{
  "513880": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 513880\nIn-book reference  : Book 32, Hadith 880\nEnglish translation  : Vol. 1, Book 32, Hadith 880",
    "url": "https://sunnah.com/malik/32",
    "text": "Malik related to me from Zayd ibn Aslam that his father said, \"Abdullah and Ubaydullah, the sons of Umar ibn al-Khattab went out with the army to Iraq. On the way home, they passed by Abu Musa al- Ashari who was the amir of Basra. He greeted them and made them welcome, and told them that if there was anything he could do to help them, he would do it. Then he said, 'There is some of the property of Allah which I want to send to the amir al-muminin, so I will lend it to you, and you can buy wares from Iraq and sell them in Madina. Then give the principal to the amir al-muminin, and you keep the profit.' They said that they would like to do it, and so he gave them the money and wrote to Umar ibn al-Khattab to take the money from them. When they came to sell they made a profit, and when they paid the principal to Umar he asked, 'Did he lend everyone in the army the like of what he lent you?' They said, 'No.' Umar ibn al-Khattab said, 'He made you the loan, because you are the sons of the amir al-muminin, so pay the principal and the profit.' Abdullah was silent. Ubaydullah said, 'You do not need to do this, amir al-muminin. Had the principal decreased or been destroyed, we would have guaranteed it.' Umar said, 'Pay it.' Abdullah was silent, and Ubaydullah repeated it. A man who was sitting with Umar said, 'Amir al-muminin, better that you make it a qirad. 'Umar said, 'I have made it qirad.' Umar then took the principal and half of the profit, and Abdullah and Ubaydullah, the sons of Umar ibn al-Khattab took half of the profit.\""
  },
  "513890": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 513890\nIn-book reference  : Book 32, Hadith 890\nEnglish translation  : Vol. 1, Book 32, Hadith 890",
    "url": "https://sunnah.com/malik/32",
    "text": "Malik related to me from al-Ala ibn Abd ar-Rahman from his father from his father that Uthman ibn Affan gave him some money as qirad to use provided the profit was shared between them."
  },
  "3203": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3203\nIn-book reference  : Book 32, Hadith 203\nEnglish translation  : Vol. 1, Book 32, Hadith 203",
    "url": "https://sunnah.com/malik/32",
    "text": "Malik said, \"The recognised and permitted form of qirad is that a man take capital from an associate to use. He does not guarantee it and in travelling pays out of the capital for food and clothes and what he makes good use of, according to the amount of capital. That is, when he travels to do the work and the capital can support it. If he remains with his people, he does not have expenses or clothing from the capital.\""
  },
  "3204": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3204\nIn-book reference  : Book 32, Hadith 204\nEnglish translation  : Vol. 1, Book 32, Hadith 204",
    "url": "https://sunnah.com/malik/32",
    "text": "Malik said, \"When a man owes money to another man and he asks him to let it stay with him as a quirad, that is disapproved of until the creditor receives his property. Then he can make it a qirad loan or keep it. That is because the debtor may be in a tight situation, and want to delay it to increase it for him.\""
  },
  "3205": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3205\nIn-book reference  : Book 32, Hadith 205\nEnglish translation  : Vol. 1, Book 32, Hadith 205",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor who made a qirad loan and stipulated to the agent that only certain goods should be bought with his money or he forbade certain goods which he named to be bought. He said, \"There is no harm in an investor making a condition on an agent in qirad not to buy a certain kind of animal or goods which he specifies. It is disapproved of for an investor to make as a condition on an agent in qirad that he only buy certain goods unless the goods which he orders him to buy are in plentiful supply and do not fail either in winter or summer. There is no harm in that case.\""
  },
  "3206": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3206\nIn-book reference  : Book 32, Hadith 206\nEnglish translation  : Vol. 1, Book 32, Hadith 206",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik said, \"The person who puts up the principal must not stipulate that he has something of the profit alone without the agent sharing in it, nor must the agent stipulate that he has something of the profit alone without the investor sharing. In qirad, there is no sale, no rent, no work, no advance, and no convenience which one party specifies to himself without the other party sharing unless one party allows it to the other unconditionally as a favour and that is alright to both. Neither of the parties should make a condition over the other which increases him in gold or silver or food over the other party.\""
  },
  "3207": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3207\nIn-book reference  : Book 32, Hadith 207\nEnglish translation  : Vol. 1, Book 32, Hadith 207",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about a man who made a qirad loan to a man and he bought wares with it and transported them to a commercial centre. It was not profitable to sell them and the agent feared a loss if he sold them, so he hired transport to take them to another city, and he sold them there and made a loss, and the cost of the hire was greater than the principal."
  },
  "3208": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3208\nIn-book reference  : Book 32, Hadith 208\nEnglish translation  : Vol. 1, Book 32, Hadith 208",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor who made a qirad loan to a man, who used it and made a profit. Then the man bought with all the profit a slave-girl and he had intercourse with her and she became pregnant by him, and so the capital decreased. Malik said, \"If he has money, the price of the slave-girl is taken from his property, and the capital is restored by it. If there is something left over after the money is paid, it is divided between them according to the first qirad. If he cannot pay it, the slave-girl is sold so that the capital is restored from her price.\""
  },
  "3209": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 3209\nIn-book reference  : Book 32, Hadith 209\nEnglish translation  : Vol. 1, Book 32, Hadith 209",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor who made a qirad loan to a man."
  },
  "32010": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32010\nIn-book reference  : Book 32, Hadith 010\nEnglish translation  : Vol. 1, Book 32, Hadith 010",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an agent who had qirad money with him and he spent from it and clothed himself. He said, \"He cannot give away any of it, and neither a beggar nor anyone else is to be given any of it and he does not pay anyone compensation from it. If he meets some people, and they bring out food and he brings out food, I hope that that will be permitted to him if he does not intend to bestow something on them. If he intends that or what is like that without the permission of the investor, he must get the sanction of the investor for it. If he sanctions it, there is no harm. If he refuses to sanction it, he must repay it with like if he has something which is suitable as compensation.\""
  },
  "32011": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32011\nIn-book reference  : Book 32, Hadith 011\nEnglish translation  : Vol. 1, Book 32, Hadith 011",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik said, \"The generally agreed on way of doing things among us about an investor who pays qirad money to an agent to buy goods, and the agent then sells the goods for a price to be paid later, and has a profit in the transaction, then the agent dies before he has received payment, is that if his heirs want to take that money, they have their father's stipulated portion from the profit. That is theirs if they are trustworthy to take the payment. If they dislike to collect it from the debtor and they refer him to the investor, they are not obliged to collect it and there is nothing against them and nothing for them by their surrendering it to the investor. If they do collect it, they have a share of it and expenses like their father had. They are in the position of their father. If they are not trustworthy to do so, they can bring someone reliable and trustworthy to collect the money. If he collects all the capital and all the profit, they are in the position of their father.\""
  },
  "32012": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32012\nIn-book reference  : Book 32, Hadith 012\nEnglish translation  : Vol. 1, Book 32, Hadith 012",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor who gave qirad money to a man, and then the man sought a loan from the investor or the investor borrowed money from the agent, or the investor left goods with the agent to sell for him, or the investor gave the agent dinars to buy goods with. Malik said, \"There is no harm if the investor leaves his goods with him knowing that if the agent did not have his money and he had asked a similar thing of him, he would have still done it because of the brotherhood between them or because it would have been no bother to him and that had the agent refused that, he would not have removed his capital from him. Or if the agent had borrowed from the investor or carried his goods for him and he knew that if the investor had not had his capital with him, he would have still done the same for him, and had he refused that to him, he would not have returned his capital to him. If that is true between both of them and it is in the way of a favour between them and it is not a condition in the terms of the qirad, it is permitted and there is no harm in it. If a condition comes into it, or it is feared that the agent is only doing it for the investor in order to safeguard the capital in his possession, or the investor is only doing it because the agent has taken his capital and will not return it to him, that is not permitted in qirad and it is part of what the people of knowledge forbid.' \""
  },
  "32013": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32013\nIn-book reference  : Book 32, Hadith 013\nEnglish translation  : Vol. 1, Book 32, Hadith 013",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about a man who loaned another man money and then the debtor asked him to leave it with him as a qirad. Malik said, \"I do not like that unless he takes his money back from him, and then pays it to him as a qirad if he wishes or if he wishes keep it.\""
  },
  "32014": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32014\nIn-book reference  : Book 32, Hadith 014\nEnglish translation  : Vol. 1, Book 32, Hadith 014",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor paying qirad money to an agent who made a profit and then wanted to take his share of the profit and the investor was away. He said, \"He should not take any of it unless the investor is present. If he takes something from it, he is responsible for it until it is accounted for in the division of the capital.\""
  },
  "32015": {
    "collection": "Muwatta Malik",
    "book": "Qirad",
    "book_num": "32",
    "reference": "Reference  : Muwatta Malik 32015\nIn-book reference  : Book 32, Hadith 015\nEnglish translation  : Vol. 1, Book 32, Hadith 015",
    "url": "https://sunnah.com/malik/32",
    "text": "Yahya said that Malik spoke about an investor who put qirad money with an agent who bought goods with it, and the investor told him to sell them. The agent said that he did not see any way to sell at that time and they quarrelled about it. He said, \"One does not look at the statement of either of them. The people of experience and insight concerning such goods are asked about these goods. If they can see anyway of selling them they are sold for them. If they think it is time to wait, they should wait.\""
  }
}