{
  "510120": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510120\nIn-book reference  : Book 22, Hadith 120\nEnglish translation  : Vol. 1, Book 22, Hadith 120",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud from Abdullah ibn Abbas that Sad ibn Ubada questioned the Messenger of Allah, may Allah bless him and grant him peace, and said,\"My mother died while she still had a vow which she had not fulfilled.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Fulfill it for her.\""
  },
  "510130": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510130\nIn-book reference  : Book 22, Hadith 130\nEnglish translation  : Vol. 1, Book 22, Hadith 130",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from"
  },
  "510140": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510140\nIn-book reference  : Book 22, Hadith 140\nEnglish translation  : Vol. 1, Book 22, Hadith 140",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that Abdullah ibn Abi Habiba said, \"I said to a man, when I was young, 'A man who only says that he must walk to the House of Allah and does not say that he has vowed to walk, does not have to walk.' A man said, 'Shall I give you this small cucumber?' and he had a small cucumber in his hand and you will say, 'I must walk to the house of Allah?' I said, 'Yes' and I said it, for at that time I was still immature. Then, when I came of age, some one said to me that I had to fulfill my vow. I went and asked Said ibn al- Musayyab about it, and he said to me, 'You must walk.' So I walked.\""
  },
  "510151": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510151\nIn-book reference  : Book 22, Hadith 151\nEnglish translation  : Vol. 1, Book 22, Hadith 151",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that Urwa ibn Udhayna al-Laythi said, \"I went out with my grandmother who had vowed to walk to the House of Allah. When we had gone part of the way, she could not go on. I sent one of her mawlas to question Abdullah ibn Umar and I went with him. He asked Abdullah ibn Umar, and Abdullah ibn Umar said to him, 'Take her and let her ride, and when she has the strength let her ride back, and start to walk from the place from which she was unable to go on.'~"
  },
  "510170": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510170\nIn-book reference  : Book 22, Hadith 170\nEnglish translation  : Vol. 1, Book 22, Hadith 170",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that Yahya ibn Said said, \"I vowed to walk, but I was struck by a pain in the kidney, so I rode until I came to Makka. I questioned Ata ibn Abi Rabah and others, and they said, 'You must sacrifice an animal.' When I came to Madina I questioned the ulama there, and they ordered me to walk again from the place from which I was unable to go on. So I walked.\""
  },
  "2206": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 2206\nIn-book reference  : Book 22, Hadith 206\nEnglish translation  : Vol. 1, Book 22, Hadith 206",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that what he preferred of what he had heard from the people of knowledge about a man or woman who vowed to walk to the House of Allah, was that they fulfilled the oath when performing umra, by walking until they had done say between Safa and Marwa. When they had done say it was finished. If they vowed to walk in the hajj, they walked until they came to Makka, then they walked until they had finished all the rites."
  },
  "510180": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510180\nIn-book reference  : Book 22, Hadith 180\nEnglish translation  : Vol. 1, Book 22, Hadith 180",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that Humayd ibn Qays and Thawr ibn Zayd adDili both informed him that the Messenger of Allah, may Allah bless him and grant him peace, (and one of them gave more detail than the other),saw a man standing in the sun. The Messenger asked, \"What's wrong with him?\" The people said, \"He has vowed not to speak or to seek shade from the sun or to sit and to fast.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Go and tell him to speak, seek shade, and sit, but let him complete his fast.\""
  },
  "510190": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510190\nIn-book reference  : Book 22, Hadith 190\nEnglish translation  : Vol. 1, Book 22, Hadith 190",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that Yahya ibn Said heard al-Qasim ibn Muhammad say, \"A woman came to Abdullah ibn Abbas and said, 'I have vowed to sacrifice my son.' Ibn Abbas said, 'Do not sacrifice your son. Do kaffara for your oath.' An old man with Ibn Abbas said, 'What kaffara is there for this?' Ibn Abbas said, 'Allah the Exalted said, \"Those of you who say, regarding their wives.'Be as my mother's back' (Sura58 ayat 2) and then He went on to oblige the kaffara for it as you have seen.' \""
  },
  "510200": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510200\nIn-book reference  : Book 22, Hadith 200\nEnglish translation  : Vol. 1, Book 22, Hadith 200",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Talha ibn Abi al-Malik al- Ayli from al-Qasim ibn Muhammad ibn as-Siddiq from A'isha that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever vows to obey Allah, let him obey Him. Whoever vows to disobey Allah, let him not disobey Him.\""
  },
  "510210": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510210\nIn-book reference  : Book 22, Hadith 210\nEnglish translation  : Vol. 1, Book 22, Hadith 210",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa from his father that A'isha, umm al-muminin said, \"Rashness in oaths is that a man says, 'By Allah, No! by Allah!' \" i.e. out of habit."
  },
  "510220": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510220\nIn-book reference  : Book 22, Hadith 220\nEnglish translation  : Vol. 1, Book 22, Hadith 220",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"Whoever swears by Allah and then says, 'Allah willing' and then does not do what he has sworn to, has not broken his oath.\""
  },
  "510230": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510230\nIn-book reference  : Book 22, Hadith 230\nEnglish translation  : Vol. 1, Book 22, Hadith 230",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Suhayl ibn Abi Salih from his father from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever makes an oath and then sees that something else would be better than it, should do kaffara for his oath and do what is better.\""
  },
  "510240": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510240\nIn-book reference  : Book 22, Hadith 240\nEnglish translation  : Vol. 1, Book 22, Hadith 240",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"If someone breaks an oath which he has stressed, he has to free a slave, or clothe ten poor people. If someone breaks an oath, but has not stressed it, he only has to feed ten poor people and each poor person is fed a mudd of wheat. Some one who does not have the means for that, should fast for three days.\""
  },
  "510250": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510250\nIn-book reference  : Book 22, Hadith 250\nEnglish translation  : Vol. 1, Book 22, Hadith 250",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to do kaffara for a broken oath by feeding ten poor people. Each person got a mudd of wheat. He sometimes freed a slave if he had repeated the oath."
  },
  "510260": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510260\nIn-book reference  : Book 22, Hadith 260\nEnglish translation  : Vol. 1, Book 22, Hadith 260",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Sulayman ibn Yasar said, \"I understood from people that when they made the kaffara for a broken oath, they gave a mudd of wheat according to the smaller mudd. They thought that that would compensate for them.\""
  },
  "510270": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510270\nIn-book reference  : Book 22, Hadith 270\nEnglish translation  : Vol. 1, Book 22, Hadith 270",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that one time the Messenger of Allah, may Allah bless him and grant him peace, was speaking to Umar ibn al-Khattab while he was travelling with a troop and Umar swore by his father and he (the Messenger) said, \"Allah forbids you to swear by your fathers. If anyone swears, let him swear by Allah or keep silent.\""
  },
  "510280": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510280\nIn-book reference  : Book 22, Hadith 280\nEnglish translation  : Vol. 1, Book 22, Hadith 280",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, used tosay, \"No, by the Overturner of hearts.\""
  },
  "510290": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510290\nIn-book reference  : Book 22, Hadith 290\nEnglish translation  : Vol. 1, Book 22, Hadith 290",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Uthman ibn Hafs ibn Umar ibn Khalda that Ibn Shihab had heard that Abu Lubaba ibn Abd al-Mundhir, when Allah turned to him said, \"Messenger of Allah, should I leave my people's house in which I committed wrong action and keep your company, and give away all my property as sadaqa for Allah and His Messenger? \"The Messenger of Allah, may Allah bless him and grant him peace, said, \"Giving away a third of it is enough for you.\""
  },
  "510300": {
    "collection": "Muwatta Malik",
    "book": "Vows and Oaths",
    "book_num": "22",
    "reference": "Reference  : Muwatta Malik 510300\nIn-book reference  : Book 22, Hadith 300\nEnglish translation  : Vol. 1, Book 22, Hadith 300",
    "url": "https://sunnah.com/malik/22",
    "text": "Yahya related to me from Malik from Ayyub ibn Musa from Mansur ibn Abd ar-Rahman al-Hajabi from his mother that A'isha, umm al- muminin, may Allah be pleased with her, was asked about a man who devoted his property to the door of Kaba. She said, \"Let him do kaffara for it with the kaffara of the oath.\""
  }
}