{
  "513900": {
    "collection": "Muwatta Malik",
    "book": "Sharecropping",
    "book_num": "33",
    "reference": "Reference  : Muwatta Malik 513900\nIn-book reference  : Book 33, Hadith 900\nEnglish translation  : Vol. 1, Book 33, Hadith 900",
    "url": "https://sunnah.com/malik/33",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, said to the jews of Khaybar on the day of the conquest of Khaybar, \"I confirm you in it as long as Allah, the Mighty, the Majestic, establishes you in it, provided that the fruits are divided between us and you.\" Said continued, \"The Messenger of Allah, may Allah bless him and grant him peace, used to send Abdullah ibn Rawaha, to assess the division of the fruit crop between him and them, and he would say, 'If you wish, you can buy it back, and if you wish, it is mine.' They would take it.\""
  },
  "513911": {
    "collection": "Muwatta Malik",
    "book": "Sharecropping",
    "book_num": "33",
    "reference": "Reference  : Muwatta Malik 513911\nIn-book reference  : Book 33, Hadith 911\nEnglish translation  : Vol. 1, Book 33, Hadith 911",
    "url": "https://sunnah.com/malik/33",
    "text": "Yahya said that Malik said, \"The best of what has been heard about a sharecropper stipulating on the owner of the property the inclusion of some slave workers, is that there is no harm in that if they are workers that come with the property. They are like the property. There is no profit in them for the share-cropper except to lighten some of his burden. If they did not come with the property, his toil would be harder. It is like share-cropping land with a spring or land with a watering trough. You will not find anyone who receives the same share for share-cropping two lands which are equal in property and yield, when one property has a constant plentiful spring and the other has a watering trough, because of the lightness of working land with a spring, and the hardship of working land with a watering trough.\""
  }
}