{
  "515590": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515590\nIn-book reference  : Book 43, Hadith 590\nEnglish translation  : Vol. 1, Book 43, Hadith 590",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm from his father that in a letter which the Messenger of Allah, may Allah bless him and grant him peace, sent to Amr ibn Hazm about blood-money he wrote that it was one hundred camels for a life, one hundred camels for a nose if completely removed, a third of the blood-money for a wound in the brain, the same as that for a belly wound, fifty for an eye, fifty for a hand, fifty for a foot, ten camels for each finger, and five for teeth, and five for a head wound which laid bare the bone."
  },
  "515600": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515600\nIn-book reference  : Book 43, Hadith 600\nEnglish translation  : Vol. 1, Book 43, Hadith 600",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik related to me that he had heard that Umar ibn al-Khattab estimated the full blood-money for the people of urban areas. For those who had gold, he made it one thousand dinars. and for those who had silver he made it ten thousand dirhams."
  },
  "515610": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515610\nIn-book reference  : Book 43, Hadith 610\nEnglish translation  : Vol. 1, Book 43, Hadith 610",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"The full blood-money for murder when it is accepted is twenty-five yearlings, twenty-five two-year-olds, twenty-five four-year-olds, and twenty-five five-year-olds.\""
  },
  "515620": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515620\nIn-book reference  : Book 43, Hadith 620\nEnglish translation  : Vol. 1, Book 43, Hadith 620",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Marwan ibn al-Hakam wrote to Muawiya ibn Abi Sufyan that a madman was brought to him who had killed a man. Muawiya wrote to him, \"Tie him up and do not inflict any retaliation on him. There is no retaliation against a madman.\""
  },
  "515630": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515630\nIn-book reference  : Book 43, Hadith 630\nEnglish translation  : Vol. 1, Book 43, Hadith 630",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Ibn Shihab from Irak ibn Malik and Sulayman ibn Yasar that a man of the Banu Sad ibn Layth was running a horse and it trod on the finger of a man from the Juhayna tribe. It bled profusely, and he died. Umar ibn al-Khattab said to those against whom the claim was made. \"Do you swear by Allah with fifty oaths that he did not die of it?\" They refused and stopped themselves from doing it. He said to the others, \"Will you take an oath?\" They refused, so Umar ibn al-Khattab gave a judgement that the Banu Sad had to pay half the full blood-money."
  },
  "515640": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515640\nIn-book reference  : Book 43, Hadith 640\nEnglish translation  : Vol. 1, Book 43, Hadith 640",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Ibn Shihab, Sulayman ibn Yasar, and Rabia ibn Abi Abd ar-Rahman said, \"The blood-money of manslaughter is twenty yearlings, twenty two-year-olds, twenty male two-year-olds, twenty four-year-olds, and twenty five-year-olds.\""
  },
  "4307": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 4307\nIn-book reference  : Book 43, Hadith 307\nEnglish translation  : Vol. 1, Book 43, Hadith 307",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik related to me that the generally agreed on way of doing things amongst the community about an accident is that there is no blood-money until the victim is better. If a man's bone, either a hand, or a foot, or another part of his body, is broken accidentally and it heals and becomes sound and returns to its form, there is no blood-money for it. If the limb is impaired or there is a scar on it, there is blood-money for it according to the extent that it is impaired."
  },
  "515650": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515650\nIn-book reference  : Book 43, Hadith 650\nEnglish translation  : Vol. 1, Book 43, Hadith 650",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab said, \"The blood-money for a woman is the same as for a man up to one third of the blood-money. Her finger is like his finger, her tooth is like his tooth, her injury which lays bare the bone is like his, and her head wound which splinters the bone is like his.\""
  },
  "515660": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515660\nIn-book reference  : Book 43, Hadith 660\nEnglish translation  : Vol. 1, Book 43, Hadith 660",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Ibn Shihab and also Urwa ibn az-Zubayr said the same as Said ibn al-Musayyab said about a woman. Her blood-money from a man is the same up to a third of the blood-money of a man. If what she is owed exceeds a third of the blood-money of the man, she is given up to half of the blood-money of a man."
  },
  "515670": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515670\nIn-book reference  : Book 43, Hadith 670\nEnglish translation  : Vol. 1, Book 43, Hadith 670",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he heard Ibn Shihab say, \"The precedent of the sunna when a man injures a woman is that he must pay the blood- money for that injury and there is no retaliation against him.\""
  },
  "515680": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515680\nIn-book reference  : Book 43, Hadith 680\nEnglish translation  : Vol. 1, Book 43, Hadith 680",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abd ar-Rahman ibn Awf from Abu Hurayra that a woman from the Hudhayl tribe threw a stone at a woman from the same tribe, and she had a miscarriage. The Messenger of Allah, may Allah bless him and grant him peace, gave a judgement that a slave or slave-girl of fair complexion and excellence should be given to her."
  },
  "515690": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515690\nIn-book reference  : Book 43, Hadith 690\nEnglish translation  : Vol. 1, Book 43, Hadith 690",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, gave a judgement that the compensation for a foetus killed in its mother's womb was a slave or slave-girl of fair complexion and excellence. The one against whom the judgement was given said, \"Why should I pay damages for that which did not drink or eat or speak or make any cry. The like of that is nothing.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"This is only one of the brothers of the diviners.\" He disapproved of the rhyming speech of the man's declaration."
  },
  "515700": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515700\nIn-book reference  : Book 43, Hadith 700\nEnglish translation  : Vol. 1, Book 43, Hadith 700",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman said, \"The slave of fair complexion and excellence is estimated at fifty dinars or six hundred dirhams. The blood-money of a free muslim woman is five hundred dinars or six thousand dirhams.\""
  },
  "515710": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515710\nIn-book reference  : Book 43, Hadith 710\nEnglish translation  : Vol. 1, Book 43, Hadith 710",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al- Musayyab used to say, \"The full blood-money is payable for cutting off both lips, but when the lower one only is cut off, two-thirds of the blood-money is due for it.\""
  },
  "515720": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515720\nIn-book reference  : Book 43, Hadith 720\nEnglish translation  : Vol. 1, Book 43, Hadith 720",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he asked Ibn Shihab about the one-eyed man who gouged out the eye of a healthy person. Ibn Shihab said, \"If the healthy person wants to take retaliation from him, he can have his retaliation. If he prefers, he has blood-money of one thousand dinars, twelve thousand dirhams.\""
  },
  "515730": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515730\nIn-book reference  : Book 43, Hadith 730\nEnglish translation  : Vol. 1, Book 43, Hadith 730",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn Yasar that Zayd ibn Thabit used to say, \"When the eye remains but the sight is lost, one hundred dinars are payable for it.\""
  },
  "515740": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515740\nIn-book reference  : Book 43, Hadith 740\nEnglish translation  : Vol. 1, Book 43, Hadith 740",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Yahya ibn Said heard Sulayman ibn Yasar mention that a face wound in which the bone was bared was like a head wound in which the bone was bared, unless the face was scarred by the wound. Then the blood-money is increased by one half of the blood-money of the head wound in which the skin was bared so that seventy five dinars are payable for it."
  },
  "515750": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515750\nIn-book reference  : Book 43, Hadith 750\nEnglish translation  : Vol. 1, Book 43, Hadith 750",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said, that Said ibn al-Musayyab said, \"For every piercing wound in any of the organs or limbs of the body, one third of the blood-money of that limb is payable.\""
  },
  "515760": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515760\nIn-book reference  : Book 43, Hadith 760\nEnglish translation  : Vol. 1, Book 43, Hadith 760",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik related to me, \"Ibn Shihab did not think and nor do I, that there is a generally agreed on way of doing things regarding a piercing wound in any of the organs or limbs of the body, but I think that there is ijtihad in the case. The imam uses ijtihad in it, and there is no generally agreed on way of doing things in our community about it.\""
  },
  "515770": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515770\nIn-book reference  : Book 43, Hadith 770\nEnglish translation  : Vol. 1, Book 43, Hadith 770",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that Abdullah ibn az-Zubayr allowed retaliation for a head wound which splintered the bone."
  },
  "515790": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515790\nIn-book reference  : Book 43, Hadith 790\nEnglish translation  : Vol. 1, Book 43, Hadith 790",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from Muslim ibn Jundub from Aslam, the mawla of Umar ibn al-Khattab that Umar ibn al-Khattab decided on a camel for a molar, a camel for a collar-bone, and a camel for a rib."
  },
  "515800": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515800\nIn-book reference  : Book 43, Hadith 800\nEnglish translation  : Vol. 1, Book 43, Hadith 800",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Yahya ibn Said heard Said ibn al-Musayyab say, ''Umar ibn al-Khattab decided on a camel for each molar, and Muawiya ibn Abi Sufyan decided on five camels for each molar.\""
  },
  "515810": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515810\nIn-book reference  : Book 43, Hadith 810\nEnglish translation  : Vol. 1, Book 43, Hadith 810",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab used to say,' 'When a tooth is struck and becomes black, there is complete blood- money for it. If it falls out after it becomes black, there is also the complete blood-money for it.\""
  },
  "515820": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515820\nIn-book reference  : Book 43, Hadith 820\nEnglish translation  : Vol. 1, Book 43, Hadith 820",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Da'ud ibn al-Husayn that Abu Ghatafan ibn Tarif al-Murri informed him that Marwan ibn al-Hakam sent him to Abdullah ibn Abbas to ask him what there was for the molar. Abdullah ibn Abbas said, \"There are five camels for it.\" He said, \"Marwan sent me back again to Abdullah ibn Abbas.'' He said, \"Do you make front teeth like molars?\" Abdullah ibn Abbas said, \"It is enough that you take the fingers as the example for that, their blood-moneys being all the same.\""
  },
  "515830": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515830\nIn-book reference  : Book 43, Hadith 830\nEnglish translation  : Vol. 1, Book 43, Hadith 830",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father made all the teeth the same in the blood-money and did not prefer any kind over others."
  },
  "515840": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515840\nIn-book reference  : Book 43, Hadith 840\nEnglish translation  : Vol. 1, Book 43, Hadith 840",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar said, \"The head wound of the slave in which the bone is bared is a twentieth of his price.\""
  },
  "515850": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515850\nIn-book reference  : Book 43, Hadith 850\nEnglish translation  : Vol. 1, Book 43, Hadith 850",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik related to me that he had heard that Marwan ibn al-Hakam gave a decision about a slave who was injured that the person who injured him had to pay what he had diminished of the value of the slave."
  },
  "515860": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515860\nIn-book reference  : Book 43, Hadith 860\nEnglish translation  : Vol. 1, Book 43, Hadith 860",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he heard that Umar ibn Abd al-Aziz gave a decision that when a jew or christian was killed, his blood-money was half the blood-money of a free muslim."
  },
  "515870": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515870\nIn-book reference  : Book 43, Hadith 870\nEnglish translation  : Vol. 1, Book 43, Hadith 870",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Sulayman ibn Yasar said, \"The blood-money of a magian is eight hundred dirhams.\""
  },
  "515880": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515880\nIn-book reference  : Book 43, Hadith 880\nEnglish translation  : Vol. 1, Book 43, Hadith 880",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"The tribe is not obliged to pay blood-money for intentional murder. They pay blood-money for accidental killing.\""
  },
  "515891": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515891\nIn-book reference  : Book 43, Hadith 891\nEnglish translation  : Vol. 1, Book 43, Hadith 891",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"The precedent of the sunna is that the tribe are not liable for any blood- money of an intentional killing unless they wish that.\""
  },
  "515910": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515910\nIn-book reference  : Book 43, Hadith 910\nEnglish translation  : Vol. 1, Book 43, Hadith 910",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik said that Ibn Shihab said, \"The precedent of the sunna in the intentional murder is that when the relatives of the murdered person relinquish retaliation, the blood-money is owed by the murderer from his own property unless the tribe helps him with it willingly.\""
  },
  "515920": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515920\nIn-book reference  : Book 43, Hadith 920\nEnglish translation  : Vol. 1, Book 43, Hadith 920",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Ibn Shihab that Umar ibn al- Khattab demanded of the people at Mina, \"If anyone has knowledge of blood-money, let him inform me.\" Ad-Dahhak ibn Sufyan al-Kilabi stood up and said, \"The Messenger of Allah, may Allah bless him and grant him peace, wrote to me that the wife of Ashyam ad-Dibabi inherited from the blood-money of her husband.\" Umar ibn al-Khattab said to him, \"Go into the tent until I come to you.\" When Umar ibn al-Khattab came in, ad-Dahhak told him about it and Umar ibn al-Khattab gave a decision based on that."
  },
  "515930": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515930\nIn-book reference  : Book 43, Hadith 930\nEnglish translation  : Vol. 1, Book 43, Hadith 930",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik related to me from Yahya ibn Said from Amr ibn Shuayb that a man of the Banu Mudlij called Qatada threw a sword at his son and it struck his thigh. The wound bled profusely and he died. Suraqa ibn Jusham came to Umar ibn al-Khattab and mentioned that to him Umar said to him, \"At the watering place of Qudayd count one hundred and twenty camels and wait until I come to you.\" When Umar ibn al-Khattab came to him, he took thirty four-year-old camels, thirty five-year-old camels, and forty pregnant camels from them. Then he said, \"Where is the brother of the slain man?\" He said, \"Here.\" He said, \"Take them. The Messenger of Allah, may Allah bless him and grant him peace, said, 'The killer gets nothing.' \""
  },
  "515940": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515940\nIn-book reference  : Book 43, Hadith 940\nEnglish translation  : Vol. 1, Book 43, Hadith 940",
    "url": "https://sunnah.com/malik/43",
    "text": "Malik said that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar were asked, \"Does one deal more harshly in taking the blood-money in the sacred month?\" They said, \"No. But it is increased in it because of violating the month.\" It was said to Said, \"Does one increase for the wound as one increases for the life?\" He said, \"Yes.\""
  },
  "515950": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515950\nIn-book reference  : Book 43, Hadith 950\nEnglish translation  : Vol. 1, Book 43, Hadith 950",
    "url": "https://sunnah.com/malik/43",
    "text": "11 Malik related to me from Yahya ibn Said from Urwa ibn az- Zubayr that a man of the Ansar called Uhayha ibn al-Julah had a young paternal uncle who was younger than him and who was living with his maternal uncles. Uhayha took him and killed him. His maternal uncles said, \"We brought him up from a baby to a youth till he stood firm on his feet, and we have had the right of a man taken from us by his paternal uncle.\" Urwa said, \"For that reason a killer does not inherit from the one he killed.\""
  },
  "515970": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515970\nIn-book reference  : Book 43, Hadith 970\nEnglish translation  : Vol. 1, Book 43, Hadith 970",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Said ibn al-Musayyab that Umar ibn al-Khattab killed five or seven people for one man whom they had killed secretly by trickery. Umar said, \"Had all the people of Sana joined forces against him, I would have killed them all.\""
  },
  "515980": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515980\nIn-book reference  : Book 43, Hadith 980\nEnglish translation  : Vol. 1, Book 43, Hadith 980",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Muhammad ibn Abd ar-Rahman ibn Sad ibn Zurara that he had heard that Hafsa, the wife of the Prophet, may Allah bless him and grant him peace, killed one of her slave-girls who had used sorcery against her. She was a mudabbara. Hafsa gave the order, and she was killed."
  },
  "515990": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 515990\nIn-book reference  : Book 43, Hadith 990\nEnglish translation  : Vol. 1, Book 43, Hadith 990",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Umar ibn Husayn, the mawla of A'isha bint Qudama, that Abd al-Malik ibn Marwan imposed retaliation against a man who killed a mawla with a stick and so the mawla's patron killed the man with a stick."
  },
  "516000": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 516000\nIn-book reference  : Book 43, Hadith 000\nEnglish translation  : Vol. 1, Book 43, Hadith 000",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he had heard that Marwan ibn al-Hakam wrote to Muawiya ibn Abi Sufyan to mention to him that a drunkard was brought to him who had killed a man. Muawiya wrote to him to kill him in retaliation for the dead man."
  },
  "516010": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 516010\nIn-book reference  : Book 43, Hadith 010\nEnglish translation  : Vol. 1, Book 43, Hadith 010",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik that he saw whomever he was satisfied with among the people of knowledge say about a man who willed that his murderer be pardoned when he murdered him intentionally, \"That is permitted for him. He is more entitled to the man's blood than any of his relatives after him.\""
  },
  "43042": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 43042\nIn-book reference  : Book 43, Hadith 042\nEnglish translation  : Vol. 1, Book 43, Hadith 042",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya said that Malik said, \"The generally agreed on way of doing things in our community is that retaliation is taken from someone who breaks someone's hand or foot intentionally and not blood-money.\""
  },
  "516020": {
    "collection": "Muwatta Malik",
    "book": "Blood-Money",
    "book_num": "43",
    "reference": "Reference  : Muwatta Malik 516020\nIn-book reference  : Book 43, Hadith 020\nEnglish translation  : Vol. 1, Book 43, Hadith 020",
    "url": "https://sunnah.com/malik/43",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from Sulayman ibn Yasar that a slave was set free by one of the people on hajj and his master had abandoned the right to inherit from him. The ex-slave then killed a man from the Banu A'idh tribe. An A'idhi, the father of the slain man came to Umar ibn al-Khattab seeking the blood-money of his son. Umar said, \"He has no blood-money.\" The A'idhi said, \"What would you think if it had been my son who killed him?\" Umar said, \"Then you would pay his blood-money.\" He said, \"He is then like the black and white Arqam snake. If it is left, it devours and if it is killed, it takes revenge.\""
  }
}