{
  "504580": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504580\nIn-book reference  : Book 14, Hadith 580\nEnglish translation  : Vol. 1, Book 14, Hadith 580",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Rafiibn Ishaq, a mawla of the family of ash-Shifa who was known as the mawla of Abu Talha, heard Abu Ayyub al-Ansari, one of the companions of the Messenger of Allah, may Allah bless him and grant him peace, say, while he was in Egypt, \"By Allah! I don't know how to deal with these lavatories.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"When you go to defecate or urinate, do not expose your genitals towards the qibla, and do not put your back to it.\""
  },
  "504590": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504590\nIn-book reference  : Book 14, Hadith 590\nEnglish translation  : Vol. 1, Book 14, Hadith 590",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from one of the Ansar that the Messenger of Allah, may Allah bless him and grant him peace, forbade defecating or urinating while facing the qibla."
  },
  "504600": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504600\nIn-book reference  : Book 14, Hadith 600\nEnglish translation  : Vol. 1, Book 14, Hadith 600",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Yahya ibn Habban from his paternal uncle, Wasi ibn Habban, that Abdullah ibn Umar said, \"People say, 'When you sit to relieve yourself, do not face the qibla or the Bayt al-Maqdis.' \""
  },
  "1404": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 1404\nIn-book reference  : Book 14, Hadith 404\nEnglish translation  : Vol. 1, Book 14, Hadith 404",
    "url": "https://sunnah.com/malik/14",
    "text": "Malik said that he meant someone who, when he prostrated, kept his body close to the ground."
  },
  "504610": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504610\nIn-book reference  : Book 14, Hadith 610\nEnglish translation  : Vol. 1, Book 14, Hadith 610",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, saw spittle on the wall of the qibla and scraped it off. Then he went up to the people and said, \"Do not spit in front of you when you are praying, because Allah, the Blessed and Exalted, is in front of you when you pray.\""
  },
  "504620": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504620\nIn-book reference  : Book 14, Hadith 620\nEnglish translation  : Vol. 1, Book 14, Hadith 620",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa from his father from A'isha, the wife of the Prophet, mayAllah bless him and grant him peace, that the Prophet, may Allah bless him and grant him peace, saw spittle, or mucus or phlegm, on the wall of the qibla and scraped it off."
  },
  "504630": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504630\nIn-book reference  : Book 14, Hadith 630\nEnglish translation  : Vol. 1, Book 14, Hadith 630",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Abdullah ibn Dinar that Abdullah ibn Umar said, \"On one occasion when the people were praying subhat Quba a man came to them and said, 'A piece of Qur'an was sent down to the Messenger of Allah, may Allah bless him and grant him peace, last night, and he was ordered to face the Kaba, so face it.' They had been facing ash-Sham, so they turned round and faced the Kaba.''"
  },
  "504640": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504640\nIn-book reference  : Book 14, Hadith 640\nEnglish translation  : Vol. 1, Book 14, Hadith 640",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab said, \"The Messenger of Allah, may Allah bless him and grant him peace, prayed towards the Baytal-Maqdis for sixteen months after arriving in Madina. Then the qibla was moved, two months before the battle of Badr. \""
  },
  "504650": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504650\nIn-book reference  : Book 14, Hadith 650\nEnglish translation  : Vol. 1, Book 14, Hadith 650",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Nafi that Umar ibn al-Khattab said, \"Any direction that is between east and west can be taken as a qibla if the person praying is face-on to the House.\""
  },
  "504660": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504660\nIn-book reference  : Book 14, Hadith 660\nEnglish translation  : Vol. 1, Book 14, Hadith 660",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Zayd ibn Rabah and Ubaydullah ibn Abi Abdullah Salman al-Agharr from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A prayer in this mosque of mine is better than a thousand prayers in any other mosque, except the Masjid al-Haram (in Makka).\""
  },
  "504670": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504670\nIn-book reference  : Book 14, Hadith 670\nEnglish translation  : Vol. 1, Book 14, Hadith 670",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Khubayb ibn Abd ar-Rahman from Hafs ibn Asim from Abu Hurayra or from Abu Said al-Khudri that the Messenger of Allah, may Allah bless him and grant him peace, said, \"What is between my house and my mimbar is one of the meadows of the Garden, and my mimbar is on my watering-place (al-Hawd).\""
  },
  "504680": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504680\nIn-book reference  : Book 14, Hadith 680\nEnglish translation  : Vol. 1, Book 14, Hadith 680",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from Abbad ibn Tamim from Abdullah ibn Zayd al-Mazini that the Messenger of Allah, may Allah bless him and grant him peace, said, \"What is between my house and my mimbar is one of the meadows of the Garden.\""
  },
  "504690": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504690\nIn-book reference  : Book 14, Hadith 690\nEnglish translation  : Vol. 1, Book 14, Hadith 690",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik that he had heard that Abdullah ibn Umar said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'Do not forbid the female slaves of Allah from (going into) the mosques of Allah.' \""
  },
  "504700": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504700\nIn-book reference  : Book 14, Hadith 700\nEnglish translation  : Vol. 1, Book 14, Hadith 700",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik that he had heard from Busr ibn Said that the Messenger of Allah, may Allah bless him and grant him peace, said, \"None of you women should use perfume when you are present at the isha prayer.\""
  },
  "504710": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504710\nIn-book reference  : Book 14, Hadith 710\nEnglish translation  : Vol. 1, Book 14, Hadith 710",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Atika bint Zayd ibn Amr ibn Nufayl, the wife of Umar ibn al-Khattab, used to ask Umar ibn al-Khattab for permission to go to the mosque. He would keep silent, so she would say, \"By Allah, I will go out, unless you forbid me,\" and he would not forbid her."
  },
  "504720": {
    "collection": "Muwatta Malik",
    "book": "The Qibla",
    "book_num": "14",
    "reference": "Reference  : Muwatta Malik 504720\nIn-book reference  : Book 14, Hadith 720\nEnglish translation  : Vol. 1, Book 14, Hadith 720",
    "url": "https://sunnah.com/malik/14",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint Abd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"If the Messenger of Allah, may Allah bless him and grant him peace, had seen what women do now, he would have forbidden them to go into the mosques, just as the women of the Bani Israil were forbidden.\""
  }
}