{
  "2701": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2701\nIn-book reference  : Book 27, Hadith 701\nEnglish translation  : Vol. 1, Book 27, Hadith 701",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik, \"The generally agreed upon way of doing things among us and what I have seen the people of knowledge doing in our city about the fixed shares of inheritance of children from the mother or father when one or other of them dies is that if they leave male and female children, the male takes the portion of two females. If there are only females, and there are more than two, they get two thirds of what is left between them. If there is only one, she gets a half. If someone shares with the children, who has a fixed share and there are males among them, the reckoner begins with the ones with fixed shares. What remains after that is divided among the children according to their inheritance."
  },
  "2702": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2702\nIn-book reference  : Book 27, Hadith 702\nEnglish translation  : Vol. 1, Book 27, Hadith 702",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The inheritance of a husband from a wife when she leaves no children or grandchildren through sons is a half. If she leaves children or grandchildren through sons, male or female, by her present or previous husbands, the husband has a quarter after bequests or debts. The inheritance of a wife from a husband who does not leave children or grandchildren through sons is a quarter. If he leaves children or grandchildren through sons, male or female, the wife has an eighth after bequests and debts. That is because Allah, the Blessed, the Exalted! said in His Book, 'You have a half of what your wives leave if they have no children. If they have children, you have a fourth of what they leave after bequests and debts. They have a fourth of what you leave if you have no children. If you have children, they have an eighth after bequests or debts.' \" (Sura4ayat 11)."
  },
  "2703": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2703\nIn-book reference  : Book 27, Hadith 703\nEnglish translation  : Vol. 1, Book 27, Hadith 703",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed on way of doing things among us about which there is no dispute and what I have seen the people of knowledge in our city doing is that when a father inherits from a son or a daughter and the deceased leaves children, or grandchildren through a son, the father has a fixed share of one sixth. If the deceased does leave any children or male grandchildren through a son, the apportioning begins with those with whom the father shares in the fixed shares. They are given their fixed shares. If a sixth or more is left over, the sixth and what is above it is given to the father, and if there is less than a sixth left, the father is given his sixth as a fixed share, (i.e. the other shares are adjusted.)"
  },
  "2704": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2704\nIn-book reference  : Book 27, Hadith 704\nEnglish translation  : Vol. 1, Book 27, Hadith 704",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed upon way of doing things among us is that maternal half-siblings do not inherit anything when there are children or grandchildren through sons, male or female. They do not inherit anything when there is a father or the father's father. They inherit in what is outside of that. If there is only one male or female, they are given a sixth. If there are two, each of them has a sixth. If there are more than that, they share in a third which is divided among them. The male does not have portion of two females. That is because Allah, the Blessed, the Exalted, says in His Book, 'If a man or woman has no direct heir, and he has a brother or sister, by the mother, each of them has a sixth. If there are more than two, they share equally in a third.' \" (Sura 4 ayat 12)."
  },
  "2705": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2705\nIn-book reference  : Book 27, Hadith 705\nEnglish translation  : Vol. 1, Book 27, Hadith 705",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed on way of doing things among us is that full siblings do not inherit anything with sons nor anything with grandsons through a son, nor anything with the father. They do inherit with the daughters and the granddaughters through a son when the deceased does not leave a paternal grandfather. Any property that is left over, they are in it as paternal relations. One begins with the people who are allotted fixed shares. They are given their shares. If there is anything left over after that, it belongs to the full siblings. They divide it between themselves according to the Book of Allah, whether they are male or female. The male has a portion of two females. If there is nothing left over, they have nothing."
  },
  "2706": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 2706\nIn-book reference  : Book 27, Hadith 706\nEnglish translation  : Vol. 1, Book 27, Hadith 706",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed on wayof doing things among us is that when there are no full siblings with them, half-siblings by the father take the position of full siblings. Their males are like the males of the full siblings, and their females are like their females except in the case where the half-siblings by the mother and the full siblings share, because they are not offspring of the mother who joins these.\""
  },
  "510770": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510770\nIn-book reference  : Book 27, Hadith 770\nEnglish translation  : Vol. 1, Book 27, Hadith 770",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Yahya ibn Said that he had heard that Muawiya ibn Abi Sufyan wrote to Zayd ibn Thabit asking him about the grandfather. Zayd ibn Thabit wrote to him, \"You have written to me asking me about the grandfather. Allah knows best. That is part of what is only determined by the amirs, i.e. the khalifs. I was present with two khalifs before you who gave the grandfather a half with one sibling, and a third with two. If there were more siblings, they did not decrease his third.\""
  },
  "510780": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510780\nIn-book reference  : Book 27, Hadith 780\nEnglish translation  : Vol. 1, Book 27, Hadith 780",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Ibn Shihab from Qabisa ibn Dhu'ayba that Umar ibn al-Khattab gave the grandfather \"what people give him today.\""
  },
  "510790": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510790\nIn-book reference  : Book 27, Hadith 790\nEnglish translation  : Vol. 1, Book 27, Hadith 790",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik that he had heard that Sulayman ibn Yasar said, ''Umar ibn al-Khattab, Uthman ibn Affan, andZayd ibn Thabit gave the grandfather a third with full siblings\". Malik said, \"The generally agreed on way of doing things among us and what I have seen the people of knowledge in our city doing is that the paternal grandfather does not inherit anything at all with the father. He is given a sixth as a fixed share with the son and the grandson through a son. Other than that, when the deceased does not leave a mother or a paternal aunt, one begins with whoever has a fixed share, and they are given their shares. If there is a sixth of the property left over, the grandfather is given a sixth as a fixed share.\""
  },
  "510800": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510800\nIn-book reference  : Book 27, Hadith 800\nEnglish translation  : Vol. 1, Book 27, Hadith 800",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Ibn Shihab from Uthman ibn Ishaq ibn Kharasha that Qabisa ibn Dhu'ayb said, \"A grandmother came to Abu Bakr as-Siddiq and asked him for her inheritance. Abu Bakr said to her, 'You have nothing in the Book of Allah, and I do not know that you have anything in the sunna of the Messenger of Allah, may Allah bless him and grant him peace. Go away therefore, until I have questioned the people.' (i.e.the Companions). He questioned the people, and al-Mughira ibn Shuba said, 'I was present with the Messenger of Allah, may Allah bless him and grant him peace, when he gave the grandmother a sixth.' Abu Bakr said, 'Was there anybody else with you?' Muhammad ibn Maslama al-Ansari stood up and said the like of what al-Mughira said. Abu Bakr as-Siddiq gave it to her. Then the other grandmother came to Umar ibn al-Khattab and asked him for her inheritance. He said to her, \"You have nothing in the Book of Allah, and what has been decided is only for other than you, and I am not one to add to the fixed shares, other than that sixth. If there are two of you together, it is between you. If eitherof you is left alone with it, it is hers.\""
  },
  "510810": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510810\nIn-book reference  : Book 27, Hadith 810\nEnglish translation  : Vol. 1, Book 27, Hadith 810",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Yahya ibn Said that al-Qasim ibn Muhammad said, \"Two grandmothers came to Abu Bakr asSiddiq, and he wanted to give the sixth to the one who was from the mother's side, and a man of the Ansar said, 'What? Are you omitting the one from whom he would inherit if she died while he was alive?' Abu Bakr divided the sixth between them.~"
  },
  "510820": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510820\nIn-book reference  : Book 27, Hadith 820\nEnglish translation  : Vol. 1, Book 27, Hadith 820",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Abdu Rabbih ibn Said that Abu Bakr ibn Abd ar-Rahman ibn al-Harith ibn Hisham only gave a fixed share to two grandmothers (together)."
  },
  "510830": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510830\nIn-book reference  : Book 27, Hadith 830\nEnglish translation  : Vol. 1, Book 27, Hadith 830",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam that Umar ibn al-Khattab asked the Messenger of Allah, may Allah bless him and grant him peace, about someone who died without parents or offspring, and the Messenger of Allah, may Allah bless him and grant him peace, said to him, \"The ayat which was sent down in the summer at the end of the Surat an-Nisa (Sura 4) is enoughfor you.\""
  },
  "510840": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510840\nIn-book reference  : Book 27, Hadith 840\nEnglish translation  : Vol. 1, Book 27, Hadith 840",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Muhammad ibn Abi Bakr ibn Muhammad ibn Amribn Hazm that Abdar-Rahman ibn Hanthala az-Zurqi was informed by a mawla of Quraysh,who used to be known as Ibn Mursi, that he was sitting with Umar ibn al-Khattab, and when they had prayed dhuhr, he said, \"Yarfa! Bring that letter! (a letter which he had written about the paternal aunt.) We asked about her and asked for information about her.\" Yarfa brought it to him. He called for a small vessel or a drinking-bowl in which there was water. He erased the letter in it. Then he said, \"Had Allah approved of you as an heir, we would have confirmed you. Had Allah approved of you, we would have confirmed you.\""
  },
  "510850": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510850\nIn-book reference  : Book 27, Hadith 850\nEnglish translation  : Vol. 1, Book 27, Hadith 850",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik that Muhammad ibn Abi Bakr ibn Hazm heard his father say many times, ''Umar ibn al-Khattab used to say, 'It is a wonder that the paternal aunt is inherited from and does not inherit.' \""
  },
  "27016": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 27016\nIn-book reference  : Book 27, Hadith 016\nEnglish translation  : Vol. 1, Book 27, Hadith 016",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed on way of doing things among us, in which there is no dispute, and which I saw the people of knowledge in our city doing, about paternal relations is that full brothers are more entitled to inherit than half-brothers by the father and half-brothers by the father are more entitled to inherit than the children of the full brothers. The sons of the full brothers are more entitled to inherit than the sons of the half-brothers by the father. The sons of the half-brothers by the father are more entitled to inherit than the sons of the sons of the full brothers. The sons of the sons of the half-brothers by the father's side are more entitled to inherit than the paternal uncle, the full brother of the father. The paternal uncle, the full brother of the father, is more entitled to inherit than the paternal uncle, the half-brotherof the father on the father's side. The paternal uncle, the half-brother of the father on the father's side is more entitled to inherit than the sons of the paternal uncle, the full brother of the father. The son of the paternal uncle on the father's side is more entitled to inherit than the paternal great uncle, the full brother of the paternal grandfather.\""
  },
  "27017": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 27017\nIn-book reference  : Book 27, Hadith 017\nEnglish translation  : Vol. 1, Book 27, Hadith 017",
    "url": "https://sunnah.com/malik/27",
    "text": "Malik said, \"The generally agreed on way of doing things among us in which there is no dispute and which I saw the people of knowledge in our citydoing, is that the child of the half-sibling by the mother, the paternal grandfather, the paternal uncle who is the maternal half- brother of the father, the maternal uncle, the great-grandmother who is the mother of the mother's father, the daughter of the full- brother, the paternal aunt, and the maternal aunt do not inherit anything by their kinship.\""
  },
  "510860": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510860\nIn-book reference  : Book 27, Hadith 860\nEnglish translation  : Vol. 1, Book 27, Hadith 860",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Ibn Shihab from Ali ibn Husayn ibn Ali from Umar ibn Uthman ibn Affan from Usama ibn Zayd that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A muslim does not inherit from a kafir.\""
  },
  "510870": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510870\nIn-book reference  : Book 27, Hadith 870\nEnglish translation  : Vol. 1, Book 27, Hadith 870",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Ibn Shihab that Ali ibn Husayn ibn Ali ibn Abi Talib told him that Aqil and Talib inherited from Abu Talib, and Ali did not inheritfrom him. Ali said, \"Because of that, we have given up our portion of ash Shab.\" (A house belonging to Banu Hashim)."
  },
  "510880": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510880\nIn-book reference  : Book 27, Hadith 880\nEnglish translation  : Vol. 1, Book 27, Hadith 880",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn Yasar that Muhammad ibn al-Ashath told him that he had a christian or jewish paternal aunt who died. Muhammad ibn al-Ashath mentioned that to Umar ibn al-Khattab and said to him, \"Who inherits from her?\" Umar ibn al-Khattab said to him, \"The people of her deen inherit from her.\" Then he went to Uthman ibn Affan, and asked him about that. Uthman said to him, \"Do you think that I have forgotten what Umar ibn al-Khattab said to you? The people.of her deen inherit from her.\""
  },
  "510890": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510890\nIn-book reference  : Book 27, Hadith 890\nEnglish translation  : Vol. 1, Book 27, Hadith 890",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Ismail ibn Abi Hakim that Umar ibn Abd al-Aziz freed a christian who then died. Ismail said, ''Umar ibn Abd al-Aziz ordered me to put his property in the bayt al-mal.\""
  },
  "510900": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510900\nIn-book reference  : Book 27, Hadith 900\nEnglish translation  : Vol. 1, Book 27, Hadith 900",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from a reliable source of his who had heard Said ibn al-Musayyab say, ''Umar ibn al-Khattab refused to let anyone inherit from the non-arabs except for one who was born among the arabs.\""
  },
  "510910": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510910\nIn-book reference  : Book 27, Hadith 910\nEnglish translation  : Vol. 1, Book 27, Hadith 910",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman from more than one of the people of knowledge of that time, that those who were killed on the Day of the Camel, the Day of Siffin, the Day of al-Harra, and the Day of Qudayd did not inherit from each other. None of them inherited anything from his companion unless it was known that he had been killed before his companion."
  },
  "510921": {
    "collection": "Muwatta Malik",
    "book": "Fara'id",
    "book_num": "27",
    "reference": "Reference  : Muwatta Malik 510921\nIn-book reference  : Book 27, Hadith 921\nEnglish translation  : Vol. 1, Book 27, Hadith 921",
    "url": "https://sunnah.com/malik/27",
    "text": "Yahya related to me from Malik that he had heard that Urwa ibn az-Zubayr said about the child of lian and the child of fornication, that if they died, the mother inherited her right from them according to the Book of Allah, the Mighty, the Majestic! The siblings by the mother had their rights. The rest was inherited by the former masters of the mother if she was a freed slave. If she was a free woman by origin, she inherited her due and the siblings by the mother inherited their due, and the rest went to the Muslims."
  }
}