{
  "502260": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502260\nIn-book reference  : Book 5, Hadith 260\nEnglish translation  : Vol. 1, Book 5, Hadith 260",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr ibn Abd ar-Rahman, from Abu Salih as-Sammani from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If someone does ghusl for major ritual impurity on the day of jumua and then goes in the first part of the time, it is as if he had offered up a camel. If he goes in the second part of the time, it is as if he had offered up a cow. If he goes in the third part of the time, it is as if he had offered up a horned ram. If he goes in the fourth part of the time, it is as if he had offered up a hen. If he goes in the fifth part of the time, it is as if he had offered up an egg. And when the imam comes out, the angels settle down listening to the dhikr (remembrance of Allah).\""
  },
  "502270": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502270\nIn-book reference  : Book 5, Hadith 270\nEnglish translation  : Vol. 1, Book 5, Hadith 270",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi that Abu Hurayra used to say, \"Doing ghusl as prescribed for major ritual impurity is incumbent (wajib) on the day of jumua on every male who has reached puberty.\""
  },
  "502280": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502280\nIn-book reference  : Book 5, Hadith 280\nEnglish translation  : Vol. 1, Book 5, Hadith 280",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Ibn Shihab that Salim ibn Abdullah said, \"One of the companions of the Messenger of Allah, may Allah bless him and grant him peace, came into the mosque on the day of jumua and Umar ibn al Khattab was already giving the khutba. Umar said, 'What (kind of) time is this (to arrive)?' He said, Amir al- muminin, I returned from the market and heard the call to prayer, so I did no more than do wudu.' Umar said, 'You only did wudu as well? You know that the Messenger of Allah, may Allah bless him and grant him peace, used to tell people to do ghusl.' \""
  },
  "502290": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502290\nIn-book reference  : Book 5, Hadith 290\nEnglish translation  : Vol. 1, Book 5, Hadith 290",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Safwan ibn Sulaym from Ata ibn Yasar from Abu Said al-Khudri that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Ghusl on the day of jumua is incumbent on every male who has reached puberty.\""
  },
  "502300": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502300\nIn-book reference  : Book 5, Hadith 300\nEnglish translation  : Vol. 1, Book 5, Hadith 300",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Nafi from Ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When you come to jumua, do ghusl.\""
  },
  "502310": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502310\nIn-book reference  : Book 5, Hadith 310\nEnglish translation  : Vol. 1, Book 5, Hadith 310",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Even saying to your companion 'Listen' while the imam is giving the khutba on the day of jumua, is to speak foolishly.\""
  },
  "502320": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502320\nIn-book reference  : Book 5, Hadith 320\nEnglish translation  : Vol. 1, Book 5, Hadith 320",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Ibn Shihab that Thalaba ibn Abi Malik al Quradhi informed him that in the time of Umar ibn al Khattab they used to pray on the day of jumua until Umar came out, and when Umar came out and sat on the mimbar and the muadhdhins called the adhan, they would sit and talk, and then when the muadhdhins were silent and Umar stood to give the khutba, they would pay attention and no-one would speak ."
  },
  "502330": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502330\nIn-book reference  : Book 5, Hadith 330\nEnglish translation  : Vol. 1, Book 5, Hadith 330",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Abu'n Nadr, the mawla of Umar ibn Ubaydullah, from Malik ibn Abi Amir that Uthman ibn Affan used to say in khutbas, and he would seldom omit it if he was giving the khutba, \"When the imam stands delivering the khutba on the day of jumua, listen and pay attention, for there is the same portion for someone who pays attention but cannot hear as for someone who pays attention and hears. And when the iqama of the prayer is called, straighten your rows and make your shoulders adjacent to each other, because the straightening of the rows is part of the completion of the prayer.\" Then he would not say the takbir until some men who had been entrusted with straightening the rows came and told him that they were straight. Then he would say the takbir."
  },
  "502340": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502340\nIn-book reference  : Book 5, Hadith 340\nEnglish translation  : Vol. 1, Book 5, Hadith 340",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar saw two men talking while the imam was giving the khutba on the day of jumua and he threw pebbles at them to tell them to be quiet."
  },
  "502350": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502350\nIn-book reference  : Book 5, Hadith 350\nEnglish translation  : Vol. 1, Book 5, Hadith 350",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik that he had heard that a man sneezed on the day of jumua while the imam was giving the khutba, and a man by his side asked Allah to bless him. Said ibn al Musayyab was asked about it and he forbade the man to do what he had done and said, \"Don't do it again.\""
  },
  "502360": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502360\nIn-book reference  : Book 5, Hadith 360\nEnglish translation  : Vol. 1, Book 5, Hadith 360",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik that he asked Ibn Shihab about talking in the jumua after the imam had come down from the mimbar but before he had said the takbir. Ibn Shihab said, \"There is no harm in that.\""
  },
  "502370": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502370\nIn-book reference  : Book 5, Hadith 370\nEnglish translation  : Vol. 1, Book 5, Hadith 370",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik that Ibn Shihab used to say, \"Some one who catches a raka of the jumua prayer should pray another one with it.\" Ibn Shihab said, \"That is the sunna.\""
  },
  "5013": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 5013\nIn-book reference  : Book 5, Hadith 013\nEnglish translation  : Vol. 1, Book 5, Hadith 013",
    "url": "https://sunnah.com/malik/5",
    "text": "Malik said, \"Someone who has a nosebleed on the day of jumua while the imam is giving the khutba and he leaves and does not come back until the imam has finished the prayer, should pray four rakas.''"
  },
  "502380": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502380\nIn-book reference  : Book 5, Hadith 380\nEnglish translation  : Vol. 1, Book 5, Hadith 380",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik that he had asked Ibn Shihab about the word of Allah, the Majestic, the Mighty, \"O you who accept, when the call is made for the prayer on the day of jumua, make haste to the remembrance of Allah.\"(Sura 62 ayat 9). Ibn Shihab said, ''Umar ibn al-Khattab used to recite, 'When the call is made for the prayer on the day of jumua, go to the remembrance of Allah.' \""
  },
  "5015": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 5015\nIn-book reference  : Book 5, Hadith 015\nEnglish translation  : Vol. 1, Book 5, Hadith 015",
    "url": "https://sunnah.com/malik/5",
    "text": "Malik said, \"If the imam stops off on a journey in a town where jumua is obligatory and he gives a khutba and takes the jumua prayer for them, then the people of the town and any other people present do the jumua prayer with him.\""
  },
  "502390": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502390\nIn-book reference  : Book 5, Hadith 390\nEnglish translation  : Vol. 1, Book 5, Hadith 390",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, mentioned the day of jumua and said, \"There is a time in it when Allah gives to a muslim slave standing in prayer whatever he asks for,\" and the Messenger of Allah, may Allah bless him and grant him peace, indicated with his hand how small it was."
  },
  "502410": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502410\nIn-book reference  : Book 5, Hadith 410\nEnglish translation  : Vol. 1, Book 5, Hadith 410",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Yahya ibn Said that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, said, \"There is nothing wrong in wearing two garments which are not work-clothes for jumua.\""
  },
  "502420": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502420\nIn-book reference  : Book 5, Hadith 420\nEnglish translation  : Vol. 1, Book 5, Hadith 420",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar would never go to jumua without wearing oil and perfume except when it was forbidden (i.e. when he was muhrim)."
  },
  "502430": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502430\nIn-book reference  : Book 5, Hadith 430\nEnglish translation  : Vol. 1, Book 5, Hadith 430",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Abi Bakr ibn Hazm from whoever related it to him that Abu Hurayra used to say, \"It is better for a man to pray on the surface of al Harra (a rocky area in Madina) than for him to wait until the imam stands to give the khutba and then come and step over people's necks.\""
  },
  "502440": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502440\nIn-book reference  : Book 5, Hadith 440\nEnglish translation  : Vol. 1, Book 5, Hadith 440",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Damra ibn Said al-Mazini from Ubaydullah ibn Abdullah ibn Utba ibn Masud that ad-Dahhak ibn Qays asked an-Numan ibn Bashir, \"What did the Messenger of Allah, may Allah bless him and grant him peace, use to recite on the day of jumua after suratal-Jumua (Sura 62)?\" He said, \"He used to recite al-Ghashiya (Sura 88).\""
  },
  "502450": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502450\nIn-book reference  : Book 5, Hadith 450\nEnglish translation  : Vol. 1, Book 5, Hadith 450",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik that Safwan ibn Sulaym said, \"If anyone omits jumua three times without reason or illness, Allah will set a seal on his heart.\" (Malik said, \"I don't know if it was from the Messenger of Allah, may Allah bless him and grant him peace, or not.\")"
  },
  "502460": {
    "collection": "Muwatta Malik",
    "book": "Jumu'a",
    "book_num": "5",
    "reference": "Reference  : Muwatta Malik 502460\nIn-book reference  : Book 5, Hadith 460\nEnglish translation  : Vol. 1, Book 5, Hadith 460",
    "url": "https://sunnah.com/malik/5",
    "text": "Yahya related to me from Malik from Jafar ibn Muhammad from his father that the Messenger of Allah, may Allah bless him and grant him peace, gave two khutbas on the day of jumua and sat down between them."
  }
}