{
  "505810": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505810\nIn-book reference  : Book 17, Hadith 810\nEnglish translation  : Vol. 1, Book 17, Hadith 810",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Amr ibn Yahya al-Mazini that his father said that he had heard Abu Said al-Khudri say that the Messenger of Allah, may Allah bless him and grant him peace, said, \"There is no zakat on less than five camels, there is no zakat on less than five awaq (two hundred dirhams of pure silver) and there is no zakat on less than five awsuq (three hundred sa).\""
  },
  "505820": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505820\nIn-book reference  : Book 17, Hadith 820\nEnglish translation  : Vol. 1, Book 17, Hadith 820",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Muhammad ibn Abdullah ibn Abd arRahman ibn Abi Sasaca al-Ansari from al-Mazini from his father from Abu Said al-Khudri that the Messenger of Allah, may Allah bless him and grant him peace, said, \"There is no zakat on less than five awsuq of dates, there is no zakat on less than five awaq of silver and there is no zakat on less than five camels.\""
  },
  "505840": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505840\nIn-book reference  : Book 17, Hadith 840\nEnglish translation  : Vol. 1, Book 17, Hadith 840",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Muhammad ibn Uqba, the mawla of az Zubayr, asked al-Qasim ibn Muhammad whether he had to pay any zakat on a large sum given to him by his slave to buy his freedom. Al- Qasim said, \"Abu Bakr as-Siddiq did not take zakat from anyone's property until it had been in his possession for a year.\""
  },
  "505850": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505850\nIn-book reference  : Book 17, Hadith 850\nEnglish translation  : Vol. 1, Book 17, Hadith 850",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Urwa ibn Husayn from A'isha bint Qudama that her father said, \"When I used to come to Uthman ibn Affan to collect my allowance he would ask me, 'Do you have any property on which zakat is due? 'If I said, 'Yes,' he would deduct the zakat on that property from my allowance, and if I said, 'No,' he would pay me my allowance (in full).\""
  },
  "505860": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505860\nIn-book reference  : Book 17, Hadith 860\nEnglish translation  : Vol. 1, Book 17, Hadith 860",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say, \"Zakat does not have to be paid on property until a year has elapsed over it.\""
  },
  "505870": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505870\nIn-book reference  : Book 17, Hadith 870\nEnglish translation  : Vol. 1, Book 17, Hadith 870",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"The first person to deduct zakat from allowances was Muawiya ibn Abi Sufyan.\" (i.e. the deduction being made automatically) ."
  },
  "505880": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505880\nIn-book reference  : Book 17, Hadith 880\nEnglish translation  : Vol. 1, Book 17, Hadith 880",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman from more than one source that the Messenger of Allah, may Allah bless him and grant him peace, assigned the mines of al Qabaliyya, which is in the direction of al-Fur, to Bilal ibn Harith al-Mazini, and nothing has been taken from them up to this day except zakat."
  },
  "1708": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 1708\nIn-book reference  : Book 17, Hadith 708\nEnglish translation  : Vol. 1, Book 17, Hadith 708",
    "url": "https://sunnah.com/malik/17",
    "text": "Malik said, \"In my opinion, and Allah knows best, nothing is taken from what comes out of mines until what comes out of them reaches a value of twenty gold dinars or two hundred silver dirhams. When it reaches that amount there is zakat to pay on it where it is on the spot. Zakat is levied on anything over that, according to how much of it there is as long as there continues to be a supply from the mine. If the vein runs out, and then after a while more becomes obtainable, the new supply is dealt with in the same way as the first, and payment of zakat on it is begun on it as it was begun on the first."
  },
  "505890": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505890\nIn-book reference  : Book 17, Hadith 890\nEnglish translation  : Vol. 1, Book 17, Hadith 890",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab and from Abu Salama ibn Abd ar-Rahman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace ,said, \"There is a tax of a fifth on buried treasure.\""
  },
  "17010": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17010\nIn-book reference  : Book 17, Hadith 010\nEnglish translation  : Vol. 1, Book 17, Hadith 010",
    "url": "https://sunnah.com/malik/17",
    "text": "Malik said, \"The position which we are agreed upon, and which I have heard the people of knowledge mentioning, is that rikaz refers to treasure which has been found which was buried during the jahiliyya, as long as neither capital is required, nor expense, great labour or inconvenience incurred in recovering it. If capital is required or great labour is incurred, or on one occasion the mark is hit and on another it is missed, then it is not rikaz.\""
  },
  "505900": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505900\nIn-book reference  : Book 17, Hadith 900\nEnglish translation  : Vol. 1, Book 17, Hadith 900",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim from his father that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, used to look after the orphaned daughters of her brother in her house. They had jewellery (which they wore) and she did not take zakat from this jewellery of theirs."
  },
  "505910": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505910\nIn-book reference  : Book 17, Hadith 910\nEnglish translation  : Vol. 1, Book 17, Hadith 910",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to adorn his daughters and slave-girls with gold jewellery and he did not take any zakat from their jewellery."
  },
  "505920": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505920\nIn-book reference  : Book 17, Hadith 920\nEnglish translation  : Vol. 1, Book 17, Hadith 920",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had heard that Umar ibn al-Khattab said, \"Trade with the property of orphans and then it will not be eaten away by zakat.\""
  },
  "505930": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505930\nIn-book reference  : Book 17, Hadith 930\nEnglish translation  : Vol. 1, Book 17, Hadith 930",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim that his father said, ''A'isha used to look after me and one of my brothers - we were orphans - in her house, and she would take the zakat from our property.\""
  },
  "505940": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505940\nIn-book reference  : Book 17, Hadith 940\nEnglish translation  : Vol. 1, Book 17, Hadith 940",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had heard that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, used to give the property of the orphans that were in her house to whoever would use it to trade with on their behalf."
  },
  "505950": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505950\nIn-book reference  : Book 17, Hadith 950\nEnglish translation  : Vol. 1, Book 17, Hadith 950",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Yahya ibn Said bought some property on behalf of his brother's sons who were orphans in his house, and that that property was sold afterwards for a great deal of profit."
  },
  "17017": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17017\nIn-book reference  : Book 17, Hadith 017\nEnglish translation  : Vol. 1, Book 17, Hadith 017",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me that Malik said, \"I consider that if a man dies and he has not paid zakat on his property, then zakat is taken from the third of his property (from which he can make bequests), and the third is not exceeded and the zakat is given priority over bequests. In my opinion it is the same as if he had a debt, which is why I think it should be given priority over bequests.\""
  },
  "505960": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505960\nIn-book reference  : Book 17, Hadith 960\nEnglish translation  : Vol. 1, Book 17, Hadith 960",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ibn Shihab from as-Sa'ib ibn Yazid that Uthman ibn Affan used to say, \"This is the month for you to pay your zakat. If you have any debts then pay them off so that you can sort out your wealth and take the zakat from it.\""
  },
  "505970": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505970\nIn-book reference  : Book 17, Hadith 970\nEnglish translation  : Vol. 1, Book 17, Hadith 970",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ayyub ibn Abi Tamima as- Sakhtayani that Umar ibn Abd al-Aziz, when writing about wealth that one of his governors had collected unjustly, ordered it to be returned to its owner and zakat to be taken from it for the years that had passed. Then shortly afterwards he revised his order with a message that zakat should only be taken from it once, since it was not wealth in hand."
  },
  "505980": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505980\nIn-book reference  : Book 17, Hadith 980\nEnglish translation  : Vol. 1, Book 17, Hadith 980",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Yazid ibn Khusayfa that he had asked Sulayman ibn Yasar whether zakat was due from a man who had wealth in hand but also owed a debt for the same amount, and he replied, \"No.\""
  },
  "505990": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 505990\nIn-book reference  : Book 17, Hadith 990\nEnglish translation  : Vol. 1, Book 17, Hadith 990",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Zurayq ibn Hayyan, who was in charge of Egypt in the time of al-Walid, Sulayman, and Umar ibn Abd al-'Aziz, mentioned that Umar ibn Abd al- Aziz had written to him saying, \"Assess the muslims that you come across and take from what is apparent of their wealth and whatever merchandise is in their charge, one dinar for every forty dinars, and the same proportion from what is less than that down to twenty dinars, and if the amount falls short of that by one third of a dinar then leave it and do not take anything from it. As for the people of the Book that you come across, take from the merchandise in their charge one dinar for every twenty dinars, and the same proportion from what is less than that down to ten dinars, and if the amount falls short by one third of a dinar leave it and do not take anything from it. Give them a receipt for what you have taken f rom them until the same time next year.\""
  },
  "506000": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506000\nIn-book reference  : Book 17, Hadith 000\nEnglish translation  : Vol. 1, Book 17, Hadith 000",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"I heard Abdullah ibn Umar being asked what kanz was and he said, 'It is wealth on which zakat has not been paid.' \""
  },
  "506010": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506010\nIn-book reference  : Book 17, Hadith 010\nEnglish translation  : Vol. 1, Book 17, Hadith 010",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Abdullah ibn Dinar from Abu's-Salih as-Samman that Abu Hurayra used to say, \"Anyone who has wealth on which he has not paid zakat will, on the day of rising, find his wealth made to resemble a whiteheaded serpent with a sac of venom in each cheek which will seek him out until it has him in its power, saying, 'I am the wealth that you had hidden away.' \""
  },
  "506030": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506030\nIn-book reference  : Book 17, Hadith 030\nEnglish translation  : Vol. 1, Book 17, Hadith 030",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Humayd ibn Qays al-Makki from Tawus al Yamani that from thirty cows, Muadh ibn Jabal took one cow in its second year, and from forty cows, one cow in its third or fourth year, and when less than that (i.e. thirty cows) was brought to him he refused to take anything from it. He said, \"I have not heard anything about it from the Messenger of Allah, may Allah bless him and grant him peace. When I meet him, I will ask him.\" But the Messenger of Allah, may Allah bless him and grant him peace, died before Muadh ibn Jabal returned."
  },
  "17025": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17025\nIn-book reference  : Book 17, Hadith 025\nEnglish translation  : Vol. 1, Book 17, Hadith 025",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya said that Malik said, concerning two associates, \"If they share one herdsman, one male animal, one pasture and one watering place then the two men are associates, as long as each one of them knows his own property from that of his companion If someone cannot tell his property apart from that of his fellow, he is not an associate, but rather, a co-owner \""
  },
  "506040": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506040\nIn-book reference  : Book 17, Hadith 040\nEnglish translation  : Vol. 1, Book 17, Hadith 040",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Thawr ibn Zayd ad-Dili from a son of Abdullah ibn Sufyan ath-Thaqafi from his grandfather Sufyan ibn Abdullah that Umar ibn al-Khattab once sent him to collect zakat. He used to include sakhlas (when assessing zakat), and they said, \"Do you include sakhlas even though you do not take them (as payment)?\" He returned to Umar ibn al-Khattab and mentioned that to him and Umar said, \"Yes, you include a sakhla which the shepherd is carrying, but you do not take it. Neither do you take an akula, or a rubba, or a makhid, or male sheep and goats in their second and third years, and this is a just compromise between the young of sheep and goats and the best of them.\""
  },
  "17027": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17027\nIn-book reference  : Book 17, Hadith 027\nEnglish translation  : Vol. 1, Book 17, Hadith 027",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya said that Malik said, \"The position with us concerning a man who has zakat to pay on one hundred camels but then the zakat collector does not come to him until zakat is due for a second timeand by that time all his camels have died except five, is that the zakat collector assesses from the five camels the two amounts of zakat that are due from the owner of the animals, which in this case is only two sheep, one for each year. This is because the only zakat which an owner of livestock has to pay is what is due from him on the day that the zakat is (actually) assessed. His livestock may have died or it may have increased, and the zakat collector only assesses the zakat on what he (actually) finds on the day he makes the assessment. If more than one payment of zakat is due from the owner of the livestock, he still only has to pay zakat according to what the zakat collector (actually) finds in his possession, and if his livestock has died, or several payments of zakat are due from him and nothing is taken until all his livestock has died, or has been reduced to an amount below that on which he has to pay zakat, then he does not have to pay any zakat, and there is no liability (on him) for what has died or for the years that have passed."
  },
  "506050": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506050\nIn-book reference  : Book 17, Hadith 050\nEnglish translation  : Vol. 1, Book 17, Hadith 050",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Muhammad ibn Yahya ibn Habban from al-Qasim ibn Muhammad that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"Sheep from the zakat were brought past Umar ibn al-Khattab and he saw amongst them a sheep with a large udder, ready to give milk, and he said, 'What is this sheep doing here?' and they replied, 'It is one of the sheep from the zakat.' Umar said, 'The owners did not give this sheep willingly. Do not subject people to trials. Do not take from the muslims those of their animals which are the best food-producers.' \""
  },
  "506060": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506060\nIn-book reference  : Book 17, Hadith 060\nEnglish translation  : Vol. 1, Book 17, Hadith 060",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Muhammad ibn Yahya ibn Habban said, \"Two men from the Ashja tribe told me that Muhammad ibn Maslama al-Ansari used tocome to them to collect their zakat, and he would say to anyone who owned livestock, 'Select (the animal for) the zakat on your livestock and bring it to me,' and he would accept any sheep that was brought to him provided it met the requirements of what the man owed.\""
  },
  "506080": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506080\nIn-book reference  : Book 17, Hadith 080\nEnglish translation  : Vol. 1, Book 17, Hadith 080",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had heard that Abu Bakr as-Siddiq said, \"If they withhold even a hobbling cord I will fight them over it.\""
  },
  "506090": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506090\nIn-book reference  : Book 17, Hadith 090\nEnglish translation  : Vol. 1, Book 17, Hadith 090",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Zayd ibn Aslam said, ''Umar ibn al Khattab drank some milk which he liked (very much) and he asked the man who had given it to him, 'Where did this milk come from?' The man told him that he had come to a watering-place, which he named, and had found grazing livestock from the zakat watering there. He was given some of their milk, which he then put into his water-skin, and that was the milk in question. Umar ibn al-Khattab then put his hand into his mouth to make himself vomit.\""
  },
  "506100": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506100\nIn-book reference  : Book 17, Hadith 100\nEnglish translation  : Vol. 1, Book 17, Hadith 100",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had heard that one of the administrators of Umar ibn Abd al-'Aziz wrote to him mentioning that a man had refused to pay zakat on his property. Umar wrote to the administrator and told him to leave the man alone and not to take any zakat from him when he took it from the other muslims. The man heard about this and the situation became unbearable for him, and after that he paid the zakat on his property. The administrator wrote to Umar and mentioned that to him, and Umar wrote back telling him to take the zakat from him."
  },
  "506110": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506110\nIn-book reference  : Book 17, Hadith 110\nEnglish translation  : Vol. 1, Book 17, Hadith 110",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from a reliable source from Sulayman ibn Yasar and from Busr ibn Said that the Messenger of Allah, may Allah bless him and grant him peace, said, \"On land that is watered by rain or springs or any natural means there is (zakat to pay of) a tenth. On irrigated land there is (zakat of) a twentieth (to pay).\""
  },
  "506120": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506120\nIn-book reference  : Book 17, Hadith 120\nEnglish translation  : Vol. 1, Book 17, Hadith 120",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ziyad ibn Sad that Ibn Shihab said, \"Neither jurur, nor musran al-fara, nor adhq ibn hubayq should be taken as zakat from dates. They should be included in the assessment but not taken as zakat. \""
  },
  "17035": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17035\nIn-book reference  : Book 17, Hadith 035\nEnglish translation  : Vol. 1, Book 17, Hadith 035",
    "url": "https://sunnah.com/malik/17",
    "text": "Malik said, \"If a man has four awsuq of dates he has harvested, four awsuq of grapes he has picked, or four awsuq of wheat he has reaped or four awsuq of pulses he has harvested, the different categories are not added together, and he does not have to pay zakat on any of the categ ries - the dates, the grapes, the wheat or the pulses - until any one of them comes to five awsuq using the sa of the Prophet, may Allah bless him and grant him peace, as the Messenger of Allah, may Allah bless him and grant him peace, said, 'There is no zakat (to pay) on anything less than five awsuq of dates. 'lf any of the categories comes to five awsuq, then zakat must be paid. If none of the categories comes to five awsuq, then there is no zakat to pay. The explanation of this is that when a man harvests five awsuq of dates (from his palms), he adds them all together and deducts the zakat from them even if they are all of different kinds and varieties. It is the same with different kinds of cereal, such as brown wheat, white wheat, barley and sult, which are all considered as one category. If a man reaps five awsuq of any of these, he adds it all together and pays zakat on it. If it does not come to that amount he does not have to pay any zakat. It is the same (also) with grapes, whether they be black or red. If a man picks five awsuq of them he has to pay zakat on them, but if they do not come to that amount he does not have to pay any zakat. Pulses also are considered as one category, like cereals, dates and grapes, even if they are of different varieties and are called by different names. Pulses include chick- peas, lentils, beans, peas, and anything which is agreed by everybody to be a pulse. If a man harvests five awsuq of pulses, measuring by the aforementioned sa, the sa of the Prophet, may Allah bless him and grant him peace, he collects them all together and must pay zakat on them, even if they are of every kind of pulse and not just one kind.\""
  },
  "17036": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17036\nIn-book reference  : Book 17, Hadith 036\nEnglish translation  : Vol. 1, Book 17, Hadith 036",
    "url": "https://sunnah.com/malik/17",
    "text": "Malik said, \"The sunna that we are all agreed upon here (in Madina) and which I have heard from the people of knowledge, is that there is no zakat on any kind of fresh (soft) fruit, whether it be pomegranates, peaches, figs or anything that is like them or not like them as long as it is fruit.\""
  },
  "506140": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506140\nIn-book reference  : Book 17, Hadith 140\nEnglish translation  : Vol. 1, Book 17, Hadith 140",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Abdullah ibn Umar from Sulayman ibn Yasar from Irak ibn Malik from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A muslim does not have to pay any zakat on his slave or his horse.\""
  },
  "506150": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506150\nIn-book reference  : Book 17, Hadith 150\nEnglish translation  : Vol. 1, Book 17, Hadith 150",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ibn Shihab from Sulayman ibn Yasar that the people of Syria said to Abu Ubayda ibn al-Jarrah, \"Take zakat from our horses and slaves,\" and he refused. Then he wrote to Umar ibn al-Khattab and he (also) refused. Again they talked to him and again he wrote to Umar, and Umar wrote back to him saying, \"If they want, take it from them and (then) give it back to them and give their slaves provision.\""
  },
  "506160": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506160\nIn-book reference  : Book 17, Hadith 160\nEnglish translation  : Vol. 1, Book 17, Hadith 160",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Abdullah ibn Abi Bakr ibn Amr ibn Hazim said, \"A message came from Umar ibn Abd al-Aziz to my father when he was in Mina telling him not to take zakat from either honey or horses.\""
  },
  "506170": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506170\nIn-book reference  : Book 17, Hadith 170\nEnglish translation  : Vol. 1, Book 17, Hadith 170",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"I asked Said ibn al-Musayyab about zakat on work-horses, and he said, 'Is there any zakat on horses ?' \""
  },
  "506180": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506180\nIn-book reference  : Book 17, Hadith 180\nEnglish translation  : Vol. 1, Book 17, Hadith 180",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"I have heard that the Messenger of Allah, may Allah bless him and grant him peace, took jizya from the magians of Bahrain, that Umar ibn al- Khattab took it from the magians of Persia and that Uthman ibn Affan took it from the Berbers.\""
  },
  "506190": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506190\nIn-book reference  : Book 17, Hadith 190\nEnglish translation  : Vol. 1, Book 17, Hadith 190",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Jafar ibn Muhammad ibn Ali from his father that Umar ibn al-Khattab mentioned the magians and said, \"I do not know what to do about them.\" Abd ar-Rahman ibn Awf said, \"I bear witness that I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'Follow the same sunna with them that you follow with the people of the Book . ' \""
  },
  "506200": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506200\nIn-book reference  : Book 17, Hadith 200\nEnglish translation  : Vol. 1, Book 17, Hadith 200",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi from Aslam, the mawla of Umar ibn al-Khattab, that Umar ibn al-Khattab imposed a jizya tax of four dinars on those living where gold was the currency, and forty dirhams on those living where silver was the currency. In addition, they had to provide for the muslims and receive them as guests for three days."
  },
  "506210": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506210\nIn-book reference  : Book 17, Hadith 210\nEnglish translation  : Vol. 1, Book 17, Hadith 210",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from his father that he said to Umar ibn al-Khattab, \"There is a blind she- camel behind the house,'' soUmar said, \"Hand it over to a household so that they can make (some) use of it.\" He said, \"But she is blind.\" Umar replied, \"Then put it in a line with other camels.\" He said, \"How will it be able to eat from the ground?\" Umar asked, \"Is it from the livestock of the jizya or the zakat?\" and Aslam replied, \"From the livestock of the jizya.\" Umar said, \"By AIIah, you wish to eat it.\" Aslam said, \"It has the brand of the jizya on it.\" So Umar ordered it to be slaughtered. He had nine platters, and on each of the platters he put some of every fruit and delicacy that there was and then sent them to the wives of the Prophet, may Allah bless him and grant him peace, and the one he sent to his daughter Hafsa was the last of them all, and if there was any deficiency in any of them it was in Hafsa's portion."
  },
  "506220": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506220\nIn-book reference  : Book 17, Hadith 220\nEnglish translation  : Vol. 1, Book 17, Hadith 220",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had heard that Umar ibn Abd al-Aziz wrote to his governors telling them to relieve any people who payed the jizya from paying the jizya if they became muslims."
  },
  "506230": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506230\nIn-book reference  : Book 17, Hadith 230\nEnglish translation  : Vol. 1, Book 17, Hadith 230",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Ibn Shihab from Salim ibn Abdullah from his father that Umar ibn al-Khattab used to take a twentieth from the cereals and olive oil of the Nabatean christians, intending by that to increase the cargo to Madina. He would take a tenth from pulses."
  },
  "506240": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506240\nIn-book reference  : Book 17, Hadith 240\nEnglish translation  : Vol. 1, Book 17, Hadith 240",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Ibn Shihab that as-Sa'ib ibn Yazid said, \"As a young man I used to work with Abdullah ibn Utba ibn Masud in the market of Madina in the time of Umar ibn al-Khattab and we used to take a tenth from the Nabateans.\""
  },
  "506250": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506250\nIn-book reference  : Book 17, Hadith 250\nEnglish translation  : Vol. 1, Book 17, Hadith 250",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik that he had asked Ibn Shihab why Umar ibn al Khattab used to take a tenth from the Nabateans, and Ibn Shihab replied, \"It used to be taken from them in the jahiliyya, and Umar imposed it on them.\""
  },
  "506260": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506260\nIn-book reference  : Book 17, Hadith 260\nEnglish translation  : Vol. 1, Book 17, Hadith 260",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Zayd ibn Aslam that his father said that he had heard Umar ibn al-Khattab say, \"I once gave a noble horse to carry somebody in the way of Allah, and the man neglected it. I wished to buy it back from him and I thought that he would sell it cheaply. I asked the Messenger of Allah, may Allah bless him and grant him peace, about it and he said, 'Do not buy it, even if he gives it to you for one dirham, for someone who takes back his sadaqa is like a dog swallowing its own vomit.' \""
  },
  "506270": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506270\nIn-book reference  : Book 17, Hadith 270\nEnglish translation  : Vol. 1, Book 17, Hadith 270",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that Umar ibn al-Khattab gave a horse to carry some one in the way of Allah, and then he wished to buy it back. So he asked the Messenger of Allah, may Allah bless him and grant him peace, about it, and he said, \"Do not buy or take back your sadaqa.\""
  },
  "17051": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17051\nIn-book reference  : Book 17, Hadith 051\nEnglish translation  : Vol. 1, Book 17, Hadith 051",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya said that Malik was asked about whether a man who gave some sadaqa, and then found it being offered back to him for sale by some one other than the man to whom he had given it, could buy it or not, and he said, \"I prefer that he leaves it.\""
  },
  "506280": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506280\nIn-book reference  : Book 17, Hadith 280\nEnglish translation  : Vol. 1, Book 17, Hadith 280",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to pay the zakat al-fitr for those slaves of his that were at Wadi'l-Qura and Khaybar."
  },
  "506290": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506290\nIn-book reference  : Book 17, Hadith 290\nEnglish translation  : Vol. 1, Book 17, Hadith 290",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, made the zakat of breaking the fast at the end of Ramadan obligatory on every muslim, whether freeman or slave, male or female, and stipulated it as a sa' of dates or a sa' of barley."
  },
  "506300": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506300\nIn-book reference  : Book 17, Hadith 300\nEnglish translation  : Vol. 1, Book 17, Hadith 300",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from lyad ibn Abdullah ibn Sad ibn Abi Sarh al-Amiri that he had heard Abu Said al- Khudri say, \"We used to pay the zakat al-fitr with a sa of wheat, or a sa of barley, or a sa of dates, or a sa of dried sour milk, or a sa of raisins, using the sa of the Prophet, may Allah bless him and grant him peace . \""
  },
  "506310": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506310\nIn-book reference  : Book 17, Hadith 310\nEnglish translation  : Vol. 1, Book 17, Hadith 310",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar would always pay the zakat al-fitr in dates, except once, when he paid it in barley."
  },
  "17056": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17056\nIn-book reference  : Book 17, Hadith 056\nEnglish translation  : Vol. 1, Book 17, Hadith 056",
    "url": "https://sunnah.com/malik/17",
    "text": "Maliksaid, \"Payment of all types of kaffara, of zakat al-fitr and of the zakat on grains for which a tenth or a twentieth is due, is made using the smaller mudd, which is the mudd of the Prophet, may Allah bless him and grant him peace, except in the case of dhihar divorce, when the kaffara is paid using the mudd of Hisham, which is the larger mudd.\""
  },
  "506320": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 506320\nIn-book reference  : Book 17, Hadith 320\nEnglish translation  : Vol. 1, Book 17, Hadith 320",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to send the zakat al-fitr to the one with whom it was collected together two or three days before the day of breaking the fast."
  },
  "17058": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17058\nIn-book reference  : Book 17, Hadith 058\nEnglish translation  : Vol. 1, Book 17, Hadith 058",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me that Malik had seen that the people of knowledge used to like to pay the zakat al-fitr after dawn had broken on the day of the Fitr before they went to the place of prayer."
  },
  "17059": {
    "collection": "Muwatta Malik",
    "book": "Zakat",
    "book_num": "17",
    "reference": "Reference  : Muwatta Malik 17059\nIn-book reference  : Book 17, Hadith 059\nEnglish translation  : Vol. 1, Book 17, Hadith 059",
    "url": "https://sunnah.com/malik/17",
    "text": "Yahya related to me that Malik said, \"A man does not have to pay zakat for the slaves of his slaves, or for some one employed by him, or for his wife's slaves, except for anyone who serves him and whose services are indispensable to him, in which case he must pay zakat. He does not have to pay zakat for any of his slaves that are kafir and have not become muslim, whether they be for trade or otherwise.\""
  }
}