{
  "514660": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514660\nIn-book reference  : Book 38, Hadith 660\nEnglish translation  : Vol. 1, Book 38, Hadith 660",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace,said, \"If a man frees his share of a slave and has enough money to cover the full price of the slave justly evaluated for him, he must buy out his partners so that the slave is completely freed. If he doesn't have the money, he partially frees him."
  },
  "3802": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 3802\nIn-book reference  : Book 38, Hadith 802\nEnglish translation  : Vol. 1, Book 38, Hadith 802",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik said, \"The generally agreed-on way of doing things among us in the case of slave whose master makes a bequest to free part of him - a third, a fourth, a half, or any share after his death, is that only the portion of him is freed that his master has named. This is because the freeing of that portion is only obliged to take place after the death of the master because the master has the option to withdraw the bequest as long as he lives. When the slave is freed from his master, the master is a testator and the testator only has access to free what he can take from his property, being the third of the property he is allowed to bequeath, and the rest of the slave is not free because the man's property has gone out of his hands. How can the rest of the slave which belongs to other people be free when they did not initiate the setting free and did not confirm it and they do not have the wala' established for them? Only the deceased could do that. He was the one who freed him and the one for whom the wala' was confirmed. That is not to be borne by another's property unless he bequeaths within the third of his property what remains of a lave to be freed. That is a request against his partners and inheritors and the partners must not refuse the slave that when it is within the third of the dead man's property because there is no harm in that to the inheritors.\""
  },
  "3803": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 3803\nIn-book reference  : Book 38, Hadith 803\nEnglish translation  : Vol. 1, Book 38, Hadith 803",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik said, \"A master who frees a slave of his and settles his emancipation so that his testimony is permitted, his inviolability complete, and his right to inherit confirmed, cannot impose stipulations on him like what he imposes on a slave about property or service, nor get him to do anything of slavery, because the Messenger of Allah, may Allah bless him and grant him peace, said, \"If a man frees his share of a slave and has enough money to cover the full price of the slave justly evaluated for him, he must give his partners their shares so the slave is completely free.\""
  },
  "514670": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514670\nIn-book reference  : Book 38, Hadith 670\nEnglish translation  : Vol. 1, Book 38, Hadith 670",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Yahya ibn Said and somebody else from al-Hasan ibn Abi al-Hasan al-Basri and from Muhammad ibn Sirin that a man in the time of the Messenger of Allah, may Allah bless him and grant him peace, freed six of his slaves while he was dying. The Messenger of Allah, may Allah bless him and grant him peace, drew lots between them and freed a third of those slaves."
  },
  "514680": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514680\nIn-book reference  : Book 38, Hadith 680\nEnglish translation  : Vol. 1, Book 38, Hadith 680",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Rabia ibn Abi Abd ar-Rahman that a man in the time of Aban ibn Uthman's amirate freed all of his slaves and did not have other property than them. Aban ibn Uthman took charge of the slaves and they were divided into three groups. Then he drew lots on the basis that which ever group drew the dead man's arrow would be free. The arrow fell to one of the thirds, and that third was freed."
  },
  "514690": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514690\nIn-book reference  : Book 38, Hadith 690\nEnglish translation  : Vol. 1, Book 38, Hadith 690",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he heard Ibn Shihab say, \"The precedent of the sunna is that when a slave is freed, his property follows him.\""
  },
  "514700": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514700\nIn-book reference  : Book 38, Hadith 700\nEnglish translation  : Vol. 1, Book 38, Hadith 700",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Nafi from Abdullah ibn Umar that Umar ibn al-Khattab said, \"If a slave-girl gives birth to a child by her master, he must not sell her, give her away, or bequeath her. He enjoys her and when he dies she is free .\""
  },
  "514710": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514710\nIn-book reference  : Book 38, Hadith 710\nEnglish translation  : Vol. 1, Book 38, Hadith 710",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that a slave-girl came to Umar ibn al-Khattab (who had been beaten by her master with a red hot iron) and he set her free."
  },
  "514720": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514720\nIn-book reference  : Book 38, Hadith 720\nEnglish translation  : Vol. 1, Book 38, Hadith 720",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Hilal ibn Usama from Ata ibn Yasar that Umar ibn al-Hakam said, \"I went to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Messenger of Allah, a slave girl of mine was tending my sheep. I came to her and one of the sheep was lost. I asked her about it and she said that a wolf had eaten it, so I became angry and I am one of the children of Adam, so I struck her on the face. As it happens, I have to set a slave free, shall I free her?' The Messenger of Allah, may Allah bless him and grant him peace, questioned her, 'Where is Allah?' She said, 'In heaven.' He said, 'Who am I?' She said, 'You are the Messenger of Allah.' The Messenger of Allah, may Allah bless him and grant him peace, said, 'Free her.' \""
  },
  "514730": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514730\nIn-book reference  : Book 38, Hadith 730\nEnglish translation  : Vol. 1, Book 38, Hadith 730",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud that one of the Ansar came to the Messenger of Allah, may Allah bless him and grant him peace, with a black slave- girl of his. He said, \"Messenger of Allah, I must set a slave free who is a mumina. If you think that she is mumina, I will free her.\" The Messenger of Allah, may Allah bless him and grant him peace, questioned her, \"Do you testify that there is no god but Allah?\" She said, \"Yes.\" \"Do you testify that Muhammad is the Messenger of Allah?\" She said, \"Yes.\" \"Are you certain about the rising after death?\" She said, \"Yes.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Free her.\""
  },
  "514740": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514740\nIn-book reference  : Book 38, Hadith 740\nEnglish translation  : Vol. 1, Book 38, Hadith 740",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that al-Maqburi said that Abu Hurayra was asked whether a man who had to free a slave, could free an illegitimate child to fulfil that obligation. Abu Hurayra said, \"Yes. That will give satisfaction for him.\""
  },
  "514750": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514750\nIn-book reference  : Book 38, Hadith 750\nEnglish translation  : Vol. 1, Book 38, Hadith 750",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that Fadala ibn Ubayd al- Ansari who was one of the companions of the Messenger of Allah, may Allah bless him and grant him peace, was asked whether it was permissible for a man who had to free a slave to free an illegitimate child. He said, \"Yes, That will give satisfaction for him.\""
  },
  "514760": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514760\nIn-book reference  : Book 38, Hadith 760\nEnglish translation  : Vol. 1, Book 38, Hadith 760",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that Abdullah ibn Umar was asked whether a slave could be bought on the specific condition that it was to be used to fulfil the obligation of freeing a slave, and he said, \"No.\""
  },
  "514770": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514770\nIn-book reference  : Book 38, Hadith 770\nEnglish translation  : Vol. 1, Book 38, Hadith 770",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Abd ar-Rahman ibn Abi Amra al-Ansari that his mother had wanted to make a bequest, but she delayed until morning and died. She had intended to set someone free, so Abd ar- Rahman said, 'I said to al-Qasim ibn Muhammad, 'Will it help her if I free a slave for her?' Al-Qasim replied, 'Sad ibn Ubada said to the Messenger of Allah, may Allah bless him and grant him peace, 'My mother died, will it help her if I set a slave free for her?' The Messenger of Allah, may Allah bless him and grant him peace, said \"Yes.\" \"'"
  },
  "514780": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514780\nIn-book reference  : Book 38, Hadith 780\nEnglish translation  : Vol. 1, Book 38, Hadith 780",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that Yahya ibn Said said, ''Abd ar-Rahman ibn Abi Bakr died in his sleep, and A'isha, the wife of the Prophet, may Allah bless him and grant him peace, set free many slaves for him.\" Malik said, \"This is what I like best of what I have heard on the subject.\""
  },
  "514790": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514790\nIn-book reference  : Book 38, Hadith 790\nEnglish translation  : Vol. 1, Book 38, Hadith 790",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Hisham ibn Urwa from his father from A'isha, the wife of the Prophet, may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, was asked what was the most excellent kind of slave to free. The Messenger of Allah, May Allah bless him and grant him peace, answered, \"The most expensive and the most valuable to his master.\""
  },
  "514800": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514800\nIn-book reference  : Book 38, Hadith 800\nEnglish translation  : Vol. 1, Book 38, Hadith 800",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Nafi that Abdullah ibn Umar freed an illegitimate child and its mother."
  },
  "514810": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514810\nIn-book reference  : Book 38, Hadith 810\nEnglish translation  : Vol. 1, Book 38, Hadith 810",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Hisham ibn Urwa from his father that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"Barira came to me and said, 'I have written myself as mukatab for my people for nine uqiyas, one uqiya per year, so help me.' A'isha said, 'If your people agree that I pay it all to them for you, and that if I pay it, your wala' is mine, then I will do it.' Barira went to her masters and told them that and they didn't agree. She came back from her masters while the Messenger of Allah, may Allah bless him and grant him peace, was sitting. She said to A'isha, 'I offered that to them and they refused me unless they had the wala'.' The Messenger of Allah, may Allah bless him and grant him peace, heard that and asked her about it A'isha told him and the Messenger of Allah, may Allah bless him and grant him peace, said, 'Take her and stipulate that the wala' is yours, for the wala' is for the one who sets free.' So A'isha did that and then the Messenger of Allah, may Allah bless him and grant him peace, stood up in front of the people, and praised Allah and gave thanks to Him. Then he said, 'What is wrong with the people who make conditions which are not in the Book of Allah? Any condition which is not in the Book of Allah is invalid even if it is a hundred conditions. The decree of Allah is truer and the conditions of Allah are firmer, and the wala' only belongs to the one who sets free.' \""
  },
  "514820": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514820\nIn-book reference  : Book 38, Hadith 820\nEnglish translation  : Vol. 1, Book 38, Hadith 820",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Nafi from Abdullah ibn Umar that A'isha umm al-muminin wanted to buy a slave-girl and set her free. Her people said, \"We will sell her to you provided that her wala' is ours.\" She mentioned that to the Messenger of Allah, may Allah bless him and grant him peace, and he said, \"Don't let that hinder you, for the wala' only belongs to the one who sets free.\""
  },
  "514830": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514830\nIn-book reference  : Book 38, Hadith 830\nEnglish translation  : Vol. 1, Book 38, Hadith 830",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Yahya ibn Said from Amra bint Abd ar- Rahman that Barira came asking the help of A'isha, umm al-muminin. A'isha said, \"If your masters agree that I pay them your price in one lump sum and set you free I will do it.\" Barira mentioned that to her masters and they said, \"No, not unless your wala' is ours.\" Yahya ibn Said added that Amra bint Abd ar-Rahman claimed that A'isha mentioned that to the Messenger of Allah, may Allah bless him and grant him peace, and the Messenger of Allah, may Allah bless him and grant him peace said, \"Buy her and set her free. The wala' only belongs to the one who sets free.\""
  },
  "514840": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514840\nIn-book reference  : Book 38, Hadith 840\nEnglish translation  : Vol. 1, Book 38, Hadith 840",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Abdullah ibn Dinar from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, forbade selling or giving away the wala'."
  },
  "38022": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 38022\nIn-book reference  : Book 38, Hadith 022\nEnglish translation  : Vol. 1, Book 38, Hadith 022",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik said that it was not permissible for a slave to buy himself from his master on the provision that he could give the wala' to whomever he wished as the wala' was for the one who set him free, and that had a man given permission to his mawla to give the wala' to whomever he wished, that would not have been permitted, because the Messenger of Allah, may Allah bless him and grant him peace, had said, \"The wala' is for the one who sets free. \" The Messenger of Allah, may Allah bless him and grant him peace, forbade selling or giving away the wala'. For if it was permitted to the master to stipulate that for him and to give him permission to give the wala' to whomever he liked, that would be a gift."
  },
  "514850": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514850\nIn-book reference  : Book 38, Hadith 850\nEnglish translation  : Vol. 1, Book 38, Hadith 850",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Rabia ibn Abd ar-Rahman that az-Zubayr ibn al-Awwam bought a slave and set him free. The slave had children by a free woman. When az-Zubayr freed him, he said, \"They are my mawali.\" The man argued, \"They are the mawali of their mother. Rather, they are our mawali.\" They took the dispute to Uthman ibn Affan, and Uthman gave a judgement that az-Zubayr had their wala'."
  },
  "514860": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514860\nIn-book reference  : Book 38, Hadith 860\nEnglish translation  : Vol. 1, Book 38, Hadith 860",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that Said ibn al-Musayyab was asked who had the wala' of the children whom a slave had by a free woman. Said said, \"If their father dies and he is a slave who was not set free, their wala' belongs to the mawali of their mother.\""
  },
  "514870": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514870\nIn-book reference  : Book 38, Hadith 870\nEnglish translation  : Vol. 1, Book 38, Hadith 870",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm from Abd al-Malik ibn Abi Bakr ibn Abd ar-Rahman ibn al- Harith ibn Hisham that his father told him that al-Asi ibn Hisham had died and left three sons, two by one wife and one by another wife. One of the two with the same mother died and left property and mawali. His full brother inherited his property and the wala' of his mawali. Then he also died, and left as heirs his son and his paternal half brother. His son said, \"I obtain what my father inherited of property and the wala' of the mawali.\" His brother said, \"It is not like that. You obtain the property. As for the wala' of the mawali, it is not so. Do you think that had it been my first brother who died today, I would not have inherited from him?\" They argued and went to Uthman ibn Affan. He gave a judgement that the brother had the wala' of the mawali."
  },
  "514880": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514880\nIn-book reference  : Book 38, Hadith 880\nEnglish translation  : Vol. 1, Book 38, Hadith 880",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me from Abdullah ibn Abi Bakr ibn Hazm that his father told him that he was sitting with Aban ibn Uthman, and an argument was brought to him between some people from the Juhayna tribe and some people from the Banu al-Harith ibn al-Khazraj. A woman of the Juhayna tribe was married to a man from the Banu al-Harith ibn al- Khazraj, called Ibrahim ibn Kulayb. She died and left property and mawali, and her son and husband inherited them from her. Then her son died and his heirs said, \"We have the wala' of the mawali. Her son obtained them.\" Those of the Juhayna said, \"It is not like that. They are the mawali of our female associate. When her child died, we have their wala' and we inherit them.\" Aban ibn Uthman gave a judgement that the people from the Juhayna tribe did indeed have the wala' of the mawali."
  },
  "514890": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514890\nIn-book reference  : Book 38, Hadith 890\nEnglish translation  : Vol. 1, Book 38, Hadith 890",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had heard that Said ibn al-Musayyab spoke about a man who died and left three sons and left mawali whom he had freed. Then two of his sons died and left children. He said, \"The third remaining son inherits the mawali. When he dies, his children and the children of his brothers share equally in the wala' of the mawali.\""
  },
  "514900": {
    "collection": "Muwatta Malik",
    "book": "Setting Free and Wala'",
    "book_num": "38",
    "reference": "Reference  : Muwatta Malik 514900\nIn-book reference  : Book 38, Hadith 900\nEnglish translation  : Vol. 1, Book 38, Hadith 900",
    "url": "https://sunnah.com/malik/38",
    "text": "Malik related to me that he had asked Ibn Shihab about a slave who was released. He said, \"He gives his wala' to whomever he likes. If he dies and has not given his wala' to anyone, his inheritance goes to the muslims and his blood-money is paid by them.\""
  }
}