{
  "510550": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510550\nIn-book reference  : Book 25, Hadith 550\nEnglish translation  : Vol. 1, Book 25, Hadith 550",
    "url": "https://sunnah.com/malik/25",
    "text": "ahya related to me from Malik that Nafi said, \"I was at al-Juruf (near Madina) and threw a stone at two birds, and hit them. One of them died, and Abdullah ibn Umar threw it away, and then went to slaughter the other one with an adze. It died before he could slaughter it, so Abdullah threw that one away as well.\""
  },
  "510560": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510560\nIn-book reference  : Book 25, Hadith 560\nEnglish translation  : Vol. 1, Book 25, Hadith 560",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he had heard that al-Qasim ibn Muhammad disapproved of eating game that had been killed with throwing sticks and by clay pellets."
  },
  "510571": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510571\nIn-book reference  : Book 25, Hadith 571\nEnglish translation  : Vol. 1, Book 25, Hadith 571",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab disapproved of killing domestic animals that had become wild by any means that game was slain such as arrows and the like."
  },
  "510572": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510572\nIn-book reference  : Book 25, Hadith 572\nEnglish translation  : Vol. 1, Book 25, Hadith 572",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he had heard the people of knowledge say that when a man hit game and something else might have contributed to death, like water or an untrained dog, that game was not to be eaten unless it was beyond doubt that it was the arrow of the hunter that had killed it by reaching a vital organ, so that it did not have any life after that."
  },
  "510580": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510580\nIn-book reference  : Book 25, Hadith 580\nEnglish translation  : Vol. 1, Book 25, Hadith 580",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said about a trained dog, \"Eat whatever it catches for you whether it eats from it or not.\""
  },
  "510590": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510590\nIn-book reference  : Book 25, Hadith 590\nEnglish translation  : Vol. 1, Book 25, Hadith 590",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he heard Nafi say that Abdullah ibn Umar said, \"Whether it eats from it or not.\""
  },
  "510601": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510601\nIn-book reference  : Book 25, Hadith 601\nEnglish translation  : Vol. 1, Book 25, Hadith 601",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he had heard that Sad ibn Abi Waqqas had said, when asked about a trained dog killing game, \"Eat, even if only one piece of it remains.\""
  },
  "510602": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510602\nIn-book reference  : Book 25, Hadith 602\nEnglish translation  : Vol. 1, Book 25, Hadith 602",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that he had heard some of the people of knowledge say that when falcons, eagles, and hawks and their like, understood as trained dogs understood, there was no harm in eating what they had killed in the course of hunting, if the name of Allah had been mentioned when they were sent out."
  },
  "510610": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510610\nIn-book reference  : Book 25, Hadith 610\nEnglish translation  : Vol. 1, Book 25, Hadith 610",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Nafi that Abd ar-Rahman ibn Abi Hurayra asked Abdullah ibn Umar about eating what was cast up by the sea and he forbade him to eat it. Then Abdullah turned and asked for a Qur'an, and read, \"The game of the sea and its flesh are halal for you.\" Nafi added, \"Abdullah ibn Umar sent me to Abdar-Rahman Ibn Abi Hurayra to say that there was no harm in eating it.\""
  },
  "510620": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510620\nIn-book reference  : Book 25, Hadith 620\nEnglish translation  : Vol. 1, Book 25, Hadith 620",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam that Sad al- Jari, the mawla of Umar ibn al-Khattab asked Abdullah ibn Umar about fish which had killed each other or which had died from severe cold . He said, \"There is no harm in eating them.'' Sad said,' 'I then asked Abdullah ibn Amr ibn al As and he said the same.\""
  },
  "510630": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510630\nIn-book reference  : Book 25, Hadith 630\nEnglish translation  : Vol. 1, Book 25, Hadith 630",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from Abu Salama ibn Abd ar-Rahman from Abu Hurayra and Zayd ibn Thabit that they saw no harm in eating what was cast up by the sea."
  },
  "510640": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510640\nIn-book reference  : Book 25, Hadith 640\nEnglish translation  : Vol. 1, Book 25, Hadith 640",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from Abu Salama ibn Abd ar-Rahman that some people from al-Jar came to Marwan ibn al- Hakam and asked him about eating what was cast up by the sea. He said, \"There is no harm in eating it.\" Marwan said, \"Go to Zayd ibn Thabit and Abu Hurayra and ask them about it, then come to me and tell me what they say.\" They went to them and asked them, and they both said, \"There is no harm in eating it \" They returned to Marwan and told him. Marwan said, \"I told you.\""
  },
  "510650": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510650\nIn-book reference  : Book 25, Hadith 650\nEnglish translation  : Vol. 1, Book 25, Hadith 650",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Ibn Shibab from Abu Idris al- Khawlani from Abu Tha~laba al-Khushani that the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is haram to eat animals with fangs \""
  },
  "510660": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510660\nIn-book reference  : Book 25, Hadith 660\nEnglish translation  : Vol. 1, Book 25, Hadith 660",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Ismail ibn Abi Hakim from Abiyda ibn Sufyan al-Hadrami from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Eating animals with fangs is haram. \""
  },
  "25015": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 25015\nIn-book reference  : Book 25, Hadith 015\nEnglish translation  : Vol. 1, Book 25, Hadith 015",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that the best of what he had heard about horses, mules, and donkeys was that they were not eaten because Allah, the Blessed, the Exalted,said, \"And horses, and mules and asses, for you to ride, and as an adornment. \" (Sura 16 ayat 8) . He said, may He be Blessed and Exalted, \"In cattle, some of them you ride, and some of them you eat.\" (Sura 6 ayat 79). He said, the Blessed, the Exalted, \"Mention Allah's name over what He has provided you of cattle, and eat of them and feed the beggar (al-qani) and the suppliant (al-mutarr). (Sura 22 ayat 34)."
  },
  "510670": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510670\nIn-book reference  : Book 25, Hadith 670\nEnglish translation  : Vol. 1, Book 25, Hadith 670",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Ibn Shihab from Ubaydullah ibn Abdullah ibn Utba ibn Masud that Abdullah ibn Abbas said, \"The Messenger of Allah, may Allah bless him and grant him peace, passed by a dead sheep which had been given to a mawla of his wife, Maimuna. He said, ' Aren't you going to use its skin?' They said, 'Messenger of Allah, but it is carrion. 'The Messenger of Allah, may Allah bless him and grant him peace, said, 'Only eating it is haram.' \""
  },
  "510680": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510680\nIn-book reference  : Book 25, Hadith 680\nEnglish translation  : Vol. 1, Book 25, Hadith 680",
    "url": "https://sunnah.com/malik/25",
    "text": "Malik related to me from Zayd ibn Aslam from Ibn Wala al-Misri from Abdullah ibn Abbas that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A skin when it is tanned is pure.\""
  },
  "510690": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 510690\nIn-book reference  : Book 25, Hadith 690\nEnglish translation  : Vol. 1, Book 25, Hadith 690",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik from Yazid ibn Abdullah ibn Qusayt from Muhammad ibn Abd ar-Rahman ibn Thawban from his mother that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said that the Messenger of Allah, may Allah bless him and grant him peace, ordered that the skins of carrion be used after they had been tanned."
  },
  "25019": {
    "collection": "Muwatta Malik",
    "book": "Game",
    "book_num": "25",
    "reference": "Reference  : Muwatta Malik 25019\nIn-book reference  : Book 25, Hadith 019\nEnglish translation  : Vol. 1, Book 25, Hadith 019",
    "url": "https://sunnah.com/malik/25",
    "text": "Yahya related to me from Malik that the best of what he had heard about a man who is forced by necessity to eat carrion is that he ate it until he was full and then he took provision from it. If he found something which would enable him to dispense with it, he threw it away."
  }
}