{
  "511530": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511530\nIn-book reference  : Book 29, Hadith 530\nEnglish translation  : Vol. 1, Book 29, Hadith 530",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that a man said to Abdullah ibn Abbas, \"I have divorced my wife by saying I divorce you a hundred times. What do you think my situation is?\" Ibn Abbas said to him, \"She was divorced from you by three pronouncements, and by the ninety-seven, you have mocked the ayat of Allah.\""
  },
  "511540": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511540\nIn-book reference  : Book 29, Hadith 540\nEnglish translation  : Vol. 1, Book 29, Hadith 540",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that a man came to Abdullah ibn Masud and said, \"I have divorced my wife by saying I divorce you eight times.\" Ibn Masud said to him, \"What have people told you?\" He replied, \"I have been told that I have to part absolutely from her.\" Ibn Masud said, \"They have spoken the truth. A person who divorces as Allah has commanded, Allah makes it clear for him, and a person who obscures himself in error, we make stay by his error. So do not confuse yourselves and pull us into your confusion. It is as they have said.\""
  },
  "511550": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511550\nIn-book reference  : Book 29, Hadith 550\nEnglish translation  : Vol. 1, Book 29, Hadith 550",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Abu Bakr ibn Hazm thatUmar ibn Abd al-Aziz had asked him what people said about the 'irrevocable' divorce, and Abu Bakr had replied that Aban ibn Uthman had clarified that it was declared only once. Umar ibn Abd al- Aziz said, \"Even if divorce had to be declared a thousand times, the'irrevocable' would use them all up. A person who says, 'irrevocably' has cast the furthest limit.\""
  },
  "511560": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511560\nIn-book reference  : Book 29, Hadith 560\nEnglish translation  : Vol. 1, Book 29, Hadith 560",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Marwan ibn al-Hakam decided that if someone made three pronouncements of divorce, he had divorced his wife irrevocably."
  },
  "511570": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511570\nIn-book reference  : Book 29, Hadith 570\nEnglish translation  : Vol. 1, Book 29, Hadith 570",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Umar ibn al-Khattab had heard in a letter from Iraq that a man said to his wife, \"Your rein is on your withers (i.e. you have free rein).\" Umar ibn al-Khattab wrote to his governor to order the man to come to him at Makka at the time of hajj. While Umar was doing tawaf around the House, a man met him and greeted him. Umar asked him who he was, and he replied that he was the man that he had ordered to be brought to him. Umar said to him, \"I ask you by the Lord of this building, what did you mean by your statement, 'Your rein is on your withers.'?\" The man replied, \"Had you made me swear by other than this place, I would not have told you the truth. I intended separation by that.\" Umar ibn al- Khattab said, \"It is what you intended.\""
  },
  "511580": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511580\nIn-book reference  : Book 29, Hadith 580\nEnglish translation  : Vol. 1, Book 29, Hadith 580",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Ali ibn Abi Talib used to say that if a man said to his wife, \"You are haram for me,\" it counted as three pronouncements of divorce."
  },
  "511590": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511590\nIn-book reference  : Book 29, Hadith 590\nEnglish translation  : Vol. 1, Book 29, Hadith 590",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said that statements like \"I cut myself off from you\",or\"You are abandoned\", were considered as three pronouncements of divorce."
  },
  "511600": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511600\nIn-book reference  : Book 29, Hadith 600\nEnglish translation  : Vol. 1, Book 29, Hadith 600",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from al-Qasim ibn Muhammad that a certain man had taken a slave-girl belonging to somebody else as a wife. He said to her people, \"She is your concern,\" and people considered that to be one pronouncement of divorce."
  },
  "511610": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511610\nIn-book reference  : Book 29, Hadith 610\nEnglish translation  : Vol. 1, Book 29, Hadith 610",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he heard Ibn Shihab say that if a man said to his wife, \"You are free of me, and I am free of you, \" it counted as three pronouncements of divorce as if it were an 'irrevocable' divorce."
  },
  "511620": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511620\nIn-book reference  : Book 29, Hadith 620\nEnglish translation  : Vol. 1, Book 29, Hadith 620",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that a man came to Abdullah ibn Umar, and said, \"Abu Abd ar-Rahman! I placed the command of my wife in her hand, and she divorced herself, what do you think?\" Abdullah ibn Umar said, \"I think that it is as she said.\" The man said, \"Don't do it, Abu Abd ar-Rahman!\" Ibn Umar said, \"You did it, it has nothing to do with me.\""
  },
  "511630": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511630\nIn-book reference  : Book 29, Hadith 630\nEnglish translation  : Vol. 1, Book 29, Hadith 630",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"When a man gives a woman command over herself, then the result is as she decides unless he denies it and says that he only meant to give her one divorce and he swears to it - then he has access to her while she is in her idda.\""
  },
  "511640": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511640\nIn-book reference  : Book 29, Hadith 640\nEnglish translation  : Vol. 1, Book 29, Hadith 640",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Said ibn Sulayman ibn Zayd ibn Thabit that Kharija ibn Zayd ibn Thabit told him that he was sitting with Zayd ibn Thabit when Muhammad ibn Abi Atiq came to him with his eyes brimming with tears. Zayd asked him what the matter was. He said, \"I gave my wife command of herself, and she separated from me.\" Zayd said to him, \"What made you do that?\" He said, \"The Decree.\" Zayd said, \"Return to her if you wish for it is only one pronouncement, and you have access to her.\""
  },
  "511650": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511650\nIn-book reference  : Book 29, Hadith 650\nEnglish translation  : Vol. 1, Book 29, Hadith 650",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim from his father that a man of Thaqif gave his wife command over herself, and she said, \"You are divorced.\" He was silent. She said, \"You are divorced.\" He said, \"May a stone be in your mouth.\" She said, \"You are divorced.\" He said, \"May a stone be in your mouth.\" They argued and went to Marwan ibn al-Hakam. He took an oath that he had only given her control over one pronouncement, and then she returned to him."
  },
  "511660": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511660\nIn-book reference  : Book 29, Hadith 660\nEnglish translation  : Vol. 1, Book 29, Hadith 660",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim from his father that A'isha, umm al-muminin, proposed to Qurayba bint Abi Umayya on behalf of Abd ar-Rahman ibn Abi Bakr. They married her to him and her people found fault with Abd ar-Rahman and said, \"We only gave in marriage because of A'isha.\" A'isha therefore sent for Abd ar-Rahman and told him about it. He gave Qurayba authority over herself and she chose her husband and so there was no divorce."
  },
  "511670": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511670\nIn-book reference  : Book 29, Hadith 670\nEnglish translation  : Vol. 1, Book 29, Hadith 670",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Qasim from his father that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, gave Hafsa bint Abd arRahman in marriage to al-Mundhir ibn az-Zubayr while Abd ar-Rahman was away in Syria. When Abd ar-Rahman arrived, he said, \"Shall someone like me have this done to him? Am I the kind of man to have something done to him without his consent?\" A'isha spoke to al-Mundhir ibn az-Zubayr, and al-Mundhir said, \"It is in the hands of Abd ar-Rahman.\" Abd ar-Rahman said, \"I won't oppose something that you have already completed.\" Hafsa was confirmed with al-Mundhir, and there was no divorce."
  },
  "511680": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511680\nIn-book reference  : Book 29, Hadith 680\nEnglish translation  : Vol. 1, Book 29, Hadith 680",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Abdullah ibn Umar and Abu Hurayra were asked about a man who gave his wife power over herself, and she returned it to him without doing anything with it. They said that there was no divorce. (i.e. The man's giving his wife power over herself was not interpreted as a desire for divorce on his part.)"
  },
  "511690": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511690\nIn-book reference  : Book 29, Hadith 690\nEnglish translation  : Vol. 1, Book 29, Hadith 690",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab said, \"If a man gives his wife authority over herself, and she does not separate from him and remains with him, there is no divorce.\""
  },
  "511700": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511700\nIn-book reference  : Book 29, Hadith 700\nEnglish translation  : Vol. 1, Book 29, Hadith 700",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Jafar ibn Muhammad from his father that Ali ibn Abi Talib said, \"When a man takes a vow to abstain from intercourse, divorce does not occur immediately. If four months pass, he must declare his intent and either he is divorced or he revokes his vow . \""
  },
  "511710": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511710\nIn-book reference  : Book 29, Hadith 710\nEnglish translation  : Vol. 1, Book 29, Hadith 710",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"When a man makes a vow to abstain from intercourse with his wife and four months have passed he must declare his intent and either he is divorced or he revokes his vow. Divorce does not occur until four months have passed and he continues to abstain.\""
  },
  "511720": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511720\nIn-book reference  : Book 29, Hadith 720\nEnglish translation  : Vol. 1, Book 29, Hadith 720",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Said al-Musayyab and Abu Bakr ibn Abd ar-Rahman said about a man who made a vow to abstain from intercourse with his wife, \"If four months pass it is a divorce. The husband can go back to his wife as long as she is in her idda.\""
  },
  "511730": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511730\nIn-book reference  : Book 29, Hadith 730\nEnglish translation  : Vol. 1, Book 29, Hadith 730",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Marwan ibn al-Hakam decided about a man who had made a vow to abstain from intercourse with his wife, that when four months had passed, it was a divorce and he could return to her as long as she was in her idda."
  },
  "511740": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511740\nIn-book reference  : Book 29, Hadith 740\nEnglish translation  : Vol. 1, Book 29, Hadith 740",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had asked Ibn Shihab about the ila of the slave. He said that it was like the ila of the free man, and it put an obligation on him. The ila of the slave was two months."
  },
  "511750": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511750\nIn-book reference  : Book 29, Hadith 750\nEnglish translation  : Vol. 1, Book 29, Hadith 750",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Said ibn Amr ibn Sulaym az- Zuraqi that he asked al-Qasim ibn Muhammad about a man who made divorce conditional on his marrying a woman i.e. if he married her he would automatically divorce her. Al-Qasim ibn Muhammad said, \"If a man marries a woman whom he has made as his mother's back, i.e. has made haram for him, Umar ibn al-Khattab ordered him not to go near her if he married her until he had done the kaffara for pronouncing dhihar.\""
  },
  "511760": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511760\nIn-book reference  : Book 29, Hadith 760\nEnglish translation  : Vol. 1, Book 29, Hadith 760",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that a man asked al-Qasim ibn Muhammad and Sulayman ibn Yasar about a man who pronounced dhihar from his wife before he had married her. They said, \"If he marries her, he must not touch her until he has done the kaffara for pronouncing dhihar.\""
  },
  "511771": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511771\nIn-book reference  : Book 29, Hadith 771\nEnglish translation  : Vol. 1, Book 29, Hadith 771",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said that a man who pronounced a dhihar from his four wives in one statement, had only to do one kaffara. Yahya related the same as that to me from Malik from Rabia ibn Abi Abd ar-Rahman."
  },
  "511790": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511790\nIn-book reference  : Book 29, Hadith 790\nEnglish translation  : Vol. 1, Book 29, Hadith 790",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that he heard a man ask Urwa ibn az-Zubayr about a man who said to his wife, \"Any woman I marry along with you as long as you live will be like my mother's back to me.\" Urwa ibn az-Zubayr said, \"The freeing of slaves is enough to release him from that.\""
  },
  "511800": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511800\nIn-book reference  : Book 29, Hadith 800\nEnglish translation  : Vol. 1, Book 29, Hadith 800",
    "url": "https://sunnah.com/malik/29",
    "text": "ahya related to me from Malik that he asked Ibn Shihab about the dhihar of a slave. He said, \"It is like the dhihar of a free man.\""
  },
  "511820": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511820\nIn-book reference  : Book 29, Hadith 820\nEnglish translation  : Vol. 1, Book 29, Hadith 820",
    "url": "https://sunnah.com/malik/29",
    "text": "ahya related to me from Malik from Nafi that Abdullah ibn Umar said that a female slave who was the wife of a slave and then was set free, had the right of choice as long as he did not have intercourse with her."
  },
  "511830": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511830\nIn-book reference  : Book 29, Hadith 830\nEnglish translation  : Vol. 1, Book 29, Hadith 830",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az- Zubayr that a mawla of the tribe of Banu Adi called Zabra told him that she had been the wife of a slave when she was a slave-girl. Then she was set free and she sent a message to Hafsa, the wife of the Prophet, may Allah bless him and grant him peace. Hafsa called her and said, \"I will tell you something., but I would prefer that you did not act upon it. You have authority over yourself as long as your husband does not have intercourse with you. If he has intercourse with you, you have no authority at all.\" Therefore she pronounced her divorce from him three times."
  },
  "511840": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511840\nIn-book reference  : Book 29, Hadith 840\nEnglish translation  : Vol. 1, Book 29, Hadith 840",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab said that if a man married a woman, and he was insane or had a physical defect, she had the right of choice. If she wished she could stay, and if she wished she could separate from him."
  },
  "29031": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 29031\nIn-book reference  : Book 29, Hadith 031\nEnglish translation  : Vol. 1, Book 29, Hadith 031",
    "url": "https://sunnah.com/malik/29",
    "text": "Malik said that if a slave-girl, who was the wife of a slave, was set free before he had consummated the marriage, and she chose herself, then she had no bride-price and it was a pronouncement of divorce. That was what was done among them."
  },
  "511850": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511850\nIn-book reference  : Book 29, Hadith 850\nEnglish translation  : Vol. 1, Book 29, Hadith 850",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me that Malik heard Ibn Shihab say, \"When a man gives his wife the right of choice, and she chooses him, that is not divorce.\""
  },
  "511860": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511860\nIn-book reference  : Book 29, Hadith 860\nEnglish translation  : Vol. 1, Book 29, Hadith 860",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related. to me from Malik from Yahya ibn Said that Amra bint Abd ar-Rahman told him from Habiba bint Sahl al-Ansari that she had been the wife of Thabit ibn Qays ibn Shammas. The Messenger of Allah, may Allah bless him and grant him peace, went out for the dawn prayer, and found Habiba bint Sahl at his door in the darkness. The Messenger of Allah, may Allah bless him and grant him peace, said to her, \"Who is this?\" She said, \"I am Habiba bint Sahl, Messenger of Allah.\" He said, \"What do you want?\" She said, \"That Thabit ibn Qays and I separate.\" When her husband, Thabit ibn Qays came, the Messenger of Allah, may Allah bless him and grant him peace, said to him, \"This is Habiba bint Sahl. She mentioned what Allah willed that she mention.\" Habiba said, \"Messenger of Allah, all that he has given me is with me!\" The Messenger of Allah, may Allah bless him and grant him peace, said to Thabit ibn Qays, \"Take it from her,\" and he took it from her, and she stayed in the house of her family."
  },
  "511870": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511870\nIn-book reference  : Book 29, Hadith 870\nEnglish translation  : Vol. 1, Book 29, Hadith 870",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi from a mawla of Safiyya bint Abi Ubayd that she gave all that she possessed to her husband as compensation for her divorce from him, and Abdullah ibn Umar did not disapprove of that."
  },
  "511880": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511880\nIn-book reference  : Book 29, Hadith 880\nEnglish translation  : Vol. 1, Book 29, Hadith 880",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Rubayyi bint Muawwidh ibn Afra came with her paternal uncle to Abdullah ibn Umar and told him that she had divorced her husband for a compensation in the time of Uthman ibn Affan, and he heard about it and did not disapprove. Abdullah ibn Umar said, \"Her idda is the idda of a divorced woman.\""
  },
  "511890": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511890\nIn-book reference  : Book 29, Hadith 890\nEnglish translation  : Vol. 1, Book 29, Hadith 890",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar and Ibn Shihab all said that a woman who divorced for a compensation had the same idda as a divorced woman - three periods."
  },
  "511900": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511900\nIn-book reference  : Book 29, Hadith 900\nEnglish translation  : Vol. 1, Book 29, Hadith 900",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Sahl ibn Sad as-Saidi told him that Uwaymir al-Ajlani came to Asim ibn Adi al- Ansari and said to him, \"Asim! What do you think a man who finds another man with his wife should do? Should he kill him and then be killed himself, or what should .he do? Asim! ask the Messenger of Allah, may Allah bless him and grant him peace, about that for me.\" Asim asked the Messenger of Allah, may Allah bless him and grant him peace, about it. The Messenger of Allah, may Allah bless him and grant him peace, was revolted by the questions and reproved them until what he heard from the Messenger of Allah, may Allah bless him and grant him peace. was intolerable for Asim. When Asim returned to his people, Uwaymir came to him and said, \" Asim! what did the Messenger of Allah, may Allah bless him and grant him peace, say to you?\" Asim said to Uwaymir, \"You didn't bring me any good. The Messenger of Allah, may Allah bless him and grant him peace, was revolted by the question which I asked him.\" Uwaymir said, \"By Allah! I will not stop until I ask him about it!\" Uwaymir stood up and went to the Messenger of Allah, may Allah bless him and grant him peace, in the middle of the people and said, \"Messenger of Allah! What do you think a man who finds another man with his wife should do? Should he kill him and then be killed himself, or what should he do?\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"Something has been sent down about you and your wife, so go and bring her.\""
  },
  "511910": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511910\nIn-book reference  : Book 29, Hadith 910\nEnglish translation  : Vol. 1, Book 29, Hadith 910",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafic from Abdullah ibn Umar that a man cursed his wife in the time of the Messenger of Allah, may Allah bless him and grant him peace, and disowned her child. The Messenger of Allah, may Allah bless him and grant him peace, separated them and gave the child to the woman."
  },
  "511921": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511921\nIn-book reference  : Book 29, Hadith 921\nEnglish translation  : Vol. 1, Book 29, Hadith 921",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that `Urwa ibn az-Zubayr said that if the child of the woman against whom li`an had been pronounced or the child of fornication, died, his mother inherited from him her right in the Book of Allah the Exalted, and his maternal half-brothers had their rights. The rest was inherited by the owners of his mother's wala' if she was a freed slave. If she was an ordinary free woman, she inherited her right, his maternal brothers inherited their rights, and the rest went to the Muslims."
  },
  "511940": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511940\nIn-book reference  : Book 29, Hadith 940\nEnglish translation  : Vol. 1, Book 29, Hadith 940",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab from Muhammad ibn Abd ar-Rahman ibn Thawban that Muhammad ibn Iyas ibn al-Bukayr said, \"A man divorced his wife three times before he had consummated the marriage, and then it seemed good to him to marry her. Therefore, he wanted an opinion, and I went with him to ask Abdullah ibn Abbas and Abu Hurayra on his behalf about it, and they said, 'We do not think that you should marry her until she has married another husband.' He protested that his divorcing her had been only once. Ibn Abbas said, 'You threw away what you had of blessing.' \""
  },
  "511950": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511950\nIn-book reference  : Book 29, Hadith 950\nEnglish translation  : Vol. 1, Book 29, Hadith 950",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Bukayr ibn Abdullah al-Ashajj from an-Numan ibn Abi Ayyash al Ansari from Ata ibn Yasar that a man came and asked Abdullah ibn Amr ibn al-As about a man who divorced his wife three times before he had had intercourse with her Ata said, \"The divorce of the virgin is one. Abdullah ibn Amr ibn al-As said to me, 'You say one pronouncement separates her and three makes her haram until she has married another husband.' \""
  },
  "511960": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511960\nIn-book reference  : Book 29, Hadith 960\nEnglish translation  : Vol. 1, Book 29, Hadith 960",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Bukayr ibn Abdullah al-Ashajj informed him that Muawiya ibn Abi Ayyash al- Ansari told him that he was sitting with Abdullah ibn az-Zubayr and Asim ibn Umar ibn al-Khattab when Muhammad ibn Iyas ibn al-Bukayr came up to them and said, \"A man from the desert has divorced his wife three times before consummating the marriage, what do you think?\" Abdullah ibn az-Zubayr said \"This is something about which we have no statement. Go to Abdullah ibn Abbas and Abu Hurayra. I left them with A'isha. Ask them and then come and tell us.\" He went and asked them. Ibn Abbas said to Abu Hurayra, \"Give an opinion, Abu Hurayra! A difficult one has come to you.\" Abu Hurayra said, \"One pronouncement separates her and three makes her haram until she has married another husband.\" Ibn Abbas said the like of that."
  },
  "511970": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511970\nIn-book reference  : Book 29, Hadith 970\nEnglish translation  : Vol. 1, Book 29, Hadith 970",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Talha ibn Abdullah ibn Awf said, and he knew that better than them, from Abu Salama ibn Abd ar-Rahman ibn Awf that Abd ar-Rahman ibn Awf divorced his wife irrevocably while he was terminally ill, and Uthman ibn Affan made her an heir after the end of her idda."
  },
  "511980": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511980\nIn-book reference  : Book 29, Hadith 980\nEnglish translation  : Vol. 1, Book 29, Hadith 980",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abdullah ibn al-Fadl from al- Araj that Uthman ibn Affan made the wives of ibn Mukmil inherit from him, and he had divorced them while he was terminally ill."
  },
  "511990": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 511990\nIn-book reference  : Book 29, Hadith 990\nEnglish translation  : Vol. 1, Book 29, Hadith 990",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he heard Rabia ibn Abi Abd ar-Rahman say, ''I heard that the wife of Abd ar-Rahman ibn Awf asked him to divorce her. He said, 'When you have menstruated and are pure, then come to me.' She did not menstruate until Abd ar-Rahman ibn Awf was ill. When she was purified, she told him and he divorced her irrevocably or made a pronouncement of divorce which was all that he had left over her Abd arRahman ibn Awf was terminally ill at the time, so Uthman ibn Affan made her one of the heirs after the end of her idda.\""
  },
  "512000": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512000\nIn-book reference  : Book 29, Hadith 000\nEnglish translation  : Vol. 1, Book 29, Hadith 000",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Muhammad ibn Yahya ibn Habban said, \"My grandfather Habban had two wives, one from the Hashimites and one from the Ansars. He divorced the Ansariyya while she was nursing, and a year passed and he died and she had still not yet menstruated. She said, 'I inherit from him. I have not menstruated yet.' The wives quarrelled and went to Uthman ibn Affan. He decided that she did inherit, and the Hashimiyya rebuked Uthman. He said, 'This is the practice of the son of your paternal uncle. He pointed this out to us.' He meant Ali ibn Abi Talib.\""
  },
  "512010": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512010\nIn-book reference  : Book 29, Hadith 010\nEnglish translation  : Vol. 1, Book 29, Hadith 010",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard Ibn Shihab say, \"When a man who is terminally ill divorces his wife three times, she inherits from him.\""
  },
  "512020": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512020\nIn-book reference  : Book 29, Hadith 020\nEnglish translation  : Vol. 1, Book 29, Hadith 020",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Abd ar- Rahman ibn Awf divorced his wife, and gave her compensation in the form of a slave-girl."
  },
  "512030": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512030\nIn-book reference  : Book 29, Hadith 030\nEnglish translation  : Vol. 1, Book 29, Hadith 030",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"Every divorced woman has compensation except for the one who is divorced and is allocated a bride-price and has not been touched. She has half of what was allocated to her.\""
  },
  "512041": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512041\nIn-book reference  : Book 29, Hadith 041\nEnglish translation  : Vol. 1, Book 29, Hadith 041",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"Every divorced woman has compensation.\""
  },
  "512060": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512060\nIn-book reference  : Book 29, Hadith 060\nEnglish translation  : Vol. 1, Book 29, Hadith 060",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from Sulayman ibn Yasar that Nufay, a mukatab of Umm Salama the wife of the Prophet, may Allah bless him and grant him peace, or her slave, had a free woman as a wife. He divorced her twice, and then he wanted to return to her. The wives of the Prophet, may Allah bless him and grant him peace, ordered him to go to Uthman ibn Affan to ask him about it. He found him at ad-Daraj with Zayd ibn Thabit. He asked them, and they both anticipated him and said, \"She is haram for you. She is haram for you.\""
  },
  "512070": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512070\nIn-book reference  : Book 29, Hadith 070\nEnglish translation  : Vol. 1, Book 29, Hadith 070",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that Nufay, a mukatab of Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, divorced his free wife twice, so he asked Uthman ibn Affan for an opinion, and he said, \"She is haram for you.\""
  },
  "512080": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512080\nIn-book reference  : Book 29, Hadith 080\nEnglish translation  : Vol. 1, Book 29, Hadith 080",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abdu Rabbih ibn Said from Muhammad ibn Ibrahim ibn al-Harith at-Taymi that Nufay, a mukatab of Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, asked Zayd ibn Thabit for an opinion. He said, \"I have divorced my free wife twice.\" Zayd ibn Thabit said, \"She is haram for you.\""
  },
  "512090": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512090\nIn-book reference  : Book 29, Hadith 090\nEnglish translation  : Vol. 1, Book 29, Hadith 090",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"When the slave divorces his wife twice, she is haram for him until she has married another husband, whether she is free or a slave. The idda of a free woman is three menstrual periods, and the idda of a slave-girl is two periods."
  },
  "512100": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512100\nIn-book reference  : Book 29, Hadith 100\nEnglish translation  : Vol. 1, Book 29, Hadith 100",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"If a man gives his slave permission to marry, the divorce is in the hand of the slave, and nobody else has any power over his divorce. Nothing is held against a man who takes the slave-girl of his male slave or the slave-girl of his female-slave.\""
  },
  "512110": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512110\nIn-book reference  : Book 29, Hadith 110\nEnglish translation  : Vol. 1, Book 29, Hadith 110",
    "url": "https://sunnah.com/malik/29",
    "text": "Malik said, \"Neither a free man nor a slave who divorces a slave- girl nor a slave who divorces a free woman, in an irrevocable divorce, is obliged to pay maintenance even if she is pregnant, and he cannot return to her.\""
  },
  "512120": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512120\nIn-book reference  : Book 29, Hadith 120\nEnglish translation  : Vol. 1, Book 29, Hadith 120",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Said ibn al-Musayyab that Umar ibn al-Khattab said, \"The woman who loses her husband and does not know where he is, waits for four years, then she does idda for four months, and then she is free to marry.\""
  },
  "512130": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512130\nIn-book reference  : Book 29, Hadith 130\nEnglish translation  : Vol. 1, Book 29, Hadith 130",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar divorced his wife while she was menstruating in the time of the Messenger of Allah, may Allah bless him and grant him peace, Umar ibn al-Khattab asked the Messenger of Allah, may Allah bless him and grant him peace, about it. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Go and tell him to take her back and keep her until she is purified and then has a period and then is purified. Then if he wishes, he an keep her, and if he wishes he should divorce her before he has intercourse with her. That is the idda which Allah has commanded for women who are divorced.\""
  },
  "512140": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512140\nIn-book reference  : Book 29, Hadith 140\nEnglish translation  : Vol. 1, Book 29, Hadith 140",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab from Urwa ibn az- Zubayr from A'isha, umm al-muminin, that she took Hafsa ibn Abd ar- Rahman ibn Abi Bakr as-Siddiq into her house when she had entered the third period of her idda. Ibn Shihab said, \"That was mentioned to Amra bint Abd ar-Rahman, and she said that Urwa had spoken the truth and people had argued with A'isha about it. They said that Allah, the Blessed, the Exalted, said in His Book, 'Three quru.' A'isha said, 'You spoke the truth. Do you know what quru are? Quru are times of becoming pure after menstruation .' \""
  },
  "512150": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512150\nIn-book reference  : Book 29, Hadith 150\nEnglish translation  : Vol. 1, Book 29, Hadith 150",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Ibn Shihab said that he heard Abu Bakr ibn Abd ar-Rahman say, \"I have never seen any of our fuqaha who did not say that this was what the statement of A'isha meant.\""
  },
  "512160": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512160\nIn-book reference  : Book 29, Hadith 160\nEnglish translation  : Vol. 1, Book 29, Hadith 160",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi and Zayd ibn Aslam from Sulayman ibn Yasar that al-Ahwas died in Syria when his wife had begun her third menstrual period after he had divorced her. Muawiya ibn Abi Sufyan wrote and asked Zayd ibn Thabit about that. Zayd wrote to him, \"When she began her third period, she was free from him and he was free from her, and he does not inherit from her nor she from him.\""
  },
  "512170": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512170\nIn-book reference  : Book 29, Hadith 170\nEnglish translation  : Vol. 1, Book 29, Hadith 170",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Abu Bakr ibn Abd ar-Rahman and Sulayman ibn Yasar and Ibn Shihab used to say, \"When the divorced woman enters the beginning of her third period, she is clearly separated from her husband and there is no inheritance between them and he has no access to her.\""
  },
  "512180": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512180\nIn-book reference  : Book 29, Hadith 180\nEnglish translation  : Vol. 1, Book 29, Hadith 180",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"When a man divorces his wife and she begins her third period, she is free from him and he is free from her.\""
  },
  "512190": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512190\nIn-book reference  : Book 29, Hadith 190\nEnglish translation  : Vol. 1, Book 29, Hadith 190",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from al-Fudayl ibn Abi Abdullah, the mawla of al-Mahri that al-Qasim ibn Muhammad and Salim ibn Abdullah said, \"When a woman is divorced and begins her third period, she is clearly separated from him and is free to marry again.\""
  },
  "512200": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512200\nIn-book reference  : Book 29, Hadith 200\nEnglish translation  : Vol. 1, Book 29, Hadith 200",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab and Ibn Shihab and Sulayman ibn Yasar all said, \"The idda of the woman with a khul divorce is three periods.\""
  },
  "512210": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512210\nIn-book reference  : Book 29, Hadith 210\nEnglish translation  : Vol. 1, Book 29, Hadith 210",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he heard Ibn Shihab say, \"The idda of the divorced woman is reckoned by the menstrual cycles even if she is estranged .\" (The reason the idda is normally reckoned by the menstrual cycle is to see whether the woman is pregnant or not.)"
  },
  "512220": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512220\nIn-book reference  : Book 29, Hadith 220\nEnglish translation  : Vol. 1, Book 29, Hadith 220",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from a man of the Ansar that his wife asked him for a divorce, and he said to her, \"When you have had your period, then tell me.\" When she had her period, she told him. He said, \"When you are purified then tell me.\" When she was purified, she told him and he divorced her."
  },
  "512230": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512230\nIn-book reference  : Book 29, Hadith 230\nEnglish translation  : Vol. 1, Book 29, Hadith 230",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik thal Yahya ibn Said heard al-Qasim ibn Muhammad and Sulayman ibn Yasar both mention that Yahya ibn Said ibn al-As divorced the daughter of Abd ar-Rahman ibn al-Hakam irrevocably, so Abd ar-Rahman ibn al-Hakam took her away A'isha umm al-muminin sent to Marwan ibn al-Hakam who was the Amir of al-Madina at that time. She said, \"Fear Allah and make him return the woman to her house.\" Marwan said in what Sulayman related, ''Abd ar-Rahman has the upper hand over me.\" Marwan said in what al-Qasim related, \"Hasn't the affair of Fatima bint Qays reached you?\" A'isha said, \"You are forced to mention the story of Fatima \" Marwan said, \"If you know that evil, whatever evil there was between those two is enough for you.\" (See hadith 67.)"
  },
  "512240": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512240\nIn-book reference  : Book 29, Hadith 240\nEnglish translation  : Vol. 1, Book 29, Hadith 240",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that the daughter of Said ibn Zayd ibn Amr ibn Nufayl was the wife of Abdullah ibn Umar ibn Uthman ibn Affan, and he divorced her irrevocably and she moved out. Abdullah ibn Umar rebuked her for that."
  },
  "512250": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512250\nIn-book reference  : Book 29, Hadith 250\nEnglish translation  : Vol. 1, Book 29, Hadith 250",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar divorced one of his wives in the house of Hafsa, the wife of the Prophet, may Allah bless him and grant him peace, while he was on the way to the mosque. He went another route from behind the houses being averse to ask permission to enter until he returned to her."
  },
  "512260": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512260\nIn-book reference  : Book 29, Hadith 260\nEnglish translation  : Vol. 1, Book 29, Hadith 260",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab was asked who was obliged to pay the rent for a woman whose husband divorced her while she was in a leased house. Said ibn al-Musayyab said, \"Her husband is obliged to pay it.\" Someone asked, \"what if her husband does not have it?\" He said, \"Then she must pay it.\" Someone asked, \"And if she does not have it?\" He said, \"Then the Amir must pay it.\""
  },
  "512270": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512270\nIn-book reference  : Book 29, Hadith 270\nEnglish translation  : Vol. 1, Book 29, Hadith 270",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abdullah ibn Yazid, the mawla of al-Aswad ibn Sufyan from Abu Salama ibn Abd ar-Rahman ibn Awf from Fatima bint Qays that Abu Amr ibn Hafs divorced her absolutely while he was away in Syria. His agent sent her some barley and she was displeased with it, saying, \"By Allah, I don't expect anything from you.\" She went to the Messenger of Allah, may Allah bless him and grant him peace, and mentioned it to him. He said, \"You have no maintenance.\" He then ordered her to spend her idda in the house of Umm Sharik. Then he said, \"This is a woman whom my companions visit. Spend the idda in the house of Ibn Umm Maktum. He is a blind man and you can undress at his home. When you are free to remarry, tell me.\""
  },
  "512280": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512280\nIn-book reference  : Book 29, Hadith 280\nEnglish translation  : Vol. 1, Book 29, Hadith 280",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he heard Ibn Shihab say, \"The woman who is absolutely divorced does not leave her house until she is free to remarry. She has no maintenance unless she is pregnant. In that circumstance the husband spends on her until she gives birth.\""
  },
  "29074": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 29074\nIn-book reference  : Book 29, Hadith 074\nEnglish translation  : Vol. 1, Book 29, Hadith 074",
    "url": "https://sunnah.com/malik/29",
    "text": "Malik said, \"What is done among us when a slave divorces a slave- girl when she is a slave and then she is set free, is that her idda is the idda of a slave-girl, and her being set free does not change her idda whether or not he can still return to her. Her idda is not altered.\""
  },
  "512290": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512290\nIn-book reference  : Book 29, Hadith 290\nEnglish translation  : Vol. 1, Book 29, Hadith 290",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said and from Yazid ibn Abdullah ibn Qusayt al-Laythi that Said ibn al-Musayyab said, ''Umar ibn al-Khattab said, 'If a woman is divorced and has one or two periods and then stops menstruating, she must wait nine months. If it is clear that she is pregnant, that is that. If not, she must do an idda of three months after the nine, and then she is free to marry.' \""
  },
  "512300": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512300\nIn-book reference  : Book 29, Hadith 300\nEnglish translation  : Vol. 1, Book 29, Hadith 300",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyab said, \"Divorce belongs to men, and women have the idda.\""
  },
  "512310": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512310\nIn-book reference  : Book 29, Hadith 310\nEnglish translation  : Vol. 1, Book 29, Hadith 310",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al- Musayyab said, \"The idda of the woman who bleeds constantly is a year.\""
  },
  "512320": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512320\nIn-book reference  : Book 29, Hadith 320\nEnglish translation  : Vol. 1, Book 29, Hadith 320",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Ali ibn Abi Talib said about the two arbiters about whom Allah, the Exalted, said,\"If you fear a breach between the two, appoint an arbiter from his people, and an arbiter from her people. If they desire to set things aright, Allah will make peace between them, surely Allah is Knowing, Aware,\" (Sura 4 ayat 35), that the separation and the joining were overseen by the two of them."
  },
  "512330": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512330\nIn-book reference  : Book 29, Hadith 330\nEnglish translation  : Vol. 1, Book 29, Hadith 330",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Umar ibn al-Khattab, Abdullah ibn Umar, Abdullah ibn Masud, Salim ibn Abdullah, al-Qasim ibn Muhammad, Ibn Shihab,and Sulayman ibn Yasar all said, \"If a man has vowed to divorce his wife before marrying her and then he breaks his vow, divorce is obligatory for him when he marries her.\""
  },
  "512350": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512350\nIn-book reference  : Book 29, Hadith 350\nEnglish translation  : Vol. 1, Book 29, Hadith 350",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Ibn Shihab that Said ibn al- Musayyab said, \"If someone marries a woman and cannot have intercourse with her, there is a deadline of a year set for him to have intercourse with her. If he does not, they are separated.\""
  },
  "512360": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512360\nIn-book reference  : Book 29, Hadith 360\nEnglish translation  : Vol. 1, Book 29, Hadith 360",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had asked Ibn Shihab about whether the deadline was set from the day he had married her, or from the day she raised the question before the Sultan. He said. 'It is from the day she presents it before the Sultan.'"
  },
  "512370": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512370\nIn-book reference  : Book 29, Hadith 370\nEnglish translation  : Vol. 1, Book 29, Hadith 370",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"I have heard that the Messenger of Allah, may Allah bless him and grant him peace, said to a man from Thaqif who had ten wives when he became muslim, 'Take four and separate from the rest.' \""
  },
  "512380": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512380\nIn-book reference  : Book 29, Hadith 380\nEnglish translation  : Vol. 1, Book 29, Hadith 380",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Ibn Shihab said that he had heard Said ibn al-Musayyab, Humayd ibn Abd ar-Rahman ibn Awf, Ubaydullah ibn Abdullah ibn Utba ibn Masud, and Sulayman ibn Yasarall say, that they had heard Abu Hurayra say that he had heard Umar ibn al-Khattab say, \"If a woman is divorced by her husband once or twice, and he leaves her until she is free to marry and she marries another husband and he dies or divorces her, and then she marries her first husband, she is with him according to what remains of her divorce.\""
  },
  "512390": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512390\nIn-book reference  : Book 29, Hadith 390\nEnglish translation  : Vol. 1, Book 29, Hadith 390",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Thabit ibn al-Ahnaf that he married an umm walad of Abd ar-Rahman ibn Zayd ibn al-Khattab. He said, \"Abdullah ibn Abd ar-Rahman ibn Zayd ibn al-Khattab summoned me and I went to him. I came in upon him and there were whips and two iron fetters placed there, and two of his slaves whom he had made to sit there. He said, 'Divorce her, or by He by whom one swears, I will do such-and-such to you!' I said, 'It is divorce a thousand times.' Then I left him and I saw Abdullah ibn Umar on the road to Makka and I told him about my situation. Abdullah ibn Umar was furious, and said, 'That is not divorce, and she is not haram for you, so return to your home.' I was still not at ease so I went to Abdullah ibn az-Zubayr who was the Amir of Makka at that time. I told him about my situation and what Abdullah ibn Umar had said to me. Abdullah ibn az-Zubayr said to me, 'She is not haram for you, so return to your home,' and he wrote to Jabir ibn al-Aswad az-Zuhra who was the Amir of Madina and ordered him to punish Abdullah ibn Abdar-Rahman and to have him leave me and my family alone. I went to Madina, and Safiyya, the wife of Abdullah ibn Umar fitted out my wife so that she could bring her to my house with the knowledge of Abdullah ibn Umar. Then I invited Abdullah ibn Umar on the day of my wedding to the wedding feast and he came.\""
  },
  "512400": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512400\nIn-book reference  : Book 29, Hadith 400\nEnglish translation  : Vol. 1, Book 29, Hadith 400",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Abdullah ibn Dinar said, \"I heard Abdullah ibn Umar recite from the Qur'an, 'Prophet! When you divorce women, divorce them at the beginning of their idda.'\""
  },
  "512410": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512410\nIn-book reference  : Book 29, Hadith 410\nEnglish translation  : Vol. 1, Book 29, Hadith 410",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father said, \"It used to be that a man would divorce his wife and then return to her before her idda was over, and that was alright, even if he divorced her a thousand times. The man went to his wife and then divorced her and when the end of her idda was in sight, he took her back and then divorced her and said, 'No! By Allah, I will not go to you and you will never be able to marry again.' Allah, the Blessed, the Exalted, sent down, 'Divorce is twice, then honourable retention or setting free kindly.' People then turned towards divorce in a new light from that day whether or not they were divorced or not divorced.\""
  },
  "512420": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512420\nIn-book reference  : Book 29, Hadith 420\nEnglish translation  : Vol. 1, Book 29, Hadith 420",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Thawr ibn Zayd ad-Dili that Allah, the Blessed, the Exalted, sent down about a man who divorced his wife and then returned to her while he had no need of her and did not mean to keep her so as to make the idda period long for her by that in order to do her harm, \"Do not retain them by force, to transgress. Whoever does that has wronged himself.\" (Sura 2 ayat 231). Allah warns them by that ayat."
  },
  "512430": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512430\nIn-book reference  : Book 29, Hadith 430\nEnglish translation  : Vol. 1, Book 29, Hadith 430",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar were asked about a man who divorced when he was drunk. They said, \"When a drunk man divorces, his divorce is allowed. If he kills, he is killed for it.\""
  },
  "512440": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512440\nIn-book reference  : Book 29, Hadith 440\nEnglish translation  : Vol. 1, Book 29, Hadith 440",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab said, \"If a man does not find the means to spend on his wife, they are to be separated . \""
  },
  "512450": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512450\nIn-book reference  : Book 29, Hadith 450\nEnglish translation  : Vol. 1, Book 29, Hadith 450",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abdu Rabbih ibn Said ibn Qays that Abu Salama ibn Abd ar-Rahman said that Abdullah ibn Abbas and Abu Hurayra were asked when a pregnant woman whose husband had died could remarry. Ibn Abbas said, \"At the end of two periods.\" Abu Hurayra said, \"When she gives birth, she is free to marry.\" Abu Salama ibn Abd ar-Rahman visited Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, and asked her about it Umm Salama said, ''Subaya al-Aslamiya gave birth half a month after the death of her husband, and two men asked to marry her. One was young and the other was old. She preferred the young man and so the older man said, 'You are not free to marry yet.' Her family were away and he hoped that when her family came, they would give her to him. She went to the Messenger of Allah, may Allah bless him and grant him peace, and he said, 'You are free to marry, so marry whomever you wish.' \""
  },
  "512460": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512460\nIn-book reference  : Book 29, Hadith 460\nEnglish translation  : Vol. 1, Book 29, Hadith 460",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar was asked about a woman whose husband died while she was pregnant, and he said, \"When she gives birth, she is free to marry.\" A man of the Ansar who was with him told him that Umar ibn al-Khattab had said, \"Had she given birth while her husband was still on his bed, unburied, she would be free to marry.\""
  },
  "512470": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512470\nIn-book reference  : Book 29, Hadith 470\nEnglish translation  : Vol. 1, Book 29, Hadith 470",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Hisham ibn 'Urwa from his father that al-Miswar ibn Makhrama told him that Subaya al-Aslamiya gave birth a few nights after the death of her husband. The Messenger of Allah, may Allah bless him and grant him peace, said to her, \"You are free to marry, so marry whomever you wish.\""
  },
  "512480": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512480\nIn-book reference  : Book 29, Hadith 480\nEnglish translation  : Vol. 1, Book 29, Hadith 480",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Sulayman ibn Yasar that Abdullah ibn Abbas and Abu Salama ibn Abd ar-Rahman ibn Awf differed on the question of a wornan who gave birth a few nights after the death of her husband. Abu Salama said, \"When she gives birth to the child she is carrying, she is free to marry.\" Ibn Abbas said, \"At the end of two periods.\" Abu Hurayra came and said, \"I am with my nephew\", meaning Abu Salama. They sent Kurayb, a mawla of Abdullah ibn Abbas to Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, to ask her about it. He came back and told them that she had said that Subaya al-Aslamiya had given birth a few nights after the death of her husband, and she had brought the matter to the Messenger of Allah, may Allah bless him and grant him peace, and he had said, \"You are free to marry, so marry whomever you wish.\""
  },
  "512490": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512490\nIn-book reference  : Book 29, Hadith 490\nEnglish translation  : Vol. 1, Book 29, Hadith 490",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Said ibn Ishaq ibn Kab ibn Ujra from his paternal aunt, Zaynab bint Kab ibn Ujra that al-Furaya bint Malik ibn Sinan, the sister of Abu Said al-Khudri, informed her that she went to the Messenger of Allah, may Allah bless him and grant him peace, and asked to be able to return to her people among the Banu Khudra since her husband had gone out in search of some of his slaves who had run away and he had caught up with them near al-Qudum, (which is 6 miles from Madina), and they had killed him."
  },
  "512500": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512500\nIn-book reference  : Book 29, Hadith 500\nEnglish translation  : Vol. 1, Book 29, Hadith 500",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Humayd ibn Qays al-Makki from Amr ibn Shuayb from Said ibn al-Musayyab that Umar ibn al-Khattab sent back widows from the desert and prevented them from doing the hajj."
  },
  "512510": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512510\nIn-book reference  : Book 29, Hadith 510\nEnglish translation  : Vol. 1, Book 29, Hadith 510",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Yahya ibn Saqd that he had heard that as-Sa'ib ibn Khabbab died, and his wife went to Abdullah ibn Umar and mentioned to him that her husband had died and mentioned some land which they had at Qanah, (a district on the outskirts of Madina), and asked him if it would be alright for her to stay overnight there. He forbade her to do so. So, she went out before dawn from Madina and spent the whole day on their land, but when evening came, she spent the night in her house."
  },
  "512520": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512520\nIn-book reference  : Book 29, Hadith 520\nEnglish translation  : Vol. 1, Book 29, Hadith 520",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Hisham ibn Urwa said about a Bedouin woman whose husband died, that she was to stay where her people stayed."
  },
  "512530": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512530\nIn-book reference  : Book 29, Hadith 530\nEnglish translation  : Vol. 1, Book 29, Hadith 530",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullan ibn Umar said, \"The only place a woman whose husband has died and a woman who is absolutely divorced can spend the night is in their houses.\""
  },
  "512540": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512540\nIn-book reference  : Book 29, Hadith 540\nEnglish translation  : Vol. 1, Book 29, Hadith 540",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that Yahya ibn Said said that he had heard al-Qasim ibn Muhammad say that Zayd ibn Abd al-Malik separated some men and their wives who were slave-girls who had borne children to men who had died, because they had married them after one or two menstrual periods. He separated them until they had done an idda of four months and ten days. Al-Qasim ibn Muhammad said, \"Glory be to Allah! Allah says in His Book, 'Those of you who die, leaving wives, they are not wives.' \""
  },
  "512550": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512550\nIn-book reference  : Book 29, Hadith 550\nEnglish translation  : Vol. 1, Book 29, Hadith 550",
    "url": "https://sunnah.com/malik/29",
    "text": "Malik related to me from Nafi that Abdullah ibn Umar said, \"The idda of an umm walad when her master dies is one menstrual period.\""
  },
  "512560": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512560\nIn-book reference  : Book 29, Hadith 560\nEnglish translation  : Vol. 1, Book 29, Hadith 560",
    "url": "https://sunnah.com/malik/29",
    "text": "Malik said, \"This is what is done among us.\""
  },
  "512570": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512570\nIn-book reference  : Book 29, Hadith 570\nEnglish translation  : Vol. 1, Book 29, Hadith 570",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Said ibn al-Musayyab and Sulayman ibn Yasar said, \"The idda of a slave-girl when her husband dies is two months and five days.\""
  },
  "512580": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512580\nIn-book reference  : Book 29, Hadith 580\nEnglish translation  : Vol. 1, Book 29, Hadith 580",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me the like of that from Malik from Ibn Shihab."
  },
  "512590": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512590\nIn-book reference  : Book 29, Hadith 590\nEnglish translation  : Vol. 1, Book 29, Hadith 590",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman from Muhammad ibn Yahya ibn Habban that Ibn Muhayriz said, \"I went into the mosque and saw Abu Said al-Khudri and so I sat by him and asked him about coitus interruptus. Abu Said al-Khudri said, 'We went out with the Messenger of Allah, may Allah bless him and grant him peace, on the expedition to the Banu al-Mustaliq. We took some Arabs prisoner, and we desired the women as celibacy was hard for us. We wanted the ransom, so we wanted to practise coitus interruptus. We said, 'Shall we practise coitus interruptus while the Messenger of Allah, may Allah bless him and grant him peace, is among us before we ask him?' We asked him about that and he said, 'You don't have to not do it. There is no self which is to come into existence up to the Day of Rising but that it will come into existence.' \""
  },
  "512600": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512600\nIn-book reference  : Book 29, Hadith 600\nEnglish translation  : Vol. 1, Book 29, Hadith 600",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar ibn Ubaydullah from Amir ibn Sad ibn Abi Waqqas from his father that he used to practise coitus interruptus."
  },
  "512610": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512610\nIn-book reference  : Book 29, Hadith 610\nEnglish translation  : Vol. 1, Book 29, Hadith 610",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abu'n-Nadr, the mawla of Umar ibn Ubaydullah from Ibn Aflah, the mawla of Abu Ayyub al-Ansari from an umm walad of Abu Ayyubal-Ansari that he practised coitus interruptus."
  },
  "512620": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512620\nIn-book reference  : Book 29, Hadith 620\nEnglish translation  : Vol. 1, Book 29, Hadith 620",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar did not practise coitus interruptus and thought that it was disapproved."
  },
  "512630": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512630\nIn-book reference  : Book 29, Hadith 630\nEnglish translation  : Vol. 1, Book 29, Hadith 630",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Damra ibn Said al-Mazini from al-Hajjaj ibn Amr ibn Ghaziya that he was sitting with Zayd ibn Thabit when Ibn Fahd came to him. He was from the Yemen. He said, \"Abu Said! I have slave-girls. None of the wives in my keep are more pleasing to me than them, and not all of them please me so much that I want a child by them, shall I then practise coitus interruptus?\" Zayd ibn Thabit said, \"Give an opinion, Hajjaj!\" \"I said, 'May Allah forgive you! We sit with you in order to learn from you!' He said, 'Give an opinion! 'I said, 'She is your field, if you wish, water it, and if you wish, leave it thirsty. I heard that from Zayd.' Zayd said, 'He has spoken the truth.' \""
  },
  "512640": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512640\nIn-book reference  : Book 29, Hadith 640\nEnglish translation  : Vol. 1, Book 29, Hadith 640",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Humayd ibn Qays al-Makki that a man called Dhafif said that Ibn Abbas was asked about coitus interruptus. He called a slave-girl of his and said, \"Tell them.\" She was embarrassed. He said, \"It is alright, and I do it myself.\""
  },
  "512650": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512650\nIn-book reference  : Book 29, Hadith 650\nEnglish translation  : Vol. 1, Book 29, Hadith 650",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr ibn Muhammad ibn Amr ibn Hazm from Humayd ibn Nafi that Zaynab bint Abi Salama related these three traditions to him. Zaynab said, \"I visited Umm Habiba, the wife of the Prophet, may Allah bless him and grant him peace, when her father Abu Sufyan ibn Harb had died. Umm Habiba called for a yellowy perfume perhaps khaluq or something else. She rubbed the perfume first on a slave-girl and she then wiped it on the sides of her face and said, 'By Allah! I have no need of perfume but I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'It is not halal for a woman who trusts in Allah and the Last Day to abstain from adornment in mourning for someone who has died, for more than three nights, except for four months and ten days for a husband.' \""
  },
  "512660": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512660\nIn-book reference  : Book 29, Hadith 660\nEnglish translation  : Vol. 1, Book 29, Hadith 660",
    "url": "https://sunnah.com/malik/29",
    "text": "Zaynab said, \"I went to the house of Zaynab bint Jahsh, the wife of the Prophet, may Allah bless him and grant him peace, when her brother had died. She called for perfume and put some on and said, 'By Allah! I have no need of perfume, but I heard the Messenger of Allah, may Allah bless him and grant him peace, say, 'It is not halal for a woman who trusts in Allah and the Last Day to abstain from adornment in mourning for someone who has died for more than three nights, except for four months and ten days for a husband.' \""
  },
  "512670": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512670\nIn-book reference  : Book 29, Hadith 670\nEnglish translation  : Vol. 1, Book 29, Hadith 670",
    "url": "https://sunnah.com/malik/29",
    "text": "Zaynab said, \"I heard my mother, Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, say that a woman came to the Messenger of Allah, may Allah bless him and grant him peace, and said, 'Messenger of Allah! My daughter's husband died, and her eyes are troubling her, can she put kohl on them?' The Messenger of Allah, may Allah bless him and grant him peace, said, 'No' two or three times. Then he said, 'It is only four months and ten days. In the Jahiliyya, none of you threw away the piece of dung until a year had passed.' \""
  },
  "512680": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512680\nIn-book reference  : Book 29, Hadith 680\nEnglish translation  : Vol. 1, Book 29, Hadith 680",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafi from Safiyya bint Abi Ubayd from A'isha and Hafsa, the wives of the Prophet, may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is not halal for a woman in mourning for someone who has died, if she trusts in Allah and the Last Day, to abstain from adornment for more than three nights, except for a husband.\""
  },
  "512690": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512690\nIn-book reference  : Book 29, Hadith 690\nEnglish translation  : Vol. 1, Book 29, Hadith 690",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, said to a woman in mourning for her husband whose eyes were troubling her and the pain had become very strong, \"Apply jala kohl at night and wipe it off in the day.\""
  },
  "512700": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512700\nIn-book reference  : Book 29, Hadith 700\nEnglish translation  : Vol. 1, Book 29, Hadith 700",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Salim ibn Abdullah and Sulayman ibn Yasar said that if a woman whose husband had died feared that an inflammation of her eyes might affect her sight or that some complaint might befall her, she should put kohl on and seek a remedy with kohl or some other cure even if it had perfume in it."
  },
  "512710": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512710\nIn-book reference  : Book 29, Hadith 710\nEnglish translation  : Vol. 1, Book 29, Hadith 710",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik from Nafic that Saffiyya bint Abi Ubayd suffered from an eye-complaint while she was in mourning for her husband, Abdullah ibn Umar. She did not apply kohl until her eyes almost had ramas (a dry white secretion in the corners of the eye)."
  },
  "512720": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512720\nIn-book reference  : Book 29, Hadith 720\nEnglish translation  : Vol. 1, Book 29, Hadith 720",
    "url": "https://sunnah.com/malik/29",
    "text": "108 Yahya related to me from Malik that he had heard that the Messenger of Allah, may Allah bless him and grant him peace, visited Umm Salama while she was in mourning for Abu Salama and she had put aloes on her eyes. He said, \"What is this, Umm Salama?\" She said, \"It is only aloes, Messenger of Allah.\" He said, \"Put it on at night and wipe it off in the daytime.\""
  },
  "512730": {
    "collection": "Muwatta Malik",
    "book": "Divorce",
    "book_num": "29",
    "reference": "Reference  : Muwatta Malik 512730\nIn-book reference  : Book 29, Hadith 730\nEnglish translation  : Vol. 1, Book 29, Hadith 730",
    "url": "https://sunnah.com/malik/29",
    "text": "Yahya related to me from Malik that he had heard that Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, said, \"A mourning woman can rub her head with lotus leaves and olive oil.''"
  }
}