{
  "514570": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514570\nIn-book reference  : Book 37, Hadith 570\nEnglish translation  : Vol. 1, Book 37, Hadith 570",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is the duty of a muslim man who has something to be given as a bequest not to spend two nights without writing a will about it.\""
  },
  "514580": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514580\nIn-book reference  : Book 37, Hadith 580\nEnglish translation  : Vol. 1, Book 37, Hadith 580",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Abdullah ibn Abi Bakr ibn Hazm that Amr ibn Sulaym az-Zuraqi informed his father that it had been said to Umar ibn al-Khattab, \"There is here an adolescent boy who has not yet reached puberty. He is from the Ghassan tribe and his heir is in ash- Sham. He has property. Here he only has the daughter of one of his paternal uncles.\" Umar ibn al-Khattab instructed, \"Let him leave her a bequest.\" He willed her a property called the well of Jusham."
  },
  "514590": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514590\nIn-book reference  : Book 37, Hadith 590\nEnglish translation  : Vol. 1, Book 37, Hadith 590",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Yahya ibn Said from Abu Bakr ibn Hazm that a boy from Ghassan was dying in Madina while his heir was in Syria. That was mentioned to Umar ibn al-Khattab. It was said to him, \"So-and-so is dying. Shall he make a bequest?\" He said, \"Let him make a bequest.\""
  },
  "514600": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514600\nIn-book reference  : Book 37, Hadith 600\nEnglish translation  : Vol. 1, Book 37, Hadith 600",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Ibn Shihab from Amir ibn Sad ibn Abi Waqqas that his father said, \"The Messenger of Allah, may Allah bless him and grant him peace, came to me to treat me for a pain which became hard to bear in the year of the farewell hajj. I said, 'Messenger of Allah, you can see how far the pain has reached me. I have property and only my daughter inherits from me. Shall I give two thirds of my property as sadaqa?' The Messenger of Allah, may Allah bless him and grant him peace, said, 'No.' I said, 'Half?' He said, 'No.' Then the Messenger of Allah, may Allah bless him and grant him peace, said, 'A third, and a third is a lot. Leaving your heirs rich is better than leaving them poor to beg from people. You never spend anything on maintenance desiring the Face of Allah by it, but that you are rewarded for it, even what you appoint for your wife.' Sad said, 'Messenger of Allah, will I be left here in Makka after my companions have departed for Madina?' The Messenger of Allah, may Allah bless him and grant him peace, said, 'If you are left behind, and do sound deeds you will increase your degree and elevation by them. Perhaps you will be left behind so that some people may benefit by you and others may be harmed by you. O Allah! complete their hijra for my companions, and do not turn them back on their heels. The unfortunate one is Said ibn Khawla.' The Messenger of Allah, may Allah bless him and grant him peace, was distressed on his account for he had died at Makka.\""
  },
  "3705": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 3705\nIn-book reference  : Book 37, Hadith 705\nEnglish translation  : Vol. 1, Book 37, Hadith 705",
    "url": "https://sunnah.com/malik/37",
    "text": "Yahya said that he heard Malik say, \"The best of what I have heard about the testament of a pregnant woman and about what settlements she is permitted in her property is that the pregnant woman is like the sick person. When the illness is light, and one does not fear for the sick person, he does with his property what he likes. If the illness is such that his life is feared for, he can only dispose of a third of his estate.\""
  },
  "3706": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 3706\nIn-book reference  : Book 37, Hadith 706\nEnglish translation  : Vol. 1, Book 37, Hadith 706",
    "url": "https://sunnah.com/malik/37",
    "text": "Yahya said that he heard Malik say, \"This ayat is abrogated. It is the word of Allah, the Blessed, the Exalted, 'If he leaves goods, the testament is for parents and kinsmen.' What came down about the division of the fixed shares of inheritance in the Book of Allah, the Mighty, the Exalted, abrogated it.\""
  },
  "514610": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514610\nIn-book reference  : Book 37, Hadith 610\nEnglish translation  : Vol. 1, Book 37, Hadith 610",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik said from Hisham ibn Urwa from his father that an effeminate man was with Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace. He said to Abdullah ibn Abi Umayya while the Messenger of Allah, may Allah bless him and grant him peace, was listening. \"Abdullah! If Allah grants you victory over Ta'if tomorrow, I will lead you to the daughter of Ghailan. She has four folds on her front and eight folds on her back.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"This sort of man should not enter freely with you.\" (It was customary to allow men with no sexual inclination to enter freely where there were women)."
  },
  "514620": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514620\nIn-book reference  : Book 37, Hadith 620\nEnglish translation  : Vol. 1, Book 37, Hadith 620",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me that Yahya ibn Said said that he heard al- Qasim ibn Muhammad say, \"A woman of the Ansar was married to Umar ibn al-Khattab. She bore Asim ibn Umar to him, and then he separated from her. Umar came to Quba and found his son Asim playing in the courtyard of the mosque. He took him by the arm and placed him before him on his mount. The grandmother of the child saw him and argued with Umar about the child so they went to Abu Bakr as-Siddiq. Umar said, 'My son.' The woman said, 'My son.' Abu Bakr said, 'Do not interfere between a child and its mother.' Umar did not repeat his words.\""
  },
  "3709": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 3709\nIn-book reference  : Book 37, Hadith 709\nEnglish translation  : Vol. 1, Book 37, Hadith 709",
    "url": "https://sunnah.com/malik/37",
    "text": "Yahya said that he heard Malik speak about a man who bought goods - animals or clothes or wares, and the sale was found not to be permitted so it was revoked and the one who had taken the goods was ordered to return the owner his goods. Malik said, \"The owner of the goods only has their value on the day they were taken from him, and not on the day they are returned to him. That is because the man is liable for them from the day he took them and whatever loss is in them after that is against him. For that reason, their increase and growth are also his. A man may take the goods at a time when they are selling well and are in demand, and then have to return them at a time when they have fallen in price and no one wants them. For instance, the man may take the goods from the other man, and sell them for ten dinars or keep them while their price is that. Then he may have to return them while their price is only a dinar. He should not go off with nine dinars from the man's property. Or perhaps they are taken by the man, and he sells them for a dinar or keeps them, while their price is only a dinar, then he has to return them, and their value on the day he returns them is ten dinars. The one who took them does not have to pay nine dinars from his property to the owner. He is only obliged to pay the value of what he took possession of on the day it was taken .\""
  },
  "514630": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514630\nIn-book reference  : Book 37, Hadith 630\nEnglish translation  : Vol. 1, Book 37, Hadith 630",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Yahya ibn Said that Abu'd-Darda wrote to Salman al-Farsi, \"Come immediately to the holy land.\" Salman wrote back to him, \"Land does not make anyone holy. Man's deeds make him holy. I have heard that you were put up as a doctor to treat and cure people. If you are innocent, then may you have delight! If you are a quack, then beware lest you kill a man and enter the Fire!\" When Abu'd-Darda judged between two men, and they turned from him to go, he would look at them and say, \"Come back to me, and tell me your story again. A quack! By Allah!\""
  },
  "514640": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514640\nIn-book reference  : Book 37, Hadith 640\nEnglish translation  : Vol. 1, Book 37, Hadith 640",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Umar ibn Abd ar-Rahman ibn Dalaf al- Muzani from his father that a man from the Juhayna tribe used to buy camels before people set out for hajj and sell them at a higher price. Then he travelled quickly and used to arrive in Makka before the others who set out for hajj. He went bankrupt and his situation was put before Umar ibn al-Khattab, who said, \"O People! al-Usayfi, al- Usayfi of the Juhayna, was satisfied with his deen and his trust because it was said of him that he arrived before the others on hajj. He used to incur debts which he was not careful to repay, so all of his property has been eaten up by it. Whoever has a debt against him, let him come to us tomorrow and we will divide his property between his creditors. Beware of debts! Their beginning is a worry and their end is destitution. \""
  },
  "37012": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 37012\nIn-book reference  : Book 37, Hadith 012\nEnglish translation  : Vol. 1, Book 37, Hadith 012",
    "url": "https://sunnah.com/malik/37",
    "text": "Yahya said that he heard Malik say, \"The sunna with us about the crime of slaves is that the hand is not cut off for any harm that a slave causes a man, or something he pilfers, or something guarded which he steals, or hanging dates he cuts down or ruins, or steals. That is against the slave's person and does not exceed the price of the slave whether it is little or much. If his master wishes to give the value of what the slave took or ruined, or pay the blood-price for the injury, he pays it and keeps his slave. If he wishes to surrender him, he surrenders him, and none of that is against him. The master has the option in that.\""
  },
  "514650": {
    "collection": "Muwatta Malik",
    "book": "Wills and Testaments",
    "book_num": "37",
    "reference": "Reference  : Muwatta Malik 514650\nIn-book reference  : Book 37, Hadith 650\nEnglish translation  : Vol. 1, Book 37, Hadith 650",
    "url": "https://sunnah.com/malik/37",
    "text": "Malik related to me from Ibn Shihab from Said ibn al-Musayyab that Uthman ibn Affan said, \"If someone gives something to his small child who is not old enough to look after it himself, and in order that his gift might be permitted he makes the gift public and has it witnessed, the gift is permitted, even if the father keeps charge of it.\""
  }
}