{
  "516530": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516530\nIn-book reference  : Book 49, Hadith 530\nEnglish translation  : Vol. 1, Book 49, Hadith 530",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Rabia ibn Abi Abd ar-Rahman heard Anas ibn Malik say, \"The Messenger of Allah, may Allah bless him and grant him peace, was not excessively tall or short. He was not very pallid nor dark. He did not have curly hair or lank hair. Allah commissioned him at the age of forty. He stayed in Makka ten years and at Madina for ten years and Allah the Mighty, the Majestic made him die when he was sixty. There were not twenty white hairs in his hair or beard, may Allah bless him and grant him peace.\""
  },
  "516540": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516540\nIn-book reference  : Book 49, Hadith 540\nEnglish translation  : Vol. 1, Book 49, Hadith 540",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"I dreamt at night that I was at the Kaba, and I saw a dark man like the most handsome of dark men you have ever seen. He had hair reaching to between his ears and his shoulders like the most excellent of such hair that you have seen. He had combed his hair, and water was dripping from it. He was leaning on two men or on the shoulders of two men doing tawaf around Kaba. I asked, 'Who is this?' It was said, 'al- Masih ibn Maryam.' Then we were with a man with wiry hair and blind in his right eye, as if it was a floating grape. I asked 'Who is this?' It was said to me, 'This is al-Masih ad-Dajjal.' \""
  },
  "516560": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516560\nIn-book reference  : Book 49, Hadith 560\nEnglish translation  : Vol. 1, Book 49, Hadith 560",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Said ibn al-Musayyub said, \"Ibrahim, may Allah bless him and grant him peace, was the first to give hospitality to the guest and the first person to be circumcised and the first person to trim the moustache and the first person to see grey hair. He said, 'O Lord! What is this?' Allah the Blessed, the Exalted, said, 'It is dignity, Ibrahim.' He said, 'Lord, increase me in dignity!' \""
  },
  "516570": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516570\nIn-book reference  : Book 49, Hadith 570\nEnglish translation  : Vol. 1, Book 49, Hadith 570",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu'z-Zubayr from Jabir ibn Abdullah as-Salami that the Messenger of Allah, may Allah bless him and grant him peace, forbade a man to eat with his left hand or walk in one sandal or wrap a single garment around his drawn-up legs exposing his genitals."
  },
  "516580": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516580\nIn-book reference  : Book 49, Hadith 580\nEnglish translation  : Vol. 1, Book 49, Hadith 580",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Ibn Shihab from Abu Bakr ibn Ubaydullah ibn Abdullah ibn Umar from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When you eat, eat with your right hand and drink with your right hand. Shaytan eats with his left hand and drinks with his left hand.\""
  },
  "516590": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516590\nIn-book reference  : Book 49, Hadith 590\nEnglish translation  : Vol. 1, Book 49, Hadith 590",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The very poor are not the people who constantly walk from person to person and are given one or two morsels, and one or two dates.\" They said, \"Who are the very poor, Messenger of Allah?\" He said, \"People who do not find enough for themselves and other people are not aware of them to give sadaqa to them, and they do not start begging from other people.\""
  },
  "516600": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516600\nIn-book reference  : Book 49, Hadith 600\nEnglish translation  : Vol. 1, Book 49, Hadith 600",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from Ibn Bujayd (formerly al-Ansari) from his grandmother that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Give to the very poor, if only a roasted hoof.\""
  },
  "516610": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516610\nIn-book reference  : Book 49, Hadith 610\nEnglish translation  : Vol. 1, Book 49, Hadith 610",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj that Abu Hurayra said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'The muslim eats in one intestine, and the kafir eats in seven!' \""
  },
  "516620": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516620\nIn-book reference  : Book 49, Hadith 620\nEnglish translation  : Vol. 1, Book 49, Hadith 620",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Suhayl ibn Abi Salih from his father from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, gave hospitality to a kafir guest. The Messenger of Allah, may Allah bless him and grant him peace, ordered a sheep to be brought for him and it was milked. He drank its milk. Then another came, and he drank it. Then another came and he drank it until he had drunk the milk of seven sheep. In the morning he became muslim, and the Messenger of Allah, may Allah bless him and grant him peace, ordered a sheep for him. It was milked and he drank its milk. Then he ordered another for him and he could not finish it. The Messenger of Allah, may Allah bless him and grant him peace, said, \"The mumin drinks in one intestine, and the kafir drinks in seven intestines.\""
  },
  "516630": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516630\nIn-book reference  : Book 49, Hadith 630\nEnglish translation  : Vol. 1, Book 49, Hadith 630",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Nafi from Zayd ibn Abdullah ibn Umar ibn al-Khattab from Abdullah ibn Abd ar-Rahman ibn Abi Bakras-Siddiq from Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A person who drinks from a silver vessel brings the fire of Jahannam into his belly.\""
  },
  "516640": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516640\nIn-book reference  : Book 49, Hadith 640\nEnglish translation  : Vol. 1, Book 49, Hadith 640",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Ayyub ibn Habib, the mawla of Sad ibn Abi Waqqas that Abu'l-Muthanna al-Juhani said, \"I was with Marwan ibn al-Hakam and Abu Said al-Khudri came to him. Marwan ibn al- Hakam said to him, 'Have you heard that the Messenger of Allah, may Allah bless him and grant him peace, forbade blowing into drinks?' Abu Said said to him, 'Yes.' A man said to him, 'Messenger of Allah, I am not quenched from one breath.' The Messenger of Allah, may Allah bless him and grant him peace, said to him, 'Remove the cup from your mouth and then breathe.' He said, 'Sometimes I see something floating in it?' He said, 'Then pour it out.'\""
  },
  "516650": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516650\nIn-book reference  : Book 49, Hadith 650\nEnglish translation  : Vol. 1, Book 49, Hadith 650",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that he had heard that Umar ibn al-Khattab and Ali ibn Abi Talib and Uthman ibn Affan drank while standing."
  },
  "516660": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516660\nIn-book reference  : Book 49, Hadith 660\nEnglish translation  : Vol. 1, Book 49, Hadith 660",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Ibn Shihab that A'isha, umm al-muminin and Sad ibn Abi Waqqas did not see any harm in a man drinking while standing."
  },
  "516670": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516670\nIn-book reference  : Book 49, Hadith 670\nEnglish translation  : Vol. 1, Book 49, Hadith 670",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Abu Jafar al-Qari said, \"I saw Abdullah ibn Umar drink while standing.\""
  },
  "516680": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516680\nIn-book reference  : Book 49, Hadith 680\nEnglish translation  : Vol. 1, Book 49, Hadith 680",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Amir ibn Abdullah ibn az- Zubayr that his father used to drink while standing."
  },
  "516690": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516690\nIn-book reference  : Book 49, Hadith 690\nEnglish translation  : Vol. 1, Book 49, Hadith 690",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Ibn Shihab from Anas ibn Malik that the Messenger of Allah, may Allah bless him and grant him peace, was brought some milk which was mixed with well-water. There was a Bedouin at his right side and Abu Bakr as-Siddiq on his left. He drank and then gave it to the Bedouin and said, \"The right-hand to the right-hand.\""
  },
  "516700": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516700\nIn-book reference  : Book 49, Hadith 700\nEnglish translation  : Vol. 1, Book 49, Hadith 700",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu Hazim ibn Dinar from Sahl ibn Sad al-Ansari that the Messenger of Allah, may Allah bless him and grant him peace, was brought a drink and he drank some of it. There was a boy at his right and some old men on his left. He said to the boy, \"Will you give me permission to give it to these people?\" The boy said, \"No, Messenger of Allah, I will not prefer anyone to get my portion from you.\" He said, \"So the Messenger of Allah, may Allah bless him and grant him peace, placed it in his hand.\""
  },
  "516710": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516710\nIn-book reference  : Book 49, Hadith 710\nEnglish translation  : Vol. 1, Book 49, Hadith 710",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Ishaq ibn Abdullah ibn Abi Talha heard Anas ibn Malik say that Abu Talha had said to Umm Sulaym, \"I have just been listening to the Messenger of Allah, may Allah bless him and grant him peace, and his voice was very weak. I recognised hunger in it, so, do you have anything?\" She replied, \"Yes,\" and brought out some barley loaves. She took her long head scarf and wrapped up the bread with part of it and put it into my (Anas's) hand and gave me part of it to wear. Then she sent me to the Messenger of Allah, may Allah bless him and grant him peace.\""
  },
  "516720": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516720\nIn-book reference  : Book 49, Hadith 720\nEnglish translation  : Vol. 1, Book 49, Hadith 720",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu'z-Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The food of two is enough for three, and the food of three is enough for four.\""
  },
  "516730": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516730\nIn-book reference  : Book 49, Hadith 730\nEnglish translation  : Vol. 1, Book 49, Hadith 730",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu'z-Zubayr al-Makki from Jabir ibn Abdullah that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Lock the door, tie the waterskin, turn the vessel over or cover it, and put out the lamp. Shaytan does not open a locked door or untie a tied knot, or uncover a vessel. A mouse may set fire to people's houses about them.\""
  },
  "516740": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516740\nIn-book reference  : Book 49, Hadith 740\nEnglish translation  : Vol. 1, Book 49, Hadith 740",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Said ibn Abi Said al-Maqburi from Abu Shurayh al-Kabi that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever believes in Allah and the Last Day should speak good or be silent. Whoever believes in Allah and the Last Day should be generous to his neighbour. Whoever believes in Allah and the Last Day, should be generous to his guest. His welcome is for a day and a night, and his hospitality is for three days. Whatever is more than that is sadaqa. It is not halal for a guest to stay with a man until he becomes a burden.\""
  },
  "516750": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516750\nIn-book reference  : Book 49, Hadith 750\nEnglish translation  : Vol. 1, Book 49, Hadith 750",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Sumayy, the mawla of Abu Bakr from Abu Salih as-Samman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"A man was walking on a road when he became very thirsty. He found a well and went into it and drank and came out. There was a dog panting and eating earth out of thirst. The man said, 'This dog has become as thirsty as I was.' He went down into the well and filled his shoe and then held it in his mouth until he climbed out and gave the dog water to drink. Allah thanked him for it and forgave him.\" They said, \"Messenger of Allah, do we have a reward for taking care of beasts?\" He said, \"There is a reward for every one with a moist liver.\""
  },
  "516760": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516760\nIn-book reference  : Book 49, Hadith 760\nEnglish translation  : Vol. 1, Book 49, Hadith 760",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Wahb ibn Kaysan that Jabir ibn Abdullah said, \"The Messenger of Allah, may Allah bless him and grant him peace, sent a delegation to the coast. Abu Ubayda ibn al- Jarrah was in command of them. There were 300 people and I was among them. We went out until we had gone part of the way and our provisions were finished. Abu Ubayda ordered that the provisions of the army be gathered up and they amounted to two containers of dates. He used to give us a little provision from it each day until it was finished, and we used to have only a single date each. I said, 'What use is one date?' He said, 'We will certainly feel its loss when they are finished.' \""
  },
  "516770": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516770\nIn-book reference  : Book 49, Hadith 770\nEnglish translation  : Vol. 1, Book 49, Hadith 770",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from Amr ibn Sad ibn Muadh from his grandmother that the Messenger of Allah, may Allah bless him and grant him peace, said, \"O trusting women, none of you must consider even a roasted sheep's trotter too small to give to her neighbour.\""
  },
  "516780": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516780\nIn-book reference  : Book 49, Hadith 780\nEnglish translation  : Vol. 1, Book 49, Hadith 780",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Abdullah ibn Abi Bakr said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'May Allah curse the jews! They were forbidden to eat fat, so they sold it and ate its price.' \""
  },
  "516790": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516790\nIn-book reference  : Book 49, Hadith 790\nEnglish translation  : Vol. 1, Book 49, Hadith 790",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that he had heard that Isa ibn Maryam used to say, \"O Banu Israil! You must drink pure water and the green things of the land and barley bread . Beware of wheat bread, for you will not be grateful enough for it.\""
  },
  "516800": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516800\nIn-book reference  : Book 49, Hadith 800\nEnglish translation  : Vol. 1, Book 49, Hadith 800",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that he heard that the Messenger of Allah, may Allah bless him and grant him peace, entered the mosque and found Abu Bakr as-Siddiq and Umar ibn al-Khattab there. He questioned them and they said, \"Hunger has driven us out.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"And hunger has brought me out.\" They went to Abu'l-Haytham ibn at- Tayyihan al-Ansari. He ordered that some barley that was in the house be prepared and he got up to slaughter a sheep for them. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Leave the one with milk.\" He slaughtered a sheep for them and brought them sweet water and it was hung on a palm-tree. Then they were brought the food and ate it and drank the water. The Messenger of Allah, may Allah bless him and grant him peace, recited, \"Then, on that day, you will be asked concerning pleasure.\" (Sura 102 ayat 8)."
  },
  "516810": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516810\nIn-book reference  : Book 49, Hadith 810\nEnglish translation  : Vol. 1, Book 49, Hadith 810",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Umar ibn al-Khattab was eating bread with ghee. He summoned one of the desert people and he began to eat and follow the grease in the dish with a morsel of bread. Umar said, \"It is as if you were poor.\" He said, \"By Allah. I have not eaten ghee nor have I seen food with it since such- and-such a time.\" Umar declared, \"I shall not eat clarified butter until people are given life again like they were first given life,\" (i.e. on the Day of Rising.)"
  },
  "516820": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516820\nIn-book reference  : Book 49, Hadith 820\nEnglish translation  : Vol. 1, Book 49, Hadith 820",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik said, \"I saw Umar ibn al-Khattab when he was amir al-muminin being given a sa of dates, and he ate all of them, even the inferior ones.\""
  },
  "516830": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516830\nIn-book reference  : Book 49, Hadith 830\nEnglish translation  : Vol. 1, Book 49, Hadith 830",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abdullah ibn Dinar that Abdullah ibn Umar said, ''Umar ibn al-Khattab was asked about locusts. He said, 'I would like to have a basket of them, from which we could eat.' \""
  },
  "516840": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516840\nIn-book reference  : Book 49, Hadith 840\nEnglish translation  : Vol. 1, Book 49, Hadith 840",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Muhammad ibn Amr ibn Halhala that Humayd ibn Malik ibn Khu'haym said, \"I was sitting with Abu Hurayra on his land at al-Aqiq. Some people rode out from Madina to call upon Abu Hurayra. He told me to go to his mother, sending his greetings and asking her to prepare some food.\" Humayd continued, \"She set down three loaves on a plate and some oil and salt. Then she put it on my head and I carried it to them. When I set it before them, Abu Hurayra said, 'Allah is greater' and added, 'Praise be to Allah who has filled us with bread after our food had previously been only water and dates,' as the people did not touch any of the food."
  },
  "516850": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516850\nIn-book reference  : Book 49, Hadith 850\nEnglish translation  : Vol. 1, Book 49, Hadith 850",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abu Nuaym that Wahb ibn Kaysan said, \"The Messenger of Allah, may Allah bless him and grant him peace, was brought food while his stepson Umar ibn Salama was with him. The Messenger of Allah, may Allah bless him and grant him peace, said to him, 'Say \"Bismillah,\" and eat what is in front of you.' \""
  },
  "516860": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516860\nIn-book reference  : Book 49, Hadith 860\nEnglish translation  : Vol. 1, Book 49, Hadith 860",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Yahya ibn Said said that he had heard al-Qasim ibn Muhammad say that a man came to Abdullah ibn Abbas and said to him, \"I have an orphan and he has camels. Can I drink from the camels' milk?\" Ibn Abbas said, \"If you search for the lost camels of his and treat the camels' mange and fill in the cracks in their water basin and give it water on the day it drinks, then drink it without doing harm to the suckling camels by milking them excessively.\""
  },
  "516870": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516870\nIn-book reference  : Book 49, Hadith 870\nEnglish translation  : Vol. 1, Book 49, Hadith 870",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa that his father never brought food or drink, nor even a remedy which he ate or drank but that he said, \"Praise be to Allah who has guided us and fed us and given us to drink and blessed us. Allah is greater. O Allah! We have found Your blessing with every evil, give us every good in the morning and evening. We ask You for its completion and its gratitude. There is no good except Your good. There is no god other than You, the God of the salihun and the Lord of the Worlds. Praise be to Allah. There is no god but Allah. What Allah wills. There is no power except in Allah. O Allah! Bless us in what You have provided us with and protect us from the punishment of the Fire!\""
  },
  "49035": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 49035\nIn-book reference  : Book 49, Hadith 035\nEnglish translation  : Vol. 1, Book 49, Hadith 035",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya said that Malik was asked, \"Can a woman eat with other than her relative or slave?\" Malik said, \"There is no harm in that if it is in a manner which is accepted for a woman to eat with men.\""
  },
  "516890": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516890\nIn-book reference  : Book 49, Hadith 890\nEnglish translation  : Vol. 1, Book 49, Hadith 890",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Yahya ibn Said that Umar ibn al-Khattab said, \"Beware of meat. It has addictiveness like the addictiveness of wine.\""
  },
  "516900": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516900\nIn-book reference  : Book 49, Hadith 900\nEnglish translation  : Vol. 1, Book 49, Hadith 900",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abdullah ibn Dinar from 'Abdullah ibn 'Umar that the Messenger of Allah, may Allah bless him and grant him peace, used to wear a gold ring. Then the Messenger of Allah, may Allah bless him and grant him peace, stood up and threw it away and said, \"I will never wear it.\" He said, \"So the people threw away their rings.\""
  },
  "516910": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516910\nIn-book reference  : Book 49, Hadith 910\nEnglish translation  : Vol. 1, Book 49, Hadith 910",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik that Sadaqa ibn Yasar said, \"I asked Said ibn al-Musayyab about wearing a ring. He said, 'Wear it, and tell people that I gave you that decision.' \""
  },
  "516930": {
    "collection": "Muwatta Malik",
    "book": "The Description of the Prophet, may Allah Bless Him and Grant Him Peace",
    "book_num": "49",
    "reference": "Reference  : Muwatta Malik 516930\nIn-book reference  : Book 49, Hadith 930\nEnglish translation  : Vol. 1, Book 49, Hadith 930",
    "url": "https://sunnah.com/malik/49",
    "text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr from Abbad ibn Tamim that Abu Bashir al-Ansari told him that he was with the Messenger of Allah, may Allah bless him and grant him peace, on one of his journeys. He related, \"The Messenger of Allah, may Allah bless him and grant him peace, sent a messenger.\" (Abdullah ibn Abi Bakr said, (I think that he said it was while the people were in their resting place.) He said, \"Do not let a single-string necklace, or any necklace, remain unbroken on the neck of a camel.\""
  }
}