{
  "500010": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500010\nIn-book reference  : Book 1, Hadith 010\nEnglish translation  : Vol. 1, Book 1, Hadith 010",
    "url": "https://sunnah.com/malik/1",
    "text": "He said, \"Yahya ibn Yahya al-Laythi related to me from Malik ibn Anas from Ibn Shihab that one day Umar ibn Abdal-Aziz delayed the prayer. Urwa ibn az-Zubayr came and told him that al-Mughira ibn Shuba had delayed the prayer one day while he was in Kufa and Abu Masud al- Ansari had come to him and said, 'What's this, Mughira? Don't you know that the angel Jibril came down and prayed and the Messenger of Allah, may Allah bless him and grant him peace, prayed.' Then he prayed again, and the Messenger of Allah, may Allah bless him and grant him peace, prayed. Then he prayed again, and the Messenger of Allah, may Allah bless him and grant him peace, prayed. Then he prayed again, and the Messenger of Allah, may Allah bless him and grant him peace, prayed. Then he prayed again, and the Messenger of Allah, may Allah bless him and grant him peace, prayed. Then Jibril said, 'This is what you have been ordered to do.' Umar ibn Abd al-Aziz said, 'Be sure of what you relate, Urwa. Was it definitely Jibril who established the time of the prayer for the Messenger of Allah?' \" Urwa said, \"That's how it was related to Bashir ibn Abi Masud al-Ansari by his father.\""
  },
  "500020": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500020\nIn-book reference  : Book 1, Hadith 020\nEnglish translation  : Vol. 1, Book 1, Hadith 020",
    "url": "https://sunnah.com/malik/1",
    "text": "Urwa said that A'isha, the wife of the Prophet, may Allah bless him and grant him peace used to pray asr while the sunlight was pouring into her room, before the sun itself had become visible (i.e. because it was still high in the sky)."
  },
  "500030": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500030\nIn-book reference  : Book 1, Hadith 030\nEnglish translation  : Vol. 1, Book 1, Hadith 030",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam that Ata ibn Yasar said, \"A man came to the Messenger of Allah, may Allah bless him and grant him peace, and asked him about the time of the subh prayer. The Messenger of Allah, may Allah bless him and grant him peace, did not answer him, but in the morning he prayed subh at first light. The following morning he prayed subh when it was much lighter, and then said, 'Where is the man who was asking about the time of the prayer?' The man replied, 'Here I am, Messenger of Allah.' He said,'The time is between these two.' \""
  },
  "500040": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500040\nIn-book reference  : Book 1, Hadith 040\nEnglish translation  : Vol. 1, Book 1, Hadith 040",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Amra bint Abd ar-Rahman that A'isha, the wife of the Prophet, may Allah bless him and grant him peace, said, \"The Messenger of Allah, may Allah bless him and grant him peace, used to pray subh and the women would leave wrapped in their garments and they could not yet be recognised in the darkness.\""
  },
  "500050": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500050\nIn-book reference  : Book 1, Hadith 050\nEnglish translation  : Vol. 1, Book 1, Hadith 050",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar and from Busr ibn Said and from al-Araj-all of whom related it from Abu Hurayra - that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Whoever manages to do a raka of subh before the sun has risen has done subh in time, and whoever manages to do a raka of asr before the sun has set has done asr in time.\""
  },
  "500060": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500060\nIn-book reference  : Book 1, Hadith 060\nEnglish translation  : Vol. 1, Book 1, Hadith 060",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Nafi', the mawla of Abdullah ibn Umar, that Umar ibn al-Khattab wrote to his governors saying, \"The most important of your affairs in my view is the prayer. Whoever protects it and observes it carefully is protecting his deen, while whoever is negligent about it will be even more negligent about other things.\" Then he added, \"Pray dhuhr any time from when the afternoon shade is the length of your forearm until the length of your shadow matches your height. Pray asr when the sun is still pure white, so that a rider can travel two or three farsakhs before the sun sets. Pray maghrib when the sun has set. Pray isha any time from when the redness in the western sky has disappeared until a third of the night has passed - and a person who sleeps, may he have no rest, a person who sleeps, may he have no rest. And pray subh when all the stars are visible and like a haze in the sky.\""
  },
  "500070": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500070\nIn-book reference  : Book 1, Hadith 070\nEnglish translation  : Vol. 1, Book 1, Hadith 070",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik, from his uncle Abu Suhayl from his father that Umar ibn al-Khattab wrote to Abu Musa saying that he should pray dhuhr when the sun had started to decline, asr when the sun was still pure white before any yellowness had entered it maghrib when the sun had set, and to delay isha as long as he did not sleep, and to pray subh when the stars were all visible and like a haze in the sky and to read in it two long suras from the mufassal."
  },
  "500080": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500080\nIn-book reference  : Book 1, Hadith 080\nEnglish translation  : Vol. 1, Book 1, Hadith 080",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Hisham ibn Urwa from his father that Umar ibn al-Khattab wrote to Abu Musa al-Ashari that he should pray asr when the sun was still pure white so that a man could ride three farsakhs (before maghrib) and that he should pray Isha during the first third of the night, or, if he delayed it, then up until the middle of the night, and he warned him not to be forgetful."
  },
  "500090": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500090\nIn-book reference  : Book 1, Hadith 090\nEnglish translation  : Vol. 1, Book 1, Hadith 090",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Yazid ibn Ziyad that Abdullah ibn Rafi, the mawla of Umm Salama, the wife of the Prophet, may Allah bless him and grant him peace, asked Abu Hurayra about the time of the prayer. Abu Hurayra said, \"Let me tell you. Pray dhuhr when the length of your shadow matches your height, asr when your shadow is twice your height, maghrib when the sun has set, isha in the first third of the night, and subh in the very first light of dawn,\" i.e. when the dawn has definitely come."
  },
  "500100": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500100\nIn-book reference  : Book 1, Hadith 100\nEnglish translation  : Vol. 1, Book 1, Hadith 100",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Ishaq ibn Abdullah ibn Abi Talha that Anas ibn Malik said, \"We would pray asr and anyone who then went to the Bani Amr ibn Awf would find them praying asr.\""
  },
  "500110": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500110\nIn-book reference  : Book 1, Hadith 110\nEnglish translation  : Vol. 1, Book 1, Hadith 110",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Ibn Shihab that Anas ibn Malik said, \"We would pray asr and anyone who then went to Quba would arrive there while the sun was still high.\""
  },
  "500120": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500120\nIn-book reference  : Book 1, Hadith 120\nEnglish translation  : Vol. 1, Book 1, Hadith 120",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that al Qasim ibn Muhammad said, \"None of the companions that I met prayed dhuhr until well after noon,\"(i.e.until when the sun had lost its fierceness)."
  },
  "500130": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500130\nIn-book reference  : Book 1, Hadith 130\nEnglish translation  : Vol. 1, Book 1, Hadith 130",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from his uncle Abu Suhayl ibn Malik that his father said, \"I used to see a carpet belonging to Aqil ibn Abi Talib spread out on the day of jumua up to the west wall of the mosque. When the shadow of the wall covered the whole carpet, Umar ibn al-Khattab would come out and pray the jumua prayer.\""
  },
  "500140": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500140\nIn-book reference  : Book 1, Hadith 140\nEnglish translation  : Vol. 1, Book 1, Hadith 140",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Amr ibn Yahya ibn Yahya al- Mazini from Ibn Abi Salit that Uthman ibn Affan prayed jumua in Madina and asr in Malal (a place seventeen miles from Madina)."
  },
  "500150": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500150\nIn-book reference  : Book 1, Hadith 150\nEnglish translation  : Vol. 1, Book 1, Hadith 150",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Ibn Shihab from Abu Salama ibn Abdar-Rahman from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said \"Whoever catches a raka of the prayer has caught the prayer.\""
  },
  "500160": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500160\nIn-book reference  : Book 1, Hadith 160\nEnglish translation  : Vol. 1, Book 1, Hadith 160",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar ibn al-Khattab used to say, \"If the ruku has passed you by, so has the sajda.\""
  },
  "500170": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500170\nIn-book reference  : Book 1, Hadith 170\nEnglish translation  : Vol. 1, Book 1, Hadith 170",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik that he had heard that Abdullah ibn Umar and Zayd ibn Thabit used to say, \"Whoever catches the raka`ah has caught the sajda.\""
  },
  "500180": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500180\nIn-book reference  : Book 1, Hadith 180\nEnglish translation  : Vol. 1, Book 1, Hadith 180",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik that he had heard that Abu Hurayra used to say, \"Whoever catches the ruku has caught the sajda and whoever misses the recitation of the umm al-Qur'an has missed much good.\""
  },
  "500190": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500190\nIn-book reference  : Book 1, Hadith 190\nEnglish translation  : Vol. 1, Book 1, Hadith 190",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar used to say, \"Duluk ash-shams begins from when the sun passes the meridian.\""
  },
  "500200": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500200\nIn-book reference  : Book 1, Hadith 200\nEnglish translation  : Vol. 1, Book 1, Hadith 200",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik that Da'ud ibn al-Husayn said that someone had told him Abdullah ibn Abbas used to say, \"Duluk ash-shams begins from when the sun passes the meridian. Ghasaq al-layl is the gathering of the night and its darkness.\""
  },
  "500210": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500210\nIn-book reference  : Book 1, Hadith 210\nEnglish translation  : Vol. 1, Book 1, Hadith 210",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Nafi from Abdullah ibn Umar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"If someone misses the asr prayer it is as if he has suffered a great misfortune in his family and wealth .\""
  },
  "500220": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500220\nIn-book reference  : Book 1, Hadith 220\nEnglish translation  : Vol. 1, Book 1, Hadith 220",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Yahya ibn Said that once Umar ibn al-Khattab left after doing the asr prayer and met a man who had not been there. Umar asked him what had kept him from the prayer and eventhough the man gave a good reason, Umar said, \"You have given yourself short measure.\""
  },
  "500230": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500230\nIn-book reference  : Book 1, Hadith 230\nEnglish translation  : Vol. 1, Book 1, Hadith 230",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik thatYahya ibn Said used to say, \"Even if someone manages to pray before the time of the prayer has passed, the time that has passed him by is more important, or better, than his family and wealth.\""
  },
  "500240": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500240\nIn-book reference  : Book 1, Hadith 240\nEnglish translation  : Vol. 1, Book 1, Hadith 240",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Nafi that one time Abdullah ibn Umar fainted and lost his senses and he did not make up the prayer."
  },
  "500250": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500250\nIn-book reference  : Book 1, Hadith 250\nEnglish translation  : Vol. 1, Book 1, Hadith 250",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, travelled by night on the way back from Khaybar.Towards the end of the night he stopped for a rest and told Bilal to stay awake to keep watch for the subh prayer. The Messenger of Allah, may Allah bless him and grant him peace, and his companions slept. Bilal stayed on guard as long as was decreed for him and then he leant against his riding camel facing the direction of the dawn and sleep overcame him and neither he nor the Messenger of Allah nor any of the party woke up until the sun's rays had struck them. The Messenger of Allah, may Allah bless him and grant him peace, was alarmed. Bilal excused himself, saying, \"Messenger of Allah! The One who took your self was the One who took myself. \"The Messenger of Allah, may Allah bless him and grant him peace, ordered the party to move on and so they roused thei r mounts and rode on a short distance. The Messenger of Allah, may Allah bless him and grant him peace, ordered Bilal to give the iqama and then led them in the subh prayer. When he had finished he said, \"Anyone who forgets a prayer should pray it when he remembers. Allah theBlessed and Exalted says in His book, 'Establish the prayer to remember Me.'\""
  },
  "500260": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500260\nIn-book reference  : Book 1, Hadith 260\nEnglish translation  : Vol. 1, Book 1, Hadith 260",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik that Zayd ibn Aslam said, \"The Messenger of Allah, may Allah bless him and grant him peace, stopped for a rest one night on the way to Makka and appointed Bilal to wake them up for the prayer. Bilal slept and everyone else slept and none of them woke up until the sun had risen. When they did wake up they were all alarmed. The Messenger of Allah, may Allah bless him and grant him peace, ordered them to ride out of the valley, saying that there was a shaytan in it. So they rode out of the valley and the Messenger of Allah, may Allah bless him and grant him peace, ordered them to dismount and do wudu and he told Bilal either to call the prayer or to give the iqama. The Messenger of Allah, may Allah bless him and grant him peace, then led them in the prayer. Noticing their uneasiness, he went to them and said, 'O people! Allah seized our spirits (arwah) and if He had wished He would have returned them to us at a time other than this. So if you sleep through the time for a prayer or forget it and then are anxious about it, pray it as if you were praying it in its time.' The Messenger of Allah, may Allah bless him and grant him peace, turned to Abu Bakr and said, 'Shaytan came to Bilal when he was standing in prayer and made him lie down and lulled him to sleep like a small boy.' The Messenger of Allah, may Allah bless him and grant him peace, then called Bilal and told him the same as he had told Abu Bakr. Abu Bakr declared, 'I bear witness that you are the Messenger of Allah.' \""
  },
  "500271": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500271\nIn-book reference  : Book 1, Hadith 271\nEnglish translation  : Vol. 1, Book 1, Hadith 271",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Zayd ibn Aslam from Ata ibn Yasar that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Scorching heat is a part of the blast of Jahannam. So, when the heat is fierce, delay the prayer until it gets cooler.\""
  },
  "500290": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500290\nIn-book reference  : Book 1, Hadith 290\nEnglish translation  : Vol. 1, Book 1, Hadith 290",
    "url": "https://sunnah.com/malik/1",
    "text": "Malik related to us from Abdullah ibn Yazid the mawla of al-Aswad ibn Sufyan, from Abu Salama ibn Abd ar-Rahman from Muhammad ibn Abd ar-Rahman ibn Thawban from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When the heat is fierce delay the prayer until it gets cooler, for scorching heat is a part of the blast of Jahannam.\""
  },
  "500300": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500300\nIn-book reference  : Book 1, Hadith 300\nEnglish translation  : Vol. 1, Book 1, Hadith 300",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Abu'z Zinad from al-Araj from Abu Hurayra that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When the heat is fierce, wait until it gets cooler before you do the prayer, for scorching heat is from the blast of Jahannam.\""
  },
  "500310": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500310\nIn-book reference  : Book 1, Hadith 310\nEnglish translation  : Vol. 1, Book 1, Hadith 310",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Ibn Shihab from Said ibn al- Musayyab that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Anyone who eats this plant should not come near our mosques. The smell of the garlic will offend us.\""
  },
  "500320": {
    "collection": "Muwatta Malik",
    "book": "The Times of Prayer",
    "book_num": "1",
    "reference": "Reference  : Muwatta Malik 500320\nIn-book reference  : Book 1, Hadith 320\nEnglish translation  : Vol. 1, Book 1, Hadith 320",
    "url": "https://sunnah.com/malik/1",
    "text": "Yahya related to me from Malik from Abd ar-Rahman ibn al-Mujabbar that he used to see Salim ibn Abdullah pull the cloth away fiercely from the mouth of any man he saw covering his mouth while praying."
  }
}