{
  "510310": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510310\nIn-book reference  : Book 23, Hadith 310\nEnglish translation  : Vol. 1, Book 23, Hadith 310",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Amr ibn al-Harith from Ubayd ibn Fayruz from al-Bara ibn Azib that the Messenger of Allah, may Allah bless him and grant him peace, was asked what animals should be avoided as sacrifices. He indicated with his hand and said, \"Four.\" Al-Bara pointed with his hand and said, \"My hand is shorter than the hand of the Messenger of Allah, may Allah bless him and grant him peace. A lame animal whose lameness is evident, a one-eyed animal which is clearly one-eyed, an animal which is clearly ill, and an emaciated animal with no fat on it.\""
  },
  "510320": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510320\nIn-book reference  : Book 23, Hadith 320\nEnglish translation  : Vol. 1, Book 23, Hadith 320",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar would guard against animals and camels which were young or had physical defects as sacrifices."
  },
  "510330": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510330\nIn-book reference  : Book 23, Hadith 330\nEnglish translation  : Vol. 1, Book 23, Hadith 330",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Nafi that one time Abdullah ibn Umar wanted to sacrifice an animal at Madina. Nafi said, \"He told me to buy him an excellent horned ram, then to sacrifice it on the Day of Sacrifice in the place where the people prayed.\" Nafi continued, \"I did so and when the ram was sacrificed, it was carried to Abdullah ibn Umar who shaved his head. He was ill, and did not attend the Id with the people.\" Nafi added, \"Abdullah ibn Umar used to say, 'Shaving the head is not obligatory for someone who sacrifices an animal.' Ibn Umar would do so however.\""
  },
  "510340": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510340\nIn-book reference  : Book 23, Hadith 340\nEnglish translation  : Vol. 1, Book 23, Hadith 340",
    "url": "https://sunnah.com/malik/23",
    "text": "ahya related to me from Malik from Yahya ibn Said from Bushayr ibn Yasar that Abu Burda ibn Niyar sacrificed an animal before the Messenger of Allah, may Allah bless him and grant him peace, sacrificed on the Day of Sacrifice. He asserted that the Messenger of Allah, may Allah bless him and grant him peace, ordered him to sacrifice another animal, and he, Abu Burda, said, \"What if I can only find an animal less than one year old, Messenger of Allah?\" He had said, \"If you can only find a young animal, then sacrifice it.\""
  },
  "510350": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510350\nIn-book reference  : Book 23, Hadith 350\nEnglish translation  : Vol. 1, Book 23, Hadith 350",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Yahya ibn Said from Abbad ibn Tamin that one time Uwaymir ibn Ashqar sacrificed his animal before the prayer on the morning of the Day of Sacrifice, and he mentioned that the Messenger of Allah, may Allah bless him and grant him peace, had ordered him to sacrifice another animal."
  },
  "510360": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510360\nIn-book reference  : Book 23, Hadith 360\nEnglish translation  : Vol. 1, Book 23, Hadith 360",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Abu'z-Zubayr al-Makki from Jabir ibn Abdullah that the Messenger of Allah, may Allah bless him and grant him peace, forbade that the meat from sacrificial animals be eaten after three days. Then later he said, \"Eat, give sadaqa, provide for yourselves and store up.\""
  },
  "510370": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510370\nIn-book reference  : Book 23, Hadith 370\nEnglish translation  : Vol. 1, Book 23, Hadith 370",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Abdullah ibn Abi Bakr that Abdullah ibn Waqid said, \"The Messengerof Allah, may Allah bless him and grant him peace, forbade eating the meat from sacrificial animals after three days.\""
  },
  "510380": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510380\nIn-book reference  : Book 23, Hadith 380\nEnglish translation  : Vol. 1, Book 23, Hadith 380",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Rabia ibn Abi Abd ar-Rahman that Abu Said alKhudri returned from a journey and his family gave him some meat. He asked whether it was meat from the sacrifice. They replied that it was. Abu Said said, \"Didn't the Messenger of Allah, may Allah bless him and grant him peace, forbid that?\" They said, \"There has been a new command from the Messenger of Allah, may Allah bless him and grant him peace, since you went away.\" Abu Said went out and made enquiries about it and was told that the Messenger of Allah, may Allah bless him and grant him peace, had said,\"I forbade you before to eat meat of the sacrifice after three days, but now eat, give sadaqa and store up. I forbade you before to make nabidh (by soaking raisins or dates in water), but now make nabidh, but remember every intoxicant is haram .I forbade you to visit graves, but now visit them, and do not use bad language.\""
  },
  "510390": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510390\nIn-book reference  : Book 23, Hadith 390\nEnglish translation  : Vol. 1, Book 23, Hadith 390",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Abu'z-Zubayr al-Makki that Jabir ibn Abdullah said, \"We sacrificed with the Messenger of Allah, may Allah bless him and grant him peace, in the year of Hudaybiya, a camel between seven people, and a cow between seven people.\""
  },
  "510400": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510400\nIn-book reference  : Book 23, Hadith 400\nEnglish translation  : Vol. 1, Book 23, Hadith 400",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Umara ibn Yasar that Ata ibn Yasar told him that Abu Ayyub al-Ansari had told him, \"We used to sacrifice one sheep, and a man sacrificed for himself and his family. Then later on people began to compete with each other and it became boasting.\""
  },
  "510410": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510410\nIn-book reference  : Book 23, Hadith 410\nEnglish translation  : Vol. 1, Book 23, Hadith 410",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik that Ibn Shihab said, \"The Messenger of Allah, may Allah bless him and grant him peace, only sacrificed one camel or one cow for himself and his family.\""
  },
  "510421": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510421\nIn-book reference  : Book 23, Hadith 421\nEnglish translation  : Vol. 1, Book 23, Hadith 421",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar said, \"The sacrifice can be done up to two days after the Day of Sacrifice.\""
  },
  "510440": {
    "collection": "Muwatta Malik",
    "book": "Sacrificial Animals",
    "book_num": "23",
    "reference": "Reference  : Muwatta Malik 510440\nIn-book reference  : Book 23, Hadith 440\nEnglish translation  : Vol. 1, Book 23, Hadith 440",
    "url": "https://sunnah.com/malik/23",
    "text": "Yahya related to me from Malik from Nafi that Abdullah ibn Umar did not sacrifice for the child in the womb."
  }
}