{
  "4001": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 4001\nIn-book reference  : Book 40, Hadith 001\nEnglish translation  : Vol. 1, Book 40, Hadith 001",
    "url": "https://sunnah.com/malik/40",
    "text": "Yahya related to me that Malik said, \"What is done in our community in the case of a man who makes his slave-girl a mudabbara and she gives birth to children after that, and then the slave-girl dies before the one who gave her a tadbir is that her children are in her position. The conditions which were confirmed for her are confirmed for them. The death of their mother does not harm them. If the one who made her mudabbara dies, they are free if their value is less than one third of his total property.\""
  },
  "4002": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 4002\nIn-book reference  : Book 40, Hadith 002\nEnglish translation  : Vol. 1, Book 40, Hadith 002",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik spoke about a mudabbar who said to his master, \"Free me immediately and I will give fifty dinars which I will have to pay in instalments.\" His master said, \"Yes. You are free and you must pay fifty dinars, and you will pay me ten dinars every year.\" The slave was satisfied with this. Then the master dies one, two or three days after that. He said, \"The freeing is confirmed and the fifty dinars become a debt against him. His testimony is permitted, his inviolability as a free man is confirmed, as are his inheritance and his liability to the full hudud punishments. The death of his master, however, does not reduce the debt for him at all.\""
  },
  "4003": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 4003\nIn-book reference  : Book 40, Hadith 003\nEnglish translation  : Vol. 1, Book 40, Hadith 003",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik said, \"The generally agreed-on way of doing things in our community is that any setting-free which a man makes in a bequest that he wills in health or illness can be rescinded by him when he likes and changed when he likes as long as it is not a tadbir. There is no way to rescind a tadbir once he has made it."
  },
  "514990": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 514990\nIn-book reference  : Book 40, Hadith 990\nEnglish translation  : Vol. 1, Book 40, Hadith 990",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik related to me from Nafi that Abdullah ibn Umar made two of his slave-girls mudabbara, and he had intercourse with them while they were mudabbara."
  },
  "515000": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 515000\nIn-book reference  : Book 40, Hadith 000\nEnglish translation  : Vol. 1, Book 40, Hadith 000",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik related to me from Yahya ibn Said that Said ibn al-Musayyab used to say, \"When a man makes his slave-girl mudabbara, he can have intercourse with her. He cannot sell her or give her away and her children are in the same position as her.\""
  },
  "4006": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 4006\nIn-book reference  : Book 40, Hadith 006\nEnglish translation  : Vol. 1, Book 40, Hadith 006",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik said, \"The generally agreed on way of doing things in our community about a mudabbar is that the owner cannot sell him or change the position in which he has put him. If a debt overtakes the master, his creditors cannot sell the mudabbar as long as the master is alive. If the master dies and has no debts, the mudabbar is included in the third (of the bequest) because he expected his work from him as long as he lived. He cannot serve him all his life, and then he frees him from his heirs out of the main portion of his property when he dies. If the master of the mudabbar dies and has no property other than him, one third of him is freed, and two thirds of him belong to the heirs. If the master of the mudabbar dies and owes a debt which encompasses the mudabbar, he is sold to meet the debt because he can only be freed in the third (which is allowed for bequest) .\""
  },
  "515010": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 515010\nIn-book reference  : Book 40, Hadith 010\nEnglish translation  : Vol. 1, Book 40, Hadith 010",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik related to me that he heard that Umar ibn Abd al-Aziz gave a judgement about the mudabbar who did an injury. He said, \"The master must surrender what he owns of him to the injured person. He is made to serve the injured person and recompense (in the form of service) is taken from him as the blood-money of the injury. If he completes that before his master dies, he reverts to his master.\""
  },
  "4008": {
    "collection": "Muwatta Malik",
    "book": "The Mudabbar",
    "book_num": "40",
    "reference": "Reference  : Muwatta Malik 4008\nIn-book reference  : Book 40, Hadith 008\nEnglish translation  : Vol. 1, Book 40, Hadith 008",
    "url": "https://sunnah.com/malik/40",
    "text": "Malik said in the case of an umm walad who injured someone, \"The blood-money of that injury is the responsibility of her master from his property, unless the blood-money of the injury is greater than the value of the umm walad. Her master does not have to pay more than her value. That is because when the master of a slave or slave-girl surrenders his slave or slave-girl for an injury which one of them has done, he does not owe any more than that, even if the blood-money is greater. As the master of the umm walad cannot surrender her because of the precedent of the sunna, when he pays her price, it is as if he had surrendered her. He does not have to pay more than that. This is the best of what I have heard about the matter. The master is not obliged to assume responsibility for more than an umm walad's value because of her criminal action.\""
  }
}