{
  "516030": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516030\nIn-book reference  : Book 44, Hadith 030\nEnglish translation  : Vol. 1, Book 44, Hadith 030",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya related to me from Malik from Abu Layla ibn Abdullah ibn Abd ar-Rahman ibn Sahl from Sahl ibn Abi Hathma that some of the great men of his people informed him that Abdullah ibn Sahl and Muhayyisa went out to Khaybar because extreme poverty had overtaken them. Muhayyisa returned and said that Abdullah ibn Sahl had been killed and thrown in a shallow well or spring. The jews came and he said, \"By Allah! You have killed him.\" They said, \"By Allah! We have not killed him!\" Then he made for his people and mentioned that to them. Then he, his brother Huwayyisa, who was older than him, and Abd ar-Rahman, set out. Muhayyisa began to speak, as he had been at Khaybar. The Messenger of Allah, may Allah bless him and grant him peace, said to him, \"The greater first, the greater first,\" meaning in age. So Huwayyisa spoke and then Muhayyisa spoke. The Messenger of Allah, may Allah bless him and grant him peace, said, \"Either they pay your companion's blood-money or we will declare war against them.\" The Messenger of Allah, may Allah bless him and grant him peace, wrote that to them and they wrote, \"By Allah, we did not kill him!\" The Messenger of Allah, may Allah bless him and grant him peace, said to Huwayyisa, Muhayyisa, and Abd ar-Rahman, \"Do you swear and claim the blood of your companion?\" They said, \"No.\" He said, \"Shall the jews swear to you?\" They said, \"But they are not muslims.\" The Messenger of Allah, may Allah bless him and grant him peace, gave blood-money from his own property, and sent them one hundred camels to their house."
  },
  "516040": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516040\nIn-book reference  : Book 44, Hadith 040\nEnglish translation  : Vol. 1, Book 44, Hadith 040",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya said from Malik from Yahya ibn Said that Bushayr ibn Yasar informed him that Abdullah ibn Sahl al-Ansari and Muhayyisa ibn Masud went out to Khaybar, and they separated on their various businesses and Abdullah ibn Sahl was killed. Muhayyisa, and his brother Huwayyisa and Abd ar-Rahman ibn Sahl went to the Prophet, may Allah bless him and grant him peace, and Abd ar-Rahman began to speak before his brother. The Messenger of Allah, may Allah bless him and grant him peace, said, \"The older first, the older first."
  },
  "516041": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516041\nIn-book reference  : Book 44, Hadith 041\nEnglish translation  : Vol. 1, Book 44, Hadith 041",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya said that Malik said, \"The way of doing things in our community about which there is no dispute is that women do not swear in the swearing for the intentional act. If the murdered man only has female relatives, the women have no right to swear for blood and no pardon in murder.\""
  },
  "516042": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516042\nIn-book reference  : Book 44, Hadith 042\nEnglish translation  : Vol. 1, Book 44, Hadith 042",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya said that Malik said, \"The way of doing things in our community about Yahya said that Malik said, \"The procedure in swearing in manslaughter is that those who claim blood swear and it becomes due by their swearing. They swear fifty oaths, and there is blood-money for them according to the division of their inheritances. If it is not possible to divide up the oaths which they swear between them evenly, one looks to the one who has most of those oaths against him, and that oath is obliged against him.\""
  },
  "516043": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516043\nIn-book reference  : Book 44, Hadith 043\nEnglish translation  : Vol. 1, Book 44, Hadith 043",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya said that Malik said, \"When the relatives of the deceased accept the blood-money then it is inherited according to the Book of Allah. Daughters of the dead man inherit and so do sisters, and whichever women would inherit from him ordinarily."
  },
  "516044": {
    "collection": "Muwatta Malik",
    "book": "The Oath of Qasama",
    "book_num": "44",
    "reference": "Reference  : Muwatta Malik 516044\nIn-book reference  : Book 44, Hadith 044\nEnglish translation  : Vol. 1, Book 44, Hadith 044",
    "url": "https://sunnah.com/malik/44",
    "text": "Yahya said that Malik said, \"What is done in our community about slaves is that when a slave is struck intentionally or accidentally and the master brings a witness, he swears with his witness one oath and then he has the value of the slave. There is no swearing for revenge in slaves, accidentally or intentionally, and I have not heard any of the people of knowledge say that there was.\""
  }
}