{
  "1709470": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709470\nIn-book reference  : Book 7, Hadith 001\nEnglish translation  : Vol. 1, Book 7, Hadith 001",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ka'b bin Malik (May Allah be pleased with him) reported:\nThe Prophet (ﷺ) set out on Thursday for the expedition of Tabuk. He liked to set out on a journey on Thursdays.\n\n[Al-Bukhari and Muslim]"
  },
  "1709480": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709480\nIn-book reference  : Book 7, Hadith 002\nEnglish translation  : Vol. 1, Book 7, Hadith 002",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Sakhr bin Wada'ah Al-Ghamidi (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"O Allah! Bless my people in the early part of the day (morning). Whenever he dispatched a detachment or an army-unit, he would dispatch it at the beginning of the day (soon after dawn). The narrator, Sakhr (May Allah be pleased with him) was a merchant, and he used to send off his merchandise at the beginning of the day. So his trade flourished and he made a good fortune.\n\n[At-Tirmidhi and Abu Dawud]."
  },
  "1709490": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709490\nIn-book reference  : Book 7, Hadith 003\nEnglish translation  : Vol. 1, Book 7, Hadith 003",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Umar (May Allah be pleased with them) reported:\nThe Messenger of Allah (ﷺ) said, \"Were people to know of what I know about the dangers of travelling alone, no rider would travel alone at night.\"\n\n[Al-Bukhari]."
  },
  "1709500": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709500\nIn-book reference  : Book 7, Hadith 004\nEnglish translation  : Vol. 1, Book 7, Hadith 004",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "'Amr bin Shu'aib (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"A single rider is (accompanied with) Satan and two riders are (accompanied with) two Satans. Three riders form a group.\"\n\n[At-Tirmidhi and Abu Dawud]."
  },
  "1709510": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709510\nIn-book reference  : Book 7, Hadith 005\nEnglish translation  : Vol. 1, Book 7, Hadith 005",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Sa'id Al-Khudri and Abu Hurairah (May Allah be pleased with them) reported:\nThe Messenger of Allah (ﷺ) said, \"When three persons set out on a journey, they should appoint one of them as their leader.\"\n\n[Abu Dawud]."
  },
  "1709520": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709520\nIn-book reference  : Book 7, Hadith 006\nEnglish translation  : Vol. 1, Book 7, Hadith 006",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Abbas (May Allah be pleased with them) reported:\nThe Prophet (ﷺ) said, \"The best number of companions is four; the best detachment is four hundred and the best army is four thousand; and twelve thousand men will not be defeated as a result of smallness of number.\"\n\n[At-Tirmidhi and Abu Dawud]."
  },
  "1709530": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709530\nIn-book reference  : Book 7, Hadith 007\nEnglish translation  : Vol. 1, Book 7, Hadith 007",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said: \"When you travel through green and lush land, give the camels their due from the ground, and when you travel through a dry and barren land, make them walk quickly lest their strength falters. When you encamp at night, keep away from the roads, for beasts pass there and they are the resort of insects at night.\"\n\n[Muslim]."
  },
  "1709540": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709540\nIn-book reference  : Book 7, Hadith 008\nEnglish translation  : Vol. 1, Book 7, Hadith 008",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Qatadah (May Allah be pleased with him) reported:\nWhen the Messenger of Allah (ﷺ) encamped at night during a journey, he would lie down on his right side, and when he stayed a little before dawn he would raise his forearm and place his head on the palm of his hand.\n\n[Muslim]."
  },
  "1709550": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709550\nIn-book reference  : Book 7, Hadith 009\nEnglish translation  : Vol. 1, Book 7, Hadith 009",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Anas (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"Keep to travelling by night because the earth is folded (traversed more easily) during the night.\"\n\n[Abu Dawud]."
  },
  "1709560": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709560\nIn-book reference  : Book 7, Hadith 010\nEnglish translation  : Vol. 1, Book 7, Hadith 010",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Tha'labah Al-Khushani (May Allah be pleased with him) reported:\nWhenever the people encamped during the journey, they would disperse in the mountain passes and valleys. (When) the Messenger of Allah (ﷺ) noticed this he said, \"Your act of scattering in the mountain passes and valleys is from Satan.\" Afterwards the Companions kept close together whenever they encamped.\n\n[Abu Dawud]."
  },
  "1709570": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709570\nIn-book reference  : Book 7, Hadith 011\nEnglish translation  : Vol. 1, Book 7, Hadith 011",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Sahl bin 'Amr known as Ibn Al-Hanzaliyyah reported:\nThe Messenger of Allah (ﷺ) happened to pass by a camel whose belly was sticking to its back (because of hunger), whereupon he said, \"Fear Allah in respect of these dumb (animals). Ride them while they are fit, and slaughter them and eat their meat when they are fit.\"\n\n[Abu Dawud]."
  },
  "1709580": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709580\nIn-book reference  : Book 7, Hadith 012\nEnglish translation  : Vol. 1, Book 7, Hadith 012",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Ja'far 'Abdullah bin Ja'far (May Allah be pleased with them) reported:\nThe Messenger of Allah (ﷺ) made me ride behind him one day and confided something to me which I shall never disclose to anyone. ('Abdullah added:) He ((ﷺ) preferred to screen himself from others when responding to the call of nature, either behind a wall or the trunk of a date-palm.\n\n[Muslim].\n\nAl-Barqani added: The Messenger of Allah (ﷺ) entered an orchid belonging to an Ansari and saw there a camel. When it saw him, it began to groan and its eyes shed tears. The Messenger of Allah (ﷺ) approached it and patted it on the hump and the base of its head until it quieted down. Then he (ﷺ) asked, \"Who is the owner of this camel? To whom does it belong?\" An Ansari youth stepped forward and said: \"It is mine O Messenger of Allah!\" He said, \"Do you not fear Allah in respect of this beast which Allah has placed in your possession? This camel is complaining to me that you starve it and put it to toil.\"\n\n[Abu Dawud]."
  },
  "1709590": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709590\nIn-book reference  : Book 7, Hadith 013\nEnglish translation  : Vol. 1, Book 7, Hadith 013",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Anas (May Allah be pleased with him) reported:\nWhen we encamped, we would not offer (voluntary) prayers until we had unsaddled our beasts.\n\n[Abu Dawud]."
  },
  "1709600": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709600\nIn-book reference  : Book 7, Hadith 014\nEnglish translation  : Vol. 1, Book 7, Hadith 014",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Sa'id Al-Khudri (May Allah be pleased with him) reported:\nWhile we were travelling with the Messenger of Allah (ﷺ), a rider came and began to stare on the right and on the left. The Messenger of Allah (ﷺ) said, \"He who has an extra mount should hand it over to one who has none, and he who possesses surplus provision, should give it to him who is without provision.\" He named various kinds of possessions until we began to think (realize) that none of us had any right to anything surplus.\n\n[Muslim]."
  },
  "1709610": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709610\nIn-book reference  : Book 7, Hadith 015\nEnglish translation  : Vol. 1, Book 7, Hadith 015",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Jabir (May Allah be pleased with him) reported:\nWhen the Messenger of Allah (ﷺ) made up his mind to go in an expedition, he would say to us, \"O Muhajirin and the Ansar! There are among you such people who have no property and no kinsfolk. Let everyone of you take along with him two or three men. None of us had a spare animal we took rides by turn.\" So I took two or three men with me and I rode my camel by turn equally with them.\n\n[Abu Dawud]."
  },
  "1709620": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709620\nIn-book reference  : Book 7, Hadith 016\nEnglish translation  : Vol. 1, Book 7, Hadith 016",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Jabir (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) used to lag behind while travelling and urge the weak to walk quickly. He used to take up someone behind him and make supplication for him.\n\n[Abu Dawud]."
  },
  "1709630": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709630\nIn-book reference  : Book 7, Hadith 017\nEnglish translation  : Vol. 1, Book 7, Hadith 017",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Umar (May Allah be pleased with them) reported:\nWhenever the Messenger of Allah (ﷺ) mounted his camel for setting out on a journey, he would recite: \"Allahu Akbar (Allah is Greatest),\" thrice. Then he (ﷺ) would supplicate: \"Subhanal-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. Allahumma inna nas'aluka fi safarina hadh al-birra wat-taqwa, wa minal-'amali ma tarda. Allahumma hawwin 'alaina safarana hadha, watwi 'anna bu'dahu. Allahumma Antas-Sahibu fissafari, wal-Khalifatu fil- ahli. Allahumma inni a'udhu bika min wa'ta'is-safari, wa kaabatil- manzari, wa su'il-munqalabi fil-mali wal-ahli wal-waladi (Far removed from imperfection is the One Who has made this subservient to us, for we have no power to subjugate it, and certainly to our Rubb shall we return. O Allah, we ask You during this journey of ours for righteousness, piety and such deeds as are pleasing to You. O Allah, make easy for us this journey of ours and make the distance short for us. O Allah, You are our Companion during the journey and the Guardian of the family and the property in our absence. O Allah, I seek refuge in You from the hardships of travelling, unhappiness connected with ghastly scenes and evil turns in property and family).\" When he returned, he recited this supplication making addition of these words: \"Ayibuna, ta'ibuna, 'abiduna, li-Rabbina hamidun (We are those who return; those who repent; those who worship and those who praise our Rubb).\"\n\n[Muslim]."
  },
  "1709640": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709640\nIn-book reference  : Book 7, Hadith 018\nEnglish translation  : Vol. 1, Book 7, Hadith 018",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "'Abdullah bin Sarjis (May Allah be pleased with him) reported:\nWhenever the Messenger of Allah (ﷺ) proceeded on a journey, he would seek refuge in Allah from the hardships of the journey, and against deviation after guidance, and against the supplication of the oppressed, and occurrences of unpleasant events in the family and property. He would say: \"Allahumma inni a'udhu bika min wa'tha'is- safari, wa kaabatil-munqalabi, wal-hauri ba'dal-kauni, wa da'watil- mazlumi, wa su'il-manzari fil-ahli wal- mal.\"\n\n[Muslim]."
  },
  "1709650": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709650\nIn-book reference  : Book 7, Hadith 019\nEnglish translation  : Vol. 1, Book 7, Hadith 019",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "'Ali bin Rabi'ah reported:\nIn my presence, a beast was brought to 'Ali bin Abu Talib (May Allah be pleased with him) for riding. When he put his foot in the stirrup, he said: \"Bismillah (With the Name of Allah).\" When he had settled himself on its back he recited: \"Al-hamdu lillahil-ladhi sakh-khara lana hadha, wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun. (All praise belongs to Allah Who has made this subservient to us, for we had not the strength to overpower it; and to our Rubb shall we return).\" He then recited thrice: \"Alhamdu lillah (Praise be to Allah),\" and then three times: \"Allahu Abkar (Allah is Greatest).\" Then he said: \"Subhanaka inni zalamtu nafsi faghfir li, innahu la yaghfirudh-dhunuba illa Anta (You are far removed from imperfection I have wronged myself, so forgive me, because none but You can forgive sins).\" Then he smiled. It was asked: \"Why have you smiled, O Amir Al-Mu'minin (Leader of the Believers)?\" He replied: \"I saw the Messenger of Allah (ﷺ) doing as I have done. I (i.e., Ali) asked him (the Messenger of Allah (ﷺ)) the reason for smiling. He (ﷺ) said, 'Your Rubb, Glorious is He, is pleased when His slave seeks His forgiveness. He (the slave) has firm faith that none except Allah Alone can forgive sins)'.\"\n\n[Abu Dawud and At-Tirmidhi]."
  },
  "1709660": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709660\nIn-book reference  : Book 7, Hadith 020\nEnglish translation  : Vol. 1, Book 7, Hadith 020",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Jabir (May Allah be pleased with him) reported:\nWhen we ascended (a height) we would proclaim: \"Allahu Akbar (Allah is Greatest),\" and when we descended (from the height) we would proclaim: \"Subhan Allah (Allah is free from imperfection).\"'\n\n[Al-Bukhari]."
  },
  "1709670": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709670\nIn-book reference  : Book 7, Hadith 021\nEnglish translation  : Vol. 1, Book 7, Hadith 021",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Umar (May Allah be pleased with them) reported:\nWhenever the Prophet (ﷺ) and his army ascended a height, they would proclaim: \"Allahu Akbar (Allah is Greatest),\" and when they climbed down, they would proclaim: \"Subhan Allah (Allah is free from imperfection).\"\n\n[Abu Dawud]."
  },
  "1709680": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709680\nIn-book reference  : Book 7, Hadith 022\nEnglish translation  : Vol. 1, Book 7, Hadith 022",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Umar (May Allah be pleased with them) reported:\nWhenever the Prophet (ﷺ) returned from Hajj or 'Umrah and ascended a height or hill, he would recite thrice: \"Allahu Akbar (Allah is Greatest).\" Then he would say, \"La ilaha ill-allahu wahdahu la sharika lahu, lahul- mulku, wa lahul-hamdu, wa Huwa 'ala kulli shay'in Qadeer. Ayibuna ta'ibuna 'abiduna li-Rabbina hamidun. Sadaq-Allahu wa'dahu, wa nasara 'abdahu, wa hazamal-ahzaba wahdahu [None has the right to be worshipped but Allah, Who has no partner, to Whom the sovereignty belongs, to Whom all praise is due, and Who is Able to do all things. We are those who return (in safety), feel penitence, worship Allah, prostrate before our Rubb and praise Him. Allah has fulfilled His Promise, helped His slave (i.e., Muhammad (ﷺ)) and He Alone vanquished the Clans].\"\n\n[Al-Bukhari and Muslim]."
  },
  "1709690": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709690\nIn-book reference  : Book 7, Hadith 023\nEnglish translation  : Vol. 1, Book 7, Hadith 023",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Hurairah (May Allah be pleased with him) reported:\nA man said: \"O Messenger of Allah (ﷺ), I intend to set out on a journey, so counsel me.\" He (ﷺ) said, \"Fear Allah, and ascending towards the raised ground, you should recite: \"Allahu Akbar (Allah is Greatest).\" When the man turned away, he (ﷺ) said, \"O Allah! Shorten the distance for him and make the journey easy for him.\"\n\n[At-Tirmidhi]."
  },
  "1709700": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709700\nIn-book reference  : Book 7, Hadith 024\nEnglish translation  : Vol. 1, Book 7, Hadith 024",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Musa Al-Ash'ari (May Allah be pleased with him) reported:\nWe accompanied the Prophet (ﷺ) in a journey, and when we climbed up a height, we proclaimed aloud: \"La ilaha illallah (There is no true god except Allah)\" and \"Allahu Akbar (Allah is Greatest).\" The Prophet (ﷺ) admonished us saying, \"O people, take it easy. He Whom you are calling is not deaf or absent. He is with you (i.e., by His Knowledge), He is Hearing and He is Near.\"\n\n[Al-Bukhari and Muslim]."
  },
  "1709710": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709710\nIn-book reference  : Book 7, Hadith 025\nEnglish translation  : Vol. 1, Book 7, Hadith 025",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"Three supplications are answered without doubt. The supplication of the oppressed, the supplication of the traveller, and the supplication of the parent for his son.\"\n\n[At- Tirmidhi and Abu Dawud]."
  },
  "1709720": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709720\nIn-book reference  : Book 7, Hadith 026\nEnglish translation  : Vol. 1, Book 7, Hadith 026",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Musa Al-Ashari (May Allah be pleased with him) reported:\nWhen the Messenger of Allah (ﷺ), feared mischief from a people, he would supplicate: \"Allahumma inna naj'aluka fi nuhurihim, wa na'udhu bika min shururihim (O Allah! We ask You to face them, and seek Your Protection against their evil.\"\n\n[Abu Dawud and An- Nasa'i]."
  },
  "1709730": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709730\nIn-book reference  : Book 7, Hadith 027\nEnglish translation  : Vol. 1, Book 7, Hadith 027",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Khaulah bint Hakim (May Allah be pleased with her) reported:\nI heard the Messenger of Allah (ﷺ) saying, \"Whosoever alights somewhere and says: 'A'udhu bikalimat-illahit-tammati min sharri ma khalaqa (I seek refuge with the Perfect Words of Allah from the evil of what He has created),' nothing will harm him until he leaves that place.\"\n\n[Muslim]."
  },
  "1709740": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709740\nIn-book reference  : Book 7, Hadith 028\nEnglish translation  : Vol. 1, Book 7, Hadith 028",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Umar (May Allah be pleased with them) reported:\nWhenever the Messenger of Allah (ﷺ) set out on a journey, he would say by nightfall: \"Ya ardu, Rabbi wa Rabbuk-illahu, a'udhu billahi min sharriki wa sharri ma fiki, wa sharri ma khuliqa fiki, wa sharri ma yadibbu 'alaiki; a'udhu billahi min sharri asadin wa aswadin, wa minal-hayyati wal-'aqrabi, wa min sakinil-baladi, wa min walidin wa ma walad [O land, my Rubb and your Rubb is Allah, I seek refuge in Him from your evils, the evils of what you contain, the evils of what has been created in you, and the evils of what walks upon you. I seek refuge in Allah from lions, black serpents, scorpions and from the inhabitants of the place, and from the parent (i.e., Satan) and his offspring who inhabit a settlement (i.e., helpers from amongst the devils)].\"\n\n[Abu Dawud]."
  },
  "1709750": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709750\nIn-book reference  : Book 7, Hadith 029\nEnglish translation  : Vol. 1, Book 7, Hadith 029",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"Travelling is a torment because it deprives a traveller of his food, drink and sleep. So when one of you has accomplished his purpose of journey, let him return home quickly.\"\n\n[Al-Bukhari and Muslim]."
  },
  "1709760": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709760\nIn-book reference  : Book 7, Hadith 030\nEnglish translation  : Vol. 1, Book 7, Hadith 030",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Jabir (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"When one of you stays away (from his family) for a long period of time, let him not surprise his family by night.\"\n\nIn another narration, Jabir (May Allah be pleased with him) said: The Messenger of Allah (ﷺ) prohibited us from coming back to our family at night.\n\n[Al-Bukhari and Muslim]."
  },
  "1709770": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709770\nIn-book reference  : Book 7, Hadith 031\nEnglish translation  : Vol. 1, Book 7, Hadith 031",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Anas (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) would not come (back) to his family by night. He used to come in the morning or in the evening (before dark).\n\n[Al-Bukhari and Muslim]."
  },
  "1709780": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709780\nIn-book reference  : Book 7, Hadith 032\nEnglish translation  : Vol. 1, Book 7, Hadith 032",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Anas (May Allah be pleased with him) reported:\nWe returned with the Prophet (ﷺ) from a journey; and when we entered the suburbs of Al- Madinah, he (ﷺ) said: \"Ayibuna, ta'ibuna, 'abiduna, li-Rabbina hamidun (We are returning in safety, turning to our Rubb, worshipping Him and praising Him).\" He (ﷺ) continued repeating these words till we entered Al-Madinah.\n\n[Muslim]."
  },
  "1709790": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709790\nIn-book reference  : Book 7, Hadith 033\nEnglish translation  : Vol. 1, Book 7, Hadith 033",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ka'b bin Malik (May Allah be pleased with him) reported:\nWhenever the Messenger of Allah (ﷺ) returned from a journey, he would proceed straight to the mosque and perform two Rak'ah of (optional) prayer.\n\n[Al-Bukhari and Muslim]."
  },
  "1709800": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709800\nIn-book reference  : Book 7, Hadith 034\nEnglish translation  : Vol. 1, Book 7, Hadith 034",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Abu Hurairah (May Allah be pleased with him) reported:\nThe Messenger of Allah (ﷺ) said, \"It is not permissible for a woman who believes in Allah and the Last Day to make a journey of one day and night unless she is accompanied by a Mahram (husband or any other relative to whom she is prohibited to marry).\"\n\n[Al-Bukhari and Muslim]."
  },
  "1709810": {
    "collection": "Riyad as-Salihin",
    "book": "The Book of Etiquette of Traveling",
    "book_num": "7",
    "reference": "Reference  : Riyad as-Salihin 1709810\nIn-book reference  : Book 7, Hadith 035\nEnglish translation  : Vol. 1, Book 7, Hadith 035",
    "url": "https://sunnah.com/riyadussalihin/7",
    "text": "Ibn 'Abbas (May Allah be pleased with them) reported:\nThe Prophet (ﷺ) said, \"No man must not be alone with a woman except in the presence of her (Mahram). No woman should travel except in company of a (Mahram).\" A man said: \"O Messenger of Allah! I have been enrolled for such and such expedition, and my wife left for Hajj.\" He (ﷺ) said to him, \"Go and perform Hajj with your wife.\"\n\n[Al- Bukhari and Muslim]."
  }
}