{
  "2736": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2736\nIn-book reference  : Book 49, Hadith 1\nUSC-MSA web (English) reference  : Book 36, Hadith 6596\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُعَاذُ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ، كُلُّهُمْ عَنْ سُلَيْمَانَ التَّيْمِيِّ، ح وَحَدَّثَنَا أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قُمْتُ عَلَى بَابِ الْجَنَّةِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا الْمَسَاكِينُ وَإِذَا أَصْحَابُ الْجَدِّ مَحْبُوسُونَ إِلاَّ أَصْحَابَ النَّارِ فَقَدْ أُمِرَ بِهِمْ إِلَى النَّارِ وَقُمْتُ عَلَى بَابِ النَّارِ فَإِذَا عَامَّةُ مَنْ دَخَلَهَا النِّسَاءُ \" ."
  },
  "2737": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2737d\nIn-book reference  : Book 49, Hadith 5\nUSC-MSA web (English) reference  : Book 36, Hadith 6599\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، سَمِعَ أَبَا رَجَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرَ مِثْلَهُ ."
  },
  "2738": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2738b\nIn-book reference  : Book 49, Hadith 7\nUSC-MSA web (English) reference  : Book 36, Hadith 6601\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ مُطَرِّفًا، يُحَدِّثُ أَنَّهُ كَانَتْ لَهُ امْرَأَتَانِ بِمَعْنَى حَدِيثِ مُعَاذٍ ."
  },
  "2739": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2739\nIn-book reference  : Book 49, Hadith 8\nUSC-MSA web (English) reference  : Book 36, Hadith 6602\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ أَبُو زُرْعَةَ، حَدَّثَنَا ابْنُ بُكَيْرٍ، حَدَّثَنِي يَعْقُوبُ بْنُ، عَبْدِ الرَّحْمَنِ عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ كَانَ مِنْ دُعَاءِ رَسُولِ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ زَوَالِ نِعْمَتِكَ وَتَحَوُّلِ عَافِيَتِكَ وَفُجَاءَةِ نِقْمَتِكَ وَجَمِيعِ سَخَطِكَ \" ."
  },
  "2740": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2740\nIn-book reference  : Book 49, Hadith 9\nUSC-MSA web (English) reference  : Book 36, Hadith 6603\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، وَمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا تَرَكْتُ بَعْدِي فِتْنَةً هِيَ أَضَرُّ عَلَى الرِّجَالِ مِنَ النِّسَاءِ \" ."
  },
  "2741": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2741b\nIn-book reference  : Book 49, Hadith 11\nUSC-MSA web (English) reference  : Book 36, Hadith 6605\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، كُلُّهُمْ عَنْ سُلَيْمَانَ التَّيْمِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2742": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2742\nIn-book reference  : Book 49, Hadith 12\nUSC-MSA web (English) reference  : Book 36, Hadith 6606\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مَسْلَمَةَ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ الدُّنْيَا حُلْوَةٌ خَضِرَةٌ وَإِنَّ اللَّهَ مُسْتَخْلِفُكُمْ فِيهَا فَيَنْظُرُ كَيْفَ تَعْمَلُونَ فَاتَّقُوا الدُّنْيَا وَاتَّقُوا النِّسَاءَ فَإِنَّ أَوَّلَ فِتْنَةِ بَنِي إِسْرَائِيلَ كَانَتْ فِي النِّسَاءِ \" . وَفِي حَدِيثِ ابْنِ بَشَّارٍ \" لِيَنْظُرَ كَيْفَ تَعْمَلُونَ \" ."
  },
  "2743": {
    "collection": "Sahih Muslim",
    "book": "The Book of Heart-Melting Traditions",
    "book_num": "49",
    "reference": "Reference  : Sahih Muslim 2743c\nIn-book reference  : Book 49, Hadith 15\nUSC-MSA web (English) reference  : Book 36, Hadith 6609\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/49",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالَ ابْنُ سَهْلٍ حَدَّثَنَا وَقَالَ الآخَرَانِ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" انْطَلَقَ ثَلاَثَةُ رَهْطٍ مِمَّنْ كَانَ قَبْلَكُمْ حَتَّى آوَاهُمُ الْمَبِيتُ إِلَى غَارٍ \" . وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ نَافِعٍ عَنِ ابْنِ عُمَرَ غَيْرَ أَنَّهُ قَالَ قَالَ رَجُلٌ مِنْهُمُ \" اللَّهُمَّ كَانَ لِي أَبَوَانِ شَيْخَانِ كَبِيرَانِ فَكُنْتُ لاَ أَغْبُقُ قَبْلَهُمَا أَهْلاً وَلاَ مَالاً \" . وَقَالَ \" فَامْتَنَعَتْ مِنِّي حَتَّى أَلَمَّتْ بِهَا سَنَةٌ مِنَ السِّنِينَ فَجَاءَتْنِي فَأَعْطَيْتُهَا عِشْرِينَ وَمِائَةَ دِينَارٍ \" . وَقَالَ \" فَثَمَّرْتُ أَجْرَهُ حَتَّى كَثُرَتْ مِنْهُ الأَمْوَالُ فَارْتَعَجَتْ \" . وَقَالَ \" فَخَرَجُوا مِنَ الْغَارِ يَمْشُونَ"
  }
}