{
  "2643": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2643b\nIn-book reference  : Book 46, Hadith 2\nUSC-MSA web (English) reference  : Book 33, Hadith 6391\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ جَرِيرِ بْنِ عَبْدِ، الْحَمِيدِ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ، الأَشَجُّ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . قَالَ فِي حَدِيثِ وَكِيعٍ \" إِنَّ خَلْقَ أَحَدِكُمْ يُجْمَعُ فِي بَطْنِ أُمِّهِ أَرْبَعِينَ لَيْلَةً \" . وَقَالَ فِي حَدِيثِ مُعَاذٍ عَنْ شُعْبَةَ \" أَرْبَعِينَ لَيْلَةً أَرْبَعِينَ يَوْمًا \" . وَأَمَّا فِي حَدِيثِ جَرِيرٍ وَعِيسَى \" أَرْبَعِينَ يَوْمًا \" ."
  },
  "2644": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2644\nIn-book reference  : Book 46, Hadith 3\nUSC-MSA web (English) reference  : Book 33, Hadith 6392\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم قَالَ \" يَدْخُلُ الْمَلَكُ عَلَى النُّطْفَةِ بَعْدَ مَا تَسْتَقِرُّ فِي الرَّحِمِ بِأَرْبَعِينَ أَوْ خَمْسَةٍ وَأَرْبَعِينَ لَيْلَةً فَيَقُولُ يَا رَبِّ أَشَقِيٌّ أَوْ سَعِيدٌ فَيُكْتَبَانِ فَيَقُولُ أَىْ رَبِّ أَذَكَرٌ أَوْ أُنْثَى فَيُكْتَبَانِ وَيُكْتَبُ عَمَلُهُ وَأَثَرُهُ وَأَجَلُهُ وَرِزْقُهُ ثُمَّ تُطْوَى الصُّحُفُ فَلاَ يُزَادُ فِيهَا وَلاَ يُنْقَصُ \" ."
  },
  "2645": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2645d\nIn-book reference  : Book 46, Hadith 7\nUSC-MSA web (English) reference  : Book 33, Hadith 6396\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا رَبِيعَةُ بْنُ كُلْثُومٍ، حَدَّثَنِي أَبِي كُلْثُومٌ، عَنْ أَبِي الطُّفَيْلِ، عَنْ حُذَيْفَةَ بْنِ أَسِيدٍ الْغِفَارِيِّ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَفَعَ الْحَدِيثَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم \" أَنَّ مَلَكًا مُوَكَّلاً بِالرَّحِمِ إِذَا أَرَادَ اللَّهُ أَنْ يَخْلُقَ شَيْئًا بِإِذْنِ اللَّهِ لِبِضْعٍ وَأَرْبَعِينَ لَيْلَةً \" . ثُمَّ ذَكَرَ نَحْوَ حَدِيثِهِمْ ."
  },
  "2646": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2646\nIn-book reference  : Book 46, Hadith 8\nUSC-MSA web (English) reference  : Book 33, Hadith 6397\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنِي أَبُو كَامِلٍ، فُضَيْلُ بْنُ حُسَيْنٍ الْجَحْدَرِيُّ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا عُبَيْدُ، اللَّهِ بْنُ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ، وَرَفَعَ الْحَدِيثَ، أَنَّهُ قَالَ \" إِنَّ اللَّهَ عَزَّ وَجَلَّ قَدْ وَكَّلَ بِالرَّحِمِ مَلَكًا فَيَقُولُ أَىْ رَبِّ نُطْفَةٌ أَىْ رَبِّ عَلَقَةٌ أَىْ رَبِّ مُضْغَةٌ . فَإِذَا أَرَادَ اللَّهُ أَنْ يَقْضِيَ خَلْقًا - قَالَ - قَالَ الْمَلَكُ أَىْ رَبِّ ذَكَرٌ أَوْ أُنْثَى شَقِيٌّ أَوْ سَعِيدٌ فَمَا الرِّزْقُ فَمَا الأَجَلُ فَيُكْتَبُ كَذَلِكَ فِي بَطْنِ أُمِّهِ \" ."
  },
  "2647": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2647d\nIn-book reference  : Book 46, Hadith 12\nUSC-MSA web (English) reference  : Book 33, Hadith 6401\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، وَالأَعْمَشِ، أَنَّهُمَا سَمِعَا سَعْدَ بْنَ عُبَيْدَةَ، يُحَدِّثُهُ عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ."
  },
  "2648": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2648b\nIn-book reference  : Book 46, Hadith 14\nUSC-MSA web (English) reference  : Book 33, Hadith 6403\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْمَعْنَى وَفِيهِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلُّ عَامِلٍ مُيَسَّرٌ لِعَمَلِهِ \" ."
  },
  "2649": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2649b\nIn-book reference  : Book 46, Hadith 16\nUSC-MSA web (English) reference  : Book 33, Hadith 6405\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ وَابْنُ نُمَيْرٍ عَنِ ابْنِ عُلَيَّةَ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ يَزِيدَ الرِّشْكِ، فِي هَذَا الإِسْنَادِ . بِمَعْنَى حَدِيثِ حَمَّادٍ وَفِي حَدِيثِ عَبْدِ الْوَارِثِ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ ."
  },
  "2650": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2650\nIn-book reference  : Book 46, Hadith 17\nUSC-MSA web (English) reference  : Book 33, Hadith 6406\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، حَدَّثَنَا عَزْرَةُ بْنُ، ثَابِتٍ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمُرَ، عَنْ أَبِي الأَسْوَدِ الدِّئَلِيِّ، قَالَ قَالَ لِي عِمْرَانُ بْنُ الْحُصَيْنِ أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ أَشَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى عَلَيْهِمْ مِنْ قَدَرِ مَا سَبَقَ أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ فَقُلْتُ بَلْ شَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى عَلَيْهِمْ قَالَ فَقَالَ أَفَلاَ يَكُونُ ظُلْمًا قَالَ فَفَزِعْتُ مِنْ ذَلِكَ فَزَعًا شَدِيدًا وَقُلْتُ كُلُّ شَىْءٍ خَلْقُ اللَّهِ وَمِلْكُ يَدِهِ فَلاَ يُسْأَلُ عَمَّا يَفْعَلُ وَهُمْ يُسْأَلُونَ . فَقَالَ لِي يَرْحَمُكَ اللَّهُ إِنِّي لَمْ أُرِدْ بِمَا سَأَلْتُكَ إِلاَّ لأَحْزُرَ عَقْلَكَ إِنَّ رَجُلَيْنِ مِنْ مُزَيْنَةَ أَتَيَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالاَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ مَا يَعْمَلُ النَّاسُ الْيَوْمَ وَيَكْدَحُونَ فِيهِ أَشَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ مِنْ قَدَرٍ قَدْ سَبَقَ أَوْ فِيمَا يُسْتَقْبَلُونَ بِهِ مِمَّا أَتَاهُمْ بِهِ نَبِيُّهُمْ وَثَبَتَتِ الْحُجَّةُ عَلَيْهِمْ فَقَالَ \" لاَ بَلْ شَىْءٌ قُضِيَ عَلَيْهِمْ وَمَضَى فِيهِمْ وَتَصْدِيقُ ذَلِكَ فِي كِتَابِ اللَّهِ عَزَّ وَجَلَّ { وَنَفْسٍ وَمَا سَوَّاهَا * فَأَلْهَمَهَا فُجُورَهَا وَتَقْوَاهَا} \" ."
  },
  "2651": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2651\nIn-book reference  : Book 46, Hadith 18\nUSC-MSA web (English) reference  : Book 33, Hadith 6407\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ الْجَنَّةِ ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ النَّارِ وَإِنَّ الرَّجُلَ لَيَعْمَلُ الزَّمَنَ الطَّوِيلَ بِعَمَلِ أَهْلِ النَّارِ ثُمَّ يُخْتَمُ لَهُ عَمَلُهُ بِعَمَلِ أَهْلِ الْجَنَّةِ \" ."
  },
  "112": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 112b\nIn-book reference  : Book 46, Hadith 19\nUSC-MSA web (English) reference  : Book 33, Hadith 6408\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ . وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ \" ."
  },
  "2652": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2652f\nIn-book reference  : Book 46, Hadith 25\nUSC-MSA web (English) reference  : Book 33, Hadith 6414\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي، هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمْ ."
  },
  "2653": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2653b\nIn-book reference  : Book 46, Hadith 27\nUSC-MSA web (English) reference  : Book 33, Hadith 6416\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ حَدَّثَنَا ابْنُ، وَهْبٍ أَخْبَرَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو، بْنِ الْعَاصِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" كَتَبَ اللَّهُ مَقَادِيرَ الْخَلاَئِقِ قَبْلَ أَنْ يَخْلُقَ السَّمَوَاتِ وَالأَرْضَ بِخَمْسِينَ أَلْفَ سَنَةٍ - قَالَ - وَعَرْشُهُ عَلَى الْمَاءِ \" ."
  },
  "2654": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2654\nIn-book reference  : Book 46, Hadith 28\nUSC-MSA web (English) reference  : Book 33, Hadith 6417\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعٌ، - يَعْنِي ابْنَ يَزِيدَ - كِلاَهُمَا عَنْ أَبِي هَانِئٍ، . بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُمَا لَمْ يَذْكُرَا وَعَرْشُهُ عَلَى الْمَاءِ ."
  },
  "2655": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2655\nIn-book reference  : Book 46, Hadith 29\nUSC-MSA web (English) reference  : Book 33, Hadith 6418\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ كِلاَهُمَا عَنِ الْمُقْرِئِ، قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ، اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ قَالَ حَدَّثَنَا حَيْوَةُ، أَخْبَرَنِي أَبُو هَانِئٍ، أَنَّهُ سَمِعَ أَبَا عَبْدِ الرَّحْمَنِ الْحُبُلِيَّ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّ قُلُوبَ بَنِي آدَمَ كُلَّهَا بَيْنَ إِصْبَعَيْنِ مِنْ أَصَابِعِ الرَّحْمَنِ كَقَلْبٍ وَاحِدٍ يُصَرِّفُهُ حَيْثُ يَشَاءُ \" . ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ مُصَرِّفَ الْقُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ \" ."
  },
  "2656": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2656\nIn-book reference  : Book 46, Hadith 30\nUSC-MSA web (English) reference  : Book 33, Hadith 6419\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالَ قَرَأْتُ عَلَى مَالِكِ بْنِ أَنَسٍ ح وَحَدَّثَنَا قُتَيْبَةُ، بْنُ سَعِيدٍ عَنْ مَالِكٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ زِيَادِ بْنِ سَعْدٍ، عَنْ عَمْرِو بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، أَنَّهُ قَالَ أَدْرَكْتُ نَاسًا مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُونَ كُلُّ شَىْءٍ بِقَدَرٍ . قَالَ وَسَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلُّ شَىْءٍ بِقَدَرٍ حَتَّى الْعَجْزُ وَالْكَيْسُ أَوِ الْكَيْسُ وَالْعَجْزُ \" ."
  },
  "2657": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2657b\nIn-book reference  : Book 46, Hadith 32\nUSC-MSA web (English) reference  : Book 33, Hadith 6421\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لإِسْحَاقَ - قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا رَأَيْتُ شَيْئًا أَشْبَهَ بِاللَّمَمِ مِمَّا قَالَ أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" إِنَّ اللَّهَ كَتَبَ عَلَى ابْنِ آدَمَ حَظَّهُ مِنَ الزِّنَى أَدْرَكَ ذَلِكَ لاَ مَحَالَةَ فَزِنَى الْعَيْنَيْنِ النَّظَرُ وَزِنَى اللِّسَانِ النُّطْقُ وَالنَّفْسُ تَمَنَّى وَتَشْتَهِي وَالْفَرْجُ يُصَدِّقُ ذَلِكَ أَوْ يُكَذِّبُهُ \" . قَالَ عَبْدٌ فِي رِوَايَتِهِ ابْنِ طَاوُسٍ عَنْ أَبِيهِ سَمِعْتُ ابْنَ عَبَّاسٍ ."
  },
  "2658": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2658g\nIn-book reference  : Book 46, Hadith 39\nUSC-MSA web (English) reference  : Book 33, Hadith 6428\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ يُولَدُ يُولَدُ عَلَى هَذِهِ الْفِطْرَةِ فَأَبَوَاهُ يُهَوِّدَانِهِ وَيُنَصِّرَانِهِ كَمَا تَنْتِجُونَ الإِبِلَ فَهَلْ تَجِدُونَ فِيهَا جَدْعَاءَ حَتَّى تَكُونُوا أَنْتُمْ تَجْدَعُونَهَا \" . قَالُوا يَا رَسُولَ اللَّهِ أَفَرَأَيْتَ مَنْ يَمُوتُ صَغِيرًا قَالَ \" اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ \" ."
  },
  "2659": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2659c\nIn-book reference  : Book 46, Hadith 42\nUSC-MSA web (English) reference  : Book 33, Hadith 6431\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ، عَبْدِ الرَّحْمَنِ بْنِ بَهْرَامَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، ح وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ - كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِإِسْنَادِ يُونُسَ وَابْنِ أَبِي ذِئْبٍ . مِثْلَ حَدِيثِهِمَا غَيْرَ أَنَّ فِي، حَدِيثِ شُعَيْبٍ وَمَعْقِلٍ سُئِلَ عَنْ ذَرَارِيِّ الْمُشْرِكِينَ ."
  },
  "2660": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2660\nIn-book reference  : Book 46, Hadith 43\nUSC-MSA web (English) reference  : Book 33, Hadith 6432\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَطْفَالِ الْمُشْرِكِينَ مَنْ يَمُوتُ مِنْهُمْ صَغِيرًا فَقَالَ \" اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ \" ."
  },
  "2661": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2661\nIn-book reference  : Book 46, Hadith 44\nUSC-MSA web (English) reference  : Book 33, Hadith 6433\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَطْفَالِ الْمُشْرِكِينَ قَالَ \" اللَّهُ أَعْلَمُ بِمَا كَانُوا عَامِلِينَ إِذْ خَلَقَهُمْ \" ."
  },
  "2662": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2662c\nIn-book reference  : Book 46, Hadith 47\nUSC-MSA web (English) reference  : Book 33, Hadith 6436\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَمَّتِهِ، عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ دُعِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى جَنَازَةِ صَبِيٍّ مِنَ الأَنْصَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ طُوبَى لِهَذَا عُصْفُورٌ مِنْ عَصَافِيرِ الْجَنَّةِ لَمْ يَعْمَلِ السُّوءَ وَلَمْ يُدْرِكْهُ قَالَ \" أَوَغَيْرَ ذَلِكَ يَا عَائِشَةُ إِنَّ اللَّهَ خَلَقَ لِلْجَنَّةِ أَهْلاً خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ وَخَلَقَ لِلنَّارِ أَهْلاً خَلَقَهُمْ لَهَا وَهُمْ فِي أَصْلاَبِ آبَائِهِمْ \" ."
  },
  "2663": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2663d\nIn-book reference  : Book 46, Hadith 51\nUSC-MSA web (English) reference  : Book 33, Hadith 6440\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، - وَاللَّفْظُ لِحَجَّاجٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، حَجَّاجٌ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ الْمُغِيرَةِ بْنِ عَبْدِ اللَّهِ الْيَشْكُرِيِّ، عَنْ مَعْرُورِ بْنِ سُوَيْدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَتْ أُمُّ حَبِيبَةَ اللَّهُمَّ مَتِّعْنِي بِزَوْجِي رَسُولِ اللَّهِ صلى الله عليه وسلم وَبِأَبِي أَبِي سُفْيَانَ وَبِأَخِي مُعَاوِيَةَ . فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّكِ سَأَلْتِ اللَّهَ لآجَالٍ مَضْرُوبَةٍ وَآثَارٍ مَوْطُوءَةٍ وَأَرْزَاقٍ مَقْسُومَةٍ لاَ يُعَجِّلُ شَيْئًا مِنْهَا قَبْلَ حِلِّهِ وَلاَ يُؤَخِّرُ مِنْهَا شَيْئًا بَعْدَ حِلِّهِ وَلَوْ سَأَلْتِ اللَّهَ أَنْ يُعَافِيَكِ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ لَكَانَ خَيْرًا لَكِ \" . قَالَ فَقَالَ رَجُلٌ يَا رَسُولَ اللَّهِ الْقِرَدَةُ وَالْخَنَازِيرُ هِيَ مِمَّا مُسِخَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" إِنَّ اللَّهَ عَزَّ وَجَلَّ لَمْ يُهْلِكْ قَوْمًا أَوْ يُعَذِّبْ قَوْمًا فَيَجْعَلَ لَهُمْ نَسْلاً وَإِنَّ الْقِرَدَةَ وَالْخَنَازِيرَ كَانُوا قَبْلَ ذَلِكَ \" .\nحَدَّثَنِيهِ أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا الْحُسَيْنُ بْنُ حَفْصٍ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ \" وَآثَارٍ مَبْلُوغَةٍ \" . قَالَ ابْنُ مَعْبَدٍ وَرَوَى بَعْضُهُمْ \" قَبْلَ حِلِّهِ \" . أَىْ نُزُولِهِ ."
  },
  "2664": {
    "collection": "Sahih Muslim",
    "book": "The Book of Destiny",
    "book_num": "46",
    "reference": "Reference  : Sahih Muslim 2664\nIn-book reference  : Book 46, Hadith 52\nUSC-MSA web (English) reference  : Book 33, Hadith 6441\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/46",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ رَبِيعَةَ بْنِ عُثْمَانَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْمُؤْمِنُ الْقَوِيُّ خَيْرٌ وَأَحَبُّ إِلَى اللَّهِ مِنَ الْمُؤْمِنِ الضَّعِيفِ وَفِي كُلٍّ خَيْرٌ احْرِصْ عَلَى مَا يَنْفَعُكَ وَاسْتَعِنْ بِاللَّهِ وَلاَ تَعْجِزْ وَإِنْ أَصَابَكَ شَىْءٌ فَلاَ تَقُلْ لَوْ أَنِّي فَعَلْتُ كَانَ كَذَا وَكَذَا . وَلَكِنْ قُلْ قَدَرُ اللَّهِ وَمَا شَاءَ فَعَلَ فَإِنَّ لَوْ تَفْتَحُ عَمَلَ الشَّيْطَانِ \" ."
  }
}