{
  "1627": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1627e\nIn-book reference  : Book 25, Hadith 5\nUSC-MSA web (English) reference  : Book 13, Hadith 3990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . نَحْوَ حَدِيثِ عَمْرِو بْنِ الْحَارِثِ ."
  },
  "1628": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1628i\nIn-book reference  : Book 25, Hadith 14\nUSC-MSA web (English) reference  : Book 13, Hadith 3999\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا هِشَامٌ، عَنْ مُحَمَّدٍ، عَنْ حُمَيْدِ، بْنِ عَبْدِ الرَّحْمَنِ حَدَّثَنِي ثَلاَثَةٌ، مِنْ وَلَدِ سَعْدِ بْنِ مَالِكٍ كُلُّهُمْ يُحَدِّثُنِيهِ بِمِثْلِ حَدِيثِ صَاحِبِهِ فَقَالَ مَرِضَ سَعْدٌ بِمَكَّةَ فَأَتَاهُ النَّبِيُّ صلى الله عليه وسلم يَعُودُهُ . بِمِثْلِ حَدِيثِ عَمْرِو بْنِ سَعِيدٍ عَنْ حُمَيْدٍ الْحِمْيَرِيِّ ."
  },
  "1629": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1629\nIn-book reference  : Book 25, Hadith 15\nUSC-MSA web (English) reference  : Book 13, Hadith 4000\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَوْ أَنَّ النَّاسَ، غَضُّوا مِنَ الثُّلُثِ إِلَى الرُّبُعِ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" الثُّلُثُ وَالثُّلُثُ كَثِيرٌ \" . وَفِي حَدِيثِ وَكِيعٍ \" كَبِيرٌ أَوْ كَثِيرٌ \" ."
  },
  "1630": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1630\nIn-book reference  : Book 25, Hadith 16\nUSC-MSA web (English) reference  : Book 13, Hadith 4001\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، قَالَ لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَبِي مَاتَ وَتَرَكَ مَالاً وَلَمْ يُوصِ فَهَلْ يُكَفِّرُ عَنْهُ أَنْ أَتَصَدَّقَ عَنْهُ قَالَ \" نَعَمْ \" ."
  },
  "1004": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1004e\nIn-book reference  : Book 25, Hadith 19\nUSC-MSA web (English) reference  : Book 13, Hadith 4004\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا شُعَيْبُ، بْنُ إِسْحَاقَ ح وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ، - وَهُوَ ابْنُ الْقَاسِمِ - ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ أَمَّا أَبُو أُسَامَةَ وَرَوْحٌ فَفِي حَدِيثِهِمَا فَهَلْ لِي أَجْرٌ كَمَا قَالَ يَحْيَى بْنُ سَعِيدٍ . وَأَمَّا شُعَيْبٌ وَجَعْفَرٌ فَفِي حَدِيثِهِمَا أَفَلَهَا أَجْرٌ كَرِوَايَةِ ابْنِ بِشْرٍ ."
  },
  "1631": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1631\nIn-book reference  : Book 25, Hadith 20\nUSC-MSA web (English) reference  : Book 13, Hadith 4005\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، - يَعْنِي ابْنَ سَعِيدٍ - وَابْنُ حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - هُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا مَاتَ الإِنْسَانُ انْقَطَعَ عَنْهُ عَمَلُهُ إِلاَّ مِنْ ثَلاَثَةٍ إِلاَّ مِنْ صَدَقَةٍ جَارِيَةٍ أَوْ عِلْمٍ يُنْتَفَعُ بِهِ أَوْ وَلَدٍ صَالِحٍ يَدْعُو لَهُ \" ."
  },
  "1632": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1632b\nIn-book reference  : Book 25, Hadith 22\nUSC-MSA web (English) reference  : Book 13, Hadith 4007\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، ح وَحَدَّثَنَا إِسْحَاقُ، أَخْبَرَنَا أَزْهَرُ السَّمَّانُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كُلُّهُمْ عَنِ ابْنِ عَوْنٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّ حَدِيثَ ابْنِ أَبِي زَائِدَةَ وَأَزْهَرَ انْتَهَى عِنْدَ قَوْلِهِ \" أَوْ يُطْعِمَ صَدِيقًا غَيْرَ مُتَمَوِّلٍ فِيهِ \" . وَلَمْ يُذْكَرْ مَا بَعْدَهُ . وَحَدِيثُ ابْنِ أَبِي عَدِيٍّ فِيهِ مَا ذَكَرَ سُلَيْمٌ قَوْلُهُ فَحَدَّثْتُ بِهَذَا الْحَدِيثِ مُحَمَّدًا . إِلَى آخِرِهِ ."
  },
  "1633": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1633\nIn-book reference  : Book 25, Hadith 23\nUSC-MSA web (English) reference  : Book 13, Hadith 4008\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، عُمَرُ بْنُ سَعْدٍ عَنْ سُفْيَانَ، عَنِ ابْنِ عَوْنٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنْ عُمَرَ، قَالَ أَصَبْتُ أَرْضًا مِنْ أَرْضِ خَيْبَرَ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ أَصَبْتُ أَرْضًا لَمْ أُصِبْ مَالاً أَحَبَّ إِلَىَّ وَلاَ أَنْفَسَ عِنْدِي مِنْهَا . وَسَاقَ الْحَدِيثَ بِمِثْلِ حَدِيثِهِمْ وَلَمْ يَذْكُرْ فَحَدَّثْتُ مُحَمَّدًا وَمَا بَعْدَهُ ."
  },
  "1634": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1634b\nIn-book reference  : Book 25, Hadith 25\nUSC-MSA web (English) reference  : Book 13, Hadith 4010\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، كِلاَهُمَا عَنْ مَالِكِ بْنِ مِغْوَلٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ وَكِيعٍ قُلْتُ فَكَيْفَ أُمِرَ النَّاسُ بِالْوَصِيَّةِ وَفِي حَدِيثِ ابْنِ نُمَيْرٍ قُلْتُ كَيْفَ كُتِبَ عَلَى الْمُسْلِمِينَ الْوَصِيَّةُ."
  },
  "1635": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1635b\nIn-book reference  : Book 25, Hadith 27\nUSC-MSA web (English) reference  : Book 13, Hadith 4012\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كُلُّهُمْ عَنْ جَرِيرٍ، ح وَحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - وَهُوَ ابْنُ يُونُسَ - جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "1636": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1636\nIn-book reference  : Book 25, Hadith 28\nUSC-MSA web (English) reference  : Book 13, Hadith 4013\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ - وَاللَّفْظُ لِيَحْيَى - قَالَ أَخْبَرَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ بْنِ يَزِيدَ، قَالَ ذَكَرُوا عِنْدَ عَائِشَةَ أَنَّ عَلِيًّا كَانَ وَصِيًّا فَقَالَتْ مَتَى أَوْصَى إِلَيْهِ فَقَدْ كُنْتُ مُسْنِدَتَهُ إِلَى صَدْرِي - أَوْ قَالَتْ حَجْرِي - فَدَعَا بِالطَّسْتِ فَلَقَدِ انْخَنَثَ فِي حَجْرِي وَمَا شَعَرْتُ أَنَّهُ مَاتَ فَمَتَى أَوْصَى إِلَيْهِ."
  },
  "1637": {
    "collection": "Sahih Muslim",
    "book": "The Book of Wills",
    "book_num": "25",
    "reference": "Reference  : Sahih Muslim 1637c\nIn-book reference  : Book 25, Hadith 31\nUSC-MSA web (English) reference  : Book 13, Hadith 4016\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/25",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا حُضِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَفِي الْبَيْتِ رِجَالٌ فِيهِمْ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" هَلُمَّ أَكْتُبْ لَكُمْ كِتَابًا لاَ تَضِلُّونَ بَعْدَهُ \" . فَقَالَ عُمَرُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَدْ غَلَبَ عَلَيْهِ الْوَجَعُ وَعِنْدَكُمُ الْقُرْآنُ حَسْبُنَا كِتَابُ اللَّهِ . فَاخْتَلَفَ أَهْلُ الْبَيْتِ فَاخْتَصَمُوا فَمِنْهُمْ مَنْ يَقُولُ قَرِّبُوا يَكْتُبْ لَكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم كِتَابًا لَنْ تَضِلُّوا بَعْدَهُ . وَمِنْهُمْ مَنْ يَقُولُ مَا قَالَ عُمَرُ . فَلَمَّا أَكْثَرُوا اللَّغْوَ وَالاِخْتِلاَفَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قُومُوا \" . قَالَ عُبَيْدُ اللَّهِ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ إِنَّ الرَّزِيَّةَ كُلَّ الرَّزِيَّةِ مَا حَالَ بَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ أَنْ يَكْتُبَ لَهُمْ ذَلِكَ الْكِتَابَ مِنِ اخْتِلاَفِهِمْ وَلَغَطِهِمْ ."
  }
}