{
  "2131": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2131\nIn-book reference  : Book 38, Hadith 1\nUSC-MSA web (English) reference  : Book 25, Hadith 5314\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ وَابْنُ أَبِي عُمَرَ - قَالَ أَبُو كُرَيْبٍ أَخْبَرَنَا وَقَالَ، ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَاللَّفْظُ، لَهُ - قَالاَ حَدَّثَنَا مَرْوَانُ، - يَعْنِيَانِ الْفَزَارِيَّ - عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ نَادَى رَجُلٌ رَجُلاً بِالْبَقِيعِ يَا أَبَا الْقَاسِمِ . فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم . فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي لَمْ أَعْنِكَ إِنَّمَا دَعَوْتُ فُلاَنًا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي \" ."
  },
  "2132": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2132\nIn-book reference  : Book 38, Hadith 2\nUSC-MSA web (English) reference  : Book 25, Hadith 5315\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنِي إِبْرَاهِيمُ بْنُ زِيَادٍ، - وَهُوَ الْمُلَقَّبُ بِسَبَلاَنَ - أَخْبَرَنَا عَبَّادُ بْنُ عَبَّادٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، وَأَخِيهِ عَبْدِ اللَّهِ، سَمِعَهُ مِنْهُمَا، سَنَةَ أَرْبَعٍ وَأَرْبَعِينَ وَمِائَةٍ يُحَدِّثَانِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَحَبَّ أَسْمَائِكُمْ إِلَى اللَّهِ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ \" ."
  },
  "2133": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2133i\nIn-book reference  : Book 38, Hadith 11\nUSC-MSA web (English) reference  : Book 25, Hadith 5324\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ يَعْنِي ابْنَ زُرَيْعٍ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - كِلاَهُمَا عَنْ رَوْحِ بْنِ الْقَاسِمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، . بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ وَلاَ نُنْعِمُكَ عَيْنًا ."
  },
  "2134": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2134\nIn-book reference  : Book 38, Hadith 12\nUSC-MSA web (English) reference  : Book 25, Hadith 5325\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ صلى الله عليه وسلم \" تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي \" . قَالَ عَمْرٌو عَنْ أَبِي هُرَيْرَةَ وَلَمَ يَقُلْ سَمِعْتُ ."
  },
  "2135": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2135\nIn-book reference  : Book 38, Hadith 13\nUSC-MSA web (English) reference  : Book 25, Hadith 5326\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو سَعِيدٍ الأَشَجُّ وَمُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالُوا حَدَّثَنَا ابْنُ إِدْرِيسَ، عَنْ أَبِيهِ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، قَالَ لَمَّا قَدِمْتُ نَجْرَانَ سَأَلُونِي فَقَالُوا إِنَّكُمْ تَقْرَءُونَ يَا أُخْتَ هَارُونَ وَمُوسَى قَبْلَ عِيسَى بِكَذَا وَكَذَا . فَلَمَّا قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم سَأَلْتُهُ عَنْ ذَلِكَ فَقَالَ \" إِنَّهُمْ كَانُوا يُسَمُّونَ بِأَنْبِيَائِهِمْ وَالصَّالِحِينَ قَبْلَهُمْ \" ."
  },
  "2136": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2136b\nIn-book reference  : Book 38, Hadith 15\nUSC-MSA web (English) reference  : Book 25, Hadith 5328\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الرُّكَيْنِ بْنِ الرَّبِيعِ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ، بْنِ جُنْدَبٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تُسَمِّ غُلاَمَكَ رَبَاحًا وَلاَ يَسَارًا وَلاَ أَفْلَحَ وَلاَ نَافِعًا \" ."
  },
  "2137": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2137b\nIn-book reference  : Book 38, Hadith 17\nUSC-MSA web (English) reference  : Book 25, Hadith 5330\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنِي جَرِيرٌ، ح وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، - وَهْوَ ابْنُ الْقَاسِمِ - ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ مَنْصُورٍ، بِإِسْنَادِ زُهَيْرٍ . فَأَمَّا حَدِيثُ جَرِيرٍ وَرَوْحٍ فَكَمِثْلِ حَدِيثِ زُهَيْرٍ بِقِصَّتِهِ . وَأَمَّا حَدِيثُ شُعْبَةَ فَلَيْسَ فِيهِ إِلاَّ ذِكْرُ تَسْمِيَةِ الْغُلاَمِ وَلَمْ يَذْكُرِ الْكَلاَمَ الأَرْبَعَ ."
  },
  "2138": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2138\nIn-book reference  : Book 38, Hadith 18\nUSC-MSA web (English) reference  : Book 25, Hadith 5331\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَرَادَ النَّبِيُّ صلى الله عليه وسلم أَنْ يَنْهَى عَنْ أَنْ يُسَمَّى بِيَعْلَى وَبِبَرَكَةَ وَبِأَفْلَحَ وَبِيَسَارٍ وَبِنَافِعٍ وَبِنَحْوِ ذَلِكَ ثُمَّ رَأَيْتُهُ سَكَتَ بَعْدُ عَنْهَا فَلَمْ يَقُلْ شَيْئًا ثُمَّ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَمْ يَنْهَ عَنْ ذَلِكَ ثُمَّ أَرَادَ عُمَرُ أَنْ يَنْهَى عَنْ ذَلِكَ ثُمَّ تَرَكَهُ ."
  },
  "2139": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2139b\nIn-book reference  : Book 38, Hadith 20\nUSC-MSA web (English) reference  : Book 25, Hadith 5333\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ ابْنَةً لِعُمَرَ، كَانَتْ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَمِيلَةَ ."
  },
  "2140": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2140\nIn-book reference  : Book 38, Hadith 21\nUSC-MSA web (English) reference  : Book 25, Hadith 5334\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، مَوْلَى آلِ طَلْحَةَ عَنْ كُرَيْبٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَتْ جُوَيْرِيَةُ اسْمُهَا بَرَّةَ فَحَوَّلَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْمَهَا جُوَيْرِيَةَ وَكَانَ يَكْرَهُ أَنْ يُقَالَ خَرَجَ مِنْ عِنْدِ بَرَّةَ . وَفِي حَدِيثِ ابْنِ أَبِي عُمَرَ عَنْ كُرَيْبٍ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ ."
  },
  "2141": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2141\nIn-book reference  : Book 38, Hadith 22\nUSC-MSA web (English) reference  : Book 25, Hadith 5335\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، سَمِعْتُ أَبَا رَافِعٍ، يُحَدِّثُ عَنْ أَبِي، هُرَيْرَةَ ح\nوَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ زَيْنَبَ، كَانَ اسْمُهَا بَرَّةَ فَقِيلَ تُزَكِّي نَفْسَهَا . فَسَمَّاهَا رَسُولُ اللَّهِ صلى الله عليه وسلم زَيْنَبَ . وَلَفْظُ الْحَدِيثِ لِهَؤُلاَءِ دُونَ ابْنِ بَشَّارٍ . وَقَالَ ابْنُ أَبِي شَيْبَةَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ ."
  },
  "2142": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2142b\nIn-book reference  : Book 38, Hadith 24\nUSC-MSA web (English) reference  : Book 25, Hadith 5337\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَطَاءٍ، قَالَ سَمَّيْتُ ابْنَتِي بَرَّةَ فَقَالَتْ لِي زَيْنَبُ بِنْتُ أَبِي سَلَمَةَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْ هَذَا الاِسْمِ وَسُمِّيتُ بَرَّةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تُزَكُّوا أَنْفُسَكُمُ اللَّهُ أَعْلَمُ بِأَهْلِ الْبِرِّ مِنْكُمْ \" . فَقَالُوا بِمَ نُسَمِّيهَا قَالَ \" سَمُّوهَا زَيْنَبَ \" ."
  },
  "2143": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2143b\nIn-book reference  : Book 38, Hadith 26\nUSC-MSA web (English) reference  : Book 25, Hadith 5339\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَغْيَظُ رَجُلٍ عَلَى اللَّهِ يَوْمَ الْقِيَامَةِ وَأَخْبَثُهُ وَأَغْيَظُهُ عَلَيْهِ رَجُلٌ كَانَ يُسَمَّى مَلِكَ الأَمْلاَكِ لاَ مَلِكَ إِلاَّ اللَّهُ \" ."
  },
  "2144": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2144c\nIn-book reference  : Book 38, Hadith 29\nUSC-MSA web (English) reference  : Book 25, Hadith 5342\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَنَسٍ، بِهَذِهِ الْقِصَّةِ نَحْوَ حَدِيثِ يَزِيدَ ."
  },
  "2145": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2145\nIn-book reference  : Book 38, Hadith 30\nUSC-MSA web (English) reference  : Book 25, Hadith 5343\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ وُلِدَ لِي غُلاَمٌ فَأَتَيْتُ بِهِ النَّبِيَّ صلى الله عليه وسلم فَسَمَّاهُ إِبْرَاهِيمَ وَحَنَّكَهُ بِتَمْرَةٍ ."
  },
  "2146": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2146c\nIn-book reference  : Book 38, Hadith 33\nUSC-MSA web (English) reference  : Book 25, Hadith 5346\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ، عَنْ هِشَامِ، بْنِ عُرْوَةَ عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا هَاجَرَتْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَهِيَ حُبْلَى بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ . فَذَكَرَ نَحْوَ حَدِيثِ أَبِي أُسَامَةَ ."
  },
  "2147": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2147\nIn-book reference  : Book 38, Hadith 34\nUSC-MSA web (English) reference  : Book 25, Hadith 5347\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، - يَعْنِي ابْنَ عُرْوَةَ - عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُؤْتَى بِالصِّبْيَانِ فَيُبَرِّكُ عَلَيْهِمْ وَيُحَنِّكُهُمْ ."
  },
  "2148": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2148\nIn-book reference  : Book 38, Hadith 35\nUSC-MSA web (English) reference  : Book 25, Hadith 5348\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ جِئْنَا بِعَبْدِ اللَّهِ بْنِ الزُّبَيْرِ إِلَى النَّبِيِّ صلى الله عليه وسلم يُحَنِّكُهُ فَطَلَبْنَا تَمْرَةً فَعَزَّ عَلَيْنَا طَلَبُهَا ."
  },
  "2149": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2149\nIn-book reference  : Book 38, Hadith 36\nUSC-MSA web (English) reference  : Book 25, Hadith 5349\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ - حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ أُتِيَ بِالْمُنْذِرِ بْنِ أَبِي أُسَيْدٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم حِينَ وُلِدَ فَوَضَعَهُ النَّبِيُّ صلى الله عليه وسلم عَلَى فَخِذِهِ وَأَبُو أُسَيْدٍ جَالِسٌ فَلَهِيَ النَّبِيُّ صلى الله عليه وسلم بِشَىْءٍ بَيْنَ يَدَيْهِ فَأَمَرَ أَبُو أُسَيْدٍ بِابْنِهِ فَاحْتُمِلَ مِنْ عَلَى فَخِذِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَقْلَبُوهُ فَاسْتَفَاقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" أَيْنَ الصَّبِيُّ \" . فَقَالَ أَبُو أُسَيْدٍ أَقْلَبْنَاهُ يَا رَسُولَ اللَّهِ . فَقَالَ \" مَا اسْمُهُ \" . قَالَ فُلاَنٌ يَا رَسُولَ اللَّهِ . قَالَ \" لاَ وَلَكِنِ اسْمُهُ الْمُنْذِرُ \" . فَسَمَّاهُ يَوْمَئِذٍ الْمُنْذِرَ ."
  },
  "2150": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2150\nIn-book reference  : Book 38, Hadith 37\nUSC-MSA web (English) reference  : Book 25, Hadith 5350\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ الْعَتَكِيُّ حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَبُو التَّيَّاحِ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، ح\nوَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ خُلُقًا وَكَانَ لِي أَخٌ يُقَالُ لَهُ أَبُو عُمَيْرٍ - قَالَ أَحْسِبُهُ قَالَ - كَانَ فَطِيمًا - قَالَ - فَكَانَ إِذَا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَرَآهُ قَالَ \" أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ \" . قَالَ فَكَانَ يَلْعَبُ بِهِ ."
  },
  "2151": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2151\nIn-book reference  : Book 38, Hadith 38\nUSC-MSA web (English) reference  : Book 25, Hadith 5351\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسِ بْنِ، مَالِكٍ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا بُنَىَّ \" ."
  },
  "2152": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2152b\nIn-book reference  : Book 38, Hadith 40\nUSC-MSA web (English) reference  : Book 25, Hadith 5353\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا سُرَيْجُ بْنُ، يُونُسَ حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ، رَافِعٍ حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ . وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ قَوْلُ النَّبِيِّ صلى الله عليه وسلم لِلْمُغِيرَةِ \" أَىْ بُنَىَّ \" . إِلاَّ فِي حَدِيثِ يَزِيدَ وَحْدَهُ ."
  },
  "2153": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2153g\nIn-book reference  : Book 38, Hadith 47\nUSC-MSA web (English) reference  : Book 25, Hadith 5360\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَاصِمٍ، ح وَحَدَّثَنَا حُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا النَّضْرُ، - يَعْنِي ابْنَ شُمَيْلٍ - قَالاَ جَمِيعًا حَدَّثَنَا ابْنُ جُرَيْجٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَلَمْ يَذْكُرْ فِي حَدِيثِ النَّضْرِ أَلْهَانِي عَنْهُ الصَّفْقُ بِالأَسْوَاقِ ."
  },
  "2154": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2154b\nIn-book reference  : Book 38, Hadith 49\nUSC-MSA web (English) reference  : Book 25, Hadith 5362\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ، حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ، عَنْ طَلْحَةَ، بْنِ يَحْيَى بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ يَا أَبَا الْمُنْذِرِ آنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ نَعَمْ فَلاَ تَكُنْ يَا ابْنَ الْخَطَّابِ عَذَابًا عَلَى أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم . وَلَمْ يَذْكُرْ مِنْ قَوْلِ عُمَرَ سُبْحَانَ اللَّهِ . وَمَا بَعْدَهُ ."
  },
  "2155": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2155c\nIn-book reference  : Book 38, Hadith 52\nUSC-MSA web (English) reference  : Book 25, Hadith 5365\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا النَّضْرُ بْنُ شُمَيْلٍ، وَأَبُو عَامِرٍ الْعَقَدِيُّ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، ح وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، حَدَّثَنَا بَهْزٌ، كُلُّهُمْ عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِهِمْ كَأَنَّهُ كَرِهَ ذَلِكَ ."
  },
  "2156": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2156c\nIn-book reference  : Book 38, Hadith 55\nUSC-MSA web (English) reference  : Book 25, Hadith 5368\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ اللَّيْثِ وَيُونُسَ ."
  },
  "2157": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2157\nIn-book reference  : Book 38, Hadith 56\nUSC-MSA web (English) reference  : Book 25, Hadith 5369\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كَامِلٍ فُضَيْلُ بْنُ حُسَيْنٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ - وَاللَّفْظُ لِيَحْيَى وَأَبِي كَامِلٍ - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ عُبَيْدِ، اللَّهِ بْنِ أَبِي بَكْرٍ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، اطَّلَعَ مِنْ بَعْضِ حُجَرِ النَّبِيِّ صلى الله عليه وسلم فَقَامَ إِلَيْهِ بِمِشْقَصٍ أَوْ مَشَاقِصَ فَكَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَخْتِلُهُ لِيَطْعُنَهُ ."
  },
  "2158": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2158b\nIn-book reference  : Book 38, Hadith 58\nUSC-MSA web (English) reference  : Book 25, Hadith 5371\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَوْ أَنَّ رَجُلاً اطَّلَعَ عَلَيْكَ بِغَيْرِ إِذْنٍ فَخَذَفْتَهُ بِحَصَاةٍ فَفَقَأْتَ عَيْنَهُ مَا كَانَ عَلَيْكَ مِنْ جُنَاحٍ \" ."
  },
  "2159": {
    "collection": "Sahih Muslim",
    "book": "The Book of Manners and Etiquette",
    "book_num": "38",
    "reference": "Reference  : Sahih Muslim 2159b\nIn-book reference  : Book 38, Hadith 60\nUSC-MSA web (English) reference  : Book 25, Hadith 5373\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/38",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الأَعْلَى، وَقَالَ، إِسْحَاقُ أَخْبَرَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ يُونُسَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  }
}