{
  "521": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 521b\nIn-book reference  : Book 5, Hadith 4\nUSC-MSA web (English) reference  : Book 4, Hadith 1059\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا سَيَّارٌ، حَدَّثَنَا يَزِيدُ الْفَقِيرُ، أَخْبَرَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ . فَذَكَرَ نَحْوَهُ ."
  },
  "522": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 522b\nIn-book reference  : Book 5, Hadith 6\nUSC-MSA web (English) reference  : Book 4, Hadith 1061\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ أَخْبَرَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ سَعْدِ بْنِ طَارِقٍ، حَدَّثَنِي رِبْعِيُّ بْنُ حِرَاشٍ، عَنْ حُذَيْفَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم . بِمِثْلِهِ ."
  },
  "523": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 523f\nIn-book reference  : Book 5, Hadith 12\nUSC-MSA web (English) reference  : Book 4, Hadith 1067\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" نُصِرْتُ بِالرُّعْبِ وَأُوتِيتُ جَوَامِعَ الْكَلِمِ \" ."
  },
  "524": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 524c\nIn-book reference  : Book 5, Hadith 15\nUSC-MSA web (English) reference  : Book 4, Hadith 1070\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "525": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 525b\nIn-book reference  : Book 5, Hadith 17\nUSC-MSA web (English) reference  : Book 4, Hadith 1072\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَأَبُو بَكْرِ بْنُ خَلاَّدٍ جَمِيعًا عَنْ يَحْيَى، - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، - عَنْ سُفْيَانَ، حَدَّثَنِي أَبُو إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ صَلَّيْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم نَحْوَ بَيْتِ الْمَقْدِسِ سِتَّةَ عَشَرَ شَهْرًا أَوْ سَبْعَةَ عَشَرَ شَهْرًا ثُمَّ صُرِفْنَا نَحْوَ الْكَعْبَةِ ."
  },
  "526": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 526b\nIn-book reference  : Book 5, Hadith 19\nUSC-MSA web (English) reference  : Book 4, Hadith 1074\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، وَعَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَمَا النَّاسُ فِي صَلاَةِ الْغَدَاةِ إِذْ جَاءَهُمْ رَجُلٌ . بِمِثْلِ حَدِيثِ مَالِكٍ ."
  },
  "527": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 527\nIn-book reference  : Book 5, Hadith 20\nUSC-MSA web (English) reference  : Book 4, Hadith 1075\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي نَحْوَ بَيْتِ الْمَقْدِسِ فَنَزَلَتْ { قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ} فَمَرَّ رَجُلٌ مِنْ بَنِي سَلِمَةَ وَهُمْ رُكُوعٌ فِي صَلاَةِ الْفَجْرِ وَقَدْ صَلَّوْا رَكْعَةً فَنَادَى أَلاَ إِنَّ الْقِبْلَةَ قَدْ حُوِّلَتْ . فَمَالُوا كَمَا هُمْ نَحْوَ الْقِبْلَةِ ."
  },
  "528": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 528c\nIn-book reference  : Book 5, Hadith 23\nUSC-MSA web (English) reference  : Book 4, Hadith 1078\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ ذَكَرْنَ أَزْوَاجُ النَّبِيِّ صلى الله عليه وسلم كَنِيسَةً رَأَيْنَهَا بِأَرْضِ الْحَبَشَةِ يُقَالُ لَهَا مَارِيَةُ . بِمِثْلِ حَدِيثِهِمْ ."
  },
  "529": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 529\nIn-book reference  : Book 5, Hadith 24\nUSC-MSA web (English) reference  : Book 4, Hadith 1079\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا شَيْبَانُ، عَنْ هِلاَلِ بْنِ أَبِي حُمَيْدٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ الَّذِي لَمْ يَقُمْ مِنْهُ \" لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ \" . قَالَتْ فَلَوْلاَ ذَاكَ أُبْرِزَ قَبْرُهُ غَيْرَ أَنَّهُ خُشِيَ أَنْ يُتَّخَذَ مَسْجِدًا . وَفِي رِوَايَةِ ابْنِ أَبِي شَيْبَةَ وَلَوْلاَ ذَاكَ لَمْ يَذْكُرْ قَالَتْ ."
  },
  "530": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 530b\nIn-book reference  : Book 5, Hadith 26\nUSC-MSA web (English) reference  : Book 4, Hadith 1081\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْفَزَارِيُّ، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَصَمِّ، حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَعَنَ اللَّهُ الْيَهُودَ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ \" ."
  },
  "531": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 531\nIn-book reference  : Book 5, Hadith 27\nUSC-MSA web (English) reference  : Book 4, Hadith 1082\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَ حَرْمَلَةُ أَخْبَرَنَا وَقَالَ، هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، أَنَّ عَائِشَةَ، وَعَبْدَ اللَّهِ بْنَ عَبَّاسٍ، قَالاَ لَمَّا نَزَلَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم طَفِقَ يَطْرَحُ خَمِيصَةً لَهُ عَلَى وَجْهِهِ فَإِذَا اغْتَمَّ كَشَفَهَا عَنْ وَجْهِهِ فَقَالَ وَهُوَ كَذَلِكَ \" لَعْنَةُ اللَّهِ عَلَى الْيَهُودِ وَالنَّصَارَى اتَّخَذُوا قُبُورَ أَنْبِيَائِهِمْ مَسَاجِدَ \" . يُحَذِّرُ مِثْلَ مَا صَنَعُوا ."
  },
  "532": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 532\nIn-book reference  : Book 5, Hadith 28\nUSC-MSA web (English) reference  : Book 4, Hadith 1083\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ أَبُو بَكْرٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ النَّجْرَانِيِّ، قَالَ حَدَّثَنِي جُنْدَبٌ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم قَبْلَ أَنْ يَمُوتَ بِخَمْسٍ وَهُوَ يَقُولُ \" إِنِّي أَبْرَأُ إِلَى اللَّهِ أَنْ يَكُونَ لِي مِنْكُمْ خَلِيلٌ فَإِنَّ اللَّهَ تَعَالَى قَدِ اتَّخَذَنِي خَلِيلاً كَمَا اتَّخَذَ إِبْرَاهِيمَ خَلِيلاً وَلَوْ كُنْتُ مُتَّخِذًا مِنْ أُمَّتِي خَلِيلاً لاَتَّخَذْتُ أَبَا بَكْرٍ خَلِيلاً أَلاَ وَإِنَّ مَنْ كَانَ قَبْلَكُمْ كَانُوا يَتَّخِذُونَ قُبُورَ أَنْبِيَائِهِمْ وَصَالِحِيهِمْ مَسَاجِدَ أَلاَ فَلاَ تَتَّخِذُوا الْقُبُورَ مَسَاجِدَ إِنِّي أَنْهَاكُمْ عَنْ ذَلِكَ \" ."
  },
  "533": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 533b\nIn-book reference  : Book 5, Hadith 30\nUSC-MSA web (English) reference  : Book 4, Hadith 1085\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنِي أَبِي، عَنْ مَحْمُودِ بْنِ لَبِيدٍ، أَنَّ عُثْمَانَ بْنَ عَفَّانَ، أَرَادَ بِنَاءَ الْمَسْجِدِ فَكَرِهَ النَّاسُ ذَلِكَ فَأَحَبُّوا أَنْ يَدَعَهُ عَلَى هَيْئَتِهِ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ بَنَى مَسْجِدًا لِلَّهِ بَنَى اللَّهُ لَهُ فِي الْجَنَّةِ مِثْلَهُ \" ."
  },
  "534": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 534c\nIn-book reference  : Book 5, Hadith 33\nUSC-MSA web (English) reference  : Book 4, Hadith 1088\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، وَالأَسْوَدِ، أَنَّهُمَا دَخَلاَ عَلَى عَبْدِ اللَّهِ فَقَالَ أَصَلَّى مَنْ خَلْفَكُمْ قَالاَ نَعَمْ . فَقَامَ بَيْنَهُمَا وَجَعَلَ أَحَدَهُمَا عَنْ يَمِينِهِ وَالآخَرَ عَنْ شِمَالِهِ ثُمَّ رَكَعْنَا فَوَضَعْنَا أَيْدِيَنَا عَلَى رُكَبِنَا فَضَرَبَ أَيْدِيَنَا ثُمَّ طَبَّقَ بَيْنَ يَدَيْهِ ثُمَّ جَعَلَهُمَا بَيْنَ فَخِذَيْهِ فَلَمَّا صَلَّى قَالَ هَكَذَا فَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "535": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 535d\nIn-book reference  : Book 5, Hadith 37\nUSC-MSA web (English) reference  : Book 4, Hadith 1092\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي خَالِدٍ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنِ مُصْعَبِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ صَلَّيْتُ إِلَى جَنْبِ أَبِي فَلَمَّا رَكَعْتُ شَبَّكْتُ أَصَابِعِي وَجَعَلْتُهُمَا بَيْنَ رُكْبَتَىَّ فَضَرَبَ يَدَىَّ فَلَمَّا صَلَّى قَالَ قَدْ كُنَّا نَفْعَلُ هَذَا ثُمَّ أُمِرْنَا أَنْ نَرْفَعَ إِلَى الرُّكَبِ ."
  },
  "536": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 536\nIn-book reference  : Book 5, Hadith 38\nUSC-MSA web (English) reference  : Book 4, Hadith 1093\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح قَالَ وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ طَاوُسًا يَقُولُ قُلْنَا لاِبْنِ عَبَّاسٍ فِي الإِقْعَاءِ عَلَى الْقَدَمَيْنِ فَقَالَ هِيَ السُّنَّةُ . فَقُلْنَا لَهُ إِنَّا لَنَرَاهُ جَفَاءً بِالرَّجُلِ . فَقَالَ ابْنُ عَبَّاسٍ بَلْ هِيَ سُنَّةُ نَبِيِّكَ صلى الله عليه وسلم ."
  },
  "537": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 537b\nIn-book reference  : Book 5, Hadith 40\nUSC-MSA web (English) reference  : Book 4, Hadith 1095\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "538": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 538b\nIn-book reference  : Book 5, Hadith 42\nUSC-MSA web (English) reference  : Book 4, Hadith 1097\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي ابْنُ نُمَيْرٍ، حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ السَّلُولِيُّ، حَدَّثَنَا هُرَيْمُ بْنُ سُفْيَانَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . نَحْوَهُ ."
  },
  "539": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 539b\nIn-book reference  : Book 5, Hadith 44\nUSC-MSA web (English) reference  : Book 4, Hadith 1099\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَوَكِيعٌ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "540": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 540d\nIn-book reference  : Book 5, Hadith 48\nUSC-MSA web (English) reference  : Book 4, Hadith 1103\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُعَلَّى بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، حَدَّثَنَا كَثِيرُ بْنُ شِنْظِيرٍ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَاجَةٍ . بِمَعْنَى حَدِيثِ حَمَّادٍ ."
  },
  "541": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 541b\nIn-book reference  : Book 5, Hadith 50\nUSC-MSA web (English) reference  : Book 4, Hadith 1105\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ، هُوَ ابْنُ جَعْفَرٍ ح قَالَ وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، كِلاَهُمَا عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ وَلَيْسَ فِي حَدِيثِ ابْنِ جَعْفَرٍ قَوْلُهُ فَذَعَتُّهُ . وَأَمَّا ابْنُ أَبِي شَيْبَةَ فَقَالَ فِي رِوَايَتِهِ فَدَعَتُّهُ ."
  },
  "542": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 542\nIn-book reference  : Book 5, Hadith 51\nUSC-MSA web (English) reference  : Book 4, Hadith 1106\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، يَقُولُ حَدَّثَنِي رَبِيعَةُ بْنُ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمِعْنَاهُ يَقُولُ \" أَعُوذُ بِاللَّهِ مِنْكَ \" . ثُمَّ قَالَ \" أَلْعَنُكَ بِلَعْنَةِ اللَّهِ \" . ثَلاَثًا . وَبَسَطَ يَدَهُ كَأَنَّهُ يَتَنَاوَلُ شَيْئًا فَلَمَّا فَرَغَ مِنَ الصَّلاَةِ قُلْنَا يَا رَسُولَ اللَّهِ قَدْ سَمِعْنَاكَ تَقُولُ فِي الصَّلاَةِ شَيْئًا لَمْ نَسْمَعْكَ تَقُولُهُ قَبْلَ ذَلِكَ وَرَأَيْنَاكَ بَسَطْتَ يَدَكَ . قَالَ \" إِنَّ عَدُوَّ اللَّهِ إِبْلِيسَ جَاءَ بِشِهَابٍ مِنْ نَارٍ لِيَجْعَلَهُ فِي وَجْهِي فَقُلْتُ أَعُوذُ بِاللَّهِ مِنْكَ . ثَلاَثَ مَرَّاتٍ ثُمَّ قُلْتُ أَلْعَنُكَ بِلَعْنَةِ اللَّهِ التَّامَّةِ فَلَمْ يَسْتَأْخِرْ ثَلاَثَ مَرَّاتٍ ثُمَّ أَرَدْتُ أَخْذَهُ وَاللَّهِ لَوْلاَ دَعْوَةُ أَخِينَا سُلَيْمَانَ لأَصْبَحَ مُوثَقًا يَلْعَبُ بِهِ وِلْدَانُ أَهْلِ الْمَدِينَةِ \" ."
  },
  "543": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 543d\nIn-book reference  : Book 5, Hadith 55\nUSC-MSA web (English) reference  : Book 4, Hadith 1110\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، جَمِيعًا عَنْ سَعِيدٍ الْمَقْبُرِيِّ، عَنْ عَمْرِو بْنِ سُلَيْمٍ الزُّرَقِيِّ، سَمِعَ أَبَا قَتَادَةَ، يَقُولُ بَيْنَا نَحْنُ فِي الْمَسْجِدِ جُلُوسٌ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم . بِنَحْوِ حَدِيثِهِمْ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ أَنَّهُ أَمَّ النَّاسَ فِي تِلْكَ الصَّلاَةِ ."
  },
  "544": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 544b\nIn-book reference  : Book 5, Hadith 57\nUSC-MSA web (English) reference  : Book 4, Hadith 1112\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ عَبْدٍ الْقَارِيُّ الْقُرَشِيُّ، حَدَّثَنِي أَبُو حَازِمٍ، أَنَّ رِجَالاً، أَتَوْا سَهْلَ بْنَ سَعْدٍ ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، قَالُوا حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي حَازِمٍ، قَالَ أَتَوْا سَهْلَ بْنَ سَعْدٍ فَسَأَلُوهُ مِنْ أَىِّ شَىْءٍ مِنْبَرُ النَّبِيِّ صلى الله عليه وسلم وَسَاقُوا الْحَدِيثَ نَحْوَ حَدِيثِ ابْنِ أَبِي حَازِمٍ ."
  },
  "545": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 545\nIn-book reference  : Book 5, Hadith 58\nUSC-MSA web (English) reference  : Book 4, Hadith 1113\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي الْحَكَمُ بْنُ مُوسَى الْقَنْطَرِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ، وَأَبُو أُسَامَةَ جَمِيعًا عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يُصَلِّيَ الرَّجُلُ مُخْتَصِرًا . وَفِي رِوَايَةِ أَبِي بَكْرٍ قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "546": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 546b-d\nIn-book reference  : Book 5, Hadith 60\nUSC-MSA web (English) reference  : Book 4, Hadith 1115\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ حَدَّثَنِي ابْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ مُعَيْقِيبٍ، أَنَّهُمْ سَأَلُوا النَّبِيَّ صلى الله عليه وسلم عَنِ الْمَسْحِ فِي الصَّلاَةِ فَقَالَ \" وَاحِدَةٌ \" . وَحَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ . وَقَالَ فِيهِ حَدَّثَنِي مُعَيْقِيبٌ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ حَدَّثَنِي مُعَيْقِيبٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي الرَّجُلِ يُسَوِّي التُّرَابَ حَيْثُ يَسْجُدُ قَالَ \" إِنْ كُنْتَ فَاعِلاً فَوَاحِدَةً \" ."
  },
  "547": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 547b\nIn-book reference  : Book 5, Hadith 62\nUSC-MSA web (English) reference  : Book 4, Hadith 1117\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي جَمِيعًا، عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ رُمْحٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ رَأَى نُخَامَةً فِي قِبْلَةِ الْمَسْجِدِ . إِلاَّ الضَّحَّاكَ فَإِنَّ فِي حَدِيثِهِ نُخَامَةً فِي الْقِبْلَةِ . بِمَعْنَى حَدِيثِ مَالِكٍ ."
  },
  "548": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 548b\nIn-book reference  : Book 5, Hadith 64\nUSC-MSA web (English) reference  : Book 4, Hadith 1119\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، ح قَالَ وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، وَأَبَا، سَعِيدٍ أَخْبَرَاهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى نُخَامَةً . بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ ."
  },
  "549": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 549\nIn-book reference  : Book 5, Hadith 65\nUSC-MSA web (English) reference  : Book 4, Hadith 1120\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى بُصَاقًا فِي جِدَارِ الْقِبْلَةِ أَوْ مُخَاطًا أَوْ نُخَامَةً فَحَكَّهُ ."
  },
  "550": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 550b\nIn-book reference  : Book 5, Hadith 67\nUSC-MSA web (English) reference  : Book 4, Hadith 1122\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، ح قَالَ وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنِ الْقَاسِمِ بْنِ مِهْرَانَ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . نَحْوَ حَدِيثِ ابْنِ عُلَيَّةَ وَزَادَ فِي حَدِيثِ هُشَيْمٍ قَالَ أَبُو هُرَيْرَةَ كَأَنِّي أَنْظُرُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَرُدُّ ثَوْبَهُ بَعْضَهُ عَلَى بَعْضٍ ."
  },
  "551": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 551\nIn-book reference  : Book 5, Hadith 68\nUSC-MSA web (English) reference  : Book 4, Hadith 1123\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا كَانَ أَحَدُكُمْ فِي الصَّلاَةِ فَإِنَّهُ يُنَاجِي رَبَّهُ فَلاَ يَبْزُقَنَّ بَيْنَ يَدَيْهِ وَلاَ عَنْ يَمِينِهِ وَلَكِنْ عَنْ شِمَالِهِ تَحْتَ قَدَمِهِ \" ."
  },
  "552": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 552b\nIn-book reference  : Book 5, Hadith 70\nUSC-MSA web (English) reference  : Book 4, Hadith 1125\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، قَالَ سَأَلْتُ قَتَادَةَ عَنِ التَّفْلِ، فِي الْمَسْجِدِ فَقَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" التَّفْلُ فِي الْمَسْجِدِ خَطِيئَةٌ وَكَفَّارَتُهَا دَفْنُهَا \" ."
  },
  "553": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 553\nIn-book reference  : Book 5, Hadith 71\nUSC-MSA web (English) reference  : Book 4, Hadith 1126\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، وَشَيْبَانُ بْنُ فَرُّوخَ، قَالاَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ، مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" عُرِضَتْ عَلَىَّ أَعْمَالُ أُمَّتِي حَسَنُهَا وَسَيِّئُهَا فَوَجَدْتُ فِي مَحَاسِنِ أَعْمَالِهَا الأَذَى يُمَاطُ عَنِ الطَّرِيقِ وَوَجَدْتُ فِي مَسَاوِي أَعْمَالِهَا النُّخَاعَةَ تَكُونُ فِي الْمَسْجِدِ لاَ تُدْفَنُ \" ."
  },
  "554": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 554b\nIn-book reference  : Book 5, Hadith 73\nUSC-MSA web (English) reference  : Book 4, Hadith 1128\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الْعَلاَءِ، يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ عَنْ أَبِيهِ، أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم قَالَ فَتَنَخَّعَ فَدَلَكَهَا بِنَعْلِهِ الْيُسْرَى ."
  },
  "555": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 555b\nIn-book reference  : Book 5, Hadith 75\nUSC-MSA web (English) reference  : Book 4, Hadith 1130\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، حَدَّثَنَا سَعِيدُ بْنُ يَزِيدَ أَبُو مَسْلَمَةَ، قَالَ سَأَلْتُ أَنَسًا . بِمِثْلِهِ ."
  },
  "556": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 556c\nIn-book reference  : Book 5, Hadith 78\nUSC-MSA web (English) reference  : Book 4, Hadith 1133\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَتْ لَهُ خَمِيصَةٌ لَهَا عَلَمٌ فَكَانَ يَتَشَاغَلُ بِهَا فِي الصَّلاَةِ فَأَعْطَاهَا أَبَا جَهْمٍ وَأَخَذَ كِسَاءً لَهُ أَنْبِجَانِيًّا ."
  },
  "557": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 557b\nIn-book reference  : Book 5, Hadith 80\nUSC-MSA web (English) reference  : Book 4, Hadith 1135\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا قُرِّبَ الْعَشَاءُ وَحَضَرَتِ الصَّلاَةُ فَابْدَءُوا بِهِ قَبْلَ أَنْ تُصَلُّوا صَلاَةَ الْمَغْرِبِ وَلاَ تَعْجَلُوا عَنْ عَشَائِكُمْ \" ."
  },
  "558": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 558\nIn-book reference  : Book 5, Hadith 81\nUSC-MSA web (English) reference  : Book 4, Hadith 1136\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَحَفْصٌ، وَوَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ ابْنِ عُيَيْنَةَ عَنِ الزُّهْرِيِّ عَنْ أَنَسٍ ."
  },
  "559": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 559b\nIn-book reference  : Book 5, Hadith 83\nUSC-MSA web (English) reference  : Book 4, Hadith 1138\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ، حَدَّثَنِي أَنَسٌ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ مُوسَى بْنِ عُقْبَةَ، ح وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، عَنِ ابْنِ جُرَيْجٍ، ح قَالَ وَحَدَّثَنَا الصَّلْتُ بْنُ مَسْعُودٍ، حَدَّثَنَا سُفْيَانُ بْنُ مُوسَى، عَنْ أَيُّوبَ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ."
  },
  "560": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 560b\nIn-book reference  : Book 5, Hadith 85\nUSC-MSA web (English) reference  : Book 4, Hadith 1140\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - أَخْبَرَنِي أَبُو حَزْرَةَ الْقَاصُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عَتِيقٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَلَمْ يَذْكُرْ فِي الْحَدِيثِ قِصَّةَ الْقَاسِمِ ."
  },
  "561": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 561b\nIn-book reference  : Book 5, Hadith 87\nUSC-MSA web (English) reference  : Book 4, Hadith 1142\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ نُمَيْرٍ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ أَكَلَ مِنْ هَذِهِ الْبَقْلَةِ فَلاَ يَقْرَبَنَّ مَسَاجِدَنَا حَتَّى يَذْهَبَ رِيحُهَا \" . يَعْنِي الثُّومَ ."
  },
  "562": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 562\nIn-book reference  : Book 5, Hadith 88\nUSC-MSA web (English) reference  : Book 4, Hadith 1143\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ صُهَيْبٍ - قَالَ سُئِلَ أَنَسٌ عَنِ الثُّومِ، فَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرَبَنَّا وَلاَ يُصَلِّي مَعَنَا \" ."
  },
  "563": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 563\nIn-book reference  : Book 5, Hadith 89\nUSC-MSA web (English) reference  : Book 4, Hadith 1144\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ فَلاَ يَقْرَبَنَّ مَسْجِدَنَا وَلاَ يُؤْذِيَنَّا بِرِيحِ الثُّومِ \" ."
  },
  "564": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 564d\nIn-book reference  : Book 5, Hadith 93\nUSC-MSA web (English) reference  : Book 4, Hadith 1148\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح قَالَ وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالاَ جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ، بِهَذَا الإِسْنَادِ \" مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ - يُرِيدُ الثُّومَ - فَلاَ يَغْشَنَا فِي مَسْجِدِنَا \" . وَلَمْ يَذْكُرِ الْبَصَلَ وَالْكُرَّاثَ ."
  },
  "565": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 565\nIn-book reference  : Book 5, Hadith 94\nUSC-MSA web (English) reference  : Book 4, Hadith 1149\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ لَمْ نَعْدُ أَنْ فُتِحَتْ، خَيْبَرُ فَوَقَعْنَا أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي تِلْكَ الْبَقْلَةِ الثُّومِ وَالنَّاسُ جِيَاعٌ فَأَكَلْنَا مِنْهَا أَكْلاً شَدِيدًا ثُمَّ رُحْنَا إِلَى الْمَسْجِدِ فَوَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم الرِّيحَ فَقَالَ \" مَنْ أَكَلَ مِنْ هَذِهِ الشَّجَرَةِ الْخَبِيثَةِ شَيْئًا فَلاَ يَقْرَبَنَّا فِي الْمَسْجِدِ \" . فَقَالَ النَّاسُ حُرِّمَتْ حُرِّمَتْ . فَبَلَغَ ذَاكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" أَيُّهَا النَّاسُ إِنَّهُ لَيْسَ بِي تَحْرِيمُ مَا أَحَلَّ اللَّهُ لِي وَلَكِنَّهَا شَجَرَةٌ أَكْرَهُ رِيحَهَا \" ."
  },
  "566": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 566\nIn-book reference  : Book 5, Hadith 95\nUSC-MSA web (English) reference  : Book 4, Hadith 1150\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنِ ابْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى زَرَّاعَةِ بَصَلٍ هُوَ وَأَصْحَابُهُ فَنَزَلَ نَاسٌ مِنْهُمْ فَأَكَلُوا مِنْهُ وَلَمْ يَأْكُلْ آخَرُونَ فَرُحْنَا إِلَيْهِ فَدَعَا الَّذِينَ لَمْ يَأْكُلُوا الْبَصَلَ وَأَخَّرَ الآخَرِينَ حَتَّى ذَهَبَ رِيحُهَا ."
  },
  "567": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 567b\nIn-book reference  : Book 5, Hadith 97\nUSC-MSA web (English) reference  : Book 4, Hadith 1152\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، ح قَالَ وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنْ شَبَابَةَ بْنِ سَوَّارٍ، قَالَ حَدَّثَنَا شُعْبَةُ، جَمِيعًا عَنْ قَتَادَةَ، فِي هَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "568": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 568b\nIn-book reference  : Book 5, Hadith 99\nUSC-MSA web (English) reference  : Book 4, Hadith 1154\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْمُقْرِئُ، حَدَّثَنَا حَيْوَةُ، قَالَ سَمِعْتُ أَبَا الأَسْوَدِ، يَقُولُ حَدَّثَنِي أَبُو عَبْدِ اللَّهِ، مَوْلَى شَدَّادٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ . بِمِثْلِهِ ."
  },
  "569": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 569c\nIn-book reference  : Book 5, Hadith 102\nUSC-MSA web (English) reference  : Book 4, Hadith 1157\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ مُحَمَّدِ بْنِ شَيْبَةَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ جَاءَ أَعْرَابِيٌّ بَعْدَ مَا صَلَّى النَّبِيُّ صلى الله عليه وسلم صَلاَةَ الْفَجْرِ . فَأَدْخَلَ رَأْسَهُ مِنْ بَابِ الْمَسْجِدِ فَذَكَرَ . بِمِثْلِ حَدِيثِهِمَا . قَالَ مُسْلِمٌ هُوَ شَيْبَةُ بْنُ نَعَامَةَ أَبُو نَعَامَةَ رَوَى عَنْهُ مِسْعَرٌ وَهُشَيْمٌ وَجَرِيرٌ وَغَيْرُهُمْ مِنَ الْكُوفِيِّينَ ."
  },
  "389": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 389i\nIn-book reference  : Book 5, Hadith 106\nUSC-MSA web (English) reference  : Book 4, Hadith 1162\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الشَّيْطَانَ إِذَا ثُوِّبَ بِالصَّلاَةِ وَلَّى وَلَهُ ضُرَاطٌ \" . فَذَكَرَ نَحْوَهُ وَزَادَ \" فَهَنَّاهُ وَمَنَّاهُ وَذَكَّرَهُ مِنْ حَاجَاتِهِ مَا لَمْ يَكُنْ يَذْكُرُ \" ."
  },
  "570": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 570c\nIn-book reference  : Book 5, Hadith 109\nUSC-MSA web (English) reference  : Book 4, Hadith 1165\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ عَبْدِ اللَّهِ بْنِ مَالِكٍ ابْنِ بُحَيْنَةَ الأَزْدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ فِي الشَّفْعِ الَّذِي يُرِيدُ أَنْ يَجْلِسَ فِي صَلاَتِهِ فَمَضَى فِي صَلاَتِهِ فَلَمَّا كَانَ فِي آخِرِ الصَّلاَةِ سَجَدَ قَبْلَ أَنْ يُسَلِّمَ ثُمَّ سَلَّمَ ."
  },
  "571": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 571b\nIn-book reference  : Book 5, Hadith 111\nUSC-MSA web (English) reference  : Book 4, Hadith 1167\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنِي عَمِّي عَبْدُ اللَّهِ، حَدَّثَنِي دَاوُدُ بْنُ قَيْسٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، بِهَذَا الإِسْنَادِ وَفِي مَعْنَاهُ قَالَ \" يَسْجُدُ سَجْدَتَيْنِ قَبْلَ السَّلاَمِ \" . كَمَا قَالَ سُلَيْمَانُ بْنُ بِلاَلٍ ."
  },
  "572": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 572n\nIn-book reference  : Book 5, Hadith 125\nUSC-MSA web (English) reference  : Book 4, Hadith 1181\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، عَنْ زَائِدَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ صَلَّيْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِمَّا زَادَ أَوْ نَقَصَ - قَالَ إِبْرَاهِيمُ وَايْمُ اللَّهِ مَا جَاءَ ذَاكَ إِلاَّ مِنْ قِبَلِي - قَالَ فَقُلْنَا يَا رَسُولَ اللَّهِ أَحَدَثَ فِي الصَّلاَةِ شَىْءٌ فَقَالَ \" لاَ \" . قَالَ فَقُلْنَا لَهُ الَّذِي صَنَعَ فَقَالَ \" إِذَا زَادَ الرَّجُلُ أَوْ نَقَصَ فَلْيَسْجُدْ سَجْدَتَيْنِ \" . قَالَ ثُمَّ سَجَدَ سَجْدَتَيْنِ ."
  },
  "573": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 573e\nIn-book reference  : Book 5, Hadith 130\nUSC-MSA web (English) reference  : Book 4, Hadith 1186\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ شَيْبَانَ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَا أَنَا أُصَلِّي، مَعَ النَّبِيِّ صلى الله عليه وسلم صَلاَةَ الظُّهْرِ سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الرَّكْعَتَيْنِ فَقَامَ رَجُلٌ مِنْ بَنِي سُلَيْمٍ . وَاقْتَصَّ الْحَدِيثَ ."
  },
  "574": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 574b\nIn-book reference  : Book 5, Hadith 132\nUSC-MSA web (English) reference  : Book 4, Hadith 1188\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا خَالِدٌ، - وَهُوَ الْحَذَّاءُ - عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَلَّبِ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي ثَلاَثِ رَكَعَاتٍ مِنَ الْعَصْرِ ثُمَّ قَامَ فَدَخَلَ الْحُجْرَةَ فَقَامَ رَجُلٌ بَسِيطُ الْيَدَيْنِ فَقَالَ أَقُصِرَتِ الصَّلاَةُ يَا رَسُولَ اللَّهِ . فَخَرَجَ مُغْضَبًا فَصَلَّى الرَّكْعَةَ الَّتِي كَانَ تَرَكَ ثُمَّ سَلَّمَ ثُمَّ سَجَدَ سَجْدَتَىِ السَّهْوِ ثُمَّ سَلَّمَ ."
  },
  "575": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 575b\nIn-book reference  : Book 5, Hadith 134\nUSC-MSA web (English) reference  : Book 4, Hadith 1190\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ رُبَّمَا قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْقُرْآنَ فَيَمُرُّ بِالسَّجْدَةِ فَيَسْجُدُ بِنَا حَتَّى ازْدَحَمْنَا عِنْدَهُ حَتَّى مَا يَجِدُ أَحَدُنَا مَكَانًا لِيَسْجُدَ فِيهِ فِي غَيْرِ صَلاَةٍ ."
  },
  "576": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 576\nIn-book reference  : Book 5, Hadith 135\nUSC-MSA web (English) reference  : Book 4, Hadith 1191\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الأَسْوَدَ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَرَأَ { وَالنَّجْمِ} فَسَجَدَ فِيهَا وَسَجَدَ مَنْ كَانَ مَعَهُ غَيْرَ أَنَّ شَيْخًا أَخَذَ كَفًّا مِنْ حَصًى أَوْ تُرَابٍ فَرَفَعَهُ إِلَى جَبْهَتِهِ وَقَالَ يَكْفِينِي هَذَا . قَالَ عَبْدُ اللَّهِ لَقَدْ رَأَيْتُهُ بَعْدُ قُتِلَ كَافِرًا ."
  },
  "577": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 577\nIn-book reference  : Book 5, Hadith 136\nUSC-MSA web (English) reference  : Book 4, Hadith 1192\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، وَهُوَ ابْنُ جَعْفَرٍ عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنِ ابْنِ قُسَيْطٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، أَنَّهُ أَخْبَرَهُ أَنَّهُ، سَأَلَ زَيْدَ بْنَ ثَابِتٍ عَنِ الْقِرَاءَةِ، مَعَ الإِمَامِ فَقَالَ لاَ قِرَاءَةَ مَعَ الإِمَامِ فِي شَىْءٍ . وَزَعَمَ أَنَّهُ قَرَأَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم { وَالنَّجْمِ إِذَا هَوَى} فَلَمْ يَسْجُدْ ."
  },
  "578": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 578h\nIn-book reference  : Book 5, Hadith 144\nUSC-MSA web (English) reference  : Book 4, Hadith 1200\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، عَنْ أَبِي رَافِعٍ، قَالَ رَأَيْتُ أَبَا هُرَيْرَةَ يَسْجُدُ فِي { إِذَا السَّمَاءُ انْشَقَّتْ} فَقُلْتُ تَسْجُدُ فِيهَا فَقَالَ نَعَمْ رَأَيْتُ خَلِيلِي صلى الله عليه وسلم يَسْجُدُ فِيهَا فَلاَ أَزَالُ أَسْجُدُ فِيهَا حَتَّى أَلْقَاهُ . قَالَ شُعْبَةُ قُلْتُ النَّبِيَّ صلى الله عليه وسلم . قَالَ نَعَمْ ."
  },
  "579": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 579b\nIn-book reference  : Book 5, Hadith 146\nUSC-MSA web (English) reference  : Book 4, Hadith 1202\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ عَجْلاَنَ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عَامِرِ بْنِ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَعَدَ يَدْعُو وَضَعَ يَدَهُ الْيُمْنَى عَلَى فَخِذِهِ الْيُمْنَى وَيَدَهُ الْيُسْرَى عَلَى فَخِذِهِ الْيُسْرَى وَأَشَارَ بِإِصْبَعِهِ السَّبَّابَةِ وَوَضَعَ إِبْهَامَهُ عَلَى إِصْبَعِهِ الْوُسْطَى وَيُلْقِمُ كَفَّهُ الْيُسْرَى رُكْبَتَهُ ."
  },
  "580": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 580d\nIn-book reference  : Book 5, Hadith 150\nUSC-MSA web (English) reference  : Book 4, Hadith 1205\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مُسْلِمِ بْنِ أَبِي مَرْيَمَ، عَنْ عَلِيِّ بْنِ عَبْدِ الرَّحْمَنِ الْمُعَاوِيِّ، قَالَ صَلَّيْتُ إِلَى جَنْبِ ابْنِ عُمَرَ . فَذَكَرَ نَحْوَ حَدِيثِ مَالِكٍ وَزَادَ قَالَ سُفْيَانُ فَكَانَ يَحْيَى بْنُ سَعِيدٍ حَدَّثَنَا بِهِ عَنْ مُسْلِمٍ ثُمَّ حَدَّثَنِيهِ مُسْلِمٌ ."
  },
  "581": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 581b\nIn-book reference  : Book 5, Hadith 152\nUSC-MSA web (English) reference  : Book 4, Hadith 1207\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنْ عَبْدِ اللَّهِ، - قَالَ شُعْبَةُ - رَفَعَهُ مَرَّةً - أَنَّ أَمِيرًا أَوْ رَجُلاً سَلَّمَ تَسْلِيمَتَيْنِ فَقَالَ عَبْدُ اللَّهِ أَنَّى عَلِقَهَا"
  },
  "582": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 582\nIn-book reference  : Book 5, Hadith 153\nUSC-MSA web (English) reference  : Book 4, Hadith 1208\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ كُنْتُ أَرَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُسَلِّمُ عَنْ يَمِينِهِ وَعَنْ يَسَارِهِ حَتَّى أَرَى بَيَاضَ خَدِّهِ ."
  },
  "583": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 583c\nIn-book reference  : Book 5, Hadith 156\nUSC-MSA web (English) reference  : Book 4, Hadith 1211\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح قَالَ وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، أَنَّ أَبَا مَعْبَدٍ، مَوْلَى ابْنِ عَبَّاسٍ أَخْبَرَهُ أَنَّ ابْنَ عَبَّاسٍ أَخْبَرَهُ أَنَّ رَفْعَ الصَّوْتِ بِالذِّكْرِ حِينَ يَنْصَرِفُ النَّاسُ مِنَ الْمَكْتُوبَةِ كَانَ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم . وَأَنَّهُ قَالَ قَالَ ابْنُ عَبَّاسٍ كُنْتُ أَعْلَمُ إِذَا انْصَرَفُوا بِذَلِكَ إِذَا سَمِعْتُهُ ."
  },
  "584": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 584\nIn-book reference  : Book 5, Hadith 157\nUSC-MSA web (English) reference  : Book 4, Hadith 1212\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالَ هَارُونُ حَدَّثَنَا وَقَالَ، حَرْمَلَةُ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي امْرَأَةٌ مِنَ الْيَهُودِ وَهْىَ تَقُولُ هَلْ شَعَرْتِ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ قَالَتْ فَارْتَاعَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ \" إِنَّمَا تُفْتَنُ يَهُودُ \" . قَالَتْ عَائِشَةُ فَلَبِثْنَا لَيَالِيَ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" هَلْ شَعَرْتِ أَنَّهُ أُوحِيَ إِلَىَّ أَنَّكُمْ تُفْتَنُونَ فِي الْقُبُورِ \" . قَالَتْ عَائِشَةُ فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدُ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ ."
  },
  "585": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 585\nIn-book reference  : Book 5, Hadith 158\nUSC-MSA web (English) reference  : Book 4, Hadith 1213\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ، وَحَرْمَلَةُ بْنُ يَحْيَى، وَعَمْرُو بْنُ سَوَّادٍ، قَالَ حَرْمَلَةُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعْدَ ذَلِكَ يَسْتَعِيذُ مِنْ عَذَابِ الْقَبْرِ ."
  },
  "586": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 586b\nIn-book reference  : Book 5, Hadith 160\nUSC-MSA web (English) reference  : Book 4, Hadith 1215\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، بِهَذَا الْحَدِيثِ وَفِيهِ قَالَتْ وَمَا صَلَّى صَلاَةً بَعْدَ ذَلِكَ إِلاَّ سَمِعْتُهُ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ ."
  },
  "587": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 587\nIn-book reference  : Book 5, Hadith 161\nUSC-MSA web (English) reference  : Book 4, Hadith 1216\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَسْتَعِيذُ فِي صَلاَتِهِ مِنْ فِتْنَةِ الدَّجَّالِ ."
  },
  "588": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 588g\nIn-book reference  : Book 5, Hadith 169\nUSC-MSA web (English) reference  : Book 4, Hadith 1224\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ بُدَيْلٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَتَعَوَّذُ مِنْ عَذَابِ الْقَبْرِ وَعَذَابِ جَهَنَّمَ وَفِتْنَةِ الدَّجَّالِ ."
  },
  "589": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 589\nIn-book reference  : Book 5, Hadith 163\nUSC-MSA web (English) reference  : Book 4, Hadith 1218\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَدْعُو فِي الصَّلاَةِ \" اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَمِ \" . قَالَتْ فَقَالَ لَهُ قَائِلٌ مَا أَكْثَرَ مَا تَسْتَعِيذُ مِنَ الْمَغْرَمِ يَا رَسُولَ اللَّهِ . فَقَالَ \" إِنَّ الرَّجُلَ إِذَا غَرِمَ حَدَّثَ فَكَذَبَ وَوَعَدَ فَأَخْلَفَ \" ."
  },
  "590": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 590\nIn-book reference  : Book 5, Hadith 170\nUSC-MSA web (English) reference  : Book 4, Hadith 1225\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، - فِيمَا قُرِئَ عَلَيْهِ - عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُعَلِّمُهُمْ هَذَا الدُّعَاءَ كَمَا يُعَلِّمُهُمُ السُّورَةَ مِنَ الْقُرْآنِ يَقُولُ \" قُولُوا اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ وَأَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ \" . قَالَ مُسْلِمُ بْنُ الْحَجَّاجِ بَلَغَنِي أَنَّ طَاوُسًا قَالَ لاِبْنِهِ أَدَعَوْتَ بِهَا فِي صَلاَتِكَ فَقَالَ لاَ . قَالَ أَعِدْ صَلاَتَكَ لأَنَّ طَاوُسًا رَوَاهُ عَنْ ثَلاَثَةٍ أَوْ أَرْبَعَةٍ أَوْ كَمَا قَالَ ."
  },
  "591": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 591\nIn-book reference  : Book 5, Hadith 171\nUSC-MSA web (English) reference  : Book 4, Hadith 1226\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنْ أَبِي عَمَّارٍ، - اسْمُهُ شَدَّادُ بْنُ عَبْدِ اللَّهِ - عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا انْصَرَفَ مِنْ صَلاَتِهِ اسْتَغْفَرَ ثَلاَثًا وَقَالَ \" اللَّهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ ذَا الْجَلاَلِ وَالإِكْرَامِ \" . قَالَ الْوَلِيدُ فَقُلْتُ لِلأَوْزَاعِيِّ كَيْفَ الاِسْتِغْفَارُ قَالَ تَقُولُ أَسْتَغْفِرُ اللَّهَ أَسْتَغْفِرُ اللَّهَ ."
  },
  "592": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 592c\nIn-book reference  : Book 5, Hadith 174\nUSC-MSA web (English) reference  : Book 4, Hadith 1229\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَاصِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، وَخَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، كِلاَهُمَا عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ . بِمِثْلِهِ غَيْرَ أَنَّهُ كَانَ يَقُولُ \" يَا ذَا الْجَلاَلِ وَالإِكْرَامِ \" ."
  },
  "593": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 593e\nIn-book reference  : Book 5, Hadith 179\nUSC-MSA web (English) reference  : Book 4, Hadith 1234\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا عَبْدَةُ بْنُ أَبِي لُبَابَةَ، وَعَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، سَمِعَا وَرَّادًا، كَاتِبَ الْمُغِيرَةِ بْنِ شُعْبَةَ يَقُولُ كَتَبَ مُعَاوِيَةُ إِلَى الْمُغِيرَةِ اكْتُبْ إِلَىَّ بِشَىْءٍ سَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَ فَكَتَبَ إِلَيْهِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ إِذَا قَضَى الصَّلاَةَ \" لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ \" ."
  },
  "594": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 594e\nIn-book reference  : Book 5, Hadith 183\nUSC-MSA web (English) reference  : Book 4, Hadith 1238\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ سَالِمٍ، عَنْ مُوسَى بْنِ عُقْبَةَ، أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، وَهُوَ يَقُولُ فِي إِثْرِ الصَّلاَةِ إِذَا سَلَّمَ . بِمِثْلِ حَدِيثِهِمَا وَقَالَ فِي آخِرِهِ وَكَانَ يَذْكُرُ ذَلِكَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "595": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 595b\nIn-book reference  : Book 5, Hadith 185\nUSC-MSA web (English) reference  : Book 4, Hadith 1240\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالدَّرَجَاتِ الْعُلَى وَالنَّعِيمِ الْمُقِيمِ . بِمِثْلِ حَدِيثِ قُتَيْبَةَ عَنِ اللَّيْثِ إِلاَّ أَنَّهُ أَدْرَجَ فِي حَدِيثِ أَبِي هُرَيْرَةَ قَوْلَ أَبِي صَالِحٍ ثُمَّ رَجَعَ فُقَرَاءُ الْمُهَاجِرِينَ . إِلَى آخِرِ الْحَدِيثِ وَزَادَ فِي الْحَدِيثِ يَقُولُ سُهَيْلٌ إِحْدَى عَشْرَةَ إِحْدَى عَشْرَةَ فَجَمِيعُ ذَلِكَ كُلِّهُ ثَلاَثَةٌ وَثَلاَثُونَ ."
  },
  "596": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 596b-c\nIn-book reference  : Book 5, Hadith 187\nUSC-MSA web (English) reference  : Book 4, Hadith 1242\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا حَمْزَةُ الزَّيَّاتُ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ كَعْبِ بْنِ عُجْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مُعَقِّبَاتٌ لاَ يَخِيبُ قَائِلُهُنَّ - أَوْ فَاعِلُهُنَّ - ثَلاَثٌ وَثَلاَثُونَ تَسْبِيحَةً وَثَلاَثٌ وَثَلاَثُونَ تَحْمِيدَةً وَأَرْبَعٌ وَثَلاَثُونَ تَكْبِيرَةً فِي دُبُرِ كُلِّ صَلاَةٍ \" . حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا أَسْبَاطُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَمْرُو بْنُ قَيْسٍ الْمُلاَئِيُّ، عَنِ الْحَكَمِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "597": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 597b\nIn-book reference  : Book 5, Hadith 189\nUSC-MSA web (English) reference  : Book 4, Hadith 1244\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنْ سُهَيْلٍ، عَنْ أَبِي عُبَيْدٍ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "598": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 598a-b\nIn-book reference  : Book 5, Hadith 190\nUSC-MSA web (English) reference  : Book 4, Hadith 1245\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا كَبَّرَ فِي الصَّلاَةِ سَكَتَ هُنَيَّةً قَبْلَ أَنْ يَقْرَأَ فَقُلْتُ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي أَرَأَيْتَ سُكُوتَكَ بَيْنَ التَّكْبِيرِ وَالْقِرَاءَةِ مَا تَقُولُ قَالَ \" أَقُولُ اللَّهُمَّ بَاعِدْ بَيْنِي وَبَيْنَ خَطَايَاىَ كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ اللَّهُمَّ نَقِّنِي مِنْ خَطَايَاىَ كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّنَسِ اللَّهُمَّ اغْسِلْنِي مِنْ خَطَايَاىَ بِالثَّلْجِ وَالْمَاءِ وَالْبَرَدِ \" . حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وَحَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - كِلاَهُمَا عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ جَرِيرٍ ."
  },
  "599": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 599\nIn-book reference  : Book 5, Hadith 191\nUSC-MSA web (English) reference  : Book 4, Hadith 1246\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "قَالَ مُسْلِمٌ وَحُدِّثْتُ عَنْ يَحْيَى بْنِ حَسَّانَ، وَيُونُسَ الْمُؤَدِّبِ، و غَيْرِهِمَا قَالُوا حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالَ حَدَّثَنِي عُمَارَةُ بْنُ الْقَعْقَاعِ، حَدَّثَنَا أَبُو زُرْعَةَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا نَهَضَ مِنَ الرَّكْعَةِ الثَّانِيَةِ اسْتَفْتَحَ الْقِرَاءَةَ بِـ { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ} وَلَمْ يَسْكُتْ ."
  },
  "600": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 600\nIn-book reference  : Book 5, Hadith 192\nUSC-MSA web (English) reference  : Book 4, Hadith 1247\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا قَتَادَةُ، وَثَابِتٌ، وَحُمَيْدٌ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، جَاءَ فَدَخَلَ الصَّفَّ وَقَدْ حَفَزَهُ النَّفَسُ فَقَالَ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ . فَلَمَّا قَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَتَهُ قَالَ \" أَيُّكُمُ الْمُتَكَلِّمُ بِالْكَلِمَاتِ \" . فَأَرَمَّ الْقَوْمُ فَقَالَ \" أَيُّكُمُ الْمُتَكَلِّمُ بِهَا فَإِنَّهُ لَمْ يَقُلْ بَأْسًا \" . فَقَالَ رَجُلٌ جِئْتُ وَقَدْ حَفَزَنِي النَّفَسُ فَقُلْتُهَا . فَقَالَ \" لَقَدْ رَأَيْتُ اثْنَىْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا أَيُّهُمْ يَرْفَعُهَا \" ."
  },
  "601": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 601\nIn-book reference  : Book 5, Hadith 193\nUSC-MSA web (English) reference  : Book 4, Hadith 1248\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، أَخْبَرَنِي الْحَجَّاجُ بْنُ أَبِي عُثْمَانَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنِ ابْنِ عُمَرَ، قَالَ بَيْنَمَا نَحْنُ نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم إِذْ قَالَ رَجُلٌ مِنَ الْقَوْمِ اللَّهُ أَكْبَرُ كَبِيرًا وَالْحَمْدُ لِلَّهِ كَثِيرًا وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنِ الْقَائِلُ كَلِمَةَ كَذَا وَكَذَا \" . قَالَ رَجُلٌ مِنَ الْقَوْمِ أَنَا يَا رَسُولَ اللَّهِ . قَالَ \" عَجِبْتُ لَهَا فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ \" . قَالَ ابْنُ عُمَرَ فَمَا تَرَكْتُهُنَّ مُنْذُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ذَلِكَ ."
  },
  "602": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 602d\nIn-book reference  : Book 5, Hadith 197\nUSC-MSA web (English) reference  : Book 4, Hadith 1252\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْفُضَيْلُ، - يَعْنِي ابْنَ عِيَاضٍ - عَنْ هِشَامٍ، ح قَالَ وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا ثُوِّبَ بِالصَّلاَةِ فَلاَ يَسْعَ إِلَيْهَا أَحَدُكُمْ وَلَكِنْ لِيَمْشِ وَعَلَيْهِ السَّكِينَةُ وَالْوَقَارُ صَلِّ مَا أَدْرَكْتَ وَاقْضِ مَا سَبَقَكَ \" ."
  },
  "603": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 603b\nIn-book reference  : Book 5, Hadith 199\nUSC-MSA web (English) reference  : Book 4, Hadith 1254\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُعَاوِيَةُ بْنُ هِشَامٍ، حَدَّثَنَا شَيْبَانُ، بِهَذَا الإِسْنَادِ ."
  },
  "604": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 604a-b\nIn-book reference  : Book 5, Hadith 200\nUSC-MSA web (English) reference  : Book 4, Hadith 1255\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حَجَّاجٍ الصَّوَّافِ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، وَعَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا أُقِيمَتِ الصَّلاَةُ فَلاَ تَقُومُوا حَتَّى تَرَوْنِي \" . وَقَالَ ابْنُ حَاتِمٍ \" إِذَا أُقِيمَتْ أَوْ نُودِيَ \" . وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مَعْمَرٍ، قَالَ أَبُو بَكْرٍ وَحَدَّثَنَا ابْنُ عُلَيَّةَ، عَنْ حَجَّاجِ بْنِ أَبِي عُثْمَانَ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، وَعَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، وَقَالَ، إِسْحَاقُ أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ شَيْبَانَ، كُلُّهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم . وَزَادَ إِسْحَاقُ فِي رِوَايَتِهِ حَدِيثَ مَعْمَرٍ وَشَيْبَانَ \" حَتَّى تَرَوْنِي قَدْ خَرَجْتُ \" ."
  },
  "605": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 605c\nIn-book reference  : Book 5, Hadith 203\nUSC-MSA web (English) reference  : Book 4, Hadith 1258\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ الصَّلاَةَ، كَانَتْ تُقَامُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَيَأْخُذُ النَّاسُ مَصَافَّهُمْ قَبْلَ أَنْ يَقُومَ النَّبِيُّ صلى الله عليه وسلم مَقَامَهُ ."
  },
  "606": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 606\nIn-book reference  : Book 5, Hadith 204\nUSC-MSA web (English) reference  : Book 4, Hadith 1259\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ بِلاَلٌ يُؤَذِّنُ إِذَا دَحَضَتْ فَلاَ يُقِيمُ حَتَّى يَخْرُجَ النَّبِيُّ صلى الله عليه وسلم فَإِذَا خَرَجَ أَقَامَ الصَّلاَةَ حِينَ يَرَاهُ ."
  },
  "607": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 607c\nIn-book reference  : Book 5, Hadith 207\nUSC-MSA web (English) reference  : Book 4, Hadith 1262\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا ابْنُ عُيَيْنَةَ، ح قَالَ وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، عَنْ مَعْمَرٍ، وَالأَوْزَاعِيِّ، وَمَالِكِ بْنِ أَنَسٍ، وَيُونُسَ، ح قَالَ وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، قَالَ وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، كُلُّ هَؤُلاَءِ عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ يَحْيَى عَنْ مَالِكٍ وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ \" مَعَ الإِمَامِ \" . وَفِي حَدِيثِ عُبَيْدِ اللَّهِ قَالَ \" فَقَدْ أَدْرَكَ الصَّلاَةَ كُلَّهَا \" ."
  },
  "608": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 608d\nIn-book reference  : Book 5, Hadith 212\nUSC-MSA web (English) reference  : Book 4, Hadith 1267\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ مَعْمَرًا، بِهَذَا الإِسْنَادِ ."
  },
  "609": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 609\nIn-book reference  : Book 5, Hadith 210\nUSC-MSA web (English) reference  : Book 4, Hadith 1264\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنَا عُرْوَةُ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ح قَالَ وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، كِلاَهُمَا عَنِ ابْنِ وَهْبٍ، - وَالسِّيَاقُ لِحَرْمَلَةَ - قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَدْرَكَ مِنَ الْعَصْرِ سَجْدَةً قَبْلَ أَنْ تَغْرُبَ الشَّمْسُ أَوْ مِنَ الصُّبْحِ قَبْلَ أَنْ تَطْلُعَ فَقَدْ أَدْرَكَهَا \" . وَالسَّجْدَةُ إِنَّمَا هِيَ الرَّكْعَةُ ."
  },
  "610": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 610b\nIn-book reference  : Book 5, Hadith 214\nUSC-MSA web (English) reference  : Book 4, Hadith 1269\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهُوَ بِالْكُوفَةِ فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ \" بِهَذَا أُمِرْتُ \" . فَقَالَ عُمَرُ لِعُرْوَةَ انْظُرْ مَا تُحَدِّثُ يَا عُرْوَةُ أَوَإِنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ هُوَ أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ فَقَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ يُحَدِّثُ عَنْ أَبِيهِ ."
  },
  "611": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 611d\nIn-book reference  : Book 5, Hadith 218\nUSC-MSA web (English) reference  : Book 4, Hadith 1272\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الْعَصْرَ وَالشَّمْسُ وَاقِعَةٌ فِي حُجْرَتِي ."
  },
  "612": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 612f\nIn-book reference  : Book 5, Hadith 224\nUSC-MSA web (English) reference  : Book 4, Hadith 1277\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، لاَ يُسْتَطَاعُ الْعِلْمُ بِرَاحَةِ الْجِسْمِ ."
  },
  "613": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 613b\nIn-book reference  : Book 5, Hadith 226\nUSC-MSA web (English) reference  : Book 4, Hadith 1279\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ السَّامِيُّ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ عَنْ مَوَاقِيتِ الصَّلاَةِ فَقَالَ \" اشْهَدْ مَعَنَا الصَّلاَةَ \" . فَأَمَرَ بِلاَلاً فَأَذَّنَ بِغَلَسٍ فَصَلَّى الصُّبْحَ حِينَ طَلَعَ الْفَجْرُ ثُمَّ أَمَرَهُ بِالظُّهْرِ حِينَ زَالَتِ الشَّمْسُ عَنْ بَطْنِ السَّمَاءِ ثُمَّ أَمَرَهُ بِالْعَصْرِ وَالشَّمْسُ مُرْتَفِعَةٌ ثُمَّ أَمَرَهُ بِالْمَغْرِبِ حِينَ وَجَبَتِ الشَّمْسُ ثُمَّ أَمَرَهُ بِالْعِشَاءِ حِينَ وَقَعَ الشَّفَقُ ثُمَّ أَمَرَهُ الْغَدَ فَنَوَّرَ بِالصُّبْحِ ثُمَّ أَمَرَهُ بِالظُّهْرِ فَأَبْرَدَ ثُمَّ أَمَرَهُ بِالْعَصْرِ وَالشَّمْسُ بَيْضَاءُ نَقِيَّةٌ لَمْ تُخَالِطْهَا صُفْرَةٌ ثُمَّ أَمَرَهُ بِالْمَغْرِبِ قَبْلَ أَنْ يَقَعَ الشَّفَقُ ثُمَّ أَمَرَهُ بِالْعِشَاءِ عِنْدَ ذَهَابِ ثُلُثِ اللَّيْلِ أَوْ بَعْضِهِ - شَكَّ حَرَمِيٌّ - فَلَمَّا أَصْبَحَ قَالَ \" أَيْنَ السَّائِلُ مَا بَيْنَ مَا رَأَيْتَ وَقْتٌ \" ."
  },
  "614": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 614b\nIn-book reference  : Book 5, Hadith 228\nUSC-MSA web (English) reference  : Book 4, Hadith 1281\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ بَدْرِ بْنِ عُثْمَانَ، عَنْ أَبِي بَكْرِ بْنِ أَبِي مُوسَى، سَمِعَهُ مِنْهُ، عَنْ أَبِيهِ، أَنَّ سَائِلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَسَأَلَهُ عَنْ مَوَاقِيتِ الصَّلاَةِ . بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ غَيْرَ أَنَّهُ قَالَ فَصَلَّى الْمَغْرِبَ قَبْلَ أَنْ يَغِيبَ الشَّفَقُ فِي الْيَوْمِ الثَّانِي ."
  },
  "615": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 615e\nIn-book reference  : Book 5, Hadith 233\nUSC-MSA web (English) reference  : Book 4, Hadith 1288\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَبْرِدُوا عَنِ الْحَرِّ فِي الصَّلاَةِ فَإِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ \" ."
  },
  "616": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 616\nIn-book reference  : Book 5, Hadith 234\nUSC-MSA web (English) reference  : Book 4, Hadith 1289\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ مُهَاجِرًا أَبَا الْحَسَنِ، يُحَدِّثُ أَنَّهُ سَمِعَ زَيْدَ بْنَ وَهْبٍ، يُحَدِّثُ عَنْ أَبِي ذَرٍّ، قَالَ أَذَّنَ مُؤَذِّنُ رَسُولِ اللَّهِ صلى الله عليه وسلم بِالظُّهْرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَبْرِدْ أَبْرِدْ \" . أَوْ قَالَ \" انْتَظِرِ انْتَظِرْ \" . وَقَالَ \" إِنَّ شِدَّةَ الْحَرِّ مِنْ فَيْحِ جَهَنَّمَ فَإِذَا اشْتَدَّ الْحَرُّ فَأَبْرِدُوا عَنِ الصَّلاَةِ \" . قَالَ أَبُو ذَرٍّ حَتَّى رَأَيْنَا فَىْءَ التُّلُولِ ."
  },
  "617": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 617c\nIn-book reference  : Book 5, Hadith 237\nUSC-MSA web (English) reference  : Book 4, Hadith 1292\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا حَيْوَةُ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" قَالَتِ النَّارُ رَبِّ أَكَلَ بَعْضِي بَعْضًا فَأْذَنْ لِي أَتَنَفَّسْ . فَأَذِنَ لَهَا بِنَفَسَيْنِ نَفَسٍ فِي الشِّتَاءِ وَنَفَسٍ فِي الصَّيْفِ فَمَا وَجَدْتُمْ مِنْ بَرْدٍ أَوْ زَمْهَرِيرٍ فَمِنْ نَفَسِ جَهَنَّمَ وَمَا وَجَدْتُمْ مِنْ حَرٍّ أَوْ حَرُورٍ فَمِنْ نَفَسِ جَهَنَّمَ \" ."
  },
  "618": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 618\nIn-book reference  : Book 5, Hadith 238\nUSC-MSA web (English) reference  : Book 4, Hadith 1293\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، كِلاَهُمَا عَنْ يَحْيَى الْقَطَّانِ، وَابْنِ، مَهْدِيٍّ - قَالَ ابْنُ الْمُثَنَّى حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، - عَنْ شُعْبَةَ، قَالَ حَدَّثَنَا سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ ابْنُ الْمُثَنَّى وَحَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الظُّهْرَ إِذَا دَحَضَتِ الشَّمْسُ ."
  },
  "619": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 619b\nIn-book reference  : Book 5, Hadith 240\nUSC-MSA web (English) reference  : Book 4, Hadith 1295\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، وَعَوْنُ بْنُ سَلاَّمٍ، - قَالَ عَوْنٌ أَخْبَرَنَا وَقَالَ ابْنُ يُونُسَ، وَاللَّفْظُ، لَهُ حَدَّثَنَا زُهَيْرٌ، - قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ سَعِيدِ بْنِ وَهْبٍ، عَنْ خَبَّابٍ، قَالَ أَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فَشَكَوْنَا إِلَيْهِ حَرَّ الرَّمْضَاءِ فَلَمْ يُشْكِنَا . قَالَ زُهَيْرٌ قُلْتُ لأَبِي إِسْحَاقَ أَفِي الظُّهْرِ قَالَ نَعَمْ . قُلْتُ أَفِي تَعْجِيلِهَا قَالَ نَعَمْ ."
  },
  "620": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 620\nIn-book reference  : Book 5, Hadith 241\nUSC-MSA web (English) reference  : Book 4, Hadith 1296\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، عَنْ غَالِبٍ الْقَطَّانِ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِدَّةِ الْحَرِّ فَإِذَا لَمْ يَسْتَطِعْ أَحَدُنَا أَنْ يُمَكِّنَ جَبْهَتَهُ مِنَ الأَرْضِ بَسَطَ ثَوْبَهُ فَسَجَدَ عَلَيْهِ ."
  },
  "621": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 621d\nIn-book reference  : Book 5, Hadith 245\nUSC-MSA web (English) reference  : Book 4, Hadith 1300\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا نُصَلِّي الْعَصْرَ ثُمَّ يَخْرُجُ الإِنْسَانُ إِلَى بَنِي عَمْرِو بْنِ عَوْفٍ فَيَجِدُهُمْ يُصَلُّونَ الْعَصْرَ ."
  },
  "622": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 622\nIn-book reference  : Book 5, Hadith 246\nUSC-MSA web (English) reference  : Book 4, Hadith 1301\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ دَخَلَ عَلَى أَنَسِ بْنِ مَالِكٍ فِي دَارِهِ بِالْبَصْرَةِ حِينَ انْصَرَفَ مِنَ الظُّهْرِ وَدَارُهُ بِجَنْبِ الْمَسْجِدِ فَلَمَّا دَخَلْنَا عَلَيْهِ قَالَ أَصَلَّيْتُمُ الْعَصْرَ فَقُلْنَا لَهُ إِنَّمَا انْصَرَفْنَا السَّاعَةَ مِنَ الظُّهْرِ . قَالَ فَصَلُّوا الْعَصْرَ . فَقُمْنَا فَصَلَّيْنَا فَلَمَّا انْصَرَفْنَا قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" تِلْكَ صَلاَةُ الْمُنَافِقِ يَجْلِسُ يَرْقُبُ الشَّمْسَ حَتَّى إِذَا كَانَتْ بَيْنَ قَرْنَىِ الشَّيْطَانِ قَامَ فَنَقَرَهَا أَرْبَعًا لاَ يَذْكُرُ اللَّهَ فِيهَا إِلاَّ قَلِيلاً \" ."
  },
  "623": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 623\nIn-book reference  : Book 5, Hadith 247\nUSC-MSA web (English) reference  : Book 4, Hadith 1302\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ أَبِي بَكْرِ بْنِ عُثْمَانَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ بْنَ سَهْلٍ، يَقُولُ صَلَّيْنَا مَعَ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ الظُّهْرَ ثُمَّ خَرَجْنَا حَتَّى دَخَلْنَا عَلَى أَنَسِ بْنِ مَالِكٍ فَوَجَدْنَاهُ يُصَلِّي الْعَصْرَ فَقُلْتُ يَا عَمِّ مَا هَذِهِ الصَّلاَةُ الَّتِي صَلَّيْتَ قَالَ الْعَصْرُ وَهَذِهِ صَلاَةُ رَسُولِ اللَّهِ صلى الله تعالى عليه وسلم الَّتِي كُنَّا نُصَلِّي مَعَهُ ."
  },
  "624": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 624\nIn-book reference  : Book 5, Hadith 248\nUSC-MSA web (English) reference  : Book 4, Hadith 1303\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، وَمُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، وَأَحْمَدُ بْنُ عِيسَى، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالَ عَمْرٌو أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ مُوسَى بْنَ سَعْدٍ الأَنْصَارِيَّ، حَدَّثَهُ عَنْ حَفْصِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ صَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْعَصْرَ فَلَمَّا انْصَرَفَ أَتَاهُ رَجُلٌ مِنْ بَنِي سَلِمَةَ فَقَالَ يَا رَسُولَ اللَّهِ إِنَّا نُرِيدُ أَنْ نَنْحَرَ جَزُورًا لَنَا وَنَحْنُ نُحِبُّ أَنْ تَحْضُرَهَا . قَالَ \" نَعَمْ \" . فَانْطَلَقَ وَانْطَلَقْنَا مَعَهُ فَوَجَدْنَا الْجَزُورَ لَمْ تُنْحَرْ فَنُحِرَتْ ثُمَّ قُطِّعَتْ ثُمَّ طُبِخَ مِنْهَا ثُمَّ أَكَلْنَا قَبْلَ أَنْ تَغِيبَ الشَّمْسُ . وَقَالَ الْمُرَادِيُّ حَدَّثَنَا ابْنُ وَهْبٍ عَنِ ابْنِ لَهِيعَةَ وَعَمْرِو بْنِ الْحَارِثِ فِي هَذَا الْحَدِيثِ ."
  },
  "625": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 625b\nIn-book reference  : Book 5, Hadith 250\nUSC-MSA web (English) reference  : Book 4, Hadith 1305\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، وَشُعَيْبُ بْنُ إِسْحَاقَ الدِّمَشْقِيُّ، قَالاَ حَدَّثَنَا الأَوْزَاعِيُّ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ كُنَّا نَنْحَرُ الْجَزُورَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم بَعْدَ الْعَصْرِ . وَلَمْ يَقُلْ كُنَّا نُصَلِّي مَعَهُ ."
  },
  "626": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 626c\nIn-book reference  : Book 5, Hadith 253\nUSC-MSA web (English) reference  : Book 4, Hadith 1308\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ فَاتَتْهُ الْعَصْرُ فَكَأَنَّمَا وُتِرَ أَهْلَهُ وَمَالَهُ \" ."
  },
  "627": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 627f\nIn-book reference  : Book 5, Hadith 259\nUSC-MSA web (English) reference  : Book 4, Hadith 1314\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، عَنْ شُتَيْرِ بْنِ شَكَلٍ، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ الأَحْزَابِ \" شَغَلُونَا عَنِ الصَّلاَةِ الْوُسْطَى صَلاَةِ الْعَصْرِ مَلأَ اللَّهُ بُيُوتَهُمْ وَقُبُورَهُمْ نَارًا \" . ثُمَّ صَلاَّهَا بَيْنَ الْعِشَاءَيْنِ بَيْنَ الْمَغْرِبِ وَالْعِشَاءِ ."
  },
  "628": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 628\nIn-book reference  : Book 5, Hadith 260\nUSC-MSA web (English) reference  : Book 4, Hadith 1315\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا عَوْنُ بْنُ سَلاَّمٍ الْكُوفِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ طَلْحَةَ الْيَامِيُّ، عَنْ زُبَيْدٍ، عَنْ مُرَّةَ، عَنْ عَبْدِ اللَّهِ، قَالَ حَبَسَ الْمُشْرِكُونَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ صَلاَةِ الْعَصْرِ حَتَّى احْمَرَّتِ الشَّمْسُ أَوِ اصْفَرَّتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" شَغَلُونَا عَنِ الصَّلاَةِ الْوُسْطَى صَلاَةِ الْعَصْرِ مَلأَ اللَّهُ أَجْوَافَهُمْ وَقُبُورَهُمْ نَارًا \" . أَوْ قَالَ \" حَشَا اللَّهُ أَجْوَافَهُمْ وَقُبُورَهُمْ نَارًا \" ."
  },
  "629": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 629\nIn-book reference  : Book 5, Hadith 261\nUSC-MSA web (English) reference  : Book 4, Hadith 1316\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنِ الْقَعْقَاعِ بْنِ حَكِيمٍ، عَنْ أَبِي يُونُسَ، مَوْلَى عَائِشَةَ أَنَّهُ قَالَ أَمَرَتْنِي عَائِشَةُ أَنْ أَكْتُبَ لَهَا مُصْحَفًا وَقَالَتْ إِذَا بَلَغْتَ هَذِهِ الآيَةَ فَآذِنِّي { حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى} فَلَمَّا بَلَغْتُهَا آذَنْتُهَا فَأَمْلَتْ عَلَىَّ حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى وَصَلاَةِ الْعَصْرِ . وَقُومُوا لِلَّهِ قَانِتِينَ . قَالَتْ عَائِشَةُ سَمِعْتُهَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "630": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 630\nIn-book reference  : Book 5, Hadith 262\nUSC-MSA web (English) reference  : Book 4, Hadith 1317\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا الْفُضَيْلُ بْنُ مَرْزُوقٍ، عَنْ شَقِيقِ بْنِ عُقْبَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ نَزَلَتْ هَذِهِ الآيَةُ حَافِظُوا عَلَى الصَّلَوَاتِ وَصَلاَةِ الْعَصْرِ . فَقَرَأْنَاهَا مَا شَاءَ اللَّهُ ثُمَّ نَسَخَهَا اللَّهُ فَنَزَلَتْ { حَافِظُوا عَلَى الصَّلَوَاتِ وَالصَّلاَةِ الْوُسْطَى} فَقَالَ رَجُلٌ كَانَ جَالِسًا عِنْدَ شَقِيقٍ لَهُ هِيَ إِذًا صَلاَةُ الْعَصْرِ . فَقَالَ الْبَرَاءُ قَدْ أَخْبَرْتُكَ كَيْفَ نَزَلَتْ وَكَيْفَ نَسَخَهَا اللَّهُ . وَاللَّهُ أَعْلَمُ .\nقَالَ مُسْلِمٌ وَرَوَاهُ الأَشْجَعِيُّ عَنْ سُفْيَانَ الثَّوْرِيِّ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ شَقِيقِ بْنِ عُقْبَةَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَرَأْنَاهَا مَعَ النَّبِيِّ صلى الله عليه وسلم زَمَانًا . بِمِثْلِ حَدِيثِ فُضَيْلِ بْنِ مَرْزُوقٍ ."
  },
  "631": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 631b\nIn-book reference  : Book 5, Hadith 264\nUSC-MSA web (English) reference  : Book 4, Hadith 1319\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا وَكِيعٌ، عَنْ عَلِيِّ بْنِ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ ."
  },
  "632": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 632b\nIn-book reference  : Book 5, Hadith 266\nUSC-MSA web (English) reference  : Book 4, Hadith 1321\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" وَالْمَلاَئِكَةُ يَتَعَاقَبُونَ فِيكُمْ \" . بِمِثْلِ حَدِيثِ أَبِي الزِّنَادِ ."
  },
  "633": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 633b\nIn-book reference  : Book 5, Hadith 268\nUSC-MSA web (English) reference  : Book 4, Hadith 1323\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ وَوَكِيعٌ بِهَذَا الإِسْنَادِ وَقَالَ \" أَمَا إِنَّكُمْ سَتُعْرَضُونَ عَلَى رَبِّكُمْ فَتَرَوْنَهُ كَمَا تَرَوْنَ هَذَا الْقَمَرَ \" . وَقَالَ ثُمَّ قَرَأَ . وَلَمْ يَقُلْ جَرِيرٌ ."
  },
  "634": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 634b\nIn-book reference  : Book 5, Hadith 270\nUSC-MSA web (English) reference  : Book 4, Hadith 1325\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا شَيْبَانُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنِ ابْنِ عُمَارَةَ بْنِ رُؤَيْبَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَلِجُ النَّارَ مَنْ صَلَّى قَبْلَ طُلُوعِ الشَّمْسِ وَقَبْلَ غُرُوبِهَا \" . وَعِنْدَهُ رَجُلٌ مِنْ أَهْلِ الْبَصْرَةِ فَقَالَ آنْتَ سَمِعْتَ هَذَا مِنَ النَّبِيِّ صلى الله عليه وسلم قَالَ نَعَمْ أَشْهَدُ بِهِ عَلَيْهِ . قَالَ وَأَنَا أَشْهَدُ لَقَدْ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُهُ بِالْمَكَانِ الَّذِي سَمِعْتَهُ مِنْهُ ."
  },
  "635": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 635b\nIn-book reference  : Book 5, Hadith 272\nUSC-MSA web (English) reference  : Book 4, Hadith 1327\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، ح قَالَ وَحَدَّثَنَا ابْنُ خِرَاشٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، قَالاَ جَمِيعًا حَدَّثَنَا هَمَّامٌ، بِهَذَا الإِسْنَادِ وَنَسَبَا أَبَا بَكْرٍ فَقَالاَ ابْنُ أَبِي مُوسَى ."
  },
  "636": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 636\nIn-book reference  : Book 5, Hadith 273\nUSC-MSA web (English) reference  : Book 4, Hadith 1328\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ - عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْمَغْرِبَ إِذَا غَرَبَتِ الشَّمْسُ وَتَوَارَتْ بِالْحِجَابِ ."
  },
  "637": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 637b\nIn-book reference  : Book 5, Hadith 275\nUSC-MSA web (English) reference  : Book 4, Hadith 1330\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا شُعَيْبُ بْنُ إِسْحَاقَ الدِّمَشْقِيُّ، حَدَّثَنَا الأَوْزَاعِيُّ، حَدَّثَنِي أَبُو النَّجَاشِيِّ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ كُنَّا نُصَلِّي الْمَغْرِبَ . بِنَحْوِهِ ."
  },
  "638": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 638c\nIn-book reference  : Book 5, Hadith 278\nUSC-MSA web (English) reference  : Book 4, Hadith 1333\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ حَاتِمٍ، كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ بَكْرٍ، ح قَالَ وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، ح قَالَ وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالُوا جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي الْمُغِيرَةُ بْنُ حَكِيمٍ، عَنْ أُمِّ كُلْثُومٍ بِنْتِ أَبِي بَكْرٍ، أَنَّهَا أَخْبَرَتْهُ عَنْ عَائِشَةَ، قَالَتْ أَعْتَمَ النَّبِيُّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ حَتَّى ذَهَبَ عَامَّةُ اللَّيْلِ وَحَتَّى نَامَ أَهْلُ الْمَسْجِدِ ثُمَّ خَرَجَ فَصَلَّى فَقَالَ \" إِنَّهُ لَوَقْتُهَا لَوْلاَ أَنْ أَشُقَّ عَلَى أُمَّتِي \" . وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ \" لَوْلاَ أَنْ يَشُقَّ عَلَى أُمَّتِي \" ."
  },
  "639": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 639b\nIn-book reference  : Book 5, Hadith 280\nUSC-MSA web (English) reference  : Book 4, Hadith 1335\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي نَافِعٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم شُغِلَ عَنْهَا لَيْلَةً فَأَخَّرَهَا حَتَّى رَقَدْنَا فِي الْمَسْجِدِ ثُمَّ اسْتَيْقَظْنَا ثُمَّ رَقَدْنَا ثُمَّ اسْتَيْقَظْنَا ثُمَّ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ \" لَيْسَ أَحَدٌ مِنْ أَهْلِ الأَرْضِ اللَّيْلَةَ يَنْتَظِرُ الصَّلاَةَ غَيْرُكُمْ \" ."
  },
  "640": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 640c\nIn-book reference  : Book 5, Hadith 283\nUSC-MSA web (English) reference  : Book 4, Hadith 1338\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ الصَّبَّاحِ الْعَطَّارُ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْمَجِيدِ الْحَنَفِيُّ، حَدَّثَنَا قُرَّةُ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ ثُمَّ أَقْبَلَ عَلَيْنَا بِوَجْهِهِ ."
  },
  "641": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 641\nIn-book reference  : Book 5, Hadith 284\nUSC-MSA web (English) reference  : Book 4, Hadith 1339\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو عَامِرٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كُنْتُ أَنَا وَأَصْحَابِي الَّذِينَ، قَدِمُوا مَعِي فِي السَّفِينَةِ نُزُولاً فِي بَقِيعِ بُطْحَانَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بِالْمَدِينَةِ فَكَانَ يَتَنَاوَبُ رَسُولَ اللَّهِ صلى الله عليه وسلم عِنْدَ صَلاَةِ الْعِشَاءِ كُلَّ لَيْلَةٍ نَفَرٌ مِنْهُمْ قَالَ أَبُو مُوسَى فَوَافَقْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم أَنَا وَأَصْحَابِي وَلَهُ بَعْضُ الشُّغُلِ فِي أَمْرِهِ حَتَّى أَعْتَمَ بِالصَّلاَةِ حَتَّى ابْهَارَّ اللَّيْلُ ثُمَّ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَلَّى بِهِمْ فَلَمَّا قَضَى صَلاَتَهُ قَالَ لِمَنْ حَضَرَهُ \" عَلَى رِسْلِكُمْ أُعْلِمُكُمْ وَأَبْشِرُوا أَنَّ مِنْ نِعْمَةِ اللَّهِ عَلَيْكُمْ أَنَّهُ لَيْسَ مِنَ النَّاسِ أَحَدٌ يُصَلِّي هَذِهِ السَّاعَةَ غَيْرُكُمْ \" . أَوْ قَالَ \" مَا صَلَّى هَذِهِ السَّاعَةَ أَحَدٌ غَيْرُكُمْ \" . لاَ نَدْرِي أَىَّ الْكَلِمَتَيْنِ قَالَ قَالَ أَبُو مُوسَى فَرَجَعْنَا فَرِحِينَ بِمَا سَمِعْنَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "642": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 642\nIn-book reference  : Book 5, Hadith 285\nUSC-MSA web (English) reference  : Book 4, Hadith 1340\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ قُلْتُ لِعَطَاءٍ أَىُّ حِينٍ أَحَبُّ إِلَيْكَ أَنْ أُصَلِّيَ الْعِشَاءَ الَّتِي يَقُولُهَا النَّاسُ الْعَتَمَةَ إِمَامًا وَخِلْوًا قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ أَعْتَمَ نَبِيُّ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ الْعِشَاءَ - قَالَ - حَتَّى رَقَدَ نَاسٌ وَاسْتَيْقَظُوا وَرَقَدُوا وَاسْتَيْقَظُوا فَقَامَ عُمَرُ بْنُ الْخَطَّابِ فَقَالَ الصَّلاَةَ . فَقَالَ عَطَاءٌ قَالَ ابْنُ عَبَّاسٍ فَخَرَجَ نَبِيُّ اللَّهِ صلى الله عليه وسلم كَأَنِّي أَنْظُرُ إِلَيْهِ الآنَ يَقْطُرُ رَأْسُهُ مَاءً وَاضِعًا يَدَهُ عَلَى شِقِّ رَأْسِهِ قَالَ \" لَوْلاَ أَنْ يَشُقَّ عَلَى أُمَّتِي لأَمَرْتُهُمْ أَنْ يُصَلُّوهَا كَذَلِكَ \" . قَالَ فَاسْتَثْبَتُّ عَطَاءً كَيْفَ وَضَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ عَلَى رَأْسِهِ كَمَا أَنْبَأَهُ ابْنُ عَبَّاسٍ فَبَدَّدَ لِي عَطَاءٌ بَيْنَ أَصَابِعِهِ شَيْئًا مِنْ تَبْدِيدٍ ثُمَّ وَضَعَ أَطْرَافَ أَصَابِعِهِ عَلَى قَرْنِ الرَّأْسِ ثُمَّ صَبَّهَا يُمِرُّهَا كَذَلِكَ عَلَى الرَّأْسِ حَتَّى مَسَّتْ إِبْهَامُهُ طَرَفَ الأُذُنِ مِمَّا يَلِي الْوَجْهَ ثُمَّ عَلَى الصُّدْغِ وَنَاحِيَةِ اللِّحْيَةِ لاَ يُقَصِّرُ وَلاَ يَبْطِشُ بِشَىْءٍ إِلاَّ كَذَلِكَ . قُلْتُ لِعَطَاءٍ كَمْ ذُكِرَ لَكَ أَخَّرَهَا النَّبِيُّ صلى الله عليه وسلم لَيْلَتَئِذٍ قَالَ لاَ أَدْرِي . قَالَ عَطَاءٌ أَحَبُّ إِلَىَّ أَنْ أُصَلِّيَهَا إِمَامًا وَخِلْوًا مُؤَخَّرَةً كَمَا صَلاَّهَا النَّبِيُّ صلى الله عليه وسلم لَيْلَتَئِذٍ فَإِنْ شَقَّ عَلَيْكَ ذَلِكَ خِلْوًا أَوْ عَلَى النَّاسِ فِي الْجَمَاعَةِ وَأَنْتَ إِمَامُهُمْ فَصَلِّهَا وَسَطًا لاَ مُعَجَّلَةً وَلاَ مُؤَخَّرَةً ."
  },
  "643": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 643b\nIn-book reference  : Book 5, Hadith 287\nUSC-MSA web (English) reference  : Book 4, Hadith 1342\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي الصَّلَوَاتِ نَحْوًا مِنْ صَلاَتِكُمْ وَكَانَ يُؤَخِّرُ الْعَتَمَةَ بَعْدَ صَلاَتِكُمْ شَيْئًا وَكَانَ يُخِفُّ الصَّلاَةَ . وَفِي رِوَايَةِ أَبِي كَامِلٍ يُخَفِّفُ ."
  },
  "644": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 644b\nIn-book reference  : Book 5, Hadith 289\nUSC-MSA web (English) reference  : Book 4, Hadith 1344\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَغْلِبَنَّكُمُ الأَعْرَابُ عَلَى اسْمِ صَلاَتِكُمُ الْعِشَاءِ فَإِنَّهَا فِي كِتَابِ اللَّهِ الْعِشَاءُ وَإِنَّهَا تُعْتِمُ بِحِلاَبِ الإِبِلِ \" ."
  },
  "645": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 645c\nIn-book reference  : Book 5, Hadith 292\nUSC-MSA web (English) reference  : Book 4, Hadith 1347\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَإِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالاَ حَدَّثَنَا مَعْنٌ، عَنْ مَالِكٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيُصَلِّي الصُّبْحَ فَيَنْصَرِفُ النِّسَاءُ مُتَلَفِّعَاتٍ بِمُرُوطِهِنَّ مَا يُعْرَفْنَ مِنَ الْغَلَسِ . وَقَالَ الأَنْصَارِيُّ فِي رِوَايَتِهِ مُتَلَفِّفَاتٍ ."
  },
  "646": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 646b\nIn-book reference  : Book 5, Hadith 294\nUSC-MSA web (English) reference  : Book 4, Hadith 1349\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدٍ، سَمِعَ مُحَمَّدَ بْنَ عَمْرِو بْنِ الْحَسَنِ بْنِ عَلِيٍّ، قَالَ كَانَ الْحَجَّاجُ يُؤَخِّرُ الصَّلَوَاتِ فَسَأَلْنَا جَابِرَ بْنَ عَبْدِ اللَّهِ بِمِثْلِ حَدِيثِ غُنْدَرٍ ."
  },
  "647": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 647c\nIn-book reference  : Book 5, Hadith 297\nUSC-MSA web (English) reference  : Book 4, Hadith 1352\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا سُوَيْدُ بْنُ عَمْرٍو الْكَلْبِيُّ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ سَيَّارِ بْنِ سَلاَمَةَ أَبِي الْمِنْهَالِ، قَالَ سَمِعْتُ أَبَا بَرْزَةَ الأَسْلَمِيَّ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُؤَخِّرُ الْعِشَاءَ إِلَى ثُلُثِ اللَّيْلِ وَيَكْرَهُ النَّوْمَ قَبْلَهَا وَالْحَدِيثَ بَعْدَهَا وَكَانَ يَقْرَأُ فِي صَلاَةِ الْفَجْرِ مِنَ الْمِائَةِ إِلَى السِّتِّينَ وَكَانَ يَنْصَرِفُ حِينَ يَعْرِفُ بَعْضُنَا وَجْهَ بَعْضٍ ."
  },
  "648": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 648g\nIn-book reference  : Book 5, Hadith 304\nUSC-MSA web (English) reference  : Book 4, Hadith 1359\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، - وَهْوَ ابْنُ هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ مَطَرٍ، عَنْ أَبِي الْعَالِيَةِ الْبَرَّاءِ، قَالَ قُلْتُ لِعَبْدِ اللَّهِ بْنِ الصَّامِتِ نُصَلِّي يَوْمَ الْجُمُعَةِ خَلْفَ أُمَرَاءَ فَيُؤَخِّرُونَ الصَّلاَةَ - قَالَ - فَضَرَبَ فَخِذِي ضَرْبَةً أَوْجَعَتْنِي وَقَالَ سَأَلْتُ أَبَا ذَرٍّ عَنْ ذَلِكَ فَضَرَبَ فَخِذِي وَقَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ ذَلِكَ فَقَالَ \" صَلُّوا الصَّلاَةَ لِوَقْتِهَا وَاجْعَلُوا صَلاَتَكُمْ مَعَهُمْ نَافِلَةً \" . قَالَ وَقَالَ عَبْدُ اللَّهِ ذُكِرَ لِي أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم ضَرَبَ فَخِذَ أَبِي ذَرٍّ ."
  },
  "649": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 649l\nIn-book reference  : Book 5, Hadith 345\nUSC-MSA web (English) reference  : Book 4, Hadith 1400\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ هَذَا ."
  },
  "650": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 650d\nIn-book reference  : Book 5, Hadith 313\nUSC-MSA web (English) reference  : Book 4, Hadith 1368\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ ابْنُ رَافِعٍ، أَخْبَرَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" بِضْعًا وَعِشْرِينَ \" ."
  },
  "651": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 651d\nIn-book reference  : Book 5, Hadith 317\nUSC-MSA web (English) reference  : Book 4, Hadith 1372\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ عَنْ وَكِيعٍ، عَنْ جَعْفَرِ بْنِ بُرْقَانَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِنَحْوِهِ ."
  },
  "652": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 652\nIn-book reference  : Book 5, Hadith 318\nUSC-MSA web (English) reference  : Book 4, Hadith 1373\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، سَمِعَهُ مِنْهُ، عَنْ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِقَوْمٍ يَتَخَلَّفُونَ عَنِ الْجُمُعَةِ \" لَقَدْ هَمَمْتُ أَنْ آمُرَ رَجُلاً يُصَلِّي بِالنَّاسِ ثُمَّ أُحَرِّقَ عَلَى رِجَالٍ يَتَخَلَّفُونَ عَنِ الْجُمُعَةِ بُيُوتَهُمْ \" ."
  },
  "653": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 653\nIn-book reference  : Book 5, Hadith 319\nUSC-MSA web (English) reference  : Book 4, Hadith 1374\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَسُوَيْدُ بْنُ سَعِيدٍ، وَيَعْقُوبُ الدَّوْرَقِيُّ، كُلُّهُمْ عَنْ مَرْوَانَ الْفَزَارِيِّ، - قَالَ قُتَيْبَةُ حَدَّثَنَا الْفَزَارِيُّ، - عَنْ عُبَيْدِ اللَّهِ بْنِ الأَصَمِّ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَتَى النَّبِيَّ صلى الله عليه وسلم رَجُلٌ أَعْمَى فَقَالَ يَا رَسُولَ اللَّهِ إِنَّهُ لَيْسَ لِي قَائِدٌ يَقُودُنِي إِلَى الْمَسْجِدِ . فَسَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَنْ يُرَخِّصَ لَهُ فَيُصَلِّيَ فِي بَيْتِهِ فَرَخَّصَ لَهُ فَلَمَّا وَلَّى دَعَاهُ فَقَالَ \" هَلْ تَسْمَعُ النِّدَاءَ بِالصَّلاَةِ \" . فَقَالَ نَعَمْ . قَالَ \" فَأَجِبْ \" ."
  },
  "654": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 654b\nIn-book reference  : Book 5, Hadith 321\nUSC-MSA web (English) reference  : Book 4, Hadith 1376\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، عَنْ أَبِي الْعُمَيْسِ، عَنْ عَلِيِّ بْنِ الأَقْمَرِ، عَنْ أَبِي الأَحْوَصِ، عَنْ عَبْدِ اللَّهِ، قَالَ مَنْ سَرَّهُ أَنْ يَلْقَى اللَّهَ غَدًا مُسْلِمًا فَلْيُحَافِظْ عَلَى هَؤُلاَءِ الصَّلَوَاتِ حَيْثُ يُنَادَى بِهِنَّ فَإِنَّ اللَّهَ شَرَعَ لِنَبِيِّكُمْ صلى الله عليه وسلم سُنَنَ الْهُدَى وَإِنَّهُنَّ مِنْ سُنَنِ الْهُدَى وَلَوْ أَنَّكُمْ صَلَّيْتُمْ فِي بُيُوتِكُمْ كَمَا يُصَلِّي هَذَا الْمُتَخَلِّفُ فِي بَيْتِهِ لَتَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ وَلَوْ تَرَكْتُمْ سُنَّةَ نَبِيِّكُمْ لَضَلَلْتُمْ وَمَا مِنْ رَجُلٍ يَتَطَهَّرُ فَيُحْسِنُ الطُّهُورَ ثُمَّ يَعْمِدُ إِلَى مَسْجِدٍ مِنْ هَذِهِ الْمَسَاجِدِ إِلاَّ كَتَبَ اللَّهُ لَهُ بِكُلِّ خَطْوَةٍ يَخْطُوهَا حَسَنَةً وَيَرْفَعُهُ بِهَا دَرَجَةً وَيَحُطُّ عَنْهُ بِهَا سَيِّئَةً وَلَقَدْ رَأَيْتُنَا وَمَا يَتَخَلَّفُ عَنْهَا إِلاَّ مُنَافِقٌ مَعْلُومُ النِّفَاقِ وَلَقَدْ كَانَ الرَّجُلُ يُؤْتَى بِهِ يُهَادَى بَيْنَ الرَّجُلَيْنِ حَتَّى يُقَامَ فِي الصَّفِّ ."
  },
  "655": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 655b\nIn-book reference  : Book 5, Hadith 323\nUSC-MSA web (English) reference  : Book 4, Hadith 1378\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، - هُوَ ابْنُ عُيَيْنَةَ - عَنْ عُمَرَ بْنِ سَعِيدٍ، عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ الْمُحَارِبِيِّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، وَرَأَى، رَجُلاً يَجْتَازُ الْمَسْجِدَ خَارِجًا بَعْدَ الأَذَانِ فَقَالَ أَمَّا هَذَا فَقَدْ عَصَى أَبَا الْقَاسِمِ صلى الله عليه وسلم ."
  },
  "656": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 656b\nIn-book reference  : Book 5, Hadith 325\nUSC-MSA web (English) reference  : Book 4, Hadith 1380\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَسَدِيُّ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنْ سُفْيَانَ، عَنْ أَبِي سَهْلٍ، عُثْمَانَ بْنِ حَكِيمٍ بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "657": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 657c\nIn-book reference  : Book 5, Hadith 328\nUSC-MSA web (English) reference  : Book 4, Hadith 1383\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ هَارُونَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنِ الْحَسَنِ، عَنْ جُنْدَبِ بْنِ سُفْيَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا وَلَمْ يَذْكُرْ \" فَيَكُبَّهُ فِي نَارِ جَهَنَّمَ \" ."
  },
  "33": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 33e\nIn-book reference  : Book 5, Hadith 331\nUSC-MSA web (English) reference  : Book 4, Hadith 1386\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي الزُّهْرِيُّ، عَنْ مَحْمُودِ بْنِ الرَّبِيعِ، قَالَ إِنِّي لأَعْقِلُ مَجَّةً مَجَّهَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ دَلْوٍ فِي دَارِنَا . قَالَ مَحْمُودٌ فَحَدَّثَنِي عِتْبَانُ بْنُ مَالِكٍ قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّ بَصَرِي قَدْ سَاءَ . وَسَاقَ الْحَدِيثَ إِلَى قَوْلِهِ فَصَلَّى بِنَا رَكْعَتَيْنِ وَحَبَسْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى جَشِيشَةٍ صَنَعْنَاهَا لَهُ . وَلَمْ يَذْكُرْ مَا بَعْدَهُ مِنْ زِيَادَةِ يُونُسَ وَمَعْمَرٍ ."
  },
  "658": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 658\nIn-book reference  : Book 5, Hadith 332\nUSC-MSA web (English) reference  : Book 4, Hadith 1387\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ جَدَّتَهُ، مُلَيْكَةَ دَعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم لِطَعَامٍ صَنَعَتْهُ فَأَكَلَ مِنْهُ ثُمَّ قَالَ \" قُومُوا فَأُصَلِّيَ لَكُمْ \" . قَالَ أَنَسُ بْنُ مَالِكٍ فَقُمْتُ إِلَى حَصِيرٍ لَنَا قَدِ اسْوَدَّ مِنْ طُولِ مَا لُبِسَ فَنَضَحْتُهُ بِمَاءٍ فَقَامَ عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم وَصَفَفْتُ أَنَا وَالْيَتِيمُ وَرَاءَهُ وَالْعَجُوزُ مِنْ وَرَائِنَا فَصَلَّى لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ انْصَرَفَ ."
  },
  "659": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 659\nIn-book reference  : Book 5, Hadith 333\nUSC-MSA web (English) reference  : Book 4, Hadith 1388\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو الرَّبِيعِ، كِلاَهُمَا عَنْ عَبْدِ الْوَارِثِ، قَالَ شَيْبَانُ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ خُلُقًا فَرُبَّمَا تَحْضُرُ الصَّلاَةُ وَهْوَ فِي بَيْتِنَا فَيَأْمُرُ بِالْبِسَاطِ الَّذِي تَحْتَهُ فَيُكْنَسُ ثُمَّ يُنْضَحُ ثُمَّ يَؤُمُّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَقُومُ خَلْفَهُ فَيُصَلِّي بِنَا وَكَانَ بِسَاطُهُمْ مِنْ جَرِيدِ النَّخْلِ ."
  },
  "660": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 660c\nIn-book reference  : Book 5, Hadith 336\nUSC-MSA web (English) reference  : Book 4, Hadith 1391\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - قَالَ حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ ."
  },
  "513": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 513b\nIn-book reference  : Book 5, Hadith 337\nUSC-MSA web (English) reference  : Book 4, Hadith 1392\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، كِلاَهُمَا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، قَالَ حَدَّثَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَأَنَا حِذَاءَهُ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ وَكَانَ يُصَلِّي عَلَى خُمْرَةٍ ."
  },
  "661": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 661\nIn-book reference  : Book 5, Hadith 338\nUSC-MSA web (English) reference  : Book 4, Hadith 1393\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، جَمِيعًا عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ الْخُدْرِيُّ، أَنَّهُ دَخَلَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدَهُ يُصَلِّي عَلَى حَصِيرٍ يَسْجُدُ عَلَيْهِ ."
  },
  "662": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 662\nIn-book reference  : Book 5, Hadith 346\nUSC-MSA web (English) reference  : Book 4, Hadith 1401\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَعْظَمَ النَّاسِ أَجْرًا فِي الصَّلاَةِ أَبْعَدُهُمْ إِلَيْهَا مَمْشًى فَأَبْعَدُهُمْ وَالَّذِي يَنْتَظِرُ الصَّلاَةَ حَتَّى يُصَلِّيَهَا مَعَ الإِمَامِ أَعْظَمُ أَجْرًا مِنَ الَّذِي يُصَلِّيهَا ثُمَّ يَنَامُ \" . وَفِي رِوَايَةِ أَبِي كُرَيْبٍ \" حَتَّى يُصَلِّيَهَا مَعَ الإِمَامِ فِي جَمَاعَةٍ \" ."
  },
  "663": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 663d\nIn-book reference  : Book 5, Hadith 350\nUSC-MSA web (English) reference  : Book 4, Hadith 1405\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، كِلاَهُمَا عَنِ ابْنِ عُيَيْنَةَ، ح وَحَدَّثَنَا سَعِيدُ بْنُ أَزْهَرَ الْوَاسِطِيُّ، قَالَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا أَبِي كُلُّهُمْ، عَنْ عَاصِمٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "664": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 664\nIn-book reference  : Book 5, Hadith 351\nUSC-MSA web (English) reference  : Book 4, Hadith 1406\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو الزُّبَيْرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كَانَتْ دِيَارُنَا نَائِيَةً عَنِ الْمَسْجِدِ، فَأَرَدْنَا أَنْ نَبِيعَ، بُيُوتَنَا فَنَقْتَرِبَ مِنَ الْمَسْجِدِ فَنَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" إِنَّ لَكُمْ بِكُلِّ خُطْوَةٍ دَرَجَةً \" ."
  },
  "665": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 665b\nIn-book reference  : Book 5, Hadith 353\nUSC-MSA web (English) reference  : Book 4, Hadith 1408\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ كَهْمَسًا، يُحَدِّثُ عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ أَرَادَ بَنُو سَلِمَةَ أَنْ يَتَحَوَّلُوا، إِلَى قُرْبِ الْمَسْجِدِ . - قَالَ - وَالْبِقَاعُ خَالِيَةٌ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" يَا بَنِي سَلِمَةَ دِيَارَكُمْ تُكْتَبْ آثَارُكُمْ \" . فَقَالُوا مَا كَانَ يَسُرُّنَا أَنَّا كُنَّا تَحَوَّلْنَا ."
  },
  "666": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 666\nIn-book reference  : Book 5, Hadith 354\nUSC-MSA web (English) reference  : Book 4, Hadith 1409\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، - يَعْنِي ابْنَ عَمْرٍو - عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ الأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ تَطَهَّرَ فِي بَيْتِهِ ثُمَّ مَشَى إِلَى بَيْتٍ مِنْ بُيُوتِ اللَّهِ لِيَقْضِيَ فَرِيضَةً مِنْ فَرَائِضِ اللَّهِ كَانَتْ خَطْوَتَاهُ إِحْدَاهُمَا تَحُطُّ خَطِيئَةً وَالأُخْرَى تَرْفَعُ دَرَجَةً \" ."
  },
  "667": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 667\nIn-book reference  : Book 5, Hadith 355\nUSC-MSA web (English) reference  : Book 4, Hadith 1410\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَقَالَ قُتَيْبَةُ حَدَّثَنَا بَكْرٌ، - يَعْنِي ابْنَ مُضَرَ - كِلاَهُمَا عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَفِي حَدِيثِ بَكْرٍ أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" أَرَأَيْتُمْ لَوْ أَنَّ نَهْرًا بِبَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ هَلْ يَبْقَى مِنْ دَرَنِهِ شَىْءٌ \" . قَالُوا لاَ يَبْقَى مِنْ دَرَنِهِ شَىْءٌ . قَالَ \" فَذَلِكَ مَثَلُ الصَّلَوَاتِ الْخَمْسِ يَمْحُو اللَّهُ بِهِنَّ الْخَطَايَا \" ."
  },
  "668": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 668\nIn-book reference  : Book 5, Hadith 356\nUSC-MSA web (English) reference  : Book 4, Hadith 1411\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ - قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلُ الصَّلَوَاتِ الْخَمْسِ كَمَثَلِ نَهَرٍ جَارٍ غَمْرٍ عَلَى بَابِ أَحَدِكُمْ يَغْتَسِلُ مِنْهُ كُلَّ يَوْمٍ خَمْسَ مَرَّاتٍ \" . قَالَ قَالَ الْحَسَنُ وَمَا يُبْقِي ذَلِكَ مِنَ الدَّرَنِ"
  },
  "669": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 669\nIn-book reference  : Book 5, Hadith 357\nUSC-MSA web (English) reference  : Book 4, Hadith 1412\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا مُحَمَّدُ بْنُ مُطَرِّفٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم \" مَنْ غَدَا إِلَى الْمَسْجِدِ أَوْ رَاحَ أَعَدَّ اللَّهُ لَهُ فِي الْجَنَّةِ نُزُلاً كُلَّمَا غَدَا أَوْ رَاحَ \" ."
  },
  "670": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 670c\nIn-book reference  : Book 5, Hadith 360\nUSC-MSA web (English) reference  : Book 4, Hadith 1415\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، ح قَالَ وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ سِمَاكٍ، بِهَذَا الإِسْنَادِ . وَلَمْ يَقُولاَ حَسَنًا ."
  },
  "671": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 671\nIn-book reference  : Book 5, Hadith 361\nUSC-MSA web (English) reference  : Book 4, Hadith 1416\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَإِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، قَالاَ حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، - حَدَّثَنِي ابْنُ أَبِي ذُبَابٍ، فِي رِوَايَةِ هَارُونَ - وَفِي حَدِيثِ الأَنْصَارِيِّ حَدَّثَنِي الْحَارِثُ - عَنْ عَبْدِ الرَّحْمَنِ بْنِ مِهْرَانَ مَوْلَى أَبِي هُرَيْرَةَ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَحَبُّ الْبِلاَدِ إِلَى اللَّهِ مَسَاجِدُهَا وَأَبْغَضُ الْبِلاَدِ إِلَى اللَّهِ أَسْوَاقُهَا \" ."
  },
  "672": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 672c\nIn-book reference  : Book 5, Hadith 364\nUSC-MSA web (English) reference  : Book 4, Hadith 1419\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، ح وَحَدَّثَنَا حَسَنُ بْنُ عِيسَى، حَدَّثَنَا ابْنُ الْمُبَارَكِ، جَمِيعًا عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "673": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 673c\nIn-book reference  : Book 5, Hadith 367\nUSC-MSA web (English) reference  : Book 4, Hadith 1422\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، قَالَ سَمِعْتُ أَوْسَ بْنَ ضَمْعَجٍ، يَقُولُ سَمِعْتُ أَبَا مَسْعُودٍ، يَقُولُ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَؤُمُّ الْقَوْمَ أَقْرَؤُهُمْ لِكِتَابِ اللَّهِ وَأَقْدَمُهُمْ قِرَاءَةً فَإِنْ كَانَتْ قِرَاءَتُهُمْ سَوَاءً فَلْيَؤُمَّهُمْ أَقْدَمُهُمْ هِجْرَةً فَإِنْ كَانُوا فِي الْهِجْرَةِ سَوَاءً فَلْيَؤُمَّهُمْ أَكْبَرُهُمْ سِنًّا وَلاَ تَؤُمَّنَّ الرَّجُلَ فِي أَهْلِهِ وَلاَ فِي سُلْطَانِهِ وَلاَ تَجْلِسْ عَلَى تَكْرِمَتِهِ فِي بَيْتِهِ إِلاَّ أَنْ يَأْذَنَ لَكَ أَوْ بِإِذْنِهِ \" ."
  },
  "674": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 674e\nIn-book reference  : Book 5, Hadith 372\nUSC-MSA web (English) reference  : Book 4, Hadith 1427\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَاهُ أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، بِهَذَا الإِسْنَادِ وَزَادَ قَالَ الْحَذَّاءُ وَكَانَا مُتَقَارِبَيْنِ فِي الْقِرَاءَةِ ."
  },
  "675": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 675d\nIn-book reference  : Book 5, Hadith 376\nUSC-MSA web (English) reference  : Book 4, Hadith 1431\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ أَبَا هُرَيْرَةَ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَمَا هُوَ يُصَلِّي الْعِشَاءَ إِذْ قَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" . ثُمَّ قَالَ قَبْلَ أَنْ يَسْجُدَ \" اللَّهُمَّ نَجِّ عَيَّاشَ بْنَ أَبِي رَبِيعَةَ \" . ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ الأَوْزَاعِيِّ إِلَى قَوْلِهِ \" كَسِنِي يُوسُفَ \" . وَلَمْ يَذْكُرْ مَا بَعْدَهُ ."
  },
  "676": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 676\nIn-book reference  : Book 5, Hadith 377\nUSC-MSA web (English) reference  : Book 4, Hadith 1432\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ وَاللَّهِ لأُقَرِّبَنَّ بِكُمْ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَكَانَ أَبُو هُرَيْرَةَ يَقْنُتُ فِي الظُّهْرِ وَالْعِشَاءِ الآخِرَةِ وَصَلاَةِ الصُّبْحِ وَيَدْعُو لِلْمُؤْمِنِينَ وَيَلْعَنُ الْكُفَّارَ ."
  },
  "677": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 677j\nIn-book reference  : Book 5, Hadith 387\nUSC-MSA web (English) reference  : Book 4, Hadith 1442\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَنَتَ شَهْرًا يَدْعُو عَلَى أَحْيَاءٍ مِنْ أَحْيَاءِ الْعَرَبِ ثُمَّ تَرَكَهُ ."
  },
  "678": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 678b\nIn-book reference  : Book 5, Hadith 389\nUSC-MSA web (English) reference  : Book 4, Hadith 1444\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ، قَالَ قَنَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْفَجْرِ وَالْمَغْرِبِ ."
  },
  "679": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 679c\nIn-book reference  : Book 5, Hadith 392\nUSC-MSA web (English) reference  : Book 4, Hadith 1447\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا إِسْمَاعِيلُ، قَالَ وَأَخْبَرَنِيهِ عَبْدُ الرَّحْمَنِ بْنُ حَرْمَلَةَ، عَنْ حَنْظَلَةَ بْنِ عَلِيِّ بْنِ الأَسْقَعِ، عَنْ خُفَافِ بْنِ إِيمَاءٍ، . بِمِثْلِهِ إِلاَّ أَنَّهُ لَمْ يَقُلْ فَجُعِلَتْ لَعْنَةُ الْكَفَرَةِ مِنْ أَجْلِ ذَلِكَ ."
  },
  "680": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 680b\nIn-book reference  : Book 5, Hadith 394\nUSC-MSA web (English) reference  : Book 4, Hadith 1449\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَيَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، كِلاَهُمَا عَنْ يَحْيَى، - قَالَ ابْنُ حَاتِمٍ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، - حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، حَدَّثَنَا أَبُو حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ عَرَّسْنَا مَعَ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَلَمْ نَسْتَيْقِظْ حَتَّى طَلَعَتِ الشَّمْسُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" لِيَأْخُذْ كُلُّ رَجُلٍ بِرَأْسِ رَاحِلَتِهِ فَإِنَّ هَذَا مَنْزِلٌ حَضَرَنَا فِيهِ الشَّيْطَانُ \" . قَالَ فَفَعَلْنَا ثُمَّ دَعَا بِالْمَاءِ فَتَوَضَّأَ ثُمَّ سَجَدَ سَجْدَتَيْنِ - وَقَالَ يَعْقُوبُ ثُمَّ صَلَّى سَجْدَتَيْنِ - ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّى الْغَدَاةَ ."
  },
  "681": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 681\nIn-book reference  : Book 5, Hadith 395\nUSC-MSA web (English) reference  : Book 4, Hadith 1450\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ الْمُغِيرَةِ - حَدَّثَنَا ثَابِتٌ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" إِنَّكُمْ تَسِيرُونَ عَشِيَّتَكُمْ وَلَيْلَتَكُمْ وَتَأْتُونَ الْمَاءَ إِنْ شَاءَ اللَّهُ غَدًا \" . فَانْطَلَقَ النَّاسُ لاَ يَلْوِي أَحَدٌ عَلَى أَحَدٍ - قَالَ أَبُو قَتَادَةَ - فَبَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَسِيرُ حَتَّى ابْهَارَّ اللَّيْلُ وَأَنَا إِلَى جَنْبِهِ - قَالَ - فَنَعَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَالَ عَنْ رَاحِلَتِهِ فَأَتَيْتُهُ فَدَعَمْتُهُ مِنْ غَيْرِ أَنْ أُوقِظَهُ حَتَّى اعْتَدَلَ عَلَى رَاحِلَتِهِ - قَالَ - ثُمَّ سَارَ حَتَّى تَهَوَّرَ اللَّيْلُ مَالَ عَنْ رَاحِلَتِهِ - قَالَ - فَدَعَمْتُهُ مِنْ غَيْرِ أَنْ أُوقِظَهُ حَتَّى اعْتَدَلَ عَلَى رَاحِلَتِهِ - قَالَ - ثُمَّ سَارَ حَتَّى إِذَا كَانَ مِنْ آخِرِ السَّحَرِ مَالَ مَيْلَةً هِيَ أَشَدُّ مِنَ الْمَيْلَتَيْنِ الأُولَيَيْنِ حَتَّى كَادَ يَنْجَفِلُ فَأَتَيْتُهُ فَدَعَمْتُهُ فَرَفَعَ رَأْسَهُ فَقَالَ \" مَنْ هَذَا \" . قُلْتُ أَبُو قَتَادَةَ . قَالَ \" مَتَى كَانَ هَذَا مَسِيرَكَ مِنِّي \" . قُلْتُ مَا زَالَ هَذَا مَسِيرِي مُنْذُ اللَّيْلَةِ . قَالَ \" حَفِظَكَ اللَّهُ بِمَا حَفِظْتَ بِهِ نَبِيَّهُ \" . ثُمَّ قَالَ \" هَلْ تَرَانَا نَخْفَى عَلَى النَّاسِ \" . ثُمَّ قَالَ \" هَلْ تَرَى مِنْ أَحَدٍ \" . قُلْتُ هَذَا رَاكِبٌ . ثُمَّ قُلْتُ هَذَا رَاكِبٌ آخَرُ . حَتَّى اجْتَمَعْنَا فَكُنَّا سَبْعَةَ رَكْبٍ - قَالَ - فَمَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الطَّرِيقِ فَوَضَعَ رَأْسَهُ ثُمَّ قَالَ \" احْفَظُوا عَلَيْنَا صَلاَتَنَا \" . فَكَانَ أَوَّلَ مَنِ اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالشَّمْسُ فِي ظَهْرِهِ - قَالَ - فَقُمْنَا فَزِعِينَ ثُمَّ قَالَ \" ارْكَبُوا \" . فَرَكِبْنَا فَسِرْنَا حَتَّى إِذَا ارْتَفَعَتِ الشَّمْسُ نَزَلَ ثُمَّ دَعَا بِمِيضَأَةٍ كَانَتْ مَعِي فِيهَا شَىْءٌ مِنْ مَاءٍ - قَالَ - فَتَوَضَّأَ مِنْهَا وُضُوءًا دُونَ وُضُوءٍ - قَالَ - وَبَقِيَ فِيهَا شَىْءٌ مِنْ مَاءٍ ثُمَّ قَالَ لأَبِي قَتَادَةَ \" احْفَظْ عَلَيْنَا مِيضَأَتَكَ فَسَيَكُونُ لَهَا نَبَأٌ \" . ثُمَّ أَذَّنَ بِلاَلٌ بِالصَّلاَةِ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم رَكْعَتَيْنِ ثُمَّ صَلَّى الْغَدَاةَ فَصَنَعَ كَمَا كَانَ يَصْنَعُ كُلَّ يَوْمٍ - قَالَ - وَرَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَكِبْنَا مَعَهُ - قَالَ - فَجَعَلَ بَعْضُنَا يَهْمِسُ إِلَى بَعْضٍ مَا كَفَّارَةُ مَا صَنَعْنَا بِتَفْرِيطِنَا فِي صَلاَتِنَا ثُمَّ قَالَ \" أَمَا لَكُمْ فِيَّ أُسْوَةٌ \" . ثُمَّ قَالَ \" أَمَا إِنَّهُ لَيْسَ فِي النَّوْمِ تَفْرِيطٌ إِنَّمَا التَّفْرِيطُ عَلَى مَنْ لَمْ يُصَلِّ الصَّلاَةَ حَتَّى يَجِيءَ وَقْتُ الصَّلاَةِ الأُخْرَى فَمَنْ فَعَلَ ذَلِكَ فَلْيُصَلِّهَا حِينَ يَنْتَبِهُ لَهَا فَإِذَا كَانَ الْغَدُ فَلْيُصَلِّهَا عِنْدَ وَقْتِهَا \" . ثُمَّ قَالَ \" مَا تَرَوْنَ النَّاسَ صَنَعُوا \" . قَالَ ثُمَّ قَالَ \" أَصْبَحَ النَّاسُ فَقَدُوا نَبِيَّهُمْ فَقَالَ أَبُو بَكْرٍ وَعُمَرُ رَسُولُ اللَّهِ صلى الله عليه وسلم بَعْدَكُمْ لَمْ يَكُنْ لِيُخَلِّفَكُمْ . وَقَالَ النَّاسُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَيْنَ أَيْدِيكُمْ فَإِنْ يُطِيعُوا أَبَا بَكْرٍ وَعُمَرَ يَرْشُدُوا \" . قَالَ فَانْتَهَيْنَا إِلَى النَّاسِ حِينَ امْتَدَّ النَّهَارُ وَحَمِيَ كُلُّ شَىْءٍ وَهُمْ يَقُولُونَ يَا رَسُولَ اللَّهِ هَلَكْنَا عَطِشْنَا . فَقَالَ \" لاَ هُلْكَ عَلَيْكُمْ \" . ثُمَّ قَالَ \" أَطْلِقُوا لِي غُمَرِي \" . قَالَ وَدَعَا بِالْمِيضَأَةِ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُبُّ وَأَبُو قَتَادَةَ يَسْقِيهِمْ فَلَمْ يَعْدُ أَنْ رَأَى النَّاسُ مَاءً فِي الْمِيضَأَةِ تَكَابُّوا عَلَيْهَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَحْسِنُوا الْمَلأَ كُلُّكُمْ سَيَرْوَى \" . قَالَ فَفَعَلُوا فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُبُّ وَأَسْقِيهِمْ حَتَّى مَا بَقِيَ غَيْرِي وَغَيْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - ثُمَّ صَبَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ لِي \" اشْرَبْ \" . فَقُلْتُ لاَ أَشْرَبُ حَتَّى تَشْرَبَ يَا رَسُولَ اللَّهِ قَالَ \" إِنَّ سَاقِيَ الْقَوْمِ آخِرُهُمْ شُرْبًا \" . قَالَ فَشَرِبْتُ وَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - فَأَتَى النَّاسُ الْمَاءَ جَامِّينَ رِوَاءً . قَالَ فَقَالَ عَبْدُ اللَّهِ بْنُ رَبَاحٍ إِنِّي لأُحَدِّثُ هَذَا الْحَدِيثَ فِي مَسْجِدِ الْجَامِعِ إِذْ قَالَ عِمْرَانُ بْنُ حُصَيْنٍ انْظُرْ أَيُّهَا الْفَتَى كَيْفَ تُحَدِّثُ فَإِنِّي أَحَدُ الرَّكْبِ تِلْكَ اللَّيْلَةَ . قَالَ قُلْتُ فَأَنْتَ أَعْلَمُ بِالْحَدِيثِ . فَقَالَ مِمَّنْ أَنْتَ قُلْتُ مِنَ الأَنْصَارِ . قَالَ حَدِّثْ فَأَنْتُمْ أَعْلَمُ بِحَدِيثِكُمْ . قَالَ فَحَدَّثْتُ الْقَوْمَ فَقَالَ عِمْرَانُ لَقَدْ شَهِدْتُ تِلْكَ اللَّيْلَةَ وَمَا شَعَرْتُ أَنَّ أَحَدًا حَفِظَهُ كَمَا حَفِظْتُهُ ."
  },
  "682": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 682b\nIn-book reference  : Book 5, Hadith 397\nUSC-MSA web (English) reference  : Book 4, Hadith 1452\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا عَوْفُ بْنُ أَبِي جَمِيلَةَ الأَعْرَابِيُّ، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، عَنْ عِمْرَانَ بْنِ الْحُصَيْنِ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَسَرَيْنَا لَيْلَةً حَتَّى إِذَا كَانَ مِنْ آخِرِ اللَّيْلِ قُبَيْلَ الصُّبْحِ وَقَعْنَا تِلْكَ الْوَقْعَةَ الَّتِي لاَ وَقْعَةَ عِنْدَ الْمُسَافِرِ أَحْلَى مِنْهَا فَمَا أَيْقَظَنَا إِلاَّ حَرُّ الشَّمْسِ . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ سَلْمِ بْنِ زَرِيرٍ وَزَادَ وَنَقَصَ . وَقَالَ فِي الْحَدِيثِ فَلَمَّا اسْتَيْقَظَ عُمَرُ بْنُ الْخَطَّابِ وَرَأَى مَا أَصَابَ النَّاسَ وَكَانَ أَجْوَفَ جَلِيدًا فَكَبَّرَ وَرَفَعَ صَوْتَهُ بِالتَّكْبِيرِ حَتَّى اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِشِدَّةِ صَوْتِهِ بِالتَّكْبِيرِ فَلَمَّا اسْتَيْقَظَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَكَوْا إِلَيْهِ الَّذِي أَصَابَهُمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ ضَيْرَ ارْتَحِلُوا \" . وَاقْتَصَّ الْحَدِيثَ ."
  },
  "683": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 683\nIn-book reference  : Book 5, Hadith 398\nUSC-MSA web (English) reference  : Book 4, Hadith 1453\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ حُمَيْدٍ، عَنْ بَكْرِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا كَانَ فِي سَفَرٍ فَعَرَّسَ بِلَيْلٍ اضْطَجَعَ عَلَى يَمِينِهِ وَإِذَا عَرَّسَ قُبَيْلَ الصُّبْحِ نَصَبَ ذِرَاعَهُ وَوَضَعَ رَأْسَهُ عَلَى كَفِّهِ ."
  },
  "684": {
    "collection": "Sahih Muslim",
    "book": "The Book of Mosques and Places of Prayer",
    "book_num": "5",
    "reference": "Reference  : Sahih Muslim 684d\nIn-book reference  : Book 5, Hadith 402\nUSC-MSA web (English) reference  : Book 4, Hadith 1457\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/5",
    "text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْمُثَنَّى، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا رَقَدَ أَحَدُكُمْ عَنِ الصَّلاَةِ أَوْ غَفَلَ عَنْهَا فَلْيُصَلِّهَا إِذَا ذَكَرَهَا فَإِنَّ اللَّهَ يَقُولُ أَقِمِ الصَّلاَةَ لِذِكْرِي \" ."
  }
}