{
  "894": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 894d\nIn-book reference  : Book 9, Hadith 4\nUSC-MSA web (English) reference  : Book 4, Hadith 1950\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ قَالَ أَخْبَرَنِي عَبَّادُ بْنُ تَمِيمٍ الْمَازِنِيُّ، أَنَّهُ سَمِعَ عَمَّهُ، وَكَانَ، مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَقُولُ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا يَسْتَسْقِي فَجَعَلَ إِلَى النَّاسِ ظَهْرَهُ يَدْعُو اللَّهَ وَاسْتَقْبَلَ الْقِبْلَةَ وَحَوَّلَ رِدَاءَهُ ثُمَّ صَلَّى رَكْعَتَيْنِ ."
  },
  "895": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 895c\nIn-book reference  : Book 9, Hadith 7\nUSC-MSA web (English) reference  : Book 4, Hadith 1953\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، وَعَبْدُ الأَعْلَى، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يَرْفَعُ يَدَيْهِ فِي شَىْءٍ مِنْ دُعَائِهِ إِلاَّ فِي الاِسْتِسْقَاءِ حَتَّى يُرَى بَيَاضُ إِبْطَيْهِ . غَيْرَ أَنَّ عَبْدَ الأَعْلَى قَالَ يُرَى بَيَاضُ إِبْطِهِ أَوْ بَيَاضُ إِبْطَيْهِ ."
  },
  "896": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 896\nIn-book reference  : Book 9, Hadith 8\nUSC-MSA web (English) reference  : Book 4, Hadith 1954\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، أَنَّحَدَّثَهُمْ عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَهُ ."
  },
  "897": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 897e\nIn-book reference  : Book 9, Hadith 13\nUSC-MSA web (English) reference  : Book 4, Hadith 1959\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، أَنَّ حَفْصَ بْنَ، عُبَيْدِ اللَّهِ بْنِ أَنَسِ بْنِ مَالِكٍ حَدَّثَهُ أَنَّهُ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ الْجُمُعَةِ وَهُوَ عَلَى الْمِنْبَرِ . وَاقْتَصَّ الْحَدِيثَ وَزَادَ فَرَأَيْتُ السَّحَابَ يَتَمَزَّقُ كَأَنَّهُ الْمُلاَءُ حِينَ تُطْوَى ."
  },
  "898": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 898\nIn-book reference  : Book 9, Hadith 14\nUSC-MSA web (English) reference  : Book 4, Hadith 1960\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، قَالَ قَالَ أَنَسٌ أَصَابَنَا وَنَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَطَرٌ قَالَ فَحَسَرَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ثَوْبَهُ حَتَّى أَصَابَهُ مِنْ الْمَطَرِ فَقُلْنَا يَا رَسُولَ اللَّهِ لِمَ صَنَعْتَ هَذَا قَالَ لِأَنَّهُ حَدِيثُ عَهْدٍ بِرَبِّهِ تَعَالَى."
  },
  "899": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 899c\nIn-book reference  : Book 9, Hadith 17\nUSC-MSA web (English) reference  : Book 4, Hadith 1963\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم مُسْتَجْمِعًا ضَاحِكًا حَتَّى أَرَى مِنْهُ لَهَوَاتِهِ إِنَّمَا كَانَ يَتَبَسَّمُ - قَالَتْ- وَكَانَ إِذَا رَأَى غَيْمًا أَوْ رِيحًا عُرِفَ ذَلِكَ فِي وَجْهِهِ . فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَى النَّاسَ"
  },
  "900": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Rain",
    "book_num": "9",
    "reference": "Reference  : Sahih Muslim 900b\nIn-book reference  : Book 9, Hadith 19\nUSC-MSA web (English) reference  : Book 4, Hadith 1965\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/9",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ مُحَمَّدِ بْنِ أَبَانٍ الْجُعْفِيُّ، حَدَّثَنَا عَبْدَةُ، - يَعْنِي ابْنَ سُلَيْمَانَ - كِلاَهُمَا عَنِ الأَعْمَشِ، عَنْ مَسْعُودِ بْنِ مَالِكٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِهِ ."
  }
}