{
  "979": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 979h\nIn-book reference  : Book 12, Hadith 8\nUSC-MSA web (English) reference  : Book 5, Hadith 2141\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا الثَّوْرِيُّ، وَمَعْمَرٌ، عَنْ إِسْمَاعِيلَ، بْنِ أُمَيَّةَ بِهَذَا الإِسْنَادِ . مِثْلَ حَدِيثِ ابْنِ مَهْدِيٍّ وَيَحْيَى بْنِ آدَمَ غَيْرَ أَنَّهُ قَالَ - بَدَلَ التَّمْرِ - ثَمَرٍ ."
  },
  "980": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 980\nIn-book reference  : Book 12, Hadith 9\nUSC-MSA web (English) reference  : Book 5, Hadith 2142\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عِيَاضُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" لَيْسَ فِيمَا دُونَ خَمْسِ أَوَاقٍ مِنَ الْوَرِقِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسِ ذَوْدٍ مِنَ الإِبِلِ صَدَقَةٌ وَلَيْسَ فِيمَا دُونَ خَمْسَةِ أَوْسُقٍ مِنَ التَّمْرِ صَدَقَةٌ \" ."
  },
  "981": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 981\nIn-book reference  : Book 12, Hadith 10\nUSC-MSA web (English) reference  : Book 5, Hadith 2143\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ وَعَمْرُو بْنُ سَوَّادٍ وَالْوَلِيدُ بْنُ شُجَاعٍ كُلُّهُمْ عَنِ ابْنِ وَهْبٍ، قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ أَبَا الزُّبَيْرِ، حَدَّثَهُ أَنَّهُ، سَمِعَ جَابِرَ بْنَ، عَبْدِ اللَّهِ يَذْكُرُ أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم قَالَ \" فِيمَا سَقَتِ الأَنْهَارُ وَالْغَيْمُ الْعُشُورُ وَفِيمَا سُقِيَ بِالسَّانِيَةِ نِصْفُ الْعُشْرِ \" ."
  },
  "982": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 982d\nIn-book reference  : Book 12, Hadith 14\nUSC-MSA web (English) reference  : Book 5, Hadith 2147\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ، عَنْ أَبِيهِ، عَنْ عِرَاكِ بْنِ مَالِكٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يُحَدِّثُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" لَيْسَ فِي الْعَبْدِ صَدَقَةٌ إِلاَّ صَدَقَةُ الْفِطْرِ \" ."
  },
  "983": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 983\nIn-book reference  : Book 12, Hadith 15\nUSC-MSA web (English) reference  : Book 5, Hadith 2148\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَلِيُّ بْنُ حَفْصٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم عُمَرَ عَلَى الصَّدَقَةِ فَقِيلَ مَنَعَ ابْنُ جَمِيلٍ وَخَالِدُ بْنُ الْوَلِيدِ وَالْعَبَّاسُ عَمُّ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا يَنْقِمُ ابْنُ جَمِيلٍ إِلاَّ أَنَّهُ كَانَ فَقِيرًا فَأَغْنَاهُ اللَّهُ وَأَمَّا خَالِدٌ فَإِنَّكُمْ تَظْلِمُونَ خَالِدًا قَدِ احْتَبَسَ أَدْرَاعَهُ وَأَعْتَادَهُ فِي سَبِيلِ اللَّهِ وَأَمَّا الْعَبَّاسُ فَهِيَ عَلَىَّ وَمِثْلُهَا مَعَهَا \" . ثُمَّ قَالَ \" يَا عُمَرُ أَمَا شَعَرْتَ أَنَّ عَمَّ الرَّجُلِ صِنْوُ أَبِيهِ \" ."
  },
  "984": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 984e\nIn-book reference  : Book 12, Hadith 20\nUSC-MSA web (English) reference  : Book 5, Hadith 2153\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم فَرَضَ زَكَاةَ الْفِطْرِ مِنْ رَمَضَانَ عَلَى كُلِّ نَفْسٍ مِنَ الْمُسْلِمِينَ حُرٍّ أَوْ عَبْدٍ أَوْ رَجُلٍ أَوِ امْرَأَةٍ صَغِيرٍ أَوْ كَبِيرٍ صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ شَعِيرٍ ."
  },
  "985": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 985e\nIn-book reference  : Book 12, Hadith 25\nUSC-MSA web (English) reference  : Book 5, Hadith 2158\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ عِيَاضِ، بْنِ عَبْدِ اللَّهِ بْنِ أَبِي سَرْحٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ مُعَاوِيَةَ، لَمَّا جَعَلَ نِصْفَ الصَّاعِ مِنَ الْحِنْطَةِ عِدْلَ صَاعٍ مِنْ تَمْرٍ أَنْكَرَ ذَلِكَ أَبُو سَعِيدٍ وَقَالَ لاَ أُخْرِجُ فِيهَا إِلاَّ الَّذِي كُنْتُ أُخْرِجُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم صَاعًا مِنْ تَمْرٍ أَوْ صَاعًا مِنْ زَبِيبٍ أَوْ صَاعًا مِنْ شَعِيرٍ أَوْ صَاعًا مِنْ أَقِطٍ ."
  },
  "986": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 986b\nIn-book reference  : Book 12, Hadith 27\nUSC-MSA web (English) reference  : Book 5, Hadith 2160\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، عَنْ نَافِعٍ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِإِخْرَاجِ زَكَاةِ الْفِطْرِ أَنْ تُؤَدَّى قَبْلَ خُرُوجِ النَّاسِ إِلَى الصَّلاَةِ ."
  },
  "987": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 987e\nIn-book reference  : Book 12, Hadith 32\nUSC-MSA web (English) reference  : Book 5, Hadith 2165\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرًا، حَدَّثَهُ عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" إِذَا لَمْ يُؤَدِّ الْمَرْءُ حَقَّ اللَّهِ أَوِ الصَّدَقَةَ فِي إِبِلِهِ \" . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ سُهَيْلٍ عَنْ أَبِيهِ ."
  },
  "988": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 988b\nIn-book reference  : Book 12, Hadith 34\nUSC-MSA web (English) reference  : Book 5, Hadith 2167\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَا مِنْ صَاحِبِ إِبِلٍ وَلاَ بَقَرٍ وَلاَ غَنَمٍ لاَ يُؤَدِّي حَقَّهَا إِلاَّ أُقْعِدَ لَهَا يَوْمَ الْقِيَامَةِ بِقَاعٍ قَرْقَرٍ تَطَؤُهُ ذَاتُ الظِّلْفِ بِظِلْفِهَا وَتَنْطِحُهُ ذَاتُ الْقَرْنِ بِقَرْنِهَا لَيْسَ فِيهَا يَوْمَئِذٍ جَمَّاءُ وَلاَ مَكْسُورَةُ الْقَرْنِ \" . قُلْنَا يَا رَسُولَ اللَّهِ وَمَا حَقُّهَا قَالَ \" إِطْرَاقُ فَحْلِهَا وَإِعَارَةُ دَلْوِهَا وَمَنِيحَتُهَا وَحَلَبُهَا عَلَى الْمَاءِ وَحَمْلٌ عَلَيْهَا فِي سَبِيلِ اللَّهِ وَلاَ مِنْ صَاحِبِ مَالٍ لاَ يُؤَدِّي زَكَاتَهُ إِلاَّ تَحَوَّلَ يَوْمَ الْقِيَامَةِ شُجَاعًا أَقْرَعَ يَتْبَعُ صَاحِبَهُ حَيْثُمَا ذَهَبَ وَهُوَ يَفِرُّ مِنْهُ وَيُقَالُ هَذَا مَالُكَ الَّذِي كُنْتَ تَبْخَلُ بِهِ فَإِذَا رَأَى أَنَّهُ لاَ بُدَّ مِنْهُ أَدْخَلَ يَدَهُ فِي فِيهِ فَجَعَلَ يَقْضَمُهَا كَمَا يَقْضَمُ الْفَحْلُ \" ."
  },
  "989": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 989c\nIn-book reference  : Book 12, Hadith 231\nUSC-MSA web (English) reference  : Book 5, Hadith 2360\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، وَأَبُو خَالِدٍ الأَحْمَرُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، وَابْنُ، أَبِي عَدِيٍّ وَعَبْدُ الأَعْلَى كُلُّهُمْ عَنْ دَاوُدَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا دَاوُدُ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا أَتَاكُمُ الْمُصَدِّقُ فَلْيَصْدُرْ عَنْكُمْ وَهُوَ عَنْكُمْ رَاضٍ \" ."
  },
  "990": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 990b\nIn-book reference  : Book 12, Hadith 38\nUSC-MSA web (English) reference  : Book 5, Hadith 2171\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ الْمَعْرُورِ، عَنْ أَبِي ذَرٍّ، قَالَ انْتَهَيْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ . فَذَكَرَ نَحْوَ حَدِيثِ وَكِيعٍ غَيْرَ أَنَّهُ قَالَ \" وَالَّذِي نَفْسِي بِيَدِهِ مَا عَلَى الأَرْضِ رَجُلٌ يَمُوتُ فَيَدَعُ إِبِلاً أَوْ بَقَرًا أَوْ غَنَمًا لَمْ يُؤَدِّ زَكَاتَهَا \" ."
  },
  "991": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 991b\nIn-book reference  : Book 12, Hadith 40\nUSC-MSA web (English) reference  : Book 5, Hadith 2173\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "94": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 94d\nIn-book reference  : Book 12, Hadith 42\nUSC-MSA web (English) reference  : Book 5, Hadith 2175\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ رُفَيْعٍ - عَنْ زَيْدِ بْنِ وَهْبٍ، عَنْ أَبِي ذَرٍّ، قَالَ خَرَجْتُ لَيْلَةً مِنَ اللَّيَالِي فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْشِي وَحْدَهُ لَيْسَ مَعَهُ إِنْسَانٌ قَالَ فَظَنَنْتُ أَنَّهُ يَكْرَهُ أَنْ يَمْشِيَ مَعَهُ أَحَدٌ - قَالَ - فَجَعَلْتُ أَمْشِي فِي ظِلِّ الْقَمَرِ فَالْتَفَتَ فَرَآنِي فَقَالَ \" مَنْ هَذَا \" . فَقُلْتُ أَبُو ذَرٍّ جَعَلَنِي اللَّهُ فِدَاءَكَ . قَالَ \" يَا أَبَا ذَرٍّ تَعَالَهْ \" . قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ \" إِنَّ الْمُكْثِرِينَ هُمُ الْمُقِلُّونَ يَوْمَ الْقِيَامَةِ إِلاَّ مَنْ أَعْطَاهُ اللَّهُ خَيْرًا فَنَفَحَ فِيهِ يَمِينَهُ وَشِمَالَهُ وَبَيْنَ يَدَيْهِ وَوَرَاءَهُ وَعَمِلَ فِيهِ خَيْرًا \" . قَالَ فَمَشَيْتُ مَعَهُ سَاعَةً فَقَالَ \" اجْلِسْ هَا هُنَا \" . قَالَ فَأَجْلَسَنِي فِي قَاعٍ حَوْلَهُ حِجَارَةٌ فَقَالَ لِيَ \" اجْلِسْ هَا هُنَا حَتَّى أَرْجِعَ إِلَيْكَ \" . قَالَ فَانْطَلَقَ فِي الْحَرَّةِ حَتَّى لاَ أَرَاهُ فَلَبِثَ عَنِّي فَأَطَالَ اللَّبْثَ ثُمَّ إِنِّي سَمِعْتُهُ وَهُوَ مُقْبِلٌ وَهُوَ يَقُولُ \" وَإِنْ سَرَقَ وَإِنْ زَنَى \" . قَالَ فَلَمَّا جَاءَ لَمْ أَصْبِرْ فَقُلْتُ يَا نَبِيَّ اللَّهِ جَعَلَنِي اللَّهُ فِدَاءَكَ مَنْ تُكَلِّمُ فِي جَانِبِ الْحَرَّةِ مَا سَمِعْتُ أَحَدًا يَرْجِعُ إِلَيْكَ شَيْئًا . قَالَ \" ذَاكَ جِبْرِيلُ عَرَضَ لِي فِي جَانِبِ الْحَرَّةِ فَقَالَ بَشِّرْ أُمَّتَكَ أَنَّهُ مَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ . فَقُلْتُ يَا جِبْرِيلُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ . قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ . قَالَ قُلْتُ وَإِنْ سَرَقَ وَإِنْ زَنَى قَالَ نَعَمْ وَإِنْ شَرِبَ الْخَمْرَ \" ."
  },
  "992": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 992b\nIn-book reference  : Book 12, Hadith 44\nUSC-MSA web (English) reference  : Book 5, Hadith 2177\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو الأَشْهَبِ، حَدَّثَنَا خُلَيْدٌ الْعَصَرِيُّ، عَنِ الأَحْنَفِ، بْنِ قَيْسٍ قَالَ كُنْتُ فِي نَفَرٍ مِنْ قُرَيْشٍ فَمَرَّ أَبُو ذَرٍّ وَهُوَ يَقُولُ بَشِّرِ الْكَانِزِينَ بِكَىٍّ فِي ظُهُورِهِمْ يَخْرُجُ مِنْ جُنُوبِهِمْ وَبِكَىٍّ مِنْ قِبَلِ أَقْفَائِهِمْ يَخْرُجُ مِنْ جِبَاهِهِمْ . - قَالَ - ثُمَّ تَنَحَّى فَقَعَدَ . - قَالَ - قُلْتُ مَنْ هَذَا قَالُوا هَذَا أَبُو ذَرٍّ . قَالَ فَقُمْتُ إِلَيْهِ فَقُلْتُ مَا شَىْءٌ سَمِعْتُكَ تَقُولُ قُبَيْلُ قَالَ مَا قُلْتُ إِلاَّ شَيْئًا قَدْ سَمِعْتُهُ مِنْ نَبِيِّهِمْ صلى الله عليه وسلم . قَالَ قُلْتُ مَا تَقُولُ فِي هَذَا الْعَطَاءِ قَالَ خُذْهُ فَإِنَّ فِيهِ الْيَوْمَ مَعُونَةً فَإِذَا كَانَ ثَمَنًا لِدِينِكَ فَدَعْهُ."
  },
  "993": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 993b\nIn-book reference  : Book 12, Hadith 46\nUSC-MSA web (English) reference  : Book 5, Hadith 2179\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، حَدَّثَنَا مَعْمَرُ بْنُ رَاشِدٍ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَخِي وَهْبِ بْنِ مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا . وَقَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ اللَّهَ قَالَ لِي أَنْفِقْ أُنْفِقْ عَلَيْكَ \" . وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَمِينُ اللَّهِ مَلأَى لاَ يَغِيضُهَا سَحَّاءُ اللَّيْلَ وَالنَّهَارَ أَرَأَيْتُمْ مَا أَنْفَقَ مُذْ خَلَقَ السَّمَاءَ وَالأَرْضَ فَإِنَّهُ لَمْ يَغِضْ مَا فِي يَمِينِهِ \" . قَالَ \" وَعَرْشُهُ عَلَى الْمَاءِ وَبِيَدِهِ الأُخْرَى الْقَبْضُ يَرْفَعُ وَيَخْفِضُ \" ."
  },
  "994": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 994\nIn-book reference  : Book 12, Hadith 47\nUSC-MSA web (English) reference  : Book 5, Hadith 2180\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ، - قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ، - حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَفْضَلُ دِينَارٍ يُنْفِقُهُ الرَّجُلُ دِينَارٌ يُنْفِقُهُ عَلَى عِيَالِهِ وَدِينَارٌ يُنْفِقُهُ الرَّجُلُ عَلَى دَابَّتِهِ فِي سَبِيلِ اللَّهِ وَدِينَارٌ يُنْفِقُهُ عَلَى أَصْحَابِهِ فِي سَبِيلِ اللَّهِ \" . قَالَ أَبُو قِلاَبَةَ وَبَدَأَ بِالْعِيَالِ ثُمَّ قَالَ أَبُو قِلاَبَةَ وَأَىُّ رَجُلٍ أَعْظَمُ أَجْرًا مِنْ رَجُلٍ يُنْفِقُ عَلَى عِيَالٍ صِغَارٍ يُعِفُّهُمْ أَوْ يَنْفَعُهُمُ اللَّهُ بِهِ وَيُغْنِيهِمْ ."
  },
  "995": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 995\nIn-book reference  : Book 12, Hadith 48\nUSC-MSA web (English) reference  : Book 5, Hadith 2181\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مُزَاحِمِ بْنِ زُفَرَ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" دِينَارٌ أَنْفَقْتَهُ فِي سَبِيلِ اللَّهِ وَدِينَارٌ أَنْفَقْتَهُ فِي رَقَبَةٍ وَدِينَارٌ تَصَدَّقْتَ بِهِ عَلَى مِسْكِينٍ وَدِينَارٌ أَنْفَقْتَهُ عَلَى أَهْلِكَ أَعْظَمُهَا أَجْرًا الَّذِي أَنْفَقْتَهُ عَلَى أَهْلِكَ \" ."
  },
  "996": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 996\nIn-book reference  : Book 12, Hadith 49\nUSC-MSA web (English) reference  : Book 5, Hadith 2182\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ الْكِنَانِيُّ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ مُصَرِّفٍ، عَنْ خَيْثَمَةَ، قَالَ كُنَّا جُلُوسًا مَعَ عَبْدِ اللَّهِ بْنِ عَمْرٍو إِذْ جَاءَهُ قَهْرَمَانٌ لَهُ فَدَخَلَ فَقَالَ أَعْطَيْتَ الرَّقِيقَ قُوتَهُمْ قَالَ لاَ . قَالَ فَانْطَلِقْ فَأَعْطِهِمْ . قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كَفَى بِالْمَرْءِ إِثْمًا أَنْ يَحْبِسَ عَمَّنْ يَمْلِكُ قُوتَهُ \" ."
  },
  "997": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 997b\nIn-book reference  : Book 12, Hadith 51\nUSC-MSA web (English) reference  : Book 5, Hadith 2184\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ - يُقَالُ لَهُ أَبُو مَذْكُورٍ - أَعْتَقَ غُلاَمًا لَهُ عَنْ دُبُرٍ يُقَالُ لَهُ يَعْقُوبُ وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ اللَّيْثِ ."
  },
  "998": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 998b\nIn-book reference  : Book 12, Hadith 53\nUSC-MSA web (English) reference  : Book 5, Hadith 2186\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ { لَنْ تَنَالُوا الْبِرَّ حَتَّى تُنْفِقُوا مِمَّا تُحِبُّونَ} قَالَ أَبُو طَلْحَةَ أُرَى رَبَّنَا يَسْأَلُنَا مِنْ أَمْوَالِنَا فَأُشْهِدُكَ يَا رَسُولَ اللَّهِ أَنِّي قَدْ جَعَلْتُ أَرْضِي بَرِيحَا لِلَّهِ . قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اجْعَلْهَا فِي قَرَابَتِكَ \" . قَالَ فَجَعَلَهَا فِي حَسَّانَ بْنِ ثَابِتٍ وَأُبَىِّ بْنِ كَعْبٍ ."
  },
  "999": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 999\nIn-book reference  : Book 12, Hadith 54\nUSC-MSA web (English) reference  : Book 5, Hadith 2187\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، أَنَّهَا أَعْتَقَتْ وَلِيدَةً فِي زَمَانِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَتْ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" لَوْ أَعْطَيْتِهَا أَخْوَالَكِ كَانَ أَعْظَمَ لأَجْرِكِ \" ."
  },
  "1000": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1000b\nIn-book reference  : Book 12, Hadith 56\nUSC-MSA web (English) reference  : Book 5, Hadith 2189\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، حَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي شَقِيقٌ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ زَيْنَبَ، امْرَأَةِ عَبْدِ اللَّهِ . قَالَ فَذَكَرْتُ لإِبْرَاهِيمَ فَحَدَّثَنِي عَنْ أَبِي عَبَيْدَةَ عَنْ عَمْرِو بْنِ الْحَارِثِ عَنْ زَيْنَبَ امْرَأَةِ عَبْدِ اللَّهِ . بِمِثْلِهِ سَوَاءً قَالَ قَالَتْ كُنْتُ فِي الْمَسْجِدِ فَرَآنِي النَّبِيُّ صلى الله عليه وسلم فَقَالَ \" تَصَدَّقْنَ وَلَوْ مِنْ حُلِيِّكُنَّ \" . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ أَبِي الأَحْوَصِ ."
  },
  "1001": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1001b\nIn-book reference  : Book 12, Hadith 58\nUSC-MSA web (English) reference  : Book 5, Hadith 2191\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ ."
  },
  "1002": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1002b\nIn-book reference  : Book 12, Hadith 60\nUSC-MSA web (English) reference  : Book 5, Hadith 2193\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، ح وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، جَمِيعًا عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ ."
  },
  "1003": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1003b\nIn-book reference  : Book 12, Hadith 62\nUSC-MSA web (English) reference  : Book 5, Hadith 2195\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ، قَالَتْ قَدِمَتْ عَلَىَّ أُمِّي وَهِيَ مُشْرِكَةٌ فِي عَهْدِ قُرَيْشٍ إِذْ عَاهَدَهُمْ فَاسْتَفْتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ قَدِمَتْ عَلَىَّ أُمِّي وَهْىَ رَاغِبَةٌ أَفَأَصِلُ أُمِّي قَالَ \" نَعَمْ صِلِي أُمَّكِ \" ."
  },
  "1004": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1004b\nIn-book reference  : Book 12, Hadith 64\nUSC-MSA web (English) reference  : Book 5, Hadith 2196\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى، حَدَّثَنَا شُعَيْبُ بْنُ إِسْحَاقَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِ أَبِي أُسَامَةَ وَلَمْ تُوصِ . كَمَا قَالَ ابْنُ بِشْرٍ وَلَمْ يَقُلْ ذَلِكَ الْبَاقُونَ ."
  },
  "1005": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1005\nIn-book reference  : Book 12, Hadith 65\nUSC-MSA web (English) reference  : Book 5, Hadith 2197\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، كِلاَهُمَا عَنْ أَبِي مَالِكٍ الأَشْجَعِيِّ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، فِي حَدِيثِ قُتَيْبَةَ قَالَ قَالَ نَبِيُّكُمْ صلى الله عليه وسلم وَقَالَ ابْنُ أَبِي شَيْبَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" كُلُّ مَعْرُوفٍ صَدَقَةٌ \" ."
  },
  "1006": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1006\nIn-book reference  : Book 12, Hadith 66\nUSC-MSA web (English) reference  : Book 5, Hadith 2198\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا وَاصِلٌ، مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ أَبِي الأَسْوَدِ الدِّيلِيِّ، عَنْ أَبِي، ذَرٍّ أَنَّ نَاسًا، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ ذَهَبَ أَهْلُ الدُّثُورِ بِالأُجُورِ يُصَلُّونَ كَمَا نُصَلِّي وَيَصُومُونَ كَمَا نَصُومُ وَيَتَصَدَّقُونَ بِفُضُولِ أَمْوَالِهِمْ . قَالَ \" أَوَلَيْسَ قَدْ جَعَلَ اللَّهُ لَكُمْ مَا تَصَّدَّقُونَ إِنَّ بِكُلِّ تَسْبِيحَةٍ صَدَقَةً وَكُلِّ تَكْبِيرَةٍ صَدَقَةٌ وَكُلِّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلِّ تَهْلِيلَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْىٌ عَنْ مُنْكَرٍ صَدَقَةٌ وَفِي بُضْعِ أَحَدِكُمْ صَدَقَةٌ \" . قَالُوا يَا رَسُولَ اللَّهِ أَيَأْتِي أَحَدُنَا شَهْوَتَهُ وَيَكُونُ لَهُ فِيهَا أَجْرٌ قَالَ \" أَرَأَيْتُمْ لَوْ وَضَعَهَا فِي حَرَامٍ أَكَانَ عَلَيْهِ فِيهَا وِزْرٌ فَكَذَلِكَ إِذَا وَضَعَهَا فِي الْحَلاَلِ كَانَ لَهُ أَجْرٌ \" ."
  },
  "1007": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1007c\nIn-book reference  : Book 12, Hadith 69\nUSC-MSA web (English) reference  : Book 5, Hadith 2201\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ، حَدَّثَنَا عَلِيٌّ، - يَعْنِي ابْنَ الْمُبَارَكِ - حَدَّثَنَا يَحْيَى، عَنْ زَيْدِ بْنِ سَلاَّمٍ، عَنْ جَدِّهِ أَبِي سَلاَّمٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ، بْنُ فَرُّوخَ أَنَّهُ سَمِعَ عَائِشَةَ، تَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" خُلِقَ كُلُّ إِنْسَانٍ \" . بِنَحْوِ حَدِيثِ مُعَاوِيَةَ عَنْ زَيْدٍ . وَقَالَ \" فَإِنَّهُ يَمْشِي يَوْمَئِذٍ \" ."
  },
  "1008": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1008b\nIn-book reference  : Book 12, Hadith 71\nUSC-MSA web (English) reference  : Book 5, Hadith 2203\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ."
  },
  "1009": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1009\nIn-book reference  : Book 12, Hadith 72\nUSC-MSA web (English) reference  : Book 5, Hadith 2204\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ، مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلُّ سُلاَمَى مِنَ النَّاسِ عَلَيْهِ صَدَقَةٌ كُلَّ يَوْمٍ تَطْلُعُ فِيهِ الشَّمْسُ - قَالَ - تَعْدِلُ بَيْنَ الاِثْنَيْنِ صَدَقَةٌ وَتُعِينُ الرَّجُلَ فِي دَابَّتِهِ فَتَحْمِلُهُ عَلَيْهَا أَوْ تَرْفَعُ لَهُ عَلَيْهَا مَتَاعَهُ صَدَقَةٌ - قَالَ - وَالْكَلِمَةُ الطَّيِّبَةُ صَدَقَةٌ وَكُلُّ خَطْوَةٍ تَمْشِيهَا إِلَى الصَّلاَةِ صَدَقَةٌ وَتُمِيطُ الأَذَى عَنِ الطَّرِيقِ صَدَقَةٌ \" ."
  },
  "1010": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1010\nIn-book reference  : Book 12, Hadith 73\nUSC-MSA web (English) reference  : Book 5, Hadith 2205\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّا، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ بِلاَلٍ - حَدَّثَنِي مُعَاوِيَةُ بْنُ أَبِي مُزَرِّدٍ، عَنْ سَعِيدِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا مِنْ يَوْمٍ يُصْبِحُ الْعِبَادُ فِيهِ إِلاَّ مَلَكَانِ يَنْزِلاَنِ فَيَقُولُ أَحَدُهُمَا اللَّهُمَّ أَعْطِ مُنْفِقًا خَلَفًا . وَيَقُولُ الآخَرُ اللَّهُمَّ أَعْطِ مُمْسِكًا تَلَفًا \" ."
  },
  "1011": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1011\nIn-book reference  : Book 12, Hadith 74\nUSC-MSA web (English) reference  : Book 5, Hadith 2206\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، قَالَ سَمِعْتُ حَارِثَةَ بْنَ وَهْبٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" تَصَدَّقُوا فَيُوشِكُ الرَّجُلُ يَمْشِي بِصَدَقَتِهِ فَيَقُولُ الَّذِي أُعْطِيَهَا لَوْ جِئْتَنَا بِهَا بِالأَمْسِ قَبِلْتُهَا فَأَمَّا الآنَ فَلاَ حَاجَةَ لِي بِهَا . فَلاَ يَجِدُ مَنْ يَقْبَلُهَا \" ."
  },
  "1012": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1012\nIn-book reference  : Book 12, Hadith 75\nUSC-MSA web (English) reference  : Book 5, Hadith 2207\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لَيَأْتِيَنَّ عَلَى النَّاسِ زَمَانٌ يَطُوفُ الرَّجُلُ فِيهِ بِالصَّدَقَةِ مِنَ الذَّهَبِ ثُمَّ لاَ يَجِدُ أَحَدًا يَأْخُذُهَا مِنْهُ وَيُرَى الرَّجُلُ الْوَاحِدُ يَتْبَعُهُ أَرْبَعُونَ امْرَأَةً يَلُذْنَ بِهِ مِنْ قِلَّةِ الرِّجَالِ وَكَثْرَةِ النِّسَاءِ \" . وَفِي رِوَايَةِ ابْنِ بَرَّادٍ \" وَتَرَى الرَّجُلَ \" ."
  },
  "157": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 157d\nIn-book reference  : Book 12, Hadith 77\nUSC-MSA web (English) reference  : Book 5, Hadith 2209\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ أَبِي يُونُسَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ تَقُومُ السَّاعَةُ حَتَّى يَكْثُرَ فِيكُمُ الْمَالُ فَيَفِيضَ حَتَّى يُهِمَّ رَبَّ الْمَالِ مَنْ يَقْبَلُهُ مِنْهُ صَدَقَةً وَيُدْعَى إِلَيْهِ الرَّجُلُ فَيَقُولُ لاَ أَرَبَ لِي فِيهِ \" ."
  },
  "1013": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1013\nIn-book reference  : Book 12, Hadith 78\nUSC-MSA web (English) reference  : Book 5, Hadith 2210\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، وَأَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ يَزِيدَ الرِّفَاعِيُّ - وَاللَّفْظُ لِوَاصِلٍ - قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَقِيءُ الأَرْضُ أَفْلاَذَ كَبِدِهَا أَمْثَالَ الأُسْطُوَانِ مِنَ الذَّهَبِ وَالْفِضَّةِ فَيَجِيءُ الْقَاتِلُ فَيَقُولُ فِي هَذَا قَتَلْتُ . وَيَجِيءُ الْقَاطِعُ فَيَقُولُ فِي هَذَا قَطَعْتُ رَحِمِي . وَيَجِيءُ السَّارِقُ فَيَقُولُ فِي هَذَا قُطِعَتْ يَدِي ثُمَّ يَدَعُونَهُ فَلاَ يَأْخُذُونَ مِنْهُ شَيْئًا \" ."
  },
  "1014": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1014d\nIn-book reference  : Book 12, Hadith 82\nUSC-MSA web (English) reference  : Book 5, Hadith 2213\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ يَعْقُوبَ عَنْ سُهَيْلٍ ."
  },
  "1015": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1015\nIn-book reference  : Book 12, Hadith 83\nUSC-MSA web (English) reference  : Book 5, Hadith 2214\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا فُضَيْلُ بْنُ مَرْزُوقٍ، حَدَّثَنِي عَدِيُّ بْنُ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَيُّهَا النَّاسُ إِنَّ اللَّهَ طَيِّبٌ لاَ يَقْبَلُ إِلاَّ طَيِّبًا وَإِنَّ اللَّهَ أَمَرَ الْمُؤْمِنِينَ بِمَا أَمَرَ بِهِ الْمُرْسَلِينَ فَقَالَ { يَا أَيُّهَا الرُّسُلُ كُلُوا مِنَ الطَّيِّبَاتِ وَاعْمَلُوا صَالِحًا إِنِّي بِمَا تَعْمَلُونَ عَلِيمٌ} وَقَالَ { يَا أَيُّهَا الَّذِينَ آمَنُوا كُلُوا مِنْ طَيِّبَاتِ مَا رَزَقْنَاكُمْ} \" . ثُمَّ ذَكَرَ الرَّجُلَ يُطِيلُ السَّفَرَ أَشْعَثَ أَغْبَرَ يَمُدُّ يَدَيْهِ إِلَى السَّمَاءِ يَا رَبِّ يَا رَبِّ وَمَطْعَمُهُ حَرَامٌ وَمَشْرَبُهُ حَرَامٌ وَمَلْبَسُهُ حَرَامٌ وَغُذِيَ بِالْحَرَامِ فَأَنَّى يُسْتَجَابُ لِذَلِكَ \" ."
  },
  "1016": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1016d\nIn-book reference  : Book 12, Hadith 87\nUSC-MSA web (English) reference  : Book 5, Hadith 2218\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ خَيْثَمَةَ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ النَّارَ فَتَعَوَّذَ مِنْهَا وَأَشَاحَ بِوَجْهِهِ ثَلاَثَ مِرَارٍ ثُمَّ قَالَ \" اتَّقُوا النَّارَ وَلَوْ بِشِقِّ تَمْرَةٍ فَإِنْ لَمْ تَجِدُوا فَبِكَلِمَةٍ طَيِّبَةٍ \" ."
  },
  "1017": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1017d\nIn-book reference  : Book 12, Hadith 91\nUSC-MSA web (English) reference  : Book 5, Hadith 2222\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ مُوسَى بْنِ عَبْدِ اللَّهِ بْنِ، يَزِيدَ وَأَبِي الضُّحَى عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ الْعَبْسِيِّ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، قَالَ جَاءَ نَاسٌ مِنَ الأَعْرَابِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَيْهِمُ الصُّوفُ فَرَأَى سُوءَ حَالِهِمْ . قَدْ أَصَابَتْهُمْ حَاجَةٌ . فَذَكَرَ بِمَعْنَى حَدِيثِهِمْ ."
  },
  "1018": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1018b\nIn-book reference  : Book 12, Hadith 93\nUSC-MSA web (English) reference  : Book 5, Hadith 2224\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنِي سَعِيدُ بْنُ الرَّبِيعِ، ح وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو دَاوُدَ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِ سَعِيدِ بْنِ الرَّبِيعِ قَالَ كُنَّا نُحَامِلُ عَلَى ظُهُورِنَا ."
  },
  "1019": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1019\nIn-book reference  : Book 12, Hadith 94\nUSC-MSA web (English) reference  : Book 5, Hadith 2225\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ \" أَلاَ رَجُلٌ يَمْنَحُ أَهْلَ بَيْتٍ نَاقَةً تَغْدُو بِعُسٍّ وَتَرُوحُ بِعُسٍّ إِنَّ أَجْرَهَا لَعَظِيمٌ \" ."
  },
  "1020": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1020\nIn-book reference  : Book 12, Hadith 95\nUSC-MSA web (English) reference  : Book 5, Hadith 2226\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، بْنُ عَمْرٍو عَنْ زَيْدٍ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ نَهَى فَذَكَرَ خِصَالاً وَقَالَ \" مَنْ مَنَحَ مَنِيحَةً غَدَتْ بِصَدَقَةٍ وَرَاحَتْ بِصَدَقَةٍ صَبُوحِهَا وَغَبُوقِهَا \" ."
  },
  "1021": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1021c\nIn-book reference  : Book 12, Hadith 98\nUSC-MSA web (English) reference  : Book 5, Hadith 2229\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ الْحَضْرَمِيُّ، عَنْ وُهَيْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلُ الْبَخِيلِ وَالْمُتَصَدِّقِ مَثَلُ رَجُلَيْنِ عَلَيْهِمَا جُنَّتَانِ مِنْ حَدِيدٍ إِذَا هَمَّ الْمُتَصَدِّقُ بِصَدَقَةٍ اتَّسَعَتْ عَلَيْهِ حَتَّى تُعَفِّيَ أَثَرَهُ وَإِذَا هَمَّ الْبَخِيلُ بِصَدَقَةٍ تَقَلَّصَتْ عَلَيْهِ وَانْضَمَّتْ يَدَاهُ إِلَى تَرَاقِيهِ وَانْقَبَضَتْ كُلُّ حَلْقَةٍ إِلَى صَاحِبَتِهَا \" . قَالَ فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" فَيَجْهَدُ أَنْ يُوَسِّعَهَا فَلاَ يَسْتَطِيعُ \" ."
  },
  "1022": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1022\nIn-book reference  : Book 12, Hadith 99\nUSC-MSA web (English) reference  : Book 5, Hadith 2230\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنِي حَفْصُ بْنُ مَيْسَرَةَ، عَنْ مُوسَى بْنِ عُقْبَةَ، عَنْ أَبِي، الزِّنَادِ عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" قَالَ رَجُلٌ لأَتَصَدَّقَنَّ اللَّيْلَةَ بِصَدَقَةٍ فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ زَانِيَةٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ اللَّيْلَةَ عَلَى زَانِيَةٍ . قَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ لأَتَصَدَّقَنَّ بِصَدَقَةٍ . فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ غَنِيٍّ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى غَنِيٍّ . قَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى غَنِيٍّ لأَتَصَدَّقَنَّ بِصَدَقَةٍ . فَخَرَجَ بِصَدَقَتِهِ فَوَضَعَهَا فِي يَدِ سَارِقٍ فَأَصْبَحُوا يَتَحَدَّثُونَ تُصُدِّقَ عَلَى سَارِقٍ . فَقَالَ اللَّهُمَّ لَكَ الْحَمْدُ عَلَى زَانِيَةٍ وَعَلَى غَنِيٍّ وَعَلَى سَارِقٍ . فَأُتِيَ فَقِيلَ لَهُ أَمَّا صَدَقَتُكَ فَقَدْ قُبِلَتْ أَمَّا الزَّانِيَةُ فَلَعَلَّهَا تَسْتَعِفُّ بِهَا عَنْ زِنَاهَا وَلَعَلَّ الْغَنِيَّ يَعْتَبِرُ فَيُنْفِقُ مِمَّا أَعْطَاهُ اللَّهُ وَلَعَلَّ السَّارِقَ يَسْتَعِفُّ بِهَا عَنْ سَرِقَتِهِ \" ."
  },
  "1023": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1023\nIn-book reference  : Book 12, Hadith 100\nUSC-MSA web (English) reference  : Book 5, Hadith 2231\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ وَابْنُ نُمَيْرٍ وَأَبُو كُرَيْبٍ كُلُّهُمْ عَنْ أَبِي أُسَامَةَ، - قَالَ أَبُو عَامِرٍ حَدَّثَنَا أَبُو أُسَامَةَ، - حَدَّثَنَا بُرَيْدٌ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ الْخَازِنَ الْمُسْلِمَ الأَمِينَ الَّذِي يُنْفِذُ - وَرُبَّمَا قَالَ يُعْطِي - مَا أُمِرَ بِهِ فَيُعْطِيهِ كَامِلاً مُوَفَّرًا طَيِّبَةً بِهِ نَفْسُهُ فَيَدْفَعُهُ إِلَى الَّذِي أُمِرَ لَهُ بِهِ - أَحَدُ الْمُتَصَدِّقَيْنِ \" ."
  },
  "1024": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1024d\nIn-book reference  : Book 12, Hadith 104\nUSC-MSA web (English) reference  : Book 5, Hadith 2235\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ نَحْوَهُ."
  },
  "1025": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1025b\nIn-book reference  : Book 12, Hadith 106\nUSC-MSA web (English) reference  : Book 5, Hadith 2237\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ يَزِيدَ، - يَعْنِي ابْنَ أَبِي عُبَيْدٍ - قَالَ سَمِعْتُ عُمَيْرًا، مَوْلَى آبِي اللَّحْمِ قَالَ أَمَرَنِي مَوْلاَىَ أَنْ أُقَدِّدَ، لَحْمًا فَجَاءَنِي مِسْكِينٌ فَأَطْعَمْتُهُ مِنْهُ فَعَلِمَ بِذَلِكَ مَوْلاَىَ فَضَرَبَنِي فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَدَعَاهُ . فَقَالَ \" لِمَ ضَرَبْتَهُ \" . فَقَالَ يُعْطِي طَعَامِي بِغَيْرِ أَنْ آمُرَهُ . فَقَالَ \" الأَجْرُ بَيْنَكُمَا \" ."
  },
  "1026": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1026\nIn-book reference  : Book 12, Hadith 107\nUSC-MSA web (English) reference  : Book 5, Hadith 2238\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَصُمِ الْمَرْأَةُ وَبَعْلُهَا شَاهِدٌ إِلاَّ بِإِذْنِهِ وَلاَ تَأْذَنْ فِي بَيْتِهِ وَهُوَ شَاهِدٌ إِلاَّ بِإِذْنِهِ وَمَا أَنْفَقَتْ مِنْ كَسْبِهِ مِنْ غَيْرِ أَمْرِهِ فَإِنَّ نِصْفَ أَجْرِهِ لَهُ \" ."
  },
  "1027": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1027c\nIn-book reference  : Book 12, Hadith 110\nUSC-MSA web (English) reference  : Book 5, Hadith 2241\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا شَيْبَانُ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ دَعَاهُ خَزَنَةُ الْجَنَّةِ كُلُّ خَزَنَةِ بَابٍ أَىْ فُلُ هَلُمَّ \" . فَقَالَ أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ ذَلِكَ الَّذِي لاَ تَوَى عَلَيْهِ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي لأَرْجُو أَنْ تَكُونَ مِنْهُمْ \" ."
  },
  "1028": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1028\nIn-book reference  : Book 12, Hadith 111\nUSC-MSA web (English) reference  : Book 5, Hadith 2242\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ - عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ الأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَصْبَحَ مِنْكُمُ الْيَوْمَ صَائِمًا \" . قَالَ أَبُو بَكْرٍ رضى الله عنه أَنَا . قَالَ \" فَمَنْ تَبِعَ مِنْكُمُ الْيَوْمَ جَنَازَةً \" . قَالَ أَبُو بَكْرٍ رضى الله عنه أَنَا . قَالَ \" فَمَنْ أَطْعَمَ مِنْكُمُ الْيَوْمَ مِسْكِينًا \" . قَالَ أَبُو بَكْرٍ رضى الله عنه أَنَا . قَالَ \" فَمَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا \" . قَالَ أَبُو بَكْرٍ رضى الله عنه أَنَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا اجْتَمَعْنَ فِي امْرِئٍ إِلاَّ دَخَلَ الْجَنَّةَ \" ."
  },
  "1029": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1029d\nIn-book reference  : Book 12, Hadith 115\nUSC-MSA web (English) reference  : Book 5, Hadith 2246\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ، أَنَّ عَبَّادَ بْنَ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، أَخْبَرَهُ عَنْ أَسْمَاءَ، بِنْتِ أَبِي بَكْرٍ أَنَّهَا جَاءَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَتْ يَا نَبِيَّ اللَّهِ لَيْسَ لِي شَىْءٌ إِلاَّ مَا أَدْخَلَ عَلَىَّ الزُّبَيْرُ فَهَلْ عَلَىَّ جُنَاحٌ أَنْ أَرْضَخَ مِمَّا يُدْخِلُ عَلَىَّ فَقَالَ \" ارْضَخِي مَا اسْتَطَعْتِ وَلاَ تُوعِي فَيُوعِيَ اللَّهُ عَلَيْكِ \" ."
  },
  "1030": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1030\nIn-book reference  : Book 12, Hadith 116\nUSC-MSA web (English) reference  : Book 5, Hadith 2247\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا اللَّيْثُ بْنُ سَعْدٍ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا اللَّيْثُ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ \" يَا نِسَاءَ الْمُسْلِمَاتِ لاَ تَحْقِرَنَّ جَارَةٌ لِجَارَتِهَا وَلَوْ فِرْسِنَ شَاةٍ \" ."
  },
  "1031": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1031b\nIn-book reference  : Book 12, Hadith 118\nUSC-MSA web (English) reference  : Book 5, Hadith 2249\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، - أَوْ عَنْ أَبِي هُرَيْرَةَ، - أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ عُبَيْدِ اللَّهِ . وَقَالَ \" وَرَجُلٌ مُعَلَّقٌ بِالْمَسْجِدِ إِذَا خَرَجَ مِنْهُ حَتَّى يَعُودَ إِلَيْهِ \" ."
  },
  "1032": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1032c\nIn-book reference  : Book 12, Hadith 121\nUSC-MSA web (English) reference  : Book 5, Hadith 2252\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا عُمَارَةُ بْنُ الْقَعْقَاعِ، بِهَذَا الإِسْنَادِ نَحْوَ حَدِيثِ جَرِيرٍ غَيْرَ أَنَّهُ قَالَ أَىُّ الصَّدَقَةِ أَفْضَلُ ."
  },
  "1033": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1033\nIn-book reference  : Book 12, Hadith 122\nUSC-MSA web (English) reference  : Book 5, Hadith 2253\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ نَافِعٍ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ عَلَى الْمِنْبَرِ وَهُوَ يَذْكُرُ الصَّدَقَةَ وَالتَّعَفُّفَ عَنِ الْمَسْأَلَةِ \" الْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَالْيَدُ الْعُلْيَا الْمُنْفِقَةُ وَالسُّفْلَى السَّائِلَةُ \" ."
  },
  "1034": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1034\nIn-book reference  : Book 12, Hadith 123\nUSC-MSA web (English) reference  : Book 5, Hadith 2254\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَأَحْمَدُ بْنُ عَبْدَةَ، جَمِيعًا عَنْ يَحْيَى الْقَطَّانِ، - قَالَ ابْنُ بَشَّارٍ حَدَّثَنَا يَحْيَى، - حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ سَمِعْتُ مُوسَى بْنَ طَلْحَةَ، يُحَدِّثُ أَنَّ حَكِيمَ بْنَ حِزَامٍ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَفْضَلُ الصَّدَقَةِ - أَوْ خَيْرُ الصَّدَقَةِ - عَنْ ظَهْرِ غِنًى وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى وَابْدَأْ بِمَنْ تَعُولُ \"."
  },
  "1035": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1035\nIn-book reference  : Book 12, Hadith 124\nUSC-MSA web (English) reference  : Book 5, Hadith 2255\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، وَسَعِيدٍ، عَنْ حَكِيمِ بْنِ حِزَامٍ، قَالَ سَأَلْتُ النَّبِيَّ صلى الله عليه وسلم فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ سَأَلْتُهُ فَأَعْطَانِي ثُمَّ قَالَ \" إِنَّ هَذَا الْمَالَ خَضِرَةٌ حُلْوَةٌ فَمَنْ أَخَذَهُ بِطِيبِ نَفْسٍ بُورِكَ لَهُ فِيهِ وَمَنْ أَخَذَهُ بِإِشْرَافِ نَفْسٍ لَمْ يُبَارَكْ لَهُ فِيهِ وَكَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى \" ."
  },
  "1036": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1036\nIn-book reference  : Book 12, Hadith 125\nUSC-MSA web (English) reference  : Book 5, Hadith 2256\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا شَدَّادٌ، قَالَ سَمِعْتُ أَبَا أُمَامَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا ابْنَ آدَمَ إِنَّكَ أَنْ تَبْذُلَ الْفَضْلَ خَيْرٌ لَكَ وَأَنْ تُمْسِكَهُ شَرٌّ لَكَ وَلاَ تُلاَمُ عَلَى كَفَافٍ وَابْدَأْ بِمَنْ تَعُولُ وَالْيَدُ الْعُلْيَا خَيْرٌ مِنَ الْيَدِ السُّفْلَى \"."
  },
  "1037": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1037b\nIn-book reference  : Book 12, Hadith 129\nUSC-MSA web (English) reference  : Book 5, Hadith 2260\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، وَهُوَ يَخْطُبُ يَقُولُ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَإِنَّمَا أَنَا قَاسِمٌ وَيُعْطِي اللَّهُ \" ."
  },
  "1038": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1038b\nIn-book reference  : Book 12, Hadith 128\nUSC-MSA web (English) reference  : Book 5, Hadith 2259\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، حَدَّثَنِي وَهْبُ بْنُ، مُنَبِّهٍ - وَدَخَلْتُ عَلَيْهِ فِي دَارِهِ بِصَنْعَاءَ فَأَطْعَمَنِي مِنْ جَوْزَةٍ فِي دَارِهِ - عَنْ أَخِيهِ قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ . فَذَكَرَ مِثْلَهُ ."
  },
  "1039": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1039c\nIn-book reference  : Book 12, Hadith 132\nUSC-MSA web (English) reference  : Book 5, Hadith 2262\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي شَرِيكٌ، أَخْبَرَنِي عَطَاءُ بْنُ يَسَارٍ، وَعَبْدُ الرَّحْمَنِ بْنُ أَبِي عَمْرَةَ، أَنَّهُمَا سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ إِسْمَاعِيلَ ."
  },
  "1040": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1040c\nIn-book reference  : Book 12, Hadith 135\nUSC-MSA web (English) reference  : Book 5, Hadith 2265\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي اللَّيْثُ، عَنْ عُبَيْدِ اللَّهِ بْنِ، أَبِي جَعْفَرٍ عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ سَمِعَ أَبَاهُ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا يَزَالُ الرَّجُلُ يَسْأَلُ النَّاسَ حَتَّى يَأْتِيَ يَوْمَ الْقِيَامَةِ وَلَيْسَ فِي وَجْهِهِ مُزْعَةُ لَحْمٍ \" ."
  },
  "1041": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1041\nIn-book reference  : Book 12, Hadith 136\nUSC-MSA web (English) reference  : Book 5, Hadith 2266\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، وَوَاصِلُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ بْنِ، الْقَعْقَاعِ عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ سَأَلَ النَّاسَ أَمْوَالَهُمْ تَكَثُّرًا فَإِنَّمَا يَسْأَلُ جَمْرًا فَلْيَسْتَقِلَّ أَوْ لِيَسْتَكْثِرْ \" ."
  },
  "1042": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1042c\nIn-book reference  : Book 12, Hadith 139\nUSC-MSA web (English) reference  : Book 5, Hadith 2269\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو، بْنُ الْحَارِثِ عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي عُبَيْدٍ، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لأَنْ يَحْتَزِمَ أَحَدُكُمْ حُزْمَةً مِنْ حَطَبٍ فَيَحْمِلَهَا عَلَى ظَهْرِهِ فَيَبِيعَهَا خَيْرٌ لَهُ مِنْ أَنْ يَسْأَلَ رَجُلاً يُعْطِيهِ أَوْ يَمْنَعُهُ \" ."
  },
  "1043": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1043\nIn-book reference  : Book 12, Hadith 140\nUSC-MSA web (English) reference  : Book 5, Hadith 2270\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَسَلَمَةُ بْنُ شَبِيبٍ، - قَالَ سَلَمَةُ حَدَّثَنَا وَقَالَ الدَّارِمِيُّ، أَخْبَرَنَا مَرْوَانُ، وَهُوَ ابْنُ مُحَمَّدٍ الدِّمَشْقِيُّ - حَدَّثَنَا سَعِيدٌ، - وَهُوَ ابْنُ عَبْدِ الْعَزِيزِ - عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ أَبِي إِدْرِيسَ الْخَوْلاَنِيِّ، عَنْ أَبِي مُسْلِمٍ الْخَوْلاَنِيِّ، قَالَ حَدَّثَنِي الْحَبِيبُ الأَمِينُ، أَمَّا هُوَ فَحَبِيبٌ إِلَىَّ وَأَمَّا هُوَ عِنْدِي فَأَمِينٌ عَوْفُ بْنُ مَالِكٍ الأَشْجَعِيُّ قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم تِسْعَةً أَوْ ثَمَانِيَةً أَوْ سَبْعَةً فَقَالَ \" أَلاَ تُبَايِعُونَ رَسُولَ اللَّهِ \" وَكُنَّا حَدِيثَ عَهْدٍ بِبَيْعَةٍ فَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ . ثُمَّ قَالَ \" أَلاَ تُبَايِعُونَ رَسُولَ اللَّهِ \" . فَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ . ثُمَّ قَالَ \" أَلاَ تُبَايِعُونَ رَسُولَ اللَّهِ \" . قَالَ فَبَسَطْنَا أَيْدِيَنَا وَقُلْنَا قَدْ بَايَعْنَاكَ يَا رَسُولَ اللَّهِ فَعَلاَمَ نُبَايِعُكَ قَالَ \" عَلَى أَنْ تَعْبُدُوا اللَّهَ وَلاَ تُشْرِكُوا بِهِ شَيْئًا وَالصَّلَوَاتِ الْخَمْسِ وَتُطِيعُوا - وَأَسَرَّ كَلِمَةً خَفِيَّةً - وَلاَ تَسْأَلُوا النَّاسَ شَيْئًا \" . فَلَقَدْ رَأَيْتُ بَعْضَ أُولَئِكَ النَّفَرِ يَسْقُطُ سَوْطُ أَحَدِهِمْ فَمَا يَسْأَلُ أَحَدًا يُنَاوِلُهُ إِيَّاهُ ."
  },
  "1044": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1044\nIn-book reference  : Book 12, Hadith 141\nUSC-MSA web (English) reference  : Book 5, Hadith 2271\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ حَمَّادِ بْنِ زَيْدٍ، قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ هَارُونَ بْنِ رِيَابٍ، حَدَّثَنِي كِنَانَةُ بْنُ نُعَيْمٍ الْعَدَوِيُّ، عَنْ قَبِيصَةَ بْنِ، مُخَارِقٍ الْهِلاَلِيِّ قَالَ تَحَمَّلْتُ حَمَالَةً فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم أَسْأَلُهُ فِيهَا فَقَالَ \" أَقِمْ حَتَّى تَأْتِيَنَا الصَّدَقَةُ فَنَأْمُرَ لَكَ بِهَا \" . قَالَ ثُمَّ قَالَ \" يَا قَبِيصَةُ إِنَّ الْمَسْأَلَةَ لاَ تَحِلُّ إِلاَّ لأَحَدِ ثَلاَثَةٍ رَجُلٍ تَحَمَّلَ حَمَالَةً فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَهَا ثُمَّ يُمْسِكُ وَرَجُلٍ أَصَابَتْهُ جَائِحَةٌ اجْتَاحَتْ مَالَهُ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ - أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ - وَرَجُلٍ أَصَابَتْهُ فَاقَةٌ حَتَّى يَقُومَ ثَلاَثَةٌ مِنْ ذَوِي الْحِجَا مِنْ قَوْمِهِ لَقَدْ أَصَابَتْ فُلاَنًا فَاقَةٌ فَحَلَّتْ لَهُ الْمَسْأَلَةُ حَتَّى يُصِيبَ قِوَامًا مِنْ عَيْشٍ - أَوْ قَالَ سِدَادًا مِنْ عَيْشٍ - فَمَا سِوَاهُنَّ مِنَ الْمَسْأَلَةِ يَا قَبِيصَةُ سُحْتًا يَأْكُلُهَا صَاحِبُهَا سُحْتًا \" ."
  },
  "1045": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1045e\nIn-book reference  : Book 12, Hadith 146\nUSC-MSA web (English) reference  : Book 5, Hadith 2276\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنِ ابْنِ السَّعْدِيِّ، أَنَّهُ قَالَ اسْتَعْمَلَنِي عُمَرُ بْنُ الْخَطَّابِ - رضى الله عنه - عَلَى الصَّدَقَةِ . بِمِثْلِ حَدِيثِ اللَّيْثِ ."
  },
  "1046": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1046b\nIn-book reference  : Book 12, Hadith 148\nUSC-MSA web (English) reference  : Book 5, Hadith 2278\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" قَلْبُ الشَّيْخِ شَابٌّ عَلَى حُبِّ اثْنَتَيْنِ طُولُ الْحَيَاةِ وَحُبُّ الْمَالِ \" ."
  },
  "1047": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1047c\nIn-book reference  : Book 12, Hadith 151\nUSC-MSA web (English) reference  : Book 5, Hadith 2281\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ."
  },
  "1048": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1048c\nIn-book reference  : Book 12, Hadith 154\nUSC-MSA web (English) reference  : Book 5, Hadith 2284\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنِي ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" لَوْ كَانَ لاِبْنِ آدَمَ وَادٍ مِنْ ذَهَبٍ أَحَبَّ أَنَّ لَهُ وَادِيًا آخَرَ وَلَنْ يَمْلأَ فَاهُ إِلاَّ التُّرَابُ وَاللَّهُ يَتُوبُ عَلَى مَنْ تَابَ \" ."
  },
  "1049": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1049\nIn-book reference  : Book 12, Hadith 155\nUSC-MSA web (English) reference  : Book 5, Hadith 2285\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لَوْ أَنَّ لاِبْنِ آدَمَ مِلْءَ وَادٍ مَالاً لأَحَبَّ أَنْ يَكُونَ إِلَيْهِ مِثْلُهُ وَلاَ يَمْلأُ نَفْسَ ابْنِ آدَمَ إِلاَّ التُّرَابُ وَاللَّهُ يَتُوبُ عَلَى مَنْ تَابَ \" . قَالَ ابْنُ عَبَّاسٍ فَلاَ أَدْرِي أَمِنَ الْقُرْآنِ هُوَ أَمْ لاَ . وَفِي رِوَايَةِ زُهَيْرٍ قَالَ فَلاَ أَدْرِي أَمِنَ الْقُرْآنِ . لَمْ يَذْكُرِ ابْنَ عَبَّاسٍ ."
  },
  "1050": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1050\nIn-book reference  : Book 12, Hadith 156\nUSC-MSA web (English) reference  : Book 5, Hadith 2286\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ دَاوُدَ، عَنْ أَبِي حَرْبِ بْنِ أَبِي، الأَسْوَدِ عَنْ أَبِيهِ، قَالَ بَعَثَ أَبُو مُوسَى الأَشْعَرِيُّ إِلَى قُرَّاءِ أَهْلِ الْبَصْرَةِ فَدَخَلَ عَلَيْهِ ثَلاَثُمِائَةِ رَجُلٍ قَدْ قَرَءُوا الْقُرْآنَ فَقَالَ أَنْتُمْ خِيَارُ أَهْلِ الْبَصْرَةِ وَقُرَّاؤُهُمْ فَاتْلُوهُ وَلاَ يَطُولَنَّ عَلَيْكُمُ الأَمَدُ فَتَقْسُوَ قُلُوبُكُمْ كَمَا قَسَتْ قُلُوبُ مَنْ كَانَ قَبْلَكُمْ وَإِنَّا كُنَّا نَقْرَأُ سُورَةً كُنَّا نُشَبِّهُهَا فِي الطُّولِ وَالشِّدَّةِ بِبَرَاءَةَ فَأُنْسِيتُهَا غَيْرَ أَنِّي قَدْ حَفِظْتُ مِنْهَا لَوْ كَانَ لاِبْنِ آدَمَ وَادِيَانِ مِنْ مَالٍ لاَبْتَغَى وَادِيًا ثَالِثًا وَلاَ يَمْلأُ جَوْفَ ابْنِ آدَمَ إِلاَّ التُّرَابُ . وَكُنَّا نَقْرَأُ سُورَةً كُنَّا نُشَبِّهُهَا بِإِحْدَى الْمُسَبِّحَاتِ فَأُنْسِيتُهَا غَيْرَ أَنِّي حَفِظْتُ مِنْهَا { يَا أَيُّهَا الَّذِينَ آمَنُوا لِمَ تَقُولُونَ مَا لاَ تَفْعَلُونَ} فَتُكْتَبُ شَهَادَةً فِي أَعْنَاقِكُمْ فَتُسْأَلُونَ عَنْهَا يَوْمَ الْقِيَامَةِ ."
  },
  "1051": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1051\nIn-book reference  : Book 12, Hadith 157\nUSC-MSA web (English) reference  : Book 5, Hadith 2287\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ الْغِنَى عَنْ كَثْرَةِ الْعَرَضِ وَلَكِنَّ الْغِنَى غِنَى النَّفْسِ \" ."
  },
  "1052": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1052c\nIn-book reference  : Book 12, Hadith 160\nUSC-MSA web (English) reference  : Book 5, Hadith 2290\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، أَخْبَرَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ جَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ وَجَلَسْنَا حَوْلَهُ فَقَالَ \" إِنَّ مِمَّا أَخَافُ عَلَيْكُمْ بَعْدِي مَا يُفْتَحُ عَلَيْكُمْ مِنْ زَهْرَةِ الدُّنْيَا وَزِينَتِهَا \" . فَقَالَ رَجُلٌ أَوَيَأْتِي الْخَيْرُ بِالشَّرِّ يَا رَسُولَ اللَّهِ قَالَ فَسَكَتَ عَنْهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقِيلَ لَهُ مَا شَأْنُكَ تُكَلِّمُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَلاَ يُكَلِّمُكَ قَالَ وَرُئِينَا أَنَّهُ يُنْزَلُ عَلَيْهِ فَأَفَاقَ يَمْسَحُ عَنْهُ الرُّحَضَاءَ وَقَالَ \" إِنَّ هَذَا السَّائِلَ - وَكَأَنَّهُ حَمِدَهُ فَقَالَ - إِنَّهُ لاَ يَأْتِي الْخَيْرُ بِالشَّرِّ وَإِنَّ مِمَّا يُنْبِتُ الرَّبِيعُ يَقْتُلُ أَوْ يُلِمُّ إِلاَّ آكِلَةَ الْخَضِرِ فَإِنَّهَا أَكَلَتْ حَتَّى إِذَا امْتَلأَتْ خَاصِرَتَاهَا اسْتَقْبَلَتْ عَيْنَ الشَّمْسِ فَثَلَطَتْ وَبَالَتْ ثُمَّ رَتَعَتْ وَإِنَّ هَذَا الْمَالَ خَضِرٌ حُلْوٌ وَنِعْمَ صَاحِبُ الْمُسْلِمِ هُوَ لِمَنْ أَعْطَى مِنْهُ الْمِسْكِينَ وَالْيَتِيمَ وَابْنَ السَّبِيلِ أَوْ كَمَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَإِنَّهُ مَنْ يَأْخُذُهُ بِغَيْرِ حَقِّهِ كَانَ كَالَّذِي يَأْكُلُ وَلاَ يَشْبَعُ وَيَكُونُ عَلَيْهِ شَهِيدًا يَوْمَ الْقِيَامَةِ \" ."
  },
  "1053": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1053b\nIn-book reference  : Book 12, Hadith 162\nUSC-MSA web (English) reference  : Book 5, Hadith 2292\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . نَحْوَهُ ."
  },
  "1054": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1054\nIn-book reference  : Book 12, Hadith 163\nUSC-MSA web (English) reference  : Book 5, Hadith 2293\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو عَبْدِ الرَّحْمَنِ الْمُقْرِئُ، عَنْ سَعِيدِ بْنِ أَبِي، أَيُّوبَ حَدَّثَنِي شُرَحْبِيلُ، - وَهُوَ ابْنُ شَرِيكٍ - عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ، بْنِ عَمْرِو بْنِ الْعَاصِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" قَدْ أَفْلَحَ مَنْ أَسْلَمَ وَرُزِقَ كَفَافًا وَقَنَّعَهُ اللَّهُ بِمَا آتَاهُ \" ."
  },
  "1055": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1055\nIn-book reference  : Book 12, Hadith 164\nUSC-MSA web (English) reference  : Book 5, Hadith 2294\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالُوا حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ أَبِيهِ، كِلاَهُمَا عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ اجْعَلْ رِزْقَ آلِ مُحَمَّدٍ قُوتًا \" ."
  },
  "1056": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1056\nIn-book reference  : Book 12, Hadith 165\nUSC-MSA web (English) reference  : Book 5, Hadith 2295\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ سَلْمَانَ، بْنِ رَبِيعَةَ قَالَ قَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَسْمًا فَقُلْتُ وَاللَّهِ يَا رَسُولَ اللَّهِ لَغَيْرُ هَؤُلاَءِ كَانَ أَحَقَّ بِهِ مِنْهُمْ . قَالَ \" إِنَّهُمْ خَيَّرُونِي أَنْ يَسْأَلُونِي بِالْفُحْشِ أَوْ يُبَخِّلُونِي فَلَسْتُ بِبَاخِلٍ \" ."
  },
  "1057": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1057b\nIn-book reference  : Book 12, Hadith 167\nUSC-MSA web (English) reference  : Book 5, Hadith 2297\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا هَمَّامٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، ح وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا أَبُو الْمُغِيرَةِ، حَدَّثَنَا الأَوْزَاعِيُّ، كُلُّهُمْ عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ، بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ . وَفِي حَدِيثِ عِكْرِمَةَ بْنِ عَمَّارٍ مِنَ الزِّيَادَةِ قَالَ ثُمَّ جَبَذَهُ إِلَيْهِ جَبْذَةً رَجَعَ نَبِيُّ اللَّهِ صلى الله عليه وسلم فِي نَحْرِ الأَعْرَابِيِّ . وَفِي حَدِيثِ هَمَّامٍ فَجَاذَبَهُ حَتَّى انْشَقَّ الْبُرْدُ وَحَتَّى بَقِيَتْ حَاشِيَتُهُ فِي عُنُقِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1058": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1058b\nIn-book reference  : Book 12, Hadith 169\nUSC-MSA web (English) reference  : Book 5, Hadith 2299\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو الْخَطَّابِ، زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ حَدَّثَنَا حَاتِمُ بْنُ وَرْدَانَ أَبُو صَالِحٍ، حَدَّثَنَا أَيُّوبُ السَّخْتِيَانِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُلَيْكَةَ، عَنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، قَالَ قَدِمَتْ عَلَى النَّبِيِّ صلى الله عليه وسلم أَقْبِيَةٌ فَقَالَ لِي أَبِي مَخْرَمَةُ انْطَلِقْ بِنَا إِلَيْهِ عَسَى أَنْ يُعْطِيَنَا مِنْهَا شَيْئًا . قَالَ فَقَامَ أَبِي عَلَى الْبَابِ فَتَكَلَّمَ فَعَرَفَ النَّبِيُّ صلى الله عليه وسلم صَوْتَهُ فَخَرَجَ وَمَعَهُ قَبَاءٌ وَهُوَ يُرِيهِ مَحَاسِنَهُ وَهُوَ يَقُولُ \" خَبَأْتُ هَذَا لَكَ خَبَأْتُ هَذَا لَكَ \" ."
  },
  "150": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 150g\nIn-book reference  : Book 12, Hadith 172\nUSC-MSA web (English) reference  : Book 5, Hadith 2302\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ سَعْدٍ، يُحَدِّثُ بِهَذَا الْحَدِيثِ - يَعْنِي حَدِيثَ الزُّهْرِيِّ الَّذِي ذَكَرْنَا - فَقَالَ فِي حَدِيثِهِ فَضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ بَيْنَ عُنُقِي وَكَتِفِي ثُمَّ قَالَ \" أَقِتَالاً أَىْ سَعْدُ إِنِّي لأُعْطِي الرَّجُلَ \" ."
  },
  "1059": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1059g\nIn-book reference  : Book 12, Hadith 179\nUSC-MSA web (English) reference  : Book 5, Hadith 2309\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، وَحَامِدُ بْنُ عُمَرَ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ ابْنُ مُعَاذٍ حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، قَالَ حَدَّثَنِي السُّمَيْطُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ افْتَتَحْنَا مَكَّةَ ثُمَّ إِنَّا غَزَوْنَا حُنَيْنًا فَجَاءَ الْمُشْرِكُونَ بِأَحْسَنِ صُفُوفٍ رَأَيْتُ - قَالَ - فَصُفَّتِ الْخَيْلُ ثُمَّ صُفَّتِ الْمُقَاتِلَةُ ثُمَّ صُفَّتِ النِّسَاءُ مِنْ وَرَاءِ ذَلِكَ ثُمَّ صُفَّتِ الْغَنَمُ ثُمَّ صُفَّتِ النَّعَمُ - قَالَ - وَنَحْنُ بَشَرٌ كَثِيرٌ قَدْ بَلَغْنَا سِتَّةَ آلاَفٍ وَعَلَى مُجَنِّبَةِ خَيْلِنَا خَالِدُ بْنُ الْوَلِيدِ - قَالَ - فَجَعَلَتْ خَيْلُنَا تَلْوِي خَلْفَ ظُهُورِنَا فَلَمْ نَلْبَثْ أَنِ انْكَشَفَتْ خَيْلُنَا وَفَرَّتِ الأَعْرَابُ وَمَنْ نَعْلَمُ مِنَ النَّاسِ - قَالَ - فَنَادَى رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا لَلْمُهَاجِرِينَ يَا لَلْمُهَاجِرِينَ \" . ثُمَّ قَالَ \" يَا لَلأَنْصَارِ يَا لَلأَنْصَارِ \" . قَالَ قَالَ أَنَسٌ هَذَا حَدِيثُ عِمِّيَّةٍ . قَالَ قُلْنَا لَبَّيْكَ يَا رَسُولَ اللَّهِ - قَالَ - فَتَقَدَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - فَايْمُ اللَّهِ مَا أَتَيْنَاهُمْ حَتَّى هَزَمَهُمُ اللَّهُ - قَالَ - فَقَبَضْنَا ذَلِكَ الْمَالَ ثُمَّ انْطَلَقْنَا إِلَى الطَّائِفِ فَحَاصَرْنَاهُمْ أَرْبَعِينَ لَيْلَةً ثُمَّ رَجَعْنَا إِلَى مَكَّةَ فَنَزَلْنَا - قَالَ - فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعْطِي الرَّجُلَ الْمِائَةَ مِنَ الإِبِلِ . ثُمَّ ذَكَرَ بَاقِيَ الْحَدِيثِ كَنَحْوِ حَدِيثِ قَتَادَةَ وَأَبِي التَّيَّاحِ وَهِشَامِ بْنِ زَيْدٍ ."
  },
  "1060": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1060c\nIn-book reference  : Book 12, Hadith 182\nUSC-MSA web (English) reference  : Book 5, Hadith 2312\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مَخْلَدُ بْنُ خَالِدٍ الشَّعِيرِيُّ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنِي عُمَرُ بْنُ سَعِيدٍ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ فِي الْحَدِيثِ عَلْقَمَةَ بْنَ عُلاَثَةَ وَلاَ صَفْوَانَ بْنَ أُمَيَّةَ وَلَمْ يَذْكُرِ الشِّعْرَ فِي حَدِيثِهِ."
  },
  "1061": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1061\nIn-book reference  : Book 12, Hadith 183\nUSC-MSA web (English) reference  : Book 5, Hadith 2313\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَمْرِو بْنِ يَحْيَى بْنِ عُمَارَةَ، عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا فَتَحَ حُنَيْنًا قَسَمَ الْغَنَائِمَ فَأَعْطَى الْمُؤَلَّفَةَ قُلُوبُهُمْ فَبَلَغَهُ أَنَّ الأَنْصَارَ يُحِبُّونَ أَنْ يُصِيبُوا مَا أَصَابَ النَّاسُ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَطَبَهُمْ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ \" يَا مَعْشَرَ الأَنْصَارِ أَلَمْ أَجِدْكُمْ ضُلاَّلاً فَهَدَاكُمُ اللَّهُ بِي وَعَالَةً فَأَغْنَاكُمُ اللَّهُ بِي وَمُتَفَرِّقِينَ فَجَمَعَكُمُ اللَّهُ بِي \" . وَيَقُولُونَ اللَّهُ وَرَسُولُهُ أَمَنُّ . فَقَالَ \" أَلاَ تُجِيبُونِي \" . فَقَالُوا اللَّهُ وَرَسُولُهُ أَمَنُّ . فَقَالَ \" أَمَا إِنَّكُمْ لَوْ شِئْتُمْ أَنْ تَقُولُوا كَذَا وَكَذَا وَكَانَ مِنَ الأَمْرِ كَذَا وَكَذَا \" . لأَشْيَاءَ عَدَّدَهَا . زَعَمَ عَمْرٌو أَنْ لاَ يَحْفَظُهَا فَقَالَ \" أَلاَ تَرْضَوْنَ أَنْ يَذْهَبَ النَّاسُ بِالشَّاءِ وَالإِبِلِ وَتَذْهَبُونَ بِرَسُولِ اللَّهِ إِلَى رِحَالِكُمُ الأَنْصَارُ شِعَارٌ وَالنَّاسُ دِثَارٌ وَلَوْلاَ الْهِجْرَةُ لَكُنْتُ امْرَأً مِنَ الأَنْصَارِ وَلَوْ سَلَكَ النَّاسُ وَادِيًا وَشِعْبًا لَسَلَكْتُ وَادِيَ الأَنْصَارِ وَشِعْبَهُمْ إِنَّكُمْ سَتَلْقَوْنَ بَعْدِي أَثَرَةً فَاصْبِرُوا حَتَّى تَلْقَوْنِي عَلَى الْحَوْضِ \" ."
  },
  "1062": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1062b\nIn-book reference  : Book 12, Hadith 185\nUSC-MSA web (English) reference  : Book 5, Hadith 2315\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَسْمًا فَقَالَ رَجُلٌ إِنَّهَا لَقِسْمَةٌ مَا أُرِيدَ بِهَا وَجْهُ اللَّهِ - قَالَ - فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَسَارَرْتُهُ فَغَضِبَ مِنْ ذَلِكَ غَضَبًا شَدِيدًا وَاحْمَرَّ وَجْهُهُ حَتَّى تَمَنَّيْتُ أَنِّي لَمْ أَذْكُرْهُ لَهُ - قَالَ - ثُمَّ قَالَ \" قَدْ أُوذِيَ مُوسَى بِأَكْثَرَ مِنْ هَذَا فَصَبَرَ \" ."
  },
  "1063": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1063b\nIn-book reference  : Book 12, Hadith 187\nUSC-MSA web (English) reference  : Book 5, Hadith 2317\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، ح. وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنِي قُرَّةُ بْنُ خَالِدٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْسِمُ مَغَانِمَ . وَسَاقَ الْحَدِيثَ ."
  },
  "1064": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1064f\nIn-book reference  : Book 12, Hadith 193\nUSC-MSA web (English) reference  : Book 5, Hadith 2323\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح . وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ الْفِهْرِيُّ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَالضَّحَّاكُ الْهَمْدَانِيُّ، أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَهُوَ يَقْسِمُ قَسْمًا أَتَاهُ ذُو الْخُوَيْصِرَةِ وَهُوَ رَجُلٌ مِنْ بَنِي تَمِيمٍ فَقَالَ يَا رَسُولَ اللَّهِ اعْدِلْ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَيْلَكَ وَمَنْ يَعْدِلُ إِنْ لَمْ أَعْدِلْ قَدْ خِبْتَ وَخَسِرْتَ إِنْ لَمْ أَعْدِلْ \" . فَقَالَ عُمَرُ بْنُ الْخَطَّابِ رضى الله عنه يَا رَسُولَ اللَّهِ ائْذَنْ لِي فِيهِ أَضْرِبْ عُنُقَهُ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" دَعْهُ فَإِنَّ لَهُ أَصْحَابًا يَحْقِرُ أَحَدُكُمْ صَلاَتَهُ مَعَ صَلاَتِهِمْ وَصِيَامَهُ مَعَ صِيَامِهِمْ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ تَرَاقِيَهُمْ يَمْرُقُونَ مِنَ الإِسْلاَمِ كَمَا يَمْرُقُ السَّهْمُ مِنَ الرَّمِيَّةِ يُنْظَرُ إِلَى نَصْلِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ ثُمَّ يُنْظَرُ إِلَى رِصَافِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ ثُمَّ يُنْظَرُ إِلَى نَضِيِّهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ - وَهُوَ الْقِدْحُ - ثُمَّ يُنْظَرُ إِلَى قُذَذِهِ فَلاَ يُوجَدُ فِيهِ شَىْءٌ سَبَقَ الْفَرْثَ وَالدَّمَ . آيَتُهُمْ رَجُلٌ أَسْوَدُ إِحْدَى عَضُدَيْهِ مِثْلُ ثَدْىِ الْمَرْأَةِ أَوْ مِثْلُ الْبَضْعَةِ تَدَرْدَرُ يَخْرُجُونَ عَلَى حِينِ فُرْقَةٍ مِنَ النَّاسِ \" . قَالَ أَبُو سَعِيدٍ فَأَشْهَدُ أَنِّي سَمِعْتُ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَشْهَدُ أَنَّ عَلِيَّ بْنَ أَبِي طَالِبٍ - رضى الله عنه - قَاتَلَهُمْ وَأَنَا مَعَهُ فَأَمَرَ بِذَلِكَ الرَّجُلِ فَالْتُمِسَ فَوُجِدَ فَأُتِيَ بِهِ حَتَّى نَظَرْتُ إِلَيْهِ عَلَى نَعْتِ رَسُولِ اللَّهِ صلى الله عليه وسلم الَّذِي نَعَتَ ."
  },
  "1065": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1065e\nIn-book reference  : Book 12, Hadith 198\nUSC-MSA web (English) reference  : Book 5, Hadith 2327\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي عُبَيْدُ اللَّهِ الْقَوَارِيرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، حَدَّثَنَا سُفْيَانُ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنِ الضَّحَّاكِ الْمِشْرَقِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي حَدِيثٍ ذَكَرَ فِيهِ قَوْمًا يَخْرُجُونَ عَلَى فُرْقَةٍ مُخْتَلِفَةٍ يَقْتُلُهُمْ أَقْرَبُ الطَّائِفَتَيْنِ مِنَ الْحَقِّ ."
  },
  "1066": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1066g\nIn-book reference  : Book 12, Hadith 205\nUSC-MSA web (English) reference  : Book 5, Hadith 2334\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ بُكَيْرِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ الْحَرُورِيَّةَ لَمَّا خَرَجَتْ وَهُوَ مَعَ عَلِيِّ بْنِ أَبِي طَالِبٍ - رضى الله عنه - قَالُوا لاَ حُكْمَ إِلاَّ لِلَّهِ . قَالَ عَلِيٌّ كَلِمَةُ حَقٍّ أُرِيدَ بِهَا بَاطِلٌ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَصَفَ نَاسًا إِنِّي لأَعْرِفُ صِفَتَهُمْ فِي هَؤُلاَءِ \" يَقُولُونَ الْحَقَّ بِأَلْسِنَتِهِمْ لاَ يَجُوزُ هَذَا مِنْهُمْ - وَأَشَارَ إِلَى حَلْقِهِ - مِنْ أَبْغَضِ خَلْقِ اللَّهِ إِلَيْهِ مِنْهُمْ أَسْوَدُ إِحْدَى يَدَيْهِ طُبْىُ شَاةٍ أَوْ حَلَمَةُ ثَدْىٍ \" . فَلَمَّا قَتَلَهُمْ عَلِيُّ بْنُ أَبِي طَالِبٍ - رضى الله عنه - قَالَ انْظُرُوا . فَنَظَرُوا فَلَمْ يَجِدُوا شَيْئًا فَقَالَ ارْجِعُوا فَوَاللَّهِ مَا كَذَبْتُ وَلاَ كُذِبْتُ . مَرَّتَيْنِ أَوْ ثَلاَثًا ثُمَّ وَجَدُوهُ فِي خَرِبَةٍ فَأَتَوْا بِهِ حَتَّى وَضَعُوهُ بَيْنَ يَدَيْهِ . قَالَ عُبَيْدُ اللَّهِ وَأَنَا حَاضِرُ ذَلِكَ مِنْ أَمْرِهِمْ . وَقَوْلِ عَلِيٍّ فِيهِمْ زَادَ يُونُسُ فِي رِوَايَتِهِ قَالَ بُكَيْرٌ وَحَدَّثَنِي رَجُلٌ عَنِ ابْنِ حُنَيْنٍ أَنَّهُ قَالَ رَأَيْتُ ذَلِكَ الأَسْوَدَ ."
  },
  "1067": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1067\nIn-book reference  : Book 12, Hadith 206\nUSC-MSA web (English) reference  : Book 5, Hadith 2335\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ بَعْدِي مِنْ أُمَّتِي - أَوْ سَيَكُونُ بَعْدِي مِنْ أُمَّتِي - قَوْمٌ يَقْرَءُونَ الْقُرْآنَ لاَ يُجَاوِزُ حَلاَقِيمَهُمْ يَخْرُجُونَ مِنَ الدِّينِ كَمَا يَخْرُجُ السَّهْمُ مِنَ الرَّمِيَّةِ ثُمَّ لاَ يَعُودُونَ فِيهِ هُمْ شَرُّ الْخَلْقِ وَالْخَلِيقَةِ \" . فَقَالَ ابْنُ الصَّامِتِ فَلَقِيتُ رَافِعَ بْنَ عَمْرٍو الْغِفَارِيَّ أَخَا الْحَكَمِ الْغِفَارِيِّ قُلْتُ مَا حَدِيثٌ سَمِعْتُهُ مِنْ أَبِي ذَرٍّ كَذَا وَكَذَا فَذَكَرْتُ لَهُ هَذَا الْحَدِيثَ فَقَالَ وَأَنَا سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1068": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1068c\nIn-book reference  : Book 12, Hadith 209\nUSC-MSA web (English) reference  : Book 5, Hadith 2338\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ، جَمِيعًا عَنْ يَزِيدَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، - عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، حَدَّثَنَا أَبُو إِسْحَاقَ الشَّيْبَانِيُّ، عَنْ أُسَيْرِ بْنِ عَمْرٍو، عَنْ سَهْلِ بْنِ حُنَيْفٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" يَتِيهُ قَوْمٌ قِبَلَ الْمَشْرِقِ مُحَلَّقَةٌ رُءُوسُهُمْ \" ."
  },
  "1069": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1069c\nIn-book reference  : Book 12, Hadith 212\nUSC-MSA web (English) reference  : Book 5, Hadith 2341\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ، أَبِي عَدِيٍّ كِلاَهُمَا عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ كَمَا قَالَ ابْنُ مُعَاذٍ \" أَنَّا لاَ، نَأْكُلُ الصَّدَقَةَ \" ."
  },
  "1070": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1070b\nIn-book reference  : Book 12, Hadith 214\nUSC-MSA web (English) reference  : Book 5, Hadith 2343\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ بْنُ هَمَّامٍ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ، مُنَبِّهٍ قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَاللَّهِ إِنِّي لأَنْقَلِبُ إِلَى أَهْلِي فَأَجِدُ التَّمْرَةَ سَاقِطَةً عَلَى فِرَاشِي - أَوْ فِي بَيْتِي - فَأَرْفَعُهَا لآكُلَهَا ثُمَّ أَخْشَى أَنْ تَكُونَ صَدَقَةً - أَوْ مِنَ الصَّدَقَةِ - فَأُلْقِيهَا \" ."
  },
  "1071": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1071c\nIn-book reference  : Book 12, Hadith 217\nUSC-MSA web (English) reference  : Book 5, Hadith 2346\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم وَجَدَ تَمْرَةً فَقَالَ \" لَوْلاَ أَنْ تَكُونَ صَدَقَةً لأَكَلْتُهَا \" ."
  },
  "1072": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1072b\nIn-book reference  : Book 12, Hadith 219\nUSC-MSA web (English) reference  : Book 5, Hadith 2348\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ، شِهَابٍ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ بْنِ نَوْفَلٍ الْهَاشِمِيِّ، أَنَّ عَبْدَ الْمُطَّلِبِ بْنَ رَبِيعَةَ بْنِ الْحَارِثِ، بْنِ عَبْدِ الْمُطَّلِبِ أَخْبَرَهُ أَنَّ أَبَاهُ رَبِيعَةَ بْنَ الْحَارِثِ بْنِ عَبْدِ الْمُطَّلِبِ وَالْعَبَّاسَ بْنَ عَبْدِ الْمُطَّلِبِ قَالاَ لِعَبْدِ الْمُطَّلِبِ بْنِ رَبِيعَةَ وَلِلْفَضْلِ بْنِ عَبَّاسٍ ائْتِيَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ مَالِكٍ وَقَالَ فِيهِ فَأَلْقَى عَلِيٌّ رِدَاءَهُ ثُمَّ اضْطَجَعَ عَلَيْهِ وَقَالَ أَنَا أَبُو حَسَنٍ الْقَرْمُ وَاللَّهِ لاَ أَرِيمُ مَكَانِي حَتَّى يَرْجِعَ إِلَيْكُمَا ابْنَاكُمَا بِحَوْرِ مَا بَعَثْتُمَا بِهِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم . وَقَالَ فِي الْحَدِيثِ ثُمَّ قَالَ لَنَا \" إِنَّ هَذِهِ الصَّدَقَاتِ إِنَّمَا هِيَ أَوْسَاخُ النَّاسِ وَإِنَّهَا لاَ تَحِلُّ لِمُحَمَّدٍ وَلاَ لآلِ مُحَمَّدٍ \" . وَقَالَ أَيْضًا ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ادْعُوَا لِي مَحْمِيَةَ بْنَ جَزْءٍ \" . وَهُوَ رَجُلٌ مِنْ بَنِي أَسَدٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَهُ عَلَى الأَخْمَاسِ ."
  },
  "1073": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1073b\nIn-book reference  : Book 12, Hadith 221\nUSC-MSA web (English) reference  : Book 5, Hadith 2350\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "1074": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1074a\nIn-book reference  : Book 12, Hadith 222\nUSC-MSA web (English) reference  : Book 5, Hadith 2351\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ، الْمُثَنَّى وَابْنُ بَشَّارٍ قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، قَالَ أَهْدَتْ بَرِيرَةُ إِلَى النَّبِيِّ صلى الله عليه وسلم لَحْمًا تُصُدِّقَ بِهِ عَلَيْهَا فَقَالَ \" هُوَ لَهَا صَدَقَةٌ وَلَنَا هَدِيَّةٌ \" ."
  },
  "1075": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1075d\nIn-book reference  : Book 12, Hadith 226\nUSC-MSA web (English) reference  : Book 5, Hadith 2355\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ رَبِيعَةَ، عَنِ الْقَاسِمِ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ ذَلِكَ غَيْرَ أَنَّهُ قَالَ \" وَهُوَ لَنَا مِنْهَا هَدِيَّةٌ \" ."
  },
  "1076": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1076\nIn-book reference  : Book 12, Hadith 227\nUSC-MSA web (English) reference  : Book 5, Hadith 2356\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ خَالِدٍ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ بَعَثَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ مِنَ الصَّدَقَةِ فَبَعَثْتُ إِلَى عَائِشَةَ مِنْهَا بِشَىْءٍ فَلَمَّا جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَائِشَةَ قَالَ \" هَلْ عِنْدَكُمْ شَىْءٌ \" . قَالَتْ لاَ . إِلاَّ أَنَّ نُسَيْبَةَ بَعَثَتْ إِلَيْنَا مِنَ الشَّاةِ الَّتِي بَعَثْتُمْ بِهَا إِلَيْهَا قَالَ \" إِنَّهَا قَدْ بَلَغَتْ مَحِلَّهَا \" ."
  },
  "1077": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1077\nIn-book reference  : Book 12, Hadith 228\nUSC-MSA web (English) reference  : Book 5, Hadith 2357\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، حَدَّثَنَا الرَّبِيعُ، - يَعْنِي ابْنَ مُسْلِمٍ - عَنْ مُحَمَّدٍ، - وَهُوَ ابْنُ زِيَادٍ - عَنْ أَبِي هُرَيْرَةَ، . أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أُتِيَ بِطَعَامٍ سَأَلَ عَنْهُ فَإِنْ قِيلَ هَدِيَّةٌ أَكَلَ مِنْهَا وَإِنْ قِيلَ صَدَقَةٌ لَمْ يَأْكُلْ مِنْهَا ."
  },
  "1078": {
    "collection": "Sahih Muslim",
    "book": "The Book of Zakat",
    "book_num": "12",
    "reference": "Reference  : Sahih Muslim 1078b\nIn-book reference  : Book 12, Hadith 230\nUSC-MSA web (English) reference  : Book 5, Hadith 2359\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/12",
    "text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ \" صَلِّ عَلَيْهِمْ \" ."
  }
}