{
  "1979": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1979d\nIn-book reference  : Book 36, Hadith 4\nUSC-MSA web (English) reference  : Book 23, Hadith 4881\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُثْمَانَ، عَنْ عَبْدِ اللَّهِ، بْنِ الْمُبَارَكِ عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1980": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1980g\nIn-book reference  : Book 36, Hadith 12\nUSC-MSA web (English) reference  : Book 23, Hadith 4889\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَالِكُ بْنُ أَنَسٍ، عَنْ إِسْحَاقَ بْنِ، عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ كُنْتُ أَسْقِي أَبَا عُبَيْدَةَ بْنَ الْجَرَّاحِ وَأَبَا طَلْحَةَ وَأُبَىَّ بْنَ كَعْبٍ شَرَابًا مِنْ فَضِيخٍ وَتَمْرٍ فَأَتَاهُمْ آتٍ فَقَالَ إِنَّ الْخَمْرَ قَدْ حُرِّمَتْ . فَقَالَ أَبُو طَلْحَةَ يَا أَنَسُ قُمْ إِلَى هَذِهِ الْجَرَّةِ فَاكْسِرْهَا . فَقُمْتُ إِلَى مِهْرَاسٍ لَنَا فَضَرَبْتُهَا بِأَسْفَلِهِ حَتَّى تَكَسَّرَتْ ."
  },
  "1981": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1981\nIn-book reference  : Book 36, Hadith 11\nUSC-MSA web (English) reference  : Book 23, Hadith 4888\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ قَتَادَةَ بْنَ دِعَامَةَ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ يُخْلَطَ التَّمْرُ وَالزَّهْوُ ثُمَّ يُشْرَبَ وَإِنَّ ذَلِكَ كَانَ عَامَّةَ خُمُورِهِمْ يَوْمَ حُرِّمَتِ الْخَمْرُ ."
  },
  "1982": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1982\nIn-book reference  : Book 36, Hadith 13\nUSC-MSA web (English) reference  : Book 23, Hadith 4890\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو بَكْرٍ، - يَعْنِي الْحَنَفِيَّ - حَدَّثَنَا عَبْدُ الْحَمِيدِ، بْنُ جَعْفَرٍ حَدَّثَنِي أَبِي أَنَّهُ، سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ لَقَدْ أَنْزَلَ اللَّهُ الآيَةَ الَّتِي حَرَّمَ اللَّهُ فِيهَا الْخَمْرَ وَمَا بِالْمَدِينَةِ شَرَابٌ يُشْرَبُ إِلاَّ مِنْ تَمْرٍ ."
  },
  "1983": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1983\nIn-book reference  : Book 36, Hadith 14\nUSC-MSA web (English) reference  : Book 23, Hadith 4891\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ السُّدِّيِّ، عَنْ يَحْيَى بْنِ عَبَّادٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سُئِلَ عَنِ الْخَمْرِ تُتَّخَذُ خَلاًّ فَقَالَ \" لاَ \" ."
  },
  "1984": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1984\nIn-book reference  : Book 36, Hadith 15\nUSC-MSA web (English) reference  : Book 23, Hadith 4892\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ أَبِيهِ، وَائِلٍ الْحَضْرَمِيِّ، أَنَّ طَارِقَ بْنَ سُوَيْدٍ الْجُعْفِيَّ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ الْخَمْرِ فَنَهَا أَوْ كَرِهَ أَنْ يَصْنَعَهَا فَقَالَ إِنَّمَا أَصْنَعُهَا لِلدَّوَاءِ فَقَالَ \" إِنَّهُ لَيْسَ بِدَوَاءٍ وَلَكِنَّهُ دَاءٌ \" ."
  },
  "1985": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1985c\nIn-book reference  : Book 36, Hadith 18\nUSC-MSA web (English) reference  : Book 23, Hadith 4895\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَوْزَاعِيِّ، وَعِكْرِمَةَ، بْنِ عَمَّارٍ وَعُقْبَةَ بْنِ التَّوْأَمِ عَنْ أَبِي كَثِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ الْكَرْمَةِ وَالنَّخْلَةِ \" . وَفِي رِوَايَةِ أَبِي كُرَيْبٍ \" الْكَرْمِ وَالنَّخْلِ \" ."
  },
  "1986": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1986d\nIn-book reference  : Book 36, Hadith 22\nUSC-MSA web (English) reference  : Book 23, Hadith 4899\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، مَوْلَى حَكِيمِ بْنِ حِزَامٍ عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ الأَنْصَارِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ نَهَى أَنْ يُنْبَذَ الزَّبِيبُ وَالتَّمْرُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا ."
  },
  "1987": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1987e\nIn-book reference  : Book 36, Hadith 27\nUSC-MSA web (English) reference  : Book 23, Hadith 4903\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ مُسْلِمٍ، الْعَبْدِيُّ بِهَذَا الإِسْنَادِ قَالَ نَهَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَخْلِطَ بُسْرًا بِتَمْرٍ أَوْ زَبِيبًا بِتَمْرٍ أَوْ زَبِيبًا بِبُسْرٍ . وَقَالَ \" مَنْ شَرِبَهُ مِنْكُمْ \" . فَذَكَرَ بِمِثْلِ حَدِيثِ وَكِيعٍ ."
  },
  "1988": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1988f\nIn-book reference  : Book 36, Hadith 33\nUSC-MSA web (English) reference  : Book 23, Hadith 4908\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي قَتَادَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ هَذَا الْحَدِيثِ ."
  },
  "1989": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1989b\nIn-book reference  : Book 36, Hadith 35\nUSC-MSA web (English) reference  : Book 23, Hadith 4909\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أُذَيْنَةَ، - وَهُوَ أَبُو كَثِيرٍ الْغُبَرِيُّ - حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1990": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1990b\nIn-book reference  : Book 36, Hadith 37\nUSC-MSA web (English) reference  : Book 23, Hadith 4910\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنِ الشَّيْبَانِيِّ، بِهَذَا الإِسْنَادِ فِي التَّمْرِ وَالزَّبِيبِ وَلَمْ يَذْكُرِ الْبُسْرَ وَالتَّمْرَ ."
  },
  "1991": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1991b\nIn-book reference  : Book 36, Hadith 39\nUSC-MSA web (English) reference  : Book 23, Hadith 4912\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ، عُقْبَةَ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ قَالَ قَدْ نُهِيَ أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا وَالتَّمْرُ وَالزَّبِيبُ جَمِيعًا ."
  },
  "1992": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1992b\nIn-book reference  : Book 36, Hadith 41\nUSC-MSA web (English) reference  : Book 23, Hadith 4913\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ أَنْ يُنْتَبَذَ فِيهِ ."
  },
  "1993": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1993c\nIn-book reference  : Book 36, Hadith 44\nUSC-MSA web (English) reference  : Book 23, Hadith 4916\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، أَخْبَرَنَا نُوحُ بْنُ قَيْسٍ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِوَفْدِ عَبْدِ الْقَيْسِ \" أَنْهَاكُمْ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ وَالنَّقِيرِ وَالْمُقَيَّرِ - وَالْحَنْتَمُ الْمَزَادَةُ الْمَجْبُوبَةُ - وَلَكِنِ اشْرَبْ فِي سِقَائِكَ وَأَوْكِهِ \" ."
  },
  "1994": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1994\nIn-book reference  : Book 36, Hadith 45\nUSC-MSA web (English) reference  : Book 23, Hadith 4917\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا عَبْثَرٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنِ الْحَارِثِ بْنِ سُوَيْدٍ، عَنْ عَلِيٍّ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يُنْتَبَذَ فِي الدُّبَّاءِ وَالْمُزَفَّتِ . هَذَا حَدِيثُ جَرِيرٍ . وَفِي حَدِيثِ عَبْثَرٍ وَشُعْبَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى عَنِ الدُّبَّاءِ وَالْمُزَفَّتِ ."
  },
  "1995": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1995f\nIn-book reference  : Book 36, Hadith 51\nUSC-MSA web (English) reference  : Book 23, Hadith 4923\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ، سُوَيْدٍ بِهَذَا الإِسْنَادِ إِلاَّ أَنَّهُ جَعَلَ مَكَانَ الْمُزَفَّتِ الْمُقَيَّرِ ."
  },
  "17": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 17g\nIn-book reference  : Book 36, Hadith 55\nUSC-MSA web (English) reference  : Book 23, Hadith 4927\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ يَحْيَى الْبَهْرَانِيِّ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ يَحْيَى بْنِ أَبِي، عُمَرَ عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْمُزَفَّتِ ."
  },
  "1996": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1996d\nIn-book reference  : Book 36, Hadith 59\nUSC-MSA web (English) reference  : Book 23, Hadith 4931\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا الْمُثَنَّى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشُّرْبِ فِي الْحَنْتَمَةِ وَالدُّبَّاءِ وَالنَّقِيرِ ."
  },
  "1997": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1997p\nIn-book reference  : Book 36, Hadith 75\nUSC-MSA web (English) reference  : Book 23, Hadith 4947\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا عَبْدُ الْخَالِقِ بْنُ، سَلَمَةَ قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ عِنْدَ هَذَا الْمِنْبَرِ - وَأَشَارَ إِلَى مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَدِمَ وَفْدُ عَبْدِ الْقَيْسِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَسَأَلُوهُ عَنِ الأَشْرِبَةِ فَنَهَاهُمْ عَنِ الدُّبَّاءِ وَالنَّقِيرِ وَالْحَنْتَمِ . فَقُلْتُ لَهُ يَا أَبَا مُحَمَّدٍ وَالْمُزَفَّتِ وَظَنَنَّا أَنَّهُ نَسِيَهُ فَقَالَ لَمْ أَسْمَعْهُ يَوْمَئِذٍ مِنْ عَبْدِ اللَّهِ بْنِ عُمَرَ وَقَدْ كَانَ يَكْرَهُ ."
  },
  "1998": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1998c, 1999a\nIn-book reference  : Book 36, Hadith 78\nUSC-MSA web (English) reference  : Book 23, Hadith 4949\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "قَالَ أَبُو الزُّبَيْرِ وَسَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْجَرِّ وَالْمُزَفَّتِ وَالنَّقِيرِ .\nوَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا لَمْ يَجِدْ شَيْئًا يُنْتَبَذُ لَهُ فِيهِ نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ ."
  },
  "1999": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1999c\nIn-book reference  : Book 36, Hadith 80\nUSC-MSA web (English) reference  : Book 23, Hadith 4951\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، ح وَحَدَّثَنَا يَحْيَى بْنُ، يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كَانَ يُنْتَبَذُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فِي سِقَاءٍ فَإِذَا لَمْ يَجِدُوا سِقَاءً نُبِذَ لَهُ فِي تَوْرٍ مِنْ حِجَارَةٍ فَقَالَ بَعْضُ الْقَوْمِ وَأَنَا أَسْمَعُ لأَبِي الزُّبَيْرِ مِنْ بِرَامٍ قَالَ مِنْ بِرَامٍ ."
  },
  "977": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 977g\nIn-book reference  : Book 36, Hadith 83\nUSC-MSA web (English) reference  : Book 23, Hadith 4954\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ مُعَرِّفِ بْنِ وَاصِلٍ، عَنْ مُحَارِبِ، بْنِ دِثَارٍ عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُنْتُ نَهَيْتُكُمْ عَنِ الأَشْرِبَةِ فِي ظُرُوفِ الأَدَمِ فَاشْرَبُوا فِي كُلِّ وِعَاءٍ غَيْرَ أَنْ لاَ تَشْرَبُوا مُسْكِرًا \" ."
  },
  "2000": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2000\nIn-book reference  : Book 36, Hadith 84\nUSC-MSA web (English) reference  : Book 23, Hadith 4955\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ الأَحْوَلِ، عَنْ مُجَاهِدٍ، عَنْ أَبِي عِيَاضٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ لَمَّا نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ النَّبِيذِ فِي الأَوْعِيَةِ قَالُوا لَيْسَ كُلُّ النَّاسِ يَجِدُ فَأَرْخَصَ لَهُمْ فِي الْجَرِّ غَيْرِ الْمُزَفَّتِ ."
  },
  "2001": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2001c\nIn-book reference  : Book 36, Hadith 87\nUSC-MSA web (English) reference  : Book 23, Hadith 4958\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَسَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ كُلُّهُمْ عَنِ ابْنِ عُيَيْنَةَ، ح وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ يَعْقُوبَ، بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَلَيْسَ فِي حَدِيثِ سُفْيَانَ وَصَالِحٍ سُئِلَ عَنِ الْبِتْعِ وَهُوَ فِي حَدِيثِ مَعْمَرٍ وَفِي حَدِيثِ صَالِحٍ أَنَّهَا سَمِعَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" كُلُّ شَرَابٍ مُسْكِرٍ حَرَامٌ \" ."
  },
  "1733": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 1733g\nIn-book reference  : Book 36, Hadith 90\nUSC-MSA web (English) reference  : Book 23, Hadith 4961\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، - وَاللَّفْظُ لاِبْنِ أَبِي خَلَفٍ - قَالاَ حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - وَهُوَ ابْنُ عَمْرٍو - عَنْ زَيْدِ بْنِ، أَبِي أُنَيْسَةَ عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، حَدَّثَنَا أَبُو بُرْدَةَ، عَنْ أَبِيهِ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَمُعَاذًا إِلَى الْيَمَنِ فَقَالَ \" ادْعُوَا النَّاسَ وَبَشِّرَا وَلاَ تُنَفِّرَا وَيَسِّرَا وَلاَ تُعَسِّرَا \" . قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ أَفْتِنَا فِي شَرَابَيْنِ كُنَّا نَصْنَعُهُمَا بِالْيَمَنِ الْبِتْعُ وَهُوَ مِنَ الْعَسَلِ يُنْبَذُ حَتَّى يَشْتَدَّ وَالْمِزْرُ وَهُوَ مِنَ الذُّرَةِ وَالشَّعِيرِ يُنْبَذُ حَتَّى يَشْتَدَّ قَالَ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَدْ أُعْطِيَ جَوَامِعَ الْكَلِمِ بِخَوَاتِمِهِ فَقَالَ \" أَنْهَى عَنْ كُلِّ مُسْكِرٍ أَسْكَرَ عَنِ الصَّلاَةِ \" ."
  },
  "2002": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2002\nIn-book reference  : Book 36, Hadith 91\nUSC-MSA web (English) reference  : Book 23, Hadith 4962\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ عُمَارَةَ بْنِ، غَزِيَّةَ عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، قَدِمَ مِنْ جَيْشَانَ - وَجَيْشَانُ مِنَ الْيَمَنِ - فَسَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنْ شَرَابٍ يَشْرَبُونَهُ بِأَرْضِهِمْ مِنَ الذُّرَةِ يُقَالُ لَهُ الْمِزْرُ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَوَمُسْكِرٌ هُوَ \" . قَالَ نَعَمْ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلُّ مُسْكِرٍ حَرَامٌ إِنَّ عَلَى اللَّهِ عَزَّ وَجَلَّ عَهْدًا لِمَنْ يَشْرَبُ الْمُسْكِرَ أَنْ يَسْقِيَهُ مِنْ طِينَةِ الْخَبَالِ \" . قَالُوا يَا رَسُولَ اللَّهِ وَمَا طِينَةُ الْخَبَالِ قَالَ \" عَرَقُ أَهْلِ النَّارِ أَوْ عُصَارَةُ أَهْلِ النَّارِ \" ."
  },
  "2003": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2003h\nIn-book reference  : Book 36, Hadith 99\nUSC-MSA web (English) reference  : Book 23, Hadith 4970\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا هِشَامٌ، - يَعْنِي ابْنَ سُلَيْمَانَ الْمَخْزُومِيَّ - عَنِ ابْنِ، جُرَيْجٍ أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ عُبَيْدِ اللَّهِ ."
  },
  "2004": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2004e\nIn-book reference  : Book 36, Hadith 104\nUSC-MSA web (English) reference  : Book 23, Hadith 4975\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدٍ، عَنْ يَحْيَى أَبِي عُمَرَ النَّخَعِيِّ، قَالَ سَأَلَ قَوْمٌ ابْنَ عَبَّاسٍ عَنْ بَيْعِ الْخَمْرِ، وَشِرَائِهَا، وَالتِّجَارَةِ فِيهَا فَقَالَ أَمُسْلِمُونَ أَنْتُمْ قَالُوا نَعَمْ . قَالَ فَإِنَّهُ لاَ يَصْلُحُ بَيْعُهَا وَلاَ شِرَاؤُهَا وَلاَ التِّجَارَةُ فِيهَا . قَالَ فَسَأَلُوهُ عَنِ النَّبِيذِ فَقَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ ثُمَّ رَجَعَ وَقَدْ نَبَذَ نَاسٌ مِنْ أَصْحَابِهِ فِي حَنَاتِمَ وَنَقِيرٍ وَدُبَّاءٍ فَأَمَرَ بِهِ فَأُهْرِيقَ ثُمَّ أَمَرَ بِسِقَاءٍ فَجُعِلَ فِيهِ زَبِيبٌ وَمَاءٌ فَجُعِلَ مِنَ اللَّيْلِ فَأَصْبَحَ فَشَرِبَ مِنْهُ يَوْمَهُ ذَلِكَ وَلَيْلَتَهُ الْمُسْتَقْبِلَةَ وَمِنَ الْغَدِ حَتَّى أَمْسَى فَشَرِبَ وَسَقَى فَلَمَّا أَصْبَحَ أَمَرَ بِمَا بَقِيَ مِنْهُ فَأُهَرِيقَ ."
  },
  "2005": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2005b\nIn-book reference  : Book 36, Hadith 106\nUSC-MSA web (English) reference  : Book 23, Hadith 4977\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ يُونُسَ، عَنِ الْحَسَنِ، عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فِي سِقَاءٍ يُوكَى أَعْلاَهُ وَلَهُ عَزْلاَءُ نَنْبِذُهُ غُدْوَةً فَيَشْرَبُهُ عِشَاءً وَنَنْبِذُهُ عِشَاءً فَيَشْرَبُهُ غُدْوَةً ."
  },
  "2006": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2006c\nIn-book reference  : Book 36, Hadith 109\nUSC-MSA web (English) reference  : Book 23, Hadith 4980\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدٌ، - يَعْنِي أَبَا غَسَّانَ - حَدَّثَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ وَقَالَ فِي تَوْرٍ مِنْ حِجَارَةٍ فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الطَّعَامِ أَمَاثَتْهُ فَسَقَتْهُ تَخُصُّهُ بِذَلِكَ ."
  },
  "2007": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2007\nIn-book reference  : Book 36, Hadith 110\nUSC-MSA web (English) reference  : Book 23, Hadith 4981\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ - قَالَ أَبُو بَكْرٍ أَخْبَرَنَا وَقَالَ ابْنُ سَهْلٍ، حَدَّثَنَا - ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ مُطَرِّفٍ أَبُو غَسَّانَ - أَخْبَرَنِي أَبُو حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ ذُكِرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم امْرَأَةٌ مِنَ الْعَرَبِ فَأَمَرَ أَبَا أُسَيْدٍ أَنْ يُرْسِلَ إِلَيْهَا فَأَرْسَلَ إِلَيْهَا فَقَدِمَتْ فَنَزَلَتْ فِي أُجُمِ بَنِي سَاعِدَةَ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى جَاءَهَا فَدَخَلَ عَلَيْهَا فَإِذَا امْرَأَةٌ مُنَكِّسَةٌ رَأْسَهَا فَلَمَّا كَلَّمَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَتْ أَعُوذُ بِاللَّهِ مِنْكَ قَالَ \" قَدْ أَعَذْتُكِ مِنِّي \" . فَقَالُوا لَهَا أَتَدْرِينَ مَنْ هَذَا فَقَالَتْ لاَ . فَقَالُوا هَذَا رَسُولُ اللَّهِ صلى الله عليه وسلم جَاءَكِ لِيَخْطُبَكِ قَالَتْ أَنَا كُنْتُ أَشْقَى مِنْ ذَلِكَ . قَالَ سَهْلٌ فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ حَتَّى جَلَسَ فِي سَقِيفَةِ بَنِي سَاعِدَةَ هُوَ وَأَصْحَابُهُ ثُمَّ قَالَ \" اسْقِنَا \" . لِسَهْلٍ قَالَ فَأَخْرَجْتُ لَهُمْ هَذَا الْقَدَحَ فَأَسْقَيْتُهُمْ فِيهِ . قَالَ أَبُو حَازِمٍ فَأَخْرَجَ لَنَا سَهْلٌ ذَلِكَ الْقَدَحَ فَشَرِبْنَا فِيهِ قَالَ ثُمَّ اسْتَوْهَبَهُ بَعْدَ ذَلِكَ عُمَرُ بْنُ عَبْدِ الْعَزِيزِ فَوَهَبَهُ لَهُ . وَفِي رِوَايَةِ أَبِي بَكْرِ بْنِ إِسْحَاقَ قَالَ \" اسْقِنَا يَا سَهْلُ \" ."
  },
  "2008": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2008\nIn-book reference  : Book 36, Hadith 111\nUSC-MSA web (English) reference  : Book 23, Hadith 4982\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ، بْنُ سَلَمَةَ عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَقَدْ سَقَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم بِقَدَحِي هَذَا الشَّرَابَ كُلَّهُ الْعَسَلَ وَالنَّبِيذَ وَالْمَاءَ وَاللَّبَنَ ."
  },
  "2009": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2009b\nIn-book reference  : Book 36, Hadith 113\nUSC-MSA web (English) reference  : Book 23, Hadith 4984\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَبَا إِسْحَاقَ الْهَمْدَانِيَّ، يَقُولُ سَمِعْتُ الْبَرَاءَ، يَقُولُ لَمَّا أَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَكَّةَ إِلَى الْمَدِينَةِ فَأَتْبَعَهُ سُرَاقَةُ بْنُ مَالِكِ بْنِ جُعْشُمٍ - قَالَ - فَدَعَا عَلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَاخَتْ فَرَسُهُ فَقَالَ ادْعُ اللَّهَ لِي وَلاَ أَضُرُّكَ . قَالَ فَدَعَا اللَّهَ - قَالَ - فَعَطِشَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَمَرُّوا بِرَاعِي غَنَمٍ . قَالَ أَبُو بَكْرٍ الصِّدِّيقُ فَأَخَذْتُ قَدَحًا فَحَلَبْتُ فِيهِ لِرَسُولِ اللَّهِ صلى الله عليه وسلم كُثْبَةً مِنْ لَبَنٍ فَأَتَيْتُهُ بِهِ فَشَرِبَ حَتَّى رَضِيتُ ."
  },
  "168": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 168c\nIn-book reference  : Book 36, Hadith 115\nUSC-MSA web (English) reference  : Book 23, Hadith 4986\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم . بِمِثْلِهِ وَلَمْ يَذْكُرْ بِإِيلِيَاءَ ."
  },
  "2010": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2010b\nIn-book reference  : Book 36, Hadith 117\nUSC-MSA web (English) reference  : Book 23, Hadith 4988\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ دِينَارٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، وَزَكَرِيَّاءُ، بْنُ إِسْحَاقَ قَالاَ أَخْبَرَنَا أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَخْبَرَنِي أَبُو حُمَيْدٍ، السَّاعِدِيُّ أَنَّهُ أَتَى النَّبِيَّ صلى الله عليه وسلم بِقَدَحِ لَبَنٍ . بِمِثْلِهِ . قَالَ وَلَمْ يَذْكُرْ زَكَرِيَّاءُ قَوْلَ أَبِي حُمَيْدٍ بِاللَّيْلِ ."
  },
  "2011": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2011b\nIn-book reference  : Book 36, Hadith 119\nUSC-MSA web (English) reference  : Book 23, Hadith 4990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، وَأَبِي، صَالِحٍ عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ يُقَالُ لَهُ أَبُو حُمَيْدٍ بِقَدَحٍ مِنْ لَبَنٍ مِنَ النَّقِيعِ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَلاَّ خَمَّرْتَهُ وَلَوْ تَعْرُضُ عَلَيْهِ عُودًا \" ."
  },
  "2012": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2012g\nIn-book reference  : Book 36, Hadith 126\nUSC-MSA web (English) reference  : Book 23, Hadith 4997\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، بِهَذَا الْحَدِيثِ عَنْ عَطَاءٍ، وَعَمْرِو بْنِ دِينَارٍ، كَرِوَايَةِ رَوْحٍ ."
  },
  "2013": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2013b\nIn-book reference  : Book 36, Hadith 128\nUSC-MSA web (English) reference  : Book 23, Hadith 4999\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ زُهَيْرٍ ."
  },
  "2014": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2014b\nIn-book reference  : Book 36, Hadith 130\nUSC-MSA web (English) reference  : Book 23, Hadith 5001\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، بِهَذَا الإِسْنَادِ . بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ \" فَإِنَّ فِي السَّنَةِ يَوْمًا يَنْزِلُ فِيهِ وَبَاءٌ \" . وَزَادَ فِي آخِرِ الْحَدِيثِ قَالَ اللَّيْثُ فَالأَعَاجِمُ عِنْدَنَا يَتَّقُونَ ذَلِكَ فِي كَانُونَ الأَوَّلِ ."
  },
  "2015": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2015\nIn-book reference  : Book 36, Hadith 131\nUSC-MSA web (English) reference  : Book 23, Hadith 5002\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالُوا حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ \" ."
  },
  "2016": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2016\nIn-book reference  : Book 36, Hadith 132\nUSC-MSA web (English) reference  : Book 23, Hadith 5003\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ وَأَبُو عَامِرٍ الأَشْعَرِيُّ وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي عَامِرٍ - قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ احْتَرَقَ بَيْتٌ عَلَى أَهْلِهِ بِالْمَدِينَةِ مِنَ اللَّيْلِ فَلَمَّا حُدِّثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَأْنِهِمْ قَالَ \" إِنَّ هَذِهِ النَّارَ إِنَّمَا هِيَ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فَأَطْفِئُوهَا عَنْكُمْ \" ."
  },
  "2017": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2017c\nIn-book reference  : Book 36, Hadith 135\nUSC-MSA web (English) reference  : Book 23, Hadith 5005\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَقَدَّمَ مَجِيءَ الْجَارِيَةِ قَبْلَ مَجِيءِ الأَعْرَابِيِّ ."
  },
  "2018": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2018b\nIn-book reference  : Book 36, Hadith 137\nUSC-MSA web (English) reference  : Book 23, Hadith 5006\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ إِنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ . بِمِثْلِ حَدِيثِ أَبِي عَاصِمٍ إِلاَّ أَنَّهُ قَالَ \" وَإِنْ لَمْ يَذْكُرِ اسْمَ اللَّهِ عِنْدَ طَعَامِهِ وَإِنْ لَمْ يَذْكُرِ اسْمَ اللَّهِ عِنْدَ دُخُولِهِ \" ."
  },
  "2019": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2019\nIn-book reference  : Book 36, Hadith 138\nUSC-MSA web (English) reference  : Book 23, Hadith 5007\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ تَأْكُلُوا بِالشِّمَالِ فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِالشِّمَالِ \" ."
  },
  "2020": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2020c\nIn-book reference  : Book 36, Hadith 141\nUSC-MSA web (English) reference  : Book 23, Hadith 5010\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، - قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا وَقَالَ، حَرْمَلَةُ حَدَّثَنَا - عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، حَدَّثَنِي الْقَاسِمُ بْنُ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ، عُمَرَ حَدَّثَهُ عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يَأْكُلَنَّ أَحَدٌ مِنْكُمْ بِشِمَالِهِ وَلاَ يَشْرَبَنَّ بِهَا فَإِنَّ الشَّيْطَانَ يَأْكُلُ بِشِمَالِهِ وَيَشْرَبُ بِهَا \" . قَالَ وَكَانَ نَافِعٌ يَزِيدُ فِيهَا \" وَلاَ يَأْخُذُ بِهَا وَلاَ يُعْطِي بِهَا \" . وَفِي رِوَايَةِ أَبِي الطَّاهِرِ \" لاَ يَأْكُلَنَّ أَحَدُكُمْ \" ."
  },
  "2021": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2021\nIn-book reference  : Book 36, Hadith 142\nUSC-MSA web (English) reference  : Book 23, Hadith 5011\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، حَدَّثَنِي إِيَاسُ بْنُ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّ رَجُلاً أَكَلَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِشِمَالِهِ فَقَالَ \" كُلْ بِيَمِينِكَ \" . قَالَ لاَ أَسْتَطِيعُ قَالَ \" لاَ اسْتَطَعْتَ \" . مَا مَنَعَهُ إِلاَّ الْكِبْرُ . قَالَ فَمَا رَفَعَهَا إِلَى فِيهِ ."
  },
  "2022": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2022b\nIn-book reference  : Book 36, Hadith 144\nUSC-MSA web (English) reference  : Book 23, Hadith 5013\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا ابْنُ أَبِي، مَرْيَمَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ حَلْحَلَةَ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، أَنَّهُ قَالَ أَكَلْتُ يَوْمًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَجَعَلْتُ آخُذُ مِنْ لَحْمٍ حَوْلَ الصَّحْفَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلْ مِمَّا يَلِيكَ \" ."
  },
  "2023": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2023c\nIn-book reference  : Book 36, Hadith 147\nUSC-MSA web (English) reference  : Book 23, Hadith 5016\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّهُ قَالَ وَاخْتِنَاثُهَا أَنْ يُقْلَبَ رَأْسُهَا ثُمَّ يُشْرَبَ مِنْهُ ."
  },
  "2024": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2024c\nIn-book reference  : Book 36, Hadith 150\nUSC-MSA web (English) reference  : Book 23, Hadith 5019\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَلَمْ يَذْكُرْ قَوْلَ قَتَادَةَ ."
  },
  "2025": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2025b\nIn-book reference  : Book 36, Hadith 152\nUSC-MSA web (English) reference  : Book 23, Hadith 5021\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لِزُهَيْرٍ وَابْنِ الْمُثَنَّى - قَالُوا حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي عِيسَى الأُسْوَارِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الشُّرْبِ قَائِمًا ."
  },
  "2026": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2026\nIn-book reference  : Book 36, Hadith 153\nUSC-MSA web (English) reference  : Book 23, Hadith 5022\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ الْعَلاَءِ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ - حَدَّثَنَا عُمَرُ بْنُ، حَمْزَةَ أَخْبَرَنِي أَبُو غَطَفَانَ الْمُرِّيُّ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَشْرَبَنَّ أَحَدٌ مِنْكُمْ قَائِمًا فَمَنْ نَسِيَ فَلْيَسْتَقِئْ \" ."
  },
  "2027": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2027e\nIn-book reference  : Book 36, Hadith 158\nUSC-MSA web (English) reference  : Book 23, Hadith 5027\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِهِمَا فَأَتَيْتُهُ بِدَلْوٍ ."
  },
  "267": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 267d\nIn-book reference  : Book 36, Hadith 159\nUSC-MSA web (English) reference  : Book 23, Hadith 5028\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ، اللَّهِ بْنِ أَبِي قَتَادَةَ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَهَى أَنْ يُتَنَفَّسَ فِي الإِنَاءِ ."
  },
  "2028": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2028c\nIn-book reference  : Book 36, Hadith 162\nUSC-MSA web (English) reference  : Book 23, Hadith 5031\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، الدَّسْتَوَائِيِّ عَنْ أَبِي عِصَامٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَقَالَ فِي الإِنَاءِ ."
  },
  "2029": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2029c\nIn-book reference  : Book 36, Hadith 165\nUSC-MSA web (English) reference  : Book 23, Hadith 5034\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ مَعْمَرِ بْنِ حَزْمٍ أَبِي طُوَالَةَ الأَنْصَارِيِّ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، ح\nوَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي دَارِنَا فَاسْتَسْقَى فَحَلَبْنَا لَهُ شَاةً ثُمَّ شُبْتُهُ مِنْ مَاءِ بِئْرِي هَذِهِ - قَالَ - فَأَعْطَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَشَرِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ عَنْ يَسَارِهِ وَعُمَرُ وُجَاهَهُ وَأَعْرَابِيٌّ عَنْ يَمِينِهِ فَلَمَّا فَرَغَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ شُرْبِهِ قَالَ عُمَرُ هَذَا أَبُو بَكْرٍ يَا رَسُولَ اللَّهِ . يُرِيهِ إِيَّاهُ فَأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم الأَعْرَابِيَّ وَتَرَكَ أَبَا بَكْرٍ وَعُمَرَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الأَيْمَنُونَ الأَيْمَنُونَ الأَيْمَنُونَ \" . قَالَ أَنَسٌ فَهِيَ سُنَّةٌ فَهِيَ سُنَّةٌ فَهِيَ سُنَّةٌ ."
  },
  "2030": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2030b\nIn-book reference  : Book 36, Hadith 167\nUSC-MSA web (English) reference  : Book 23, Hadith 5036\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، ح وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ، سَعِيدٍ حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - كِلاَهُمَا عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ، بْنِ سَعْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِهِ وَلَمْ يَقُولاَ فَتَلَّهُ . وَلَكِنْ فِي رِوَايَةِ يَعْقُوبَ قَالَ فَأَعْطَاهُ إِيَّاهُ ."
  },
  "2031": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2031b\nIn-book reference  : Book 36, Hadith 169\nUSC-MSA web (English) reference  : Book 23, Hadith 5038\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي أَبُو عَاصِمٍ، جَمِيعًا عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ عَطَاءً، يَقُولُ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا أَكَلَ أَحَدُكُمْ مِنَ الطَّعَامِ فَلاَ يَمْسَحْ يَدَهُ حَتَّى يَلْعَقَهَا أَوْ يُلْعِقَهَا \" ."
  },
  "2032": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2032d\nIn-book reference  : Book 36, Hadith 173\nUSC-MSA web (English) reference  : Book 23, Hadith 5042\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ، أَنَّحَدَّثَاهُ - أَوْ، أَحَدُهُمَا - عَنْ أَبِيهِ، كَعْبِ بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2033": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2033f\nIn-book reference  : Book 36, Hadith 179\nUSC-MSA web (English) reference  : Book 23, Hadith 5048\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي، صَالِحٍ وَأَبِي سُفْيَانَ عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي ذِكْرِ اللَّعْقِ . وَعَنْ أَبِي سُفْيَانَ عَنْ جَابِرٍ عَنِ النَّبِيِّ صلى الله عليه وسلم وَذَكَرَ اللُّقْمَةَ نَحْوَ حَدِيثِهِمَا ."
  },
  "2034": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2034\nIn-book reference  : Book 36, Hadith 180\nUSC-MSA web (English) reference  : Book 23, Hadith 5049\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ قَالاَ حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ، بْنُ سَلَمَةَ حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا أَكَلَ طَعَامًا لَعِقَ أَصَابِعَهُ الثَّلاَثَ . قَالَ وَقَالَ \" إِذَا سَقَطَتْ لُقْمَةُ أَحَدِكُمْ فَلْيُمِطْ عَنْهَا الأَذَى وَلْيَأْكُلْهَا وَلاَ يَدَعْهَا لِلشَّيْطَانِ \" . وَأَمَرَنَا أَنْ نَسْلُتَ الْقَصْعَةَ قَالَ \" فَإِنَّكُمْ لاَ تَدْرُونَ فِي أَىِّ طَعَامِكُمُ الْبَرَكَةُ \" ."
  },
  "2035": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2035b\nIn-book reference  : Book 36, Hadith 182\nUSC-MSA web (English) reference  : Book 23, Hadith 5050\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - قَالاَ حَدَّثَنَا حَمَّادٌ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ \" وَلْيَسْلُتْ أَحْدُكُمُ الصَّحْفَةَ \" . وَقَالَ \" فِي أَىِّ طَعَامِكُمُ الْبَرَكَةُ أَوْ يُبَارَكُ لَكُمْ \" ."
  },
  "2036": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2036c\nIn-book reference  : Book 36, Hadith 185\nUSC-MSA web (English) reference  : Book 23, Hadith 5053\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، حَدَّثَنَا أَبُو الْجَوَّابِ، حَدَّثَنَا عَمَّارٌ، - وَهْوَ ابْنُ رُزَيْقٍ - عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، ح\nوَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ ."
  },
  "2037": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2037\nIn-book reference  : Book 36, Hadith 186\nUSC-MSA web (English) reference  : Book 23, Hadith 5054\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ جَارًا، لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَارِسِيًّا كَانَ طَيِّبَ الْمَرَقِ فَصَنَعَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ جَاءَ يَدْعُوهُ فَقَالَ \" وَهَذِهِ \" . لِعَائِشَةَ فَقَالَ لاَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ \" فَعَادَ يَدْعُوهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَهَذِهِ \" . قَالَ لاَ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ \" . ثُمَّ عَادَ يَدْعُوهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَهَذِهِ \" . قَالَ نَعَمْ . فِي الثَّالِثَةِ . فَقَامَا يَتَدَافَعَانِ حَتَّى أَتَيَا مَنْزِلَهُ ."
  },
  "2038": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2038b\nIn-book reference  : Book 36, Hadith 188\nUSC-MSA web (English) reference  : Book 23, Hadith 5056\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو هِشَامٍ، - يَعْنِي الْمُغِيرَةَ بْنَ سَلَمَةَ - حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا يَزِيدُ، حَدَّثَنَا أَبُو حَازِمٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ بَيْنَا أَبُو بَكْرٍ قَاعِدٌ وَعُمَرُ مَعَهُ إِذْ أَتَاهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" مَا أَقْعَدَكُمَا هَا هُنَا \" . قَالاَ أَخْرَجَنَا الْجُوعُ مِنْ بُيُوتِنَا وَالَّذِي بَعَثَكَ بِالْحَقِّ . ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ خَلَفِ بْنِ خَلِيفَةَ ."
  },
  "2039": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2039\nIn-book reference  : Book 36, Hadith 189\nUSC-MSA web (English) reference  : Book 23, Hadith 5057\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنِي الضَّحَّاكُ بْنُ مَخْلَدٍ، مِنْ رُقْعَةٍ عَارَضَ لِي بِهَا ثُمَّ قَرَأَهُ عَلَىَّ قَالَ أَخْبَرَنَاهُ حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ حَدَّثَنَا سَعِيدُ بْنُ مِينَاءَ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ يَقُولُ لَمَّا حُفِرَ الْخَنْدَقُ رَأَيْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم خَمَصًا فَانْكَفَأْتُ إِلَى امْرَأَتِي فَقُلْتُ لَهَا هَلْ عِنْدَكِ شَىْءٌ فَإِنِّي رَأَيْتُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم خَمَصًا شَدِيدًا . فَأَخْرَجَتْ لِي جِرَابًا فِيهِ صَاعٌ مِنْ شَعِيرٍ وَلَنَا بُهَيْمَةٌ دَاجِنٌ - قَالَ - فَذَبَحْتُهَا وَطَحَنَتْ فَفَرَغَتْ إِلَى فَرَاغِي فَقَطَّعْتُهَا فِي بُرْمَتِهَا ثُمَّ وَلَّيْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لاَ تَفْضَحْنِي بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَمَنْ مَعَهُ - قَالَ - فَجِئْتُهُ فَسَارَرْتُهُ فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّا قَدْ ذَبَحْنَا بُهَيْمَةً لَنَا وَطَحَنَتْ صَاعًا مِنْ شَعِيرٍ كَانَ عِنْدَنَا فَتَعَالَ أَنْتَ فِي نَفَرٍ مَعَكَ . فَصَاحَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ \" يَا أَهْلَ الْخَنْدَقِ إِنَّ جَابِرًا قَدْ صَنَعَ لَكُمْ سُورًا فَحَيَّهَلاَ بِكُمْ \" . وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تُنْزِلُنَّ بُرْمَتَكُمْ وَلاَ تَخْبِزُنَّ عَجِينَتَكُمْ حَتَّى أَجِيءَ \" . فَجِئْتُ وَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْدُمُ النَّاسَ حَتَّى جِئْتُ امْرَأَتِي فَقَالَتْ بِكَ وَبِكَ . فَقُلْتُ قَدْ فَعَلْتُ الَّذِي قُلْتِ لِي . فَأَخْرَجْتُ لَهُ عَجِينَتَنَا فَبَصَقَ فِيهَا وَبَارَكَ ثُمَّ عَمَدَ إِلَى بُرْمَتِنَا فَبَصَقَ فِيهَا وَبَارَكَ ثُمَّ قَالَ \" ادْعِي خَابِزَةً فَلْتَخْبِزْ مَعَكِ وَاقْدَحِي مِنْ بُرْمَتِكُمْ وَلاَ تُنْزِلُوهَا \" . وَهُمْ أَلْفٌ فَأُقْسِمُ بِاللَّهِ لأَكَلُوا حَتَّى تَرَكُوهُ وَانْحَرَفُوا وَإِنَّ بُرْمَتَنَا لَتَغِطُّ كَمَا هِيَ وَإِنَّ عَجِينَتَنَا - أَوْ كَمَا قَالَ الضَّحَّاكُ - لَتُخْبَزُ كَمَا هُوَ ."
  },
  "2040": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2040i\nIn-book reference  : Book 36, Hadith 198\nUSC-MSA web (English) reference  : Book 23, Hadith 5066\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا حَرْبُ بْنُ مَيْمُونٍ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم فِي طَعَامِ أَبِي طَلْحَةَ نَحْوَ حَدِيثِهِمْ ."
  },
  "2041": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2041c\nIn-book reference  : Book 36, Hadith 201\nUSC-MSA web (English) reference  : Book 23, Hadith 5069\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ الْبُنَانِيِّ، وَعَاصِمٍ الأَحْوَلِ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَجُلاً، خَيَّاطًا دَعَا رَسُولَ اللَّهِ صلى الله عليه وسلم . وَزَادَ قَالَ ثَابِتٌ فَسَمِعْتُ أَنَسًا يَقُولُ فَمَا صُنِعَ لِي طَعَامٌ بَعْدُ أَقْدِرُ عَلَى أَنْ يُصْنَعَ فِيهِ دُبَّاءٌ إِلاَّ صُنِعَ ."
  },
  "2042": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2042b\nIn-book reference  : Book 36, Hadith 203\nUSC-MSA web (English) reference  : Book 23, Hadith 5071\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ وَلَمْ يَشُكَّا فِي إِلْقَاءِ النَّوَى بَيْنَ الإِصْبَعَيْنِ ."
  },
  "2043": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2043\nIn-book reference  : Book 36, Hadith 204\nUSC-MSA web (English) reference  : Book 23, Hadith 5072\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَعَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلاَلِيُّ، - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ ابْنُ عَوْنٍ، حَدَّثَنَا - إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَأْكُلُ الْقُثَّاءَ بِالرُّطَبِ ."
  },
  "2044": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2044b\nIn-book reference  : Book 36, Hadith 206\nUSC-MSA web (English) reference  : Book 23, Hadith 5074\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مُصْعَبِ بْنِ سُلَيْمٍ، عَنْ أَنَسٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَمْرٍ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَقْسِمُهُ وَهُوَ مُحْتَفِزٌ يَأْكُلُ مِنْهُ أَكْلاً ذَرِيعًا . وَفِي رِوَايَةِ زُهَيْرٍ أَكْلاً حَثِيثًا ."
  },
  "2045": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2045c\nIn-book reference  : Book 36, Hadith 209\nUSC-MSA web (English) reference  : Book 23, Hadith 5077\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ جَبَلَةَ بْنِ سُحَيْمٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ يَقْرِنَ الرَّجُلُ بَيْنَ التَّمْرَتَيْنِ حَتَّى يَسْتَأْذِنَ أَصْحَابَهُ ."
  },
  "2046": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2046b\nIn-book reference  : Book 36, Hadith 211\nUSC-MSA web (English) reference  : Book 23, Hadith 5079\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ مُحَمَّدِ بْنِ طَحْلاَءَ، عَنْ أَبِي، الرِّجَالِ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ أُمِّهِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا عَائِشَةُ بَيْتٌ لاَ تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ يَا عَائِشَةُ بَيْتٌ لاَ تَمْرَ فِيهِ جِيَاعٌ أَهْلُهُ أَوْ جَاعَ أَهْلُهُ \" . قَالَهَا مَرَّتَيْنِ أَوْ ثَلاَثًا ."
  },
  "2047": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2047c\nIn-book reference  : Book 36, Hadith 214\nUSC-MSA web (English) reference  : Book 23, Hadith 5082\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، ح وَحَدَّثَنَاهُ إِسْحَاقُ، بْنُ إِبْرَاهِيمَ أَخْبَرَنَا أَبُو بَدْرٍ، شُجَاعُ بْنُ الْوَلِيدِ كِلاَهُمَا عَنْ هَاشِمِ بْنِ هَاشِمٍ، بِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ وَلاَ يَقُولاَنِ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم ."
  },
  "2048": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2048\nIn-book reference  : Book 36, Hadith 215\nUSC-MSA web (English) reference  : Book 23, Hadith 5083\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ شَرِيكٍ، - وَهُوَ ابْنُ أَبِي نَمِرٍ - عَنْ عَبْدِ اللَّهِ بْنِ أَبِي عَتِيقٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ فِي عَجْوَةِ الْعَالِيَةِ شِفَاءً أَوْ إِنَّهَا تِرْيَاقٌ أَوَّلَ الْبُكْرَةِ \" ."
  },
  "2049": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2049g\nIn-book reference  : Book 36, Hadith 222\nUSC-MSA web (English) reference  : Book 23, Hadith 5089\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا مُحَمَّدُ بْنُ شَبِيبٍ، قَالَ سَمِعْتُهُ مِنْ، شَهْرِ بْنِ حَوْشَبٍ فَسَأَلْتُهُ فَقَالَ سَمِعْتُهُ مِنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، قَالَ فَلَقِيتُ عَبْدَ الْمَلِكِ فَحَدَّثَنِي عَنْ عَمْرِو بْنِ حُرَيْثٍ، عَنْ سَعِيدِ بْنِ زَيْدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْكَمْأَةُ مِنَ الْمَنِّ وَمَاؤُهَا شِفَاءٌ لِلْعَيْنِ \" ."
  },
  "2050": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2050\nIn-book reference  : Book 36, Hadith 223\nUSC-MSA web (English) reference  : Book 23, Hadith 5090\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم بِمَرِّ الظَّهْرَانِ وَنَحْنُ نَجْنِي الْكَبَاثَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" عَلَيْكُمْ بِالأَسْوَدِ مِنْهُ \" . قَالَ فَقُلْنَا يَا رَسُولَ اللَّهِ كَأَنَّكَ رَعَيْتَ الْغَنَمَ قَالَ \" نَعَمْ وَهَلْ مِنْ نَبِيٍّ إِلاَّ وَقَدْ رَعَاهَا \" . أَوْ نَحْوَ هَذَا مِنَ الْقَوْلِ ."
  },
  "2051": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2051b\nIn-book reference  : Book 36, Hadith 225\nUSC-MSA web (English) reference  : Book 23, Hadith 5092\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ مُوسَى بْنُ قُرَيْشِ بْنِ نَافِعٍ التَّمِيمِيُّ، حَدَّثَنَا يَحْيَى بْنُ صَالِحٍ الْوُحَاظِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، بِهَذَا الإِسْنَادِ وَقَالَ \" نِعْمَ الأُدُمُ \" . وَلَمْ يَشُكَّ ."
  },
  "2052": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2052d\nIn-book reference  : Book 36, Hadith 229\nUSC-MSA web (English) reference  : Book 23, Hadith 5096\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَجَّاجُ بْنُ أَبِي، زَيْنَبَ حَدَّثَنِي أَبُو سُفْيَانَ، طَلْحَةُ بْنُ نَافِعٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ كُنْتُ جَالِسًا فِي دَارِي فَمَرَّ بِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَشَارَ إِلَىَّ فَقُمْتُ إِلَيْهِ فَأَخَذَ بِيَدِي فَانْطَلَقْنَا حَتَّى أَتَى بَعْضَ حُجَرِ نِسَائِهِ فَدَخَلَ ثُمَّ أَذِنَ لِي فَدَخَلْتُ الْحِجَابَ عَلَيْهَا فَقَالَ \" هَلْ مِنْ غَدَاءٍ \" . فَقَالُوا نَعَمْ . فَأُتِيَ بِثَلاَثَةِ أَقْرِصَةٍ فَوُضِعْنَ عَلَى نَبِيٍّ فَأَخَذَ رَسُولُ اللَّهِ صلى الله عليه وسلم قُرْصًا فَوَضَعَهُ بَيْنَ يَدَيْهِ وَأَخَذَ قُرْصًا آخَرَ فَوَضَعَهُ بَيْنَ يَدَىَّ ثُمَّ أَخَذَ الثَّالِثَ فَكَسَرَهُ بِاثْنَيْنِ فَجَعَلَ نِصْفَهُ بَيْنَ يَدَيْهِ وَنِصْفَهُ بَيْنَ يَدَىَّ ثُمَّ قَالَ \" هَلْ مِنْ أُدُمٍ \" . قَالُوا لاَ . إِلاَّ شَىْءٌ مِنْ خَلٍّ . قَالَ \" هَاتُوهُ فَنِعْمَ الأُدُمُ هُوَ \" ."
  },
  "2053": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2053c\nIn-book reference  : Book 36, Hadith 232\nUSC-MSA web (English) reference  : Book 23, Hadith 5099\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَأَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ، - وَاللَّفْظُ مِنْهُمَا قَرِيبٌ - قَالاَ حَدَّثَنَا أَبُو النُّعْمَانِ، حَدَّثَنَا ثَابِتٌ، - فِي رِوَايَةِ حَجَّاجِ بْنِ يَزِيدَ أَبُو زَيْدٍ الأَحْوَلُ - حَدَّثَنَا عَاصِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أَفْلَحَ، مَوْلَى أَبِي أَيُّوبَ عَنْ أَبِي أَيُّوبَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم نَزَلَ عَلَيْهِ فَنَزَلَ النَّبِيُّ صلى الله عليه وسلم فِي السُّفْلِ وَأَبُو أَيُّوبَ فِي الْعُلْوِ - قَالَ - فَانْتَبَهَ أَبُو أَيُّوبَ لَيْلَةً فَقَالَ نَمْشِي فَوْقَ رَأْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَتَنَحَّوْا فَبَاتُوا فِي جَانِبٍ ثُمَّ قَالَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" السُّفْلُ أَرْفَقُ \" . فَقَالَ لاَ أَعْلُو سَقِيفَةً أَنْتَ تَحْتَهَا . فَتَحَوَّلَ النَّبِيُّ صلى الله عليه وسلم فِي الْعُلْوِ وَأَبُو أَيُّوبَ فِي السُّفْلِ فَكَانَ يَصْنَعُ لِلنَّبِيِّ صلى الله عليه وسلم طَعَامًا فَإِذَا جِيءَ بِهِ إِلَيْهِ سَأَلَ عَنْ مَوْضِعِ أَصَابِعِهِ فَيَتَتَبَّعُ مَوْضِعَ أَصَابِعِهِ فَصَنَعَ لَهُ طَعَامًا فِيهِ ثُومٌ فَلَمَّا رُدَّ إِلَيْهِ سَأَلَ عَنْ مَوْضِعِ أَصَابِعِ النَّبِيِّ صلى الله عليه وسلم فَقِيلَ لَهُ لَمْ يَأْكُلْ . فَفَزِعَ وَصَعِدَ إِلَيْهِ فَقَالَ أَحَرَامٌ هُوَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" لاَ وَلَكِنِّي أَكْرَهُهُ \" . قَالَ فَإِنِّي أَكْرَهُ مَا تَكْرَهُ أَوْ مَا كَرِهْتَ . قَالَ وَكَانَ النَّبِيُّ صلى الله عليه وسلم يُؤْتَى ."
  },
  "2054": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2054c\nIn-book reference  : Book 36, Hadith 235\nUSC-MSA web (English) reference  : Book 23, Hadith 5102\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لِيُضِيفَهُ فَلَمْ يَكُنْ عِنْدَهُ مَا يُضِيفُهُ فَقَالَ \" أَلاَ رَجُلٌ يُضِيفُ هَذَا رَحِمَهُ اللَّهُ \" . فَقَامَ رَجُلٌ مِنَ الأَنْصَارِ يُقَالُ لَهُ أَبُو طَلْحَةَ فَانْطَلَقَ بِهِ إِلَى رَحْلِهِ . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ جَرِيرٍ وَذَكَرَ فِيهِ نُزُولَ الآيَةِ كَمَا ذَكَرَهُ وَكِيعٌ ."
  },
  "2055": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2055b\nIn-book reference  : Book 36, Hadith 237\nUSC-MSA web (English) reference  : Book 23, Hadith 5104\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، بِهَذَا الإِسْنَادِ ."
  },
  "2056": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2056\nIn-book reference  : Book 36, Hadith 238\nUSC-MSA web (English) reference  : Book 23, Hadith 5105\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، وَحَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ، الأَعْلَى جَمِيعًا عَنِ الْمُعْتَمِرِ بْنِ سُلَيْمَانَ، - وَاللَّفْظُ لاِبْنِ مُعَاذٍ - حَدَّثَنَا الْمُعْتَمِرُ، حَدَّثَنَا أَبِي، عَنْ أَبِي عُثْمَانَ، - وَحَدَّثَ أَيْضًا، - عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم ثَلاَثِينَ وَمِائَةً فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" هَلْ مَعَ أَحَدٍ مِنْكُمْ طَعَامٌ \" . فَإِذَا مَعَ رَجُلٍ صَاعٌ مِنْ طَعَامٍ أَوْ نَحْوُهُ فَعُجِنَ ثُمَّ جَاءَ رَجُلٌ مُشْرِكٌ مُشْعَانٌّ طَوِيلٌ بِغَنَمٍ يَسُوقُهَا فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَبَيْعٌ أَمْ عَطِيَّةٌ - أَوْ قَالَ - أَمْ هِبَةٌ \" . فَقَالَ لاَ بَلْ بَيْعٌ . فَاشْتَرَى مِنْهُ شَاةً فَصُنِعَتْ وَأَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِسَوَادِ الْبَطْنِ أَنْ يُشْوَى . قَالَ وَايْمُ اللَّهِ مَا مِنَ الثَّلاَثِينَ وَمِائَةٍ إِلاَّ حَزَّ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم حُزَّةً حُزَّةً مِنْ سَوَادِ بَطْنِهَا إِنْ كَانَ شَاهِدًا أَعْطَاهُ وَإِنْ كَانَ غَائِبًا خَبَأَ لَهُ - قَالَ - وَجَعَلَ قَصْعَتَيْنِ فَأَكَلْنَا مِنْهُمَا أَجْمَعُونَ وَشَبِعْنَا وَفَضَلَ فِي الْقَصْعَتَيْنِ فَحَمَلْتُهُ عَلَى الْبَعِيرِ . أَوْ كَمَا قَالَ ."
  },
  "2057": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2057b\nIn-book reference  : Book 36, Hadith 240\nUSC-MSA web (English) reference  : Book 23, Hadith 5107\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ الْعَطَّارُ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي عُثْمَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، قَالَ نَزَلَ عَلَيْنَا أَضْيَافٌ لَنَا - قَالَ - وَكَانَ أَبِي يَتَحَدَّثُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ اللَّيْلِ - قَالَ - فَانْطَلَقَ وَقَالَ يَا عَبْدَ الرَّحْمَنِ افْرُغْ مِنْ أَضْيَافِكَ . قَالَ فَلَمَّا أَمْسَيْتُ جِئْنَا بِقِرَاهُمْ - قَالَ - فَأَبَوْا فَقَالُوا حَتَّى يَجِيءَ أَبُو مَنْزِلِنَا فَيَطْعَمَ مَعَنَا - قَالَ - فَقُلْتُ لَهُمْ إِنَّهُ رَجُلٌ حَدِيدٌ وَإِنَّكُمْ إِنْ لَمْ تَفْعَلُوا خِفْتُ أَنْ يُصِيبَنِي مِنْهُ أَذًى - قَالَ - فَأَبَوْا فَلَمَّا جَاءَ لَمْ يَبْدَأْ بِشَىْءٍ أَوَّلَ مِنْهُمْ فَقَالَ أَفَرَغْتُمْ مِنْ أَضْيَافِكُمْ قَالَ قَالُوا لاَ وَاللَّهِ مَا فَرَغْنَا . قَالَ أَلَمْ آمُرْ عَبْدَ الرَّحْمَنِ قَالَ وَتَنَحَّيْتُ عَنْهُ فَقَالَ يَا عَبْدَ الرَّحْمَنِ . قَالَ فَتَنَحَّيْتُ - قَالَ - فَقَالَ يَا غُنْثَرُ أَقْسَمْتُ عَلَيْكَ إِنْ كُنْتَ تَسْمَعُ صَوْتِي إِلاَّ جِئْتَ - قَالَ - فَجِئْتُ فَقُلْتُ وَاللَّهِ مَا لِي ذَنْبٌ هَؤُلاَءِ أَضْيَافُكَ فَسَلْهُمْ قَدْ أَتَيْتُهُمْ بِقِرَاهُمْ فَأَبَوْا أَنْ يَطْعَمُوا حَتَّى تَجِيءَ - قَالَ - فَقَالَ مَا لَكُمْ أَلاَ تَقْبَلُوا عَنَّا قِرَاكُمْ - قَالَ - فَقَالَ أَبُو بَكْرٍ فَوَاللَّهِ لاَ أَطْعَمُهُ اللَّيْلَةَ - قَالَ - فَقَالُوا فَوَاللَّهِ لاَ نَطْعَمُهُ حَتَّى تَطْعَمَهُ . قَالَ فَمَا رَأَيْتُ كَالشَّرِّ كَاللَّيْلَةِ قَطُّ وَيْلَكُمْ مَا لَكُمْ أَنْ لاَ تَقْبَلُوا عَنَّا قِرَاكُمْ قَالَ ثُمَّ قَالَ أَمَّا الأُولَى فَمِنَ الشَّيْطَانِ هَلُمُّوا قِرَاكُمْ - قَالَ - فَجِيءَ بِالطَّعَامِ فَسَمَّى فَأَكَلَ وَأَكَلُوا - قَالَ - فَلَمَّا أَصْبَحَ غَدَا عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ بَرُّوا وَحَنِثْتُ - قَالَ - فَأَخْبَرَهُ فَقَالَ \" بَلْ أَنْتَ أَبَرُّهُمْ وَأَخْيَرُهُمْ \" . قَالَ وَلَمْ تَبْلُغْنِي كَفَّارَةٌ ."
  },
  "2058": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2058\nIn-book reference  : Book 36, Hadith 241\nUSC-MSA web (English) reference  : Book 23, Hadith 5108\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" طَعَامُ الاِثْنَيْنِ كَافِي الثَّلاَثَةِ وَطَعَامُ الثَّلاَثَةِ كَافِي الأَرْبَعَةِ \" ."
  },
  "2059": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2059d\nIn-book reference  : Book 36, Hadith 245\nUSC-MSA web (English) reference  : Book 23, Hadith 5112\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالاَ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" طَعَامُ الرَّجُلِ يَكْفِي رَجُلَيْنِ وَطَعَامُ رَجُلَيْنِ يَكْفِي أَرْبَعَةً وَطَعَامُ أَرْبَعَةٍ يَكْفِي ثَمَانِيَةً \" ."
  },
  "2060": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2060c\nIn-book reference  : Book 36, Hadith 248\nUSC-MSA web (English) reference  : Book 23, Hadith 5115\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ وَاقِدِ، بْنِ مُحَمَّدِ بْنِ زَيْدٍ أَنَّهُ سَمِعَ نَافِعًا، قَالَ رَأَى ابْنُ عُمَرَ مِسْكِينًا فَجَعَلَ يَضَعُ بَيْنَ يَدَيْهِ وَيَضَعُ بَيْنَ يَدَيْهِ - قَالَ - فَجَعَلَ يَأْكُلُ أَكْلاً كَثِيرًا - قَالَ - فَقَالَ لاَ يُدْخَلَنَّ هَذَا عَلَىَّ فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّ الْكَافِرَ يَأْكُلُ فِي سَبْعَةِ أَمْعَاءٍ \" ."
  },
  "2061": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2061b\nIn-book reference  : Book 36, Hadith 250\nUSC-MSA web (English) reference  : Book 23, Hadith 5117\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَلَمْ يَذْكَرِ ابْنَ عُمَرَ ."
  },
  "2062": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2062b\nIn-book reference  : Book 36, Hadith 252\nUSC-MSA web (English) reference  : Book 23, Hadith 5119\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِهِمْ ."
  },
  "2063": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2063\nIn-book reference  : Book 36, Hadith 253\nUSC-MSA web (English) reference  : Book 23, Hadith 5120\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، أَخْبَرَنَا مَالِكٌ، عَنْ سُهَيْلِ بْنِ، أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَافَهُ ضَيْفٌ وَهُوَ كَافِرٌ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَحُلِبَتْ فَشَرِبَ حِلاَبَهَا ثُمَّ أُخْرَى فَشَرِبَهُ ثُمَّ أُخْرَى فَشَرِبَهُ حَتَّى شَرِبَ حِلاَبَ سَبْعِ شِيَاهٍ ثُمَّ إِنَّهُ أَصْبَحَ فَأَسْلَمَ فَأَمَرَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَاةٍ فَشَرِبَ حِلاَبَهَا ثُمَّ أَمَرَ بِأُخْرَى فَلَمْ يَسْتَتِمَّهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْمُؤْمِنُ يَشْرَبُ فِي مِعًى وَاحِدٍ وَالْكَافِرُ يَشْرَبُ فِي سَبْعَةِ أَمْعَاءٍ \" ."
  },
  "2064": {
    "collection": "Sahih Muslim",
    "book": "The Book of Drinks",
    "book_num": "36",
    "reference": "Reference  : Sahih Muslim 2064d\nIn-book reference  : Book 36, Hadith 257\nUSC-MSA web (English) reference  : Book 23, Hadith 5124\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/36",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَمُحَمَّدُ بْنُ الْمُثَنَّى وَعَمْرٌو النَّاقِدُ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالُوا أَخْبَرَنَا أَبُو مُعَاوِيَةَ حَدَّثَنَا الأَعْمَشُ عَنْ أَبِي يَحْيَى مَوْلَى آلِ جَعْدَةَ عَنْ أَبِي هُرَيْرَةَ قَالَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَابَ طَعَامًا قَطُّ كَانَ إِذَا اشْتَهَاهُ أَكَلَهُ وَإِنْ لَمْ يَشْتَهِهِ سَكَتَ .\nوَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  }
}