{
  "1960": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1960e\nIn-book reference  : Book 35, Hadith 5\nUSC-MSA web (English) reference  : Book 22, Hadith 4822\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1961": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1961j\nIn-book reference  : Book 35, Hadith 15\nUSC-MSA web (English) reference  : Book 22, Hadith 4832\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو عَامِرٍ الْعَقَدِيُّ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ . وَلَمْ يَذْكُرِ الشَّكَّ فِي قَوْلِهِ هِيَ خَيْرٌ مِنْ مُسِنَّةٍ ."
  },
  "1962": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1962c\nIn-book reference  : Book 35, Hadith 18\nUSC-MSA web (English) reference  : Book 22, Hadith 4835\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي زِيَادُ بْنُ يَحْيَى الْحَسَّانِيُّ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ وَرْدَانَ - حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ أَضْحًى - قَالَ - فَوَجَدَ رِيحَ لَحْمٍ فَنَهَاهُمْ أَنْ يَذْبَحُوا قَالَ \" مَنْ كَانَ ضَحَّى فَلْيُعِدْ \" . ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمَا ."
  },
  "1963": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1963\nIn-book reference  : Book 35, Hadith 19\nUSC-MSA web (English) reference  : Book 22, Hadith 4836\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَذْبَحُوا إِلاَّ مُسِنَّةً إِلاَّ أَنْ يَعْسُرَ عَلَيْكُمْ فَتَذْبَحُوا جَذَعَةً مِنَ الضَّأْنِ \" ."
  },
  "1964": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1964\nIn-book reference  : Book 35, Hadith 20\nUSC-MSA web (English) reference  : Book 22, Hadith 4837\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ صَلَّى بِنَا النَّبِيُّ صلى الله عليه وسلم يَوْمَ النَّحْرِ بِالْمَدِينَةِ فَتَقَدَّمَ رِجَالٌ فَنَحَرُوا وَظَنُّوا أَنَّ النَّبِيَّ صلى الله عليه وسلم قَدْ نَحَرَ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم مَنْ كَانَ نَحَرَ قَبْلَهُ أَنْ يُعِيدَ بِنَحْرٍ آخَرَ وَلاَ يَنْحَرُوا حَتَّى يَنْحَرَ النَّبِيُّ صلى الله عليه وسلم ."
  },
  "1965": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1965c\nIn-book reference  : Book 35, Hadith 23\nUSC-MSA web (English) reference  : Book 22, Hadith 4840\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ حَسَّانَ - أَخْبَرَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، أَخْبَرَنِي بَعْجَةُ بْنُ عَبْدِ، اللَّهِ أَنَّ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ، أَخْبَرَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَسَمَ ضَحَايَا بَيْنَ أَصْحَابِهِ . بِمِثْلِ مَعْنَاهُ ."
  },
  "1966": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1966d\nIn-book reference  : Book 35, Hadith 27\nUSC-MSA web (English) reference  : Book 22, Hadith 4844\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ وَيَقُولُ \" بِاسْمِ اللَّهِ وَاللَّهُ أَكْبَرُ \" ."
  },
  "1967": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1967\nIn-book reference  : Book 35, Hadith 28\nUSC-MSA web (English) reference  : Book 22, Hadith 4845\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ قَالَ حَيْوَةُ أَخْبَرَنِي أَبُو صَخْرٍ، عَنْ يَزِيدَ بْنِ قُسَيْطٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ بِكَبْشٍ أَقْرَنَ يَطَأُ فِي سَوَادٍ وَيَبْرُكُ فِي سَوَادٍ وَيَنْظُرُ فِي سَوَادٍ فَأُتِيَ بِهِ لِيُضَحِّيَ بِهِ فَقَالَ لَهَا \" يَا عَائِشَةُ هَلُمِّي الْمُدْيَةَ \" . ثُمَّ قَالَ \" اشْحَذِيهَا بِحَجَرٍ \" . فَفَعَلَتْ ثُمَّ أَخَذَهَا وَأَخَذَ الْكَبْشَ فَأَضْجَعَهُ ثُمَّ ذَبَحَهُ ثُمَّ قَالَ \" بِاسْمِ اللَّهِ اللَّهُمَّ تَقَبَّلْ مِنْ مُحَمَّدٍ وَآلِ مُحَمَّدٍ وَمِنْ أُمَّةِ مُحَمَّدٍ \" . ثُمَّ ضَحَّى بِهِ ."
  },
  "1968": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1968e\nIn-book reference  : Book 35, Hadith 33\nUSC-MSA web (English) reference  : Book 22, Hadith 4849\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ بْنِ رَافِعٍ، عَنْ رَافِعِ بْنِ خَدِيجٍ، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنَّا لاَقُو الْعَدُوِّ غَدًا وَلَيْسَ مَعَنَا مُدًى وَسَاقَ الْحَدِيثَ وَلَمْ يَذْكُرْ فَعَجِلَ الْقَوْمُ فَأَغْلَوْا بِهَا الْقُدُورَ فَأَمَرَ بِهَا فَكُفِئَتْ وَذَكَرَ سَائِرَ الْقِصَّةِ ."
  },
  "1969": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1969c\nIn-book reference  : Book 35, Hadith 36\nUSC-MSA web (English) reference  : Book 22, Hadith 4852\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي ابْنِ شِهَابٍ، ح وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1970": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1970c\nIn-book reference  : Book 35, Hadith 39\nUSC-MSA web (English) reference  : Book 22, Hadith 4855\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَقَالَ عَبْدٌ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى أَنْ تُؤْكَلَ لُحُومُ الأَضَاحِي بَعْدَ ثَلاَثٍ . قَالَ سَالِمٌ فَكَانَ ابْنُ عُمَرَ لاَ يَأْكُلُ لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ . وَقَالَ ابْنُ أَبِي عُمَرَ بَعْدَ ثَلاَثٍ ."
  },
  "1971": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1971\nIn-book reference  : Book 35, Hadith 40\nUSC-MSA web (English) reference  : Book 22, Hadith 4856\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا مَالِكٌ، عَنْ عَبْدِ اللَّهِ بْنِ، أَبِي بَكْرٍ عَنْ عَبْدِ اللَّهِ بْنِ وَاقِدٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ أَكْلِ لُحُومِ الضَّحَايَا بَعْدَ ثَلاَثٍ . قَالَ عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ فَذَكَرْتُ ذَلِكَ لِعَمْرَةَ فَقَالَتْ صَدَقَ سَمِعْتُ عَائِشَةَ تَقُولُ دَفَّ أَهْلُ أَبْيَاتٍ مِنْ أَهْلِ الْبَادِيَةِ حِضْرَةَ الأَضْحَى زَمَنَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ادَّخِرُوا ثَلاَثًا ثُمَّ تَصَدَّقُوا بِمَا بَقِيَ \" . فَلَمَّا كَانَ بَعْدَ ذَلِكَ قَالُوا يَا رَسُولَ اللَّهِ إِنَّ النَّاسَ يَتَّخِذُونَ الأَسْقِيَةَ مِنْ ضَحَايَاهُمْ وَيَحْمِلُونَ مِنْهَا الْوَدَكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَمَا ذَاكَ \" . قَالُوا نَهَيْتَ أَنْ تُؤْكَلَ لُحُومُ الضَّحَايَا بَعْدَ ثَلاَثٍ . فَقَالَ \" إِنَّمَا نَهَيْتُكُمْ مِنْ أَجْلِ الدَّافَّةِ الَّتِي دَفَّتْ فَكُلُوا وَادَّخِرُوا وَتَصَدَّقُوا \" ."
  },
  "1972": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1972d\nIn-book reference  : Book 35, Hadith 44\nUSC-MSA web (English) reference  : Book 22, Hadith 4860\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرٍو، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ كُنَّا نَتَزَوَّدُهَا إِلَى الْمَدِينَةِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1973": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1973\nIn-book reference  : Book 35, Hadith 45\nUSC-MSA web (English) reference  : Book 22, Hadith 4861\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَبِي، نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا أَهْلَ الْمَدِينَةِ لاَ تَأْكُلُوا لُحُومَ الأَضَاحِيِّ فَوْقَ ثَلاَثٍ \" . وَقَالَ ابْنُ الْمُثَنَّى ثَلاَثَةِ أَيَّامٍ . فَشَكَوْا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّ لَهُمْ عِيَالاً وَحَشَمًا وَخَدَمًا فَقَالَ \" كُلُوا وَأَطْعِمُوا وَاحْبِسُوا أَوِ ادَّخِرُوا \" . قَالَ ابْنُ الْمُثَنَّى شَكَّ عَبْدُ الأَعْلَى ."
  },
  "1974": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1974\nIn-book reference  : Book 35, Hadith 46\nUSC-MSA web (English) reference  : Book 22, Hadith 4862\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَاصِمٍ، عَنْ يَزِيدَ بْنِ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ، بْنِ الأَكْوَعِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ ضَحَّى مِنْكُمْ فَلاَ يُصْبِحَنَّ فِي بَيْتِهِ بَعْدَ ثَالِثَةٍ شَيْئًا \" . فَلَمَّا كَانَ فِي الْعَامِ الْمُقْبِلِ قَالُوا يَا رَسُولَ اللَّهِ نَفْعَلُ كَمَا فَعَلْنَا عَامَ أَوَّلَ فَقَالَ \" لاَ إِنَّ ذَاكَ عَامٌ كَانَ النَّاسُ فِيهِ بِجَهْدٍ فَأَرَدْتُ أَنْ يَفْشُوَ فِيهِمْ \" ."
  },
  "1975": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1975c, d\nIn-book reference  : Book 35, Hadith 49\nUSC-MSA web (English) reference  : Book 22, Hadith 4865\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو مُسْهِرٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي الزُّبَيْدِيُّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرِ بْنِ نُفَيْرٍ، عَنْ أَبِيهِ، عَنْ ثَوْبَانَ، مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ \" أَصْلِحْ هَذَا اللَّحْمَ \" . قَالَ فَأَصْلَحْتُهُ فَلَمْ يَزَلْ يَأْكُلُ مِنْهُ حَتَّى بَلَغَ الْمَدِينَةَ .\nوَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُبَارَكِ، حَدَّثَنَا يَحْيَى، بْنُ حَمْزَةَ بِهَذَا الإِسْنَادِ وَلَمْ يَقُلْ فِي حَجَّةِ الْوَدَاعِ ."
  },
  "1977": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1977i\nIn-book reference  : Book 35, Hadith 59\nUSC-MSA web (English) reference  : Book 22, Hadith 4875\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، وَأَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ أَخِي ابْنِ وَهْبٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، أَخْبَرَنِي خَالِدُ بْنُ يَزِيدَ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، عَنْ عُمَرَ، بْنِ مُسْلِمٍ الْجُنْدَعِيِّ أَنَّ ابْنَ الْمُسَيَّبِ، أَخْبَرَهُ أَنَّ أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ . وَذَكَرَ النَّبِيَّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمْ ."
  },
  "1976": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1976\nIn-book reference  : Book 35, Hadith 52\nUSC-MSA web (English) reference  : Book 22, Hadith 4868\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ فَرَعَ وَلاَ عَتِيرَةَ \" . زَادَ ابْنُ رَافِعٍ فِي رِوَايَتِهِ وَالْفَرَعُ أَوَّلُ النِّتَاجِ كَانَ يُنْتَجُ لَهُمْ فَيَذْبَحُونَهُ ."
  },
  "1978": {
    "collection": "Sahih Muslim",
    "book": "The Book of Sacrifices",
    "book_num": "35",
    "reference": "Reference  : Sahih Muslim 1978c\nIn-book reference  : Book 35, Hadith 62\nUSC-MSA web (English) reference  : Book 22, Hadith 4878\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/35",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ الْقَاسِمَ بْنَ أَبِي بَزَّةَ، يُحَدِّثُ عَنْ أَبِي الطُّفَيْلِ، قَالَ سُئِلَ عَلِيٌّ أَخَصَّكُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ فَقَالَ مَا خَصَّنَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِشَىْءٍ لَمْ يَعُمَّ بِهِ النَّاسَ كَافَّةً إِلاَّ مَا كَانَ فِي قِرَابِ سَيْفِي هَذَا - قَالَ - فَأَخْرَجَ صَحِيفَةً مَكْتُوبٌ فِيهَا \" لَعَنَ اللَّهُ مَنْ ذَبَحَ لِغَيْرِ اللَّهِ وَلَعَنَ اللَّهُ مَنْ سَرَقَ مَنَارَ الأَرْضِ وَلَعَنَ اللَّهُ مَنْ لَعَنَ وَالِدَهُ وَلَعَنَ اللَّهُ مَنْ آوَى مُحْدِثًا \" ."
  }
}