{
  "377": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 377\nIn-book reference  : Book 4, Hadith 1\nUSC-MSA web (English) reference  : Book 4, Hadith 735\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالاَ أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لَهُ - قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ، مَوْلَى ابْنِ عُمَرَ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، أَنَّهُ قَالَ كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَوَاتِ وَلَيْسَ يُنَادِي بِهَا أَحَدٌ فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمُ اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى وَقَالَ بَعْضُهُمْ قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ فَقَالَ عُمَرُ أَوَلاَ تَبْعَثُونَ رَجُلاً يُنَادِي بِالصَّلاَةِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا بِلاَلُ قُمْ فَنَادِ بِالصَّلاَةِ \" ."
  },
  "378": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 378d\nIn-book reference  : Book 4, Hadith 5\nUSC-MSA web (English) reference  : Book 4, Hadith 739\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، وَعَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْمَجِيدِ، قَالاَ حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ أُمِرَ بِلاَلٌ أَنْ يَشْفَعَ، الأَذَانَ وَيُوتِرَ الإِقَامَةَ ."
  },
  "379": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 379\nIn-book reference  : Book 4, Hadith 6\nUSC-MSA web (English) reference  : Book 4, Hadith 740\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، مَالِكُ بْنُ عَبْدِ الْوَاحِدِ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ قَالَ أَبُو غَسَّانَ حَدَّثَنَا مُعَاذٌ، وَقَالَ، إِسْحَاقُ أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ وَحَدَّثَنِي أَبِي، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ مَكْحُولٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَيْرِيزٍ، عَنْ أَبِي مَحْذُورَةَ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم عَلَّمَهُ هَذَا الأَذَانَ \" اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ - ثُمَّ يَعُودُ فَيَقُولُ - أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَىَّ عَلَى الصَّلاَةِ - مَرَّتَيْنِ - حَىَّ عَلَى الْفَلاَحِ - مَرَّتَيْنِ \" . زَادَ إِسْحَاقُ \" اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللَّهُ \" ."
  },
  "380": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 380b\nIn-book reference  : Book 4, Hadith 8\nUSC-MSA web (English) reference  : Book 4, Hadith 742\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا الْقَاسِمُ، عَنْ عَائِشَةَ، مِثْلَهُ ."
  },
  "381": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 381b\nIn-book reference  : Book 4, Hadith 10\nUSC-MSA web (English) reference  : Book 4, Hadith 744\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ، وَسَعِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "382": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 382\nIn-book reference  : Book 4, Hadith 11\nUSC-MSA web (English) reference  : Book 4, Hadith 745\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ حَمَّادِ بْنِ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُغِيرُ إِذَا طَلَعَ الْفَجْرُ وَكَانَ يَسْتَمِعُ الأَذَانَ فَإِنْ سَمِعَ أَذَانًا أَمْسَكَ وَإِلاَّ أَغَارَ فَسَمِعَ رَجُلاً يَقُولُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" عَلَى الْفِطْرَةِ \" . ثُمَّ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" خَرَجْتَ مِنَ النَّارِ \" . فَنَظَرُوا فَإِذَا هُوَ رَاعِي مِعْزًى ."
  },
  "383": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 383\nIn-book reference  : Book 4, Hadith 12\nUSC-MSA web (English) reference  : Book 4, Hadith 746\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَطَاءِ بْنِ يَزِيدَ اللَّيْثِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا سَمِعْتُمُ النِّدَاءَ فَقُولُوا مِثْلَ مَا يَقُولُ الْمُؤَذِّنُ \" ."
  },
  "384": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 384\nIn-book reference  : Book 4, Hadith 13\nUSC-MSA web (English) reference  : Book 4, Hadith 747\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ حَيْوَةَ، وَسَعِيدِ بْنِ أَبِي أَيُّوبَ، وَغَيْرِهِمَا، عَنْ كَعْبِ بْنِ عَلْقَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" إِذَا سَمِعْتُمُ الْمُؤَذِّنَ فَقُولُوا مِثْلَ مَا يَقُولُ ثُمَّ صَلُّوا عَلَىَّ فَإِنَّهُ مَنْ صَلَّى عَلَىَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْرًا ثُمَّ سَلُوا اللَّهَ لِيَ الْوَسِيلَةَ فَإِنَّهَا مَنْزِلَةٌ فِي الْجَنَّةِ لاَ تَنْبَغِي إِلاَّ لِعَبْدٍ مِنْ عِبَادِ اللَّهِ وَأَرْجُو أَنْ أَكُونَ أَنَا هُوَ فَمَنْ سَأَلَ لِيَ الْوَسِيلَةَ حَلَّتْ لَهُ الشَّفَاعَةُ \" ."
  },
  "385": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 385\nIn-book reference  : Book 4, Hadith 14\nUSC-MSA web (English) reference  : Book 4, Hadith 748\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ جَهْضَمٍ الثَّقَفِيُّ حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ إِسَافٍ، عَنْ حَفْصِ بْنِ عَاصِمِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، عُمَرَ بْنِ الْخَطَّابِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا قَالَ الْمُؤَذِّنُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ . فَقَالَ أَحَدُكُمُ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ . ثُمَّ قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ . قَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ ثُمَّ قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ . قَالَ أَشْهَدُ أَنَّ مُحَمَّدًا رَسُولُ اللَّهِ . ثُمَّ قَالَ حَىَّ عَلَى الصَّلاَةِ . قَالَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ . ثُمَّ قَالَ حَىَّ عَلَى الْفَلاَحِ . قَالَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ . ثُمَّ قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ . قَالَ اللَّهُ أَكْبَرُ اللَّهُ أَكْبَرُ . ثُمَّ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . مِنْ قَلْبِهِ دَخَلَ الْجَنَّةَ \" ."
  },
  "386": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 386\nIn-book reference  : Book 4, Hadith 15\nUSC-MSA web (English) reference  : Book 4, Hadith 749\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ الْقُرَشِيِّ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ الْحُكَيْمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ رَضِيتُ بِاللَّهِ رَبًّا وَبِمُحَمَّدٍ رَسُولاً وَبِالإِسْلاَمِ دِينًا . غُفِرَ لَهُ ذَنْبُهُ \" . قَالَ ابْنُ رُمْحٍ فِي رِوَايَتِهِ \" مَنْ قَالَ حِينَ يَسْمَعُ الْمُؤَذِّنَ وَأَنَا أَشْهَدُ \" . وَلَمْ يَذْكُرْ قُتَيْبَةُ قَوْلَهُ وَأَنَا ."
  },
  "387": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 387\nIn-book reference  : Book 4, Hadith 16\nUSC-MSA web (English) reference  : Book 4, Hadith 750\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَمِّهِ، قَالَ كُنْتُ عِنْدَ مُعَاوِيَةَ بْنِ أَبِي سُفْيَانَ فَجَاءَهُ الْمُؤَذِّنُ يَدْعُوهُ إِلَى الصَّلاَةِ فَقَالَ مُعَاوِيَةُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الْمُؤَذِّنُونَ أَطْوَلُ النَّاسِ أَعْنَاقًا يَوْمَ الْقِيَامَةِ \" . وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو عَامِرٍ، حَدَّثَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عِيسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ مُعَاوِيَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "388": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 388b\nIn-book reference  : Book 4, Hadith 18\nUSC-MSA web (English) reference  : Book 4, Hadith 752\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ."
  },
  "389": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 389e\nIn-book reference  : Book 4, Hadith 23\nUSC-MSA web (English) reference  : Book 4, Hadith 757\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ \" حَتَّى يَظَلَّ الرَّجُلُ إِنْ يَدْرِي كَيْفَ صَلَّى \" ."
  },
  "390": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 390c\nIn-book reference  : Book 4, Hadith 26\nUSC-MSA web (English) reference  : Book 4, Hadith 760\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنٌ، - وَهُوَ ابْنُ الْمُثَنَّى - حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، حَدَّثَنَا سَلَمَةُ بْنُ سُلَيْمَانَ، أَخْبَرَنَا يُونُسُ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ كَمَا قَالَ ابْنُ جُرَيْجٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ لِلصَّلاَةِ رَفَعَ يَدَيْهِ حَتَّى تَكُونَا حَذْوَ مَنْكِبَيْهِ ثُمَّ كَبَّرَ ."
  },
  "391": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 391c\nIn-book reference  : Book 4, Hadith 29\nUSC-MSA web (English) reference  : Book 4, Hadith 763\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ أَنَّهُ رَأَى نَبِيَّ اللَّهِ صلى الله عليه وسلم وَقَالَ حَتَّى يُحَاذِيَ بِهِمَا فُرُوعَ أُذُنَيْهِ ."
  },
  "392": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 392f\nIn-book reference  : Book 4, Hadith 35\nUSC-MSA web (English) reference  : Book 4, Hadith 769\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ كَانَ يُكَبِّرُ كُلَّمَا خَفَضَ وَرَفَعَ وَيُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَفْعَلُ ذَلِكَ ."
  },
  "393": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 393\nIn-book reference  : Book 4, Hadith 36\nUSC-MSA web (English) reference  : Book 4, Hadith 770\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَخَلَفُ بْنُ هِشَامٍ، جَمِيعًا عَنْ حَمَّادٍ، - قَالَ يَحْيَى أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، - عَنْ غَيْلاَنَ، عَنْ مُطَرِّفٍ، قَالَ صَلَّيْتُ أَنَا وَعِمْرَانُ بْنُ حُصَيْنٍ، خَلْفَ عَلِيِّ بْنِ أَبِي طَالِبٍ فَكَانَ إِذَا سَجَدَ كَبَّرَ وَإِذَا رَفَعَ رَأْسَهُ كَبَّرَ وَإِذَا نَهَضَ مِنَ الرَّكْعَتَيْنِ كَبَّرَ فَلَمَّا انْصَرَفْنَا مِنَ الصَّلاَةِ - قَالَ - أَخَذَ عِمْرَانُ بِيَدِي ثُمَّ قَالَ لَقَدْ صَلَّى بِنَا هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم . أَوْ قَالَ قَدْ ذَكَّرَنِي هَذَا صَلاَةَ مُحَمَّدٍ صلى الله عليه وسلم ."
  },
  "394": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 394d\nIn-book reference  : Book 4, Hadith 40\nUSC-MSA web (English) reference  : Book 4, Hadith 774\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَزَادَ فَصَاعِدًا ."
  },
  "395": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 395c\nIn-book reference  : Book 4, Hadith 43\nUSC-MSA web (English) reference  : Book 4, Hadith 777\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُوَيْسٍ، أَخْبَرَنِي الْعَلاَءُ، قَالَ سَمِعْتُ مِنْ أَبِي وَمِنْ أَبِي السَّائِبِ، وَكَانَا، جَلِيسَىْ أَبِي هُرَيْرَةَ قَالاَ قَالَ أَبُو هُرَيْرَةَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَلَّى صَلاَةً لَمْ يَقْرَأْ فِيهَا بِفَاتِحَةِ الْكِتَابِ فَهْىَ خِدَاجٌ \" . يَقُولُهَا ثَلاَثًا بِمِثْلِ حَدِيثِهِمْ ."
  },
  "396": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 396c\nIn-book reference  : Book 4, Hadith 46\nUSC-MSA web (English) reference  : Book 4, Hadith 780\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - عَنْ حَبِيبٍ الْمُعَلِّمِ، عَنْ عَطَاءٍ، قَالَ قَالَ أَبُو هُرَيْرَةَ فِي كُلِّ صَلاَةٍ قِرَاءَةٌ فَمَا أَسْمَعَنَا النَّبِيُّ صلى الله عليه وسلم أَسْمَعْنَاكُمْ وَمَا أَخْفَى مِنَّا أَخْفَيْنَاهُ مِنْكُمْ وَمَنْ قَرَأَ بِأُمِّ الْكِتَابِ فَقَدْ أَجْزَأَتْ عَنْهُ وَمَنْ زَادَ فَهُوَ أَفْضَلُ ."
  },
  "397": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 397b\nIn-book reference  : Book 4, Hadith 48\nUSC-MSA web (English) reference  : Book 4, Hadith 782\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي قَالاَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ فَصَلَّى وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي نَاحِيَةٍ وَسَاقَا الْحَدِيثَ بِمِثْلِ هَذِهِ الْقِصَّةِ وَزَادَا فِيهِ \" إِذَا قُمْتَ إِلَى الصَّلاَةِ فَأَسْبِغِ الْوُضُوءَ ثُمَّ اسْتَقْبِلِ الْقِبْلَةَ فَكَبِّرْ \" ."
  },
  "398": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 398c\nIn-book reference  : Book 4, Hadith 51\nUSC-MSA web (English) reference  : Book 4, Hadith 785\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنِ ابْنِ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى الظُّهْرَ وَقَالَ \" قَدْ عَلِمْتُ أَنَّ بَعْضَكُمْ خَالَجَنِيهَا \" ."
  },
  "399": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 399d\nIn-book reference  : Book 4, Hadith 55\nUSC-MSA web (English) reference  : Book 4, Hadith 789\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، أَخْبَرَنِي إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَذْكُرُ ذَلِكَ ."
  },
  "400": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 400b\nIn-book reference  : Book 4, Hadith 57\nUSC-MSA web (English) reference  : Book 4, Hadith 791\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ أَخْبَرَنَا ابْنُ فُضَيْلٍ، عَنْ مُخْتَارِ بْنِ فُلْفُلٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ أَغْفَى رَسُولُ اللَّهِ صلى الله عليه وسلم إِغْفَاءَةً . بِنَحْوِ حَدِيثِ ابْنِ مُسْهِرٍ غَيْرَ أَنَّهُ قَالَ \" نَهْرٌ وَعَدَنِيهِ رَبِّي عَزَّ وَجَلَّ فِي الْجَنَّةِ عَلَيْهِ حَوْضٌ \" . وَلَمْ يَذْكُرْ \" آنِيَتُهُ عَدَدُ النُّجُومِ \" ."
  },
  "401": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 401\nIn-book reference  : Book 4, Hadith 58\nUSC-MSA web (English) reference  : Book 4, Hadith 792\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا مُحَمَّدُ بْنُ جُحَادَةَ، حَدَّثَنِي عَبْدُ الْجَبَّارِ بْنُ وَائِلٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، وَمَوْلًى، لَهُمْ أَنَّهُمَا حَدَّثَاهُ عَنْ أَبِيهِ، وَائِلِ بْنِ حُجْرٍ، أَنَّهُ رَأَى النَّبِيَّ صلى الله عليه وسلم رَفَعَ يَدَيْهِ حِينَ دَخَلَ فِي الصَّلاَةِ كَبَّرَ - وَصَفَ هَمَّامٌ حِيَالَ أُذُنَيْهِ - ثُمَّ الْتَحَفَ بِثَوْبِهِ ثُمَّ وَضَعَ يَدَهُ الْيُمْنَى عَلَى الْيُسْرَى فَلَمَّا أَرَادَ أَنْ يَرْكَعَ أَخْرَجَ يَدَيْهِ مِنَ الثَّوْبِ ثُمَّ رَفَعَهُمَا ثُمَّ كَبَّرَ فَرَكَعَ فَلَمَّا قَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" . رَفَعَ يَدَيْهِ فَلَمَّا سَجَدَ سَجَدَ بَيْنَ كَفَّيْهِ ."
  },
  "402": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 402e\nIn-book reference  : Book 4, Hadith 63\nUSC-MSA web (English) reference  : Book 4, Hadith 797\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا سَيْفُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ مُجَاهِدًا، يَقُولُ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَخْبَرَةَ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ عَلَّمَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم التَّشَهُّدَ كَفِّي بَيْنَ كَفَّيْهِ كَمَا يُعَلِّمُنِي السُّورَةَ مِنَ الْقُرْآنِ . وَاقْتَصَّ التَّشَهُّدَ بِمِثْلِ مَا اقْتَصُّوا ."
  },
  "403": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 403b\nIn-book reference  : Book 4, Hadith 65\nUSC-MSA web (English) reference  : Book 4, Hadith 799\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ حُمَيْدٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُعَلِّمُنَا التَّشَهُّدَ كَمَا يُعَلِّمُنَا السُّورَةَ مِنَ الْقُرْآنِ ."
  },
  "404": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 404c\nIn-book reference  : Book 4, Hadith 68\nUSC-MSA web (English) reference  : Book 4, Hadith 802\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، عَنْ عَبْدِ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ وَقَالَ فِي الْحَدِيثِ \" فَإِنَّ اللَّهَ عَزَّ وَجَلَّ قَضَى عَلَى لِسَانِ نَبِيِّهِ صلى الله عليه وسلم سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" ."
  },
  "405": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 405\nIn-book reference  : Book 4, Hadith 69\nUSC-MSA web (English) reference  : Book 4, Hadith 803\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ زَيْدٍ الأَنْصَارِيَّ، - وَعَبْدُ اللَّهِ بْنُ زَيْدٍ هُوَ الَّذِي كَانَ أُرِيَ النِّدَاءَ بِالصَّلاَةِ - أَخْبَرَهُ عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ قَالَ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي مَجْلِسِ سَعْدِ بْنِ عُبَادَةَ فَقَالَ لَهُ بَشِيرُ بْنُ سَعْدٍ أَمَرَنَا اللَّهُ تَعَالَى أَنْ نُصَلِّيَ عَلَيْكَ يَا رَسُولَ اللَّهِ فَكَيْفَ نُصَلِّي عَلَيْكَ قَالَ فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى تَمَنَّيْنَا أَنَّهُ لَمْ يَسْأَلْهُ ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قُولُوا \" اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ فِي الْعَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ . وَالسَّلاَمُ كَمَا قَدْ عَلِمْتُمْ \" ."
  },
  "406": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 406c\nIn-book reference  : Book 4, Hadith 72\nUSC-MSA web (English) reference  : Book 4, Hadith 806\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، عَنِ الأَعْمَشِ، وَعَنْ مِسْعَرٍ، وَعَنْ مَالِكِ بْنِ مِغْوَلٍ، كُلُّهُمْ عَنِ الْحَكَمِ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ \" وَبَارِكْ عَلَى مُحَمَّدٍ \" . وَلَمْ يَقُلِ اللَّهُمَّ ."
  },
  "407": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 407\nIn-book reference  : Book 4, Hadith 73\nUSC-MSA web (English) reference  : Book 4, Hadith 807\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا رَوْحٌ، وَعَبْدُ اللَّهِ بْنُ نَافِعٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا رَوْحٌ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، عَنْ عَمْرِو بْنِ سُلَيْمٍ، أَخْبَرَنِي أَبُو حُمَيْدٍ السَّاعِدِيُّ، أَنَّهُمْ قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ نُصَلِّي عَلَيْكَ قَالَ \" قُولُوا اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا صَلَّيْتَ عَلَى آلِ إِبْرَاهِيمَ وَبَارِكْ عَلَى مُحَمَّدٍ وَعَلَى أَزْوَاجِهِ وَذُرِّيَّتِهِ كَمَا بَارَكْتَ عَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ \" ."
  },
  "408": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 408\nIn-book reference  : Book 4, Hadith 74\nUSC-MSA web (English) reference  : Book 4, Hadith 808\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ صَلَّى عَلَىَّ وَاحِدَةً صَلَّى اللَّهُ عَلَيْهِ عَشْرًا \" ."
  },
  "409": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 409b\nIn-book reference  : Book 4, Hadith 76\nUSC-MSA web (English) reference  : Book 4, Hadith 810\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ سُمَىٍّ ."
  },
  "410": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 410f\nIn-book reference  : Book 4, Hadith 82\nUSC-MSA web (English) reference  : Book 4, Hadith 816\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا قَالَ الْقَارِئُ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ . فَقَالَ مَنْ خَلْفَهُ آمِينَ . فَوَافَقَ قَوْلُهُ قَوْلَ أَهْلِ السَّمَاءِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "411": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 411e\nIn-book reference  : Book 4, Hadith 87\nUSC-MSA web (English) reference  : Book 4, Hadith 821\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَنَسٌ، أَنَّ النَّبِيَّ صلى الله عليه وسلم سَقَطَ مِنْ فَرَسِهِ فَجُحِشَ شِقُّهُ الأَيْمَنُ . وَسَاقَ الْحَدِيثَ وَلَيْسَ فِيهِ زِيَادَةُ يُونُسَ وَمَالِكٍ ."
  },
  "412": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 412b\nIn-book reference  : Book 4, Hadith 89\nUSC-MSA web (English) reference  : Book 4, Hadith 823\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا أَبِي جَمِيعًا، عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "413": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 413b\nIn-book reference  : Book 4, Hadith 91\nUSC-MSA web (English) reference  : Book 4, Hadith 825\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الرُّؤَاسِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبُو بَكْرٍ خَلْفَهُ فَإِذَا كَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم كَبَّرَ أَبُو بَكْرٍ لِيُسْمِعَنَا . ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ اللَّيْثِ ."
  },
  "414": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 414b\nIn-book reference  : Book 4, Hadith 93\nUSC-MSA web (English) reference  : Book 4, Hadith 827\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "415": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 415b\nIn-book reference  : Book 4, Hadith 95\nUSC-MSA web (English) reference  : Book 4, Hadith 829\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ إِلاَّ قَوْلَهُ \" وَلاَ الضَّالِّينَ . فَقُولُوا آمِينَ \" . وَزَادَ \" وَلاَ تَرْفَعُوا قَبْلَهُ \" ."
  },
  "416": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 416\nIn-book reference  : Book 4, Hadith 96\nUSC-MSA web (English) reference  : Book 4, Hadith 830\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ يَعْلَى، - وَهُوَ ابْنُ عَطَاءٍ - سَمِعَ أَبَا عَلْقَمَةَ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّمَا الإِمَامُ جُنَّةٌ فَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ . فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ . فَإِذَا وَافَقَ قَوْلُ أَهْلِ الأَرْضِ قَوْلَ أَهْلِ السَّمَاءِ غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "417": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 417\nIn-book reference  : Book 4, Hadith 97\nUSC-MSA web (English) reference  : Book 4, Hadith 831\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" إِنَّمَا جُعِلَ الإِمَامُ لِيُؤْتَمَّ بِهِ فَإِذَا كَبَّرَ فَكَبِّرُوا وَإِذَا رَكَعَ فَارْكَعُوا وَإِذَا قَالَ سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ . فَقُولُوا اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ . وَإِذَا صَلَّى قَائِمًا فَصَلُّوا قِيَامًا وَإِذَا صَلَّى قَاعِدًا فَصَلُّوا قُعُودًا أَجْمَعُونَ \" ."
  },
  "418": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 418h\nIn-book reference  : Book 4, Hadith 105\nUSC-MSA web (English) reference  : Book 4, Hadith 839\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ هِشَامٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ أَمَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فِي مَرَضِهِ فَكَانَ يُصَلِّي بِهِمْ . قَالَ عُرْوَةُ فَوَجَدَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ نَفْسِهِ خِفَّةً فَخَرَجَ وَإِذَا أَبُو بَكْرٍ يَؤُمُّ النَّاسَ فَلَمَّا رَآهُ أَبُو بَكْرٍ اسْتَأْخَرَ فَأَشَارَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىْ كَمَا أَنْتَ فَجَلَسَ رَسُولُ اللَّهِ حِذَاءَ أَبِي بَكْرٍ إِلَى جَنْبِهِ . فَكَانَ أَبُو بَكْرٍ يُصَلِّي بِصَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَالنَّاسُ يُصَلُّونَ بِصَلاَةِ أَبِي بَكْرٍ ."
  },
  "419": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 419d\nIn-book reference  : Book 4, Hadith 109\nUSC-MSA web (English) reference  : Book 4, Hadith 843\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ لَمْ يَخْرُجْ إِلَيْنَا نَبِيُّ اللَّهِ صلى الله عليه وسلم ثَلاَثًا فَأُقِيمَتِ الصَّلاَةُ فَذَهَبَ أَبُو بَكْرٍ يَتَقَدَّمُ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِالْحِجَابِ فَرَفَعَهُ فَلَمَّا وَضَحَ لَنَا وَجْهُ نَبِيِّ اللَّهِ صلى الله عليه وسلم مَا نَظَرْنَا مَنْظَرًا قَطُّ كَانَ أَعْجَبَ إِلَيْنَا مِنْ وَجْهِ النَّبِيِّ صلى الله عليه وسلم حِينَ وَضَحَ لَنَا - قَالَ - فَأَوْمَأَ نَبِيُّ اللَّهِ صلى الله عليه وسلم بِيَدِهِ إِلَى أَبِي بَكْرٍ أَنْ يَتَقَدَّمَ وَأَرْخَى نَبِيُّ اللَّهِ صلى الله عليه وسلم الْحِجَابَ فَلَمْ نَقْدِرْ عَلَيْهِ حَتَّى مَاتَ ."
  },
  "420": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 420\nIn-book reference  : Book 4, Hadith 110\nUSC-MSA web (English) reference  : Book 4, Hadith 844\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ مَرِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَاشْتَدَّ مَرَضُهُ فَقَالَ \" مُرُوا أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ \" . فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّ أَبَا بَكْرٍ رَجُلٌ رَقِيقٌ مَتَى يَقُمْ مَقَامَكَ لاَ يَسْتَطِعْ أَنْ يُصَلِّيَ بِالنَّاسِ فَقَالَ \" مُرِي أَبَا بَكْرٍ فَلْيُصَلِّ بِالنَّاسِ فَإِنَّكُنَّ صَوَاحِبُ يُوسُفَ \" . قَالَ فَصَلَّى بِهِمْ أَبُو بَكْرٍ حَيَاةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "421": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 421c\nIn-book reference  : Book 4, Hadith 113\nUSC-MSA web (English) reference  : Book 4, Hadith 847\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ بَزِيعٍ، أَخْبَرَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ ذَهَبَ نَبِيُّ اللَّهِ صلى الله عليه وسلم يُصْلِحُ بَيْنَ بَنِي عَمْرِو بْنِ عَوْفٍ . بِمِثْلِ حَدِيثِهِمْ وَزَادَ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَخَرَقَ الصُّفُوفَ حَتَّى قَامَ عِنْدَ الصَّفِّ الْمُقَدَّمِ . وَفِيهِ أَنَّ أَبَا بَكْرٍ رَجَعَ الْقَهْقَرَى ."
  },
  "274": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 274m\nIn-book reference  : Book 4, Hadith 115\nUSC-MSA web (English) reference  : Book 4, Hadith 849\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَالْحُلْوَانِيُّ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ حَمْزَةَ بْنِ الْمُغِيرَةِ، نَحْوَ حَدِيثِ عَبَّادٍ قَالَ الْمُغِيرَةُ فَأَرَدْتُ تَأْخِيرَ عَبْدِ الرَّحْمَنِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" دَعْهُ \" ."
  },
  "422": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 422c\nIn-book reference  : Book 4, Hadith 118\nUSC-MSA web (English) reference  : Book 4, Hadith 852\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِهِ وَزَادَ \" فِي الصَّلاَةِ \" ."
  },
  "423": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 423\nIn-book reference  : Book 4, Hadith 119\nUSC-MSA web (English) reference  : Book 4, Hadith 853\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الْوَلِيدِ، - يَعْنِي ابْنَ كَثِيرٍ - حَدَّثَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا ثُمَّ انْصَرَفَ فَقَالَ \" يَا فُلاَنُ أَلاَ تُحْسِنُ صَلاَتَكَ أَلاَ يَنْظُرُ الْمُصَلِّي إِذَا صَلَّى كَيْفَ يُصَلِّي فَإِنَّمَا يُصَلِّي لِنَفْسِهِ إِنِّي وَاللَّهِ لأُبْصِرُ مَنْ وَرَائِي كَمَا أُبْصِرُ مَنْ بَيْنَ يَدَىَّ \" ."
  },
  "424": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 424\nIn-book reference  : Book 4, Hadith 120\nUSC-MSA web (English) reference  : Book 4, Hadith 854\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" هَلْ تَرَوْنَ قِبْلَتِي هَا هُنَا فَوَاللَّهِ مَا يَخْفَى عَلَىَّ رُكُوعُكُمْ وَلاَ سُجُودُكُمْ إِنِّي لأَرَاكُمْ وَرَاءَ ظَهْرِي \" ."
  },
  "425": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 425b\nIn-book reference  : Book 4, Hadith 122\nUSC-MSA web (English) reference  : Book 4, Hadith 856\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ هِشَامٍ - حَدَّثَنِي أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، كِلاَهُمَا عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ \" أَتِمُّوا الرُّكُوعَ وَالسُّجُودَ فَوَاللَّهِ إِنِّي لأَرَاكُمْ مِنْ بَعْدِ ظَهْرِي إِذَا مَا رَكَعْتُمْ وَإِذَا مَا سَجَدْتُمْ \" . وَفِي حَدِيثِ سَعِيدٍ \" إِذَا رَكَعْتُمْ وَإِذَا سَجَدْتُمْ \" ."
  },
  "426": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 426b\nIn-book reference  : Book 4, Hadith 124\nUSC-MSA web (English) reference  : Book 4, Hadith 858\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ ابْنِ فُضَيْلٍ، جَمِيعًا عَنِ الْمُخْتَارِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ وَلَيْسَ فِي حَدِيثِ جَرِيرٍ \" وَلاَ بِالاِنْصِرَافِ \" ."
  },
  "427": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 427c\nIn-book reference  : Book 4, Hadith 127\nUSC-MSA web (English) reference  : Book 4, Hadith 861\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سَلاَّمٍ الْجُمَحِيُّ، وَعَبْدُ الرَّحْمَنِ بْنُ الرَّبِيعِ بْنِ مُسْلِمٍ، جَمِيعًا عَنِ الرَّبِيعِ بْنِ مُسْلِمٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، كُلُّهُمْ عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا غَيْرَ أَنَّ فِي حَدِيثِ الرَّبِيعِ بْنِ مُسْلِمٍ \" أَنْ يَجْعَلَ اللَّهُ وَجْهَهُ وَجْهَ حِمَارٍ \" ."
  },
  "428": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 428\nIn-book reference  : Book 4, Hadith 128\nUSC-MSA web (English) reference  : Book 4, Hadith 862\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنِ الْمُسَيَّبِ، عَنْ تَمِيمِ بْنِ طَرَفَةَ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيَنْتَهِيَنَّ أَقْوَامٌ يَرْفَعُونَ أَبْصَارَهُمْ إِلَى السَّمَاءِ فِي الصَّلاَةِ أَوْ لاَ تَرْجِعُ إِلَيْهِمْ \" ."
  },
  "429": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 429\nIn-book reference  : Book 4, Hadith 129\nUSC-MSA web (English) reference  : Book 4, Hadith 863\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَيَنْتَهِيَنَّ أَقْوَامٌ عَنْ رَفْعِهِمْ أَبْصَارَهُمْ عِنْدَ الدُّعَاءِ فِي الصَّلاَةِ إِلَى السَّمَاءِ أَوْ لَتُخْطَفَنَّ أَبْصَارُهُمْ \" ."
  },
  "430": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 430b\nIn-book reference  : Book 4, Hadith 131\nUSC-MSA web (English) reference  : Book 4, Hadith 865\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، قَالاَ جَمِيعًا حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "431": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 431b\nIn-book reference  : Book 4, Hadith 133\nUSC-MSA web (English) reference  : Book 4, Hadith 867\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، عَنْ فُرَاتٍ، - يَعْنِي الْقَزَّازَ - عَنْ عُبَيْدِ اللَّهِ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَكُنَّا إِذَا سَلَّمْنَا قُلْنَا بِأَيْدِينَا السَّلاَمُ عَلَيْكُمْ السَّلاَمُ عَلَيْكُمْ فَنَظَرَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" مَا شَأْنُكُمْ تُشِيرُونَ بِأَيْدِيكُمْ كَأَنَّهَا أَذْنَابُ خَيْلٍ شُمُسٍ إِذَا سَلَّمَ أَحَدُكُمْ فَلْيَلْتَفِتْ إِلَى صَاحِبِهِ وَلاَ يُومِئْ بِيَدِهِ \" ."
  },
  "432": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 432c\nIn-book reference  : Book 4, Hadith 136\nUSC-MSA web (English) reference  : Book 4, Hadith 870\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَصَالِحُ بْنُ حَاتِمِ بْنِ وَرْدَانَ، قَالاَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنِي خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لِيَلِنِي مِنْكُمْ أُولُو الأَحْلاَمِ وَالنُّهَى ثُمَّ الَّذِينَ يَلُونَهُمْ - ثَلاَثًا - وَإِيَّاكُمْ وَهَيْشَاتِ الأَسْوَاقِ \" ."
  },
  "433": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 433\nIn-book reference  : Book 4, Hadith 137\nUSC-MSA web (English) reference  : Book 4, Hadith 871\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" سَوُّوا صُفُوفَكُمْ فَإِنَّ تَسْوِيَةَ الصَّفِّ مِنْ تَمَامِ الصَّلاَةِ \" ."
  },
  "434": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 434\nIn-book reference  : Book 4, Hadith 138\nUSC-MSA web (English) reference  : Book 4, Hadith 872\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ صُهَيْبٍ - عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَتِمُّوا الصُّفُوفَ فَإِنِّي أَرَاكُمْ خَلْفَ ظَهْرِي \" ."
  },
  "435": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 435\nIn-book reference  : Book 4, Hadith 139\nUSC-MSA web (English) reference  : Book 4, Hadith 873\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ \" أَقِيمُوا الصَّفَّ فِي الصَّلاَةِ فَإِنَّ إِقَامَةَ الصَّفِّ مِنْ حُسْنِ الصَّلاَةِ \" ."
  },
  "436": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 436c\nIn-book reference  : Book 4, Hadith 142\nUSC-MSA web (English) reference  : Book 4, Hadith 876\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "437": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 437\nIn-book reference  : Book 4, Hadith 143\nUSC-MSA web (English) reference  : Book 4, Hadith 877\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَوْ يَعْلَمُ النَّاسُ مَا فِي النِّدَاءِ وَالصَّفِّ الأَوَّلِ ثُمَّ لَمْ يَجِدُوا إِلاَّ أَنْ يَسْتَهِمُوا عَلَيْهِ لاَسْتَهَمُوا وَلَوْ يَعْلَمُونَ مَا فِي التَّهْجِيرِ لاَسْتَبَقُوا إِلَيْهِ وَلَوْ يَعْلَمُونَ مَا فِي الْعَتَمَةِ وَالصُّبْحِ لأَتَوْهُمَا وَلَوْ حَبْوًا \" ."
  },
  "438": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 438b\nIn-book reference  : Book 4, Hadith 145\nUSC-MSA web (English) reference  : Book 4, Hadith 879\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرَّقَاشِيُّ، حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ رَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم قَوْمًا فِي مُؤَخَّرِ الْمَسْجِدِ . فَذَكَرَ مِثْلَهُ ."
  },
  "439": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 439\nIn-book reference  : Book 4, Hadith 146\nUSC-MSA web (English) reference  : Book 4, Hadith 880\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ دِينَارٍ، وَمُحَمَّدُ بْنُ حَرْبٍ الْوَاسِطِيُّ، قَالاَ حَدَّثَنَا عَمْرُو بْنُ الْهَيْثَمِ أَبُو قَطَنٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ خِلاَسٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لَوْ تَعْلَمُونَ - أَوْ يَعْلَمُونَ - مَا فِي الصَّفِّ الْمُقَدَّمِ لَكَانَتْ قُرْعَةً \" . وَقَالَ ابْنُ حَرْبٍ \" الصَّفِّ الأَوَّلِ مَا كَانَتْ إِلاَّ قُرْعَةً \" ."
  },
  "440": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 440b\nIn-book reference  : Book 4, Hadith 148\nUSC-MSA web (English) reference  : Book 4, Hadith 882\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي الدَّرَاوَرْدِيَّ - عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ ."
  },
  "441": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 441\nIn-book reference  : Book 4, Hadith 149\nUSC-MSA web (English) reference  : Book 4, Hadith 883\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ لَقَدْ رَأَيْتُ الرِّجَالَ عَاقِدِي أُزُرِهِمْ فِي أَعْنَاقِهِمْ مِثْلَ الصِّبْيَانِ مِنْ ضِيقِ الأُزُرِ خَلْفَ النَّبِيِّ صلى الله عليه وسلم فَقَالَ قَائِلٌ يَا مَعْشَرَ النِّسَاءِ لاَ تَرْفَعْنَ رُءُوسَكُنَّ حَتَّى يَرْفَعَ الرِّجَالُ ."
  },
  "442": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 442h\nIn-book reference  : Book 4, Hadith 157\nUSC-MSA web (English) reference  : Book 4, Hadith 891\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدٌ، - يَعْنِي ابْنَ أَبِي أَيُّوبَ - حَدَّثَنَا كَعْبُ بْنُ عَلْقَمَةَ، عَنْ بِلاَلِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَمْنَعُوا النِّسَاءَ حُظُوظَهُنَّ مِنَ الْمَسَاجِدِ إِذَا اسْتَأْذَنُوكُمْ \" فَقَالَ بِلاَلٌ وَاللَّهِ لَنَمْنَعُهُنَّ . فَقَالَ لَهُ عَبْدُ اللَّهِ أَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَتَقُولُ أَنْتَ لَنَمْنَعُهُنَّ ."
  },
  "443": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 443b\nIn-book reference  : Book 4, Hadith 159\nUSC-MSA web (English) reference  : Book 4, Hadith 893\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنْ مُحَمَّدِ بْنِ عَجْلاَنَ، حَدَّثَنِي بُكَيْرُ بْنُ عَبْدِ اللَّهِ بْنِ الأَشَجِّ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْنَبَ، امْرَأَةِ عَبْدِ اللَّهِ قَالَتْ قَالَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا شَهِدَتْ إِحْدَاكُنَّ الْمَسْجِدَ فَلاَ تَمَسَّ طِيبًا \" ."
  },
  "444": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 444\nIn-book reference  : Book 4, Hadith 160\nUSC-MSA web (English) reference  : Book 4, Hadith 894\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ يَحْيَى أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي فَرْوَةَ، عَنْ يَزِيدَ بْنِ خُصَيْفَةَ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَيُّمَا امْرَأَةٍ أَصَابَتْ بَخُورًا فَلاَ تَشْهَدْ مَعَنَا الْعِشَاءَ الآخِرَةَ \" ."
  },
  "445": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 445b\nIn-book reference  : Book 4, Hadith 162\nUSC-MSA web (English) reference  : Book 4, Hadith 896\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح قَالَ وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "446": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 446\nIn-book reference  : Book 4, Hadith 163\nUSC-MSA web (English) reference  : Book 4, Hadith 897\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ الصَّبَّاحِ وَعَمْرٌو النَّاقِدُ جَمِيعًا عَنْ هُشَيْمٍ، - قَالَ ابْنُ الصَّبَّاحِ حَدَّثَنَا هُشَيْمٌ، - أَخْبَرَنَا أَبُو بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ { وَلاَ تَجْهَرْ بِصَلاَتِكَ وَلاَ تُخَافِتْ بِهَا} قَالَ نَزَلَتْ وَرَسُولُ اللَّهِ صلى الله عليه وسلم مُتَوَارٍ بِمَكَّةَ فَكَانَ إِذَا صَلَّى بِأَصْحَابِهِ رَفَعَ صَوْتَهُ بِالْقُرْآنِ فَإِذَا سَمِعَ ذَلِكَ الْمُشْرِكُونَ سَبُّوا الْقُرْآنَ وَمَنْ أَنْزَلَهُ وَمَنْ جَاءَ بِهِ فَقَالَ اللَّهُ تَعَالَى لِنَبِيِّهِ صلى الله عليه وسلم { وَلاَ تَجْهَرْ بِصَلاَتِكَ} فَيَسْمَعَ الْمُشْرِكُونَ قِرَاءَتَكَ { وَلاَ تُخَافِتْ بِهَا} عَنْ أَصْحَابِكَ أَسْمِعْهُمُ الْقُرْآنَ وَلاَ تَجْهَرْ ذَلِكَ الْجَهْرَ وَابْتَغِ بَيْنَ ذَلِكَ سَبِيلاً يَقُولُ بَيْنَ الْجَهْرِ وَالْمُخَافَتَةِ ."
  },
  "447": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 447b\nIn-book reference  : Book 4, Hadith 165\nUSC-MSA web (English) reference  : Book 4, Hadith 899\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَوَكِيعٌ، ح قَالَ وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "448": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 448b\nIn-book reference  : Book 4, Hadith 167\nUSC-MSA web (English) reference  : Book 4, Hadith 901\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُوسَى بْنِ أَبِي عَائِشَةَ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ { لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ} قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يُعَالِجُ مِنَ التَّنْزِيلِ شِدَّةً كَانَ يُحَرِّكُ شَفَتَيْهِ - فَقَالَ لِيَ ابْنُ عَبَّاسٍ أَنَا أُحَرِّكُهُمَا كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَرِّكُهُمَا . فَقَالَ سَعِيدٌ أَنَا أُحَرِّكُهُمَا كَمَا كَانَ ابْنُ عَبَّاسٍ يُحَرِّكُهُمَا . فَحَرَّكَ شَفَتَيْهِ - فَأَنْزَلَ اللَّهُ تَعَالَى { لاَ تُحَرِّكْ بِهِ لِسَانَكَ لِتَعْجَلَ بِهِ * إِنَّ عَلَيْنَا جَمْعَهُ وَقُرْآنَهُ} قَالَ جَمْعَهُ فِي صَدْرِكَ ثُمَّ تَقْرَأُهُ { فَإِذَا قَرَأْنَاهُ فَاتَّبِعْ قُرْآنَهُ} قَالَ فَاسْتَمِعْ وَأَنْصِتْ ثُمَّ إِنَّ عَلَيْنَا أَنْ تَقْرَأَهُ قَالَ فَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَتَاهُ جِبْرِيلُ اسْتَمَعَ فَإِذَا انْطَلَقَ جِبْرِيلُ قَرَأَهُ النَّبِيُّ صلى الله عليه وسلم كَمَا أَقْرَأَهُ ."
  },
  "449": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 449\nIn-book reference  : Book 4, Hadith 168\nUSC-MSA web (English) reference  : Book 4, Hadith 902\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ مَا قَرَأَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْجِنِّ وَمَا رَآهُمُ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي طَائِفَةٍ مِنْ أَصْحَابِهِ عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَقَدْ حِيلَ بَيْنَ الشَّيَاطِينِ وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْهِمُ الشُّهُبُ فَرَجَعَتِ الشَّيَاطِينُ إِلَى قَوْمِهِمْ فَقَالُوا مَا لَكُمْ قَالُوا حِيلَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ وَأُرْسِلَتْ عَلَيْنَا الشُّهُبُ . قَالُوا مَا ذَاكَ إِلاَّ مِنْ شَىْءٍ حَدَثَ فَاضْرِبُوا مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَانْظُرُوا مَا هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ . فَانْطَلَقُوا يَضْرِبُونَ مَشَارِقَ الأَرْضِ وَمَغَارِبَهَا فَمَرَّ النَّفَرُ الَّذِينَ أَخَذُوا نَحْوَ تِهَامَةَ - وَهُوَ بِنَخْلٍ - عَامِدِينَ إِلَى سُوقِ عُكَاظٍ وَهُوَ يُصَلِّي بِأَصْحَابِهِ صَلاَةَ الْفَجْرِ فَلَمَّا سَمِعُوا الْقُرْآنَ اسْتَمَعُوا لَهُ وَقَالُوا هَذَا الَّذِي حَالَ بَيْنَنَا وَبَيْنَ خَبَرِ السَّمَاءِ . فَرَجَعُوا إِلَى قَوْمِهِمْ فَقَالُوا يَا قَوْمَنَا { إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا * يَهْدِي إِلَى الرُّشْدِ فَآمَنَّا بِهِ وَلَنْ نُشْرِكَ بِرَبِّنَا أَحَدًا} فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ عَلَى نَبِيِّهِ مُحَمَّدٍ صلى الله عليه وسلم { قُلْ أُوحِيَ إِلَىَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِنَ الْجِنِّ} ."
  },
  "450": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 450e\nIn-book reference  : Book 4, Hadith 173\nUSC-MSA web (English) reference  : Book 4, Hadith 907\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مُحَمَّدٍ الْجَرْمِيُّ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ مِسْعَرٍ، عَنْ مَعْنٍ، قَالَ سَمِعْتُ أَبِي قَالَ، سَأَلْتُ مَسْرُوقًا مَنْ آذَنَ النَّبِيَّ صلى الله عليه وسلم بِالْجِنِّ لَيْلَةَ اسْتَمَعُوا الْقُرْآنَ فَقَالَ حَدَّثَنِي أَبُوكَ - يَعْنِي ابْنَ مَسْعُودٍ - أَنَّهُ آذَنَتْهُ بِهِمْ شَجَرَةٌ ."
  },
  "451": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 451b\nIn-book reference  : Book 4, Hadith 175\nUSC-MSA web (English) reference  : Book 4, Hadith 909\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هَمَّامٌ، وَأَبَانُ بْنُ يَزِيدَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ مِنَ الظُّهْرِ وَالْعَصْرِ بِفَاتِحَةِ الْكِتَابِ وَسُورَةٍ وَيُسْمِعُنَا الآيَةَ أَحْيَانًا وَيَقْرَأُ فِي الرَّكْعَتَيْنِ الأُخْرَيَيْنِ بِفَاتِحَةِ الْكِتَابِ ."
  },
  "452": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 452b\nIn-book reference  : Book 4, Hadith 177\nUSC-MSA web (English) reference  : Book 4, Hadith 911\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مَنْصُورٍ، عَنِ الْوَلِيدِ أَبِي بِشْرٍ، عَنْ أَبِي الصِّدِّيقِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي صَلاَةِ الظُّهْرِ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ فِي كُلِّ رَكْعَةٍ قَدْرَ ثَلاَثِينَ آيَةً وَفِي الأُخْرَيَيْنِ قَدْرَ خَمْسَ عَشَرَةَ آيَةً أَوْ قَالَ نِصْفَ ذَلِكَ وَفِي الْعَصْرِ فِي الرَّكْعَتَيْنِ الأُولَيَيْنِ فِي كُلِّ رَكْعَةٍ قَدْرَ قِرَاءَةِ خَمْسَ عَشْرَةَ آيَةً وَفِي الأُخْرَيَيْنِ قَدْرَ نِصْفِ ذَلِكَ ."
  },
  "453": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 453d\nIn-book reference  : Book 4, Hadith 181\nUSC-MSA web (English) reference  : Book 4, Hadith 915\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، عَنْ عَبْدِ الْمَلِكِ، وَأَبِي، عَوْنٍ عَنْ جَابِرِ بْنِ سَمُرَةَ، بِمَعْنَى حَدِيثِهِمْ وَزَادَ فَقَالَ تُعَلِّمُنِي الأَعْرَابُ بِالصَّلاَةِ"
  },
  "454": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 454b\nIn-book reference  : Book 4, Hadith 183\nUSC-MSA web (English) reference  : Book 4, Hadith 917\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ رَبِيعَةَ، قَالَ حَدَّثَنِي قَزْعَةُ، قَالَ أَتَيْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ وَهُوَ مَكْثُورٌ عَلَيْهِ فَلَمَّا تَفَرَّقَ النَّاسُ عَنْهُ قُلْتُ إِنِّي لاَ أَسْأَلُكَ عَمَّا يَسْأَلُكَ هَؤُلاَءِ عَنْهُ - قُلْتُ - أَسْأَلُكَ عَنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَقَالَ مَا لَكَ فِي ذَاكَ مِنْ خَيْرٍ . فَأَعَادَهَا عَلَيْهِ فَقَالَ كَانَتْ صَلاَةُ الظُّهْرِ تُقَامُ فَيَنْطَلِقُ أَحَدُنَا إِلَى الْبَقِيعِ فَيَقْضِي حَاجَتَهُ ثُمَّ يَأْتِي أَهْلَهُ فَيَتَوَضَّأُ ثُمَّ يَرْجِعُ إِلَى الْمَسْجِدِ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي الرَّكْعَةِ الأُولَى ."
  },
  "455": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 455\nIn-book reference  : Book 4, Hadith 184\nUSC-MSA web (English) reference  : Book 4, Hadith 918\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، عَنِ ابْنِ جُرَيْجٍ، ح قَالَ وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، - وَتَقَارَبَا فِي اللَّفْظِ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ عَبَّادِ بْنِ جَعْفَرٍ، يَقُولُ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ سُفْيَانَ، وَعَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ، وَعَبْدُ اللَّهِ بْنُ الْمُسَيَّبِ الْعَابِدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ السَّائِبِ، قَالَ صَلَّى لَنَا النَّبِيُّ صلى الله عليه وسلم الصُّبْحَ بِمَكَّةَ فَاسْتَفْتَحَ سُورَةَ الْمُؤْمِنِينَ حَتَّى جَاءَ ذِكْرُ مُوسَى وَهَارُونَ أَوْ ذِكْرُ عِيسَى - مُحَمَّدُ بْنُ عَبَّادٍ يَشُكُّ أَوِ اخْتَلَفُوا عَلَيْهِ - أَخَذَتِ النَّبِيَّ صلى الله عليه وسلم سَعْلَةٌ فَرَكَعَ وَعَبْدُ اللَّهِ بْنُ السَّائِبِ حَاضِرٌ ذَلِكَ . وَفِي حَدِيثِ عَبْدِ الرَّزَّاقِ فَحَذَفَ فَرَكَعَ . وَفِي حَدِيثِهِ وَعَبْدُ اللَّهِ بْنُ عَمْرٍو . وَلَمْ يَقُلِ ابْنِ الْعَاصِ ."
  },
  "456": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 456\nIn-book reference  : Book 4, Hadith 185\nUSC-MSA web (English) reference  : Book 4, Hadith 919\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي أَبُو كُرَيْبٍ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ سَرِيعٍ، عَنْ عَمْرِو بْنِ حُرَيْثٍ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقْرَأُ فِي الْفَجْرِ { وَاللَّيْلِ إِذَا عَسْعَسَ}"
  },
  "457": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 457c\nIn-book reference  : Book 4, Hadith 188\nUSC-MSA web (English) reference  : Book 4, Hadith 922\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ زِيَادِ بْنِ عِلاَقَةَ، عَنْ عَمِّهِ، أَنَّهُ صَلَّى مَعَ النَّبِيِّ صلى الله عليه وسلم الصُّبْحَ فَقَرَأَ فِي أَوَّلِ رَكْعَةٍ { وَالنَّخْلَ بَاسِقَاتٍ لَهَا طَلْعٌ نَضِيدٌ} وَرُبَّمَا قَالَ { ق} ."
  },
  "458": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 458b\nIn-book reference  : Book 4, Hadith 190\nUSC-MSA web (English) reference  : Book 4, Hadith 924\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ رَافِعٍ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - قَالاَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا زُهَيْرٌ، عَنْ سِمَاكٍ، قَالَ سَأَلْتُ جَابِرَ بْنَ سَمُرَةَ عَنْ صَلاَةِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ كَانَ يُخَفِّفُ الصَّلاَةَ وَلاَ يُصَلِّي صَلاَةَ هَؤُلاَءِ . قَالَ وَأَنْبَأَنِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الْفَجْرِ بـ { ق وَالْقُرْآنِ} وَنَحْوِهَا ."
  },
  "459": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 459\nIn-book reference  : Book 4, Hadith 191\nUSC-MSA web (English) reference  : Book 4, Hadith 925\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَقْرَأُ فِي الظُّهْرِ بِـ { اللَّيْلِ إِذَا يَغْشَى} وَفِي الْعَصْرِ نَحْوَ ذَلِكَ وَفِي الصُّبْحِ أَطْوَلَ مِنْ ذَلِكَ ."
  },
  "460": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 460\nIn-book reference  : Book 4, Hadith 192\nUSC-MSA web (English) reference  : Book 4, Hadith 926\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، عَنْ شُعْبَةَ، عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، . أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَقْرَأُ فِي الظُّهْرِ بِـ { سَبِّحِ اسْمَ رَبِّكَ الأَعْلَى} وَفِي الصُّبْحِ بِأَطْوَلَ مِنْ ذَلِكَ ."
  },
  "461": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 461b\nIn-book reference  : Book 4, Hadith 194\nUSC-MSA web (English) reference  : Book 4, Hadith 928\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي الْمِنْهَالِ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرَأُ فِي الْفَجْرِ مَا بَيْنَ السِّتِّينَ إِلَى الْمِائَةِ آيَةً ."
  },
  "462": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 462b\nIn-book reference  : Book 4, Hadith 196\nUSC-MSA web (English) reference  : Book 4, Hadith 930\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، قَالاَ حَدَّثَنَا سُفْيَانُ، ح قَالَ وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح قَالَ وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . وَزَادَ فِي حَدِيثِ صَالِحٍ ثُمَّ مَا صَلَّى بَعْدُ حَتَّى قَبَضَهُ اللَّهُ عَزَّ وَجَلَّ ."
  },
  "463": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 463b\nIn-book reference  : Book 4, Hadith 198\nUSC-MSA web (English) reference  : Book 4, Hadith 932\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا سُفْيَانُ، ح قَالَ وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "464": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 464c\nIn-book reference  : Book 4, Hadith 201\nUSC-MSA web (English) reference  : Book 4, Hadith 935\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا مِسْعَرٌ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ سَمِعْتُ الْبَرَاءَ بْنَ عَازِبٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم قَرَأَ فِي الْعِشَاءِ بِالتِّينِ وَالزَّيْتُونِ . فَمَا سَمِعْتُ أَحَدًا أَحْسَنَ صَوْتًا مِنْهُ ."
  },
  "465": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 465d\nIn-book reference  : Book 4, Hadith 205\nUSC-MSA web (English) reference  : Book 4, Hadith 939\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو الرَّبِيعِ الزَّهْرَانِيُّ، قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ مُعَاذٌ يُصَلِّي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الْعِشَاءَ ثُمَّ يَأْتِي مَسْجِدَ قَوْمِهِ فَيُصَلِّي بِهِمْ ."
  },
  "466": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 466b\nIn-book reference  : Book 4, Hadith 207\nUSC-MSA web (English) reference  : Book 4, Hadith 941\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا هُشَيْمٌ، وَوَكِيعٌ، ح قَالَ وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، فِي هَذَا الإِسْنَادِ بِمِثْلِ حَدِيثِ هُشَيْمٍ ."
  },
  "467": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 467d\nIn-book reference  : Book 4, Hadith 211\nUSC-MSA web (English) reference  : Book 4, Hadith 945\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، حَدَّثَنِي اللَّيْثُ بْنُ سَعْدٍ، حَدَّثَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم . بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ - بَدَلَ السَّقِيمِ - الْكَبِيرَ ."
  },
  "468": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 468b\nIn-book reference  : Book 4, Hadith 213\nUSC-MSA web (English) reference  : Book 4, Hadith 947\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، قَالَ سَمِعْتُ سَعِيدَ بْنَ الْمُسَيَّبِ، قَالَ حَدَّثَ عُثْمَانُ بْنُ أَبِي الْعَاصِ، قَالَ آخِرُ مَا عَهِدَ إِلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا أَمَمْتَ قَوْمًا فَأَخِفَّ بِهِمُ الصَّلاَةَ \" ."
  },
  "469": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 469c\nIn-book reference  : Book 4, Hadith 216\nUSC-MSA web (English) reference  : Book 4, Hadith 950\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنْ شَرِيكِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّهُ قَالَ مَا صَلَّيْتُ وَرَاءَ إِمَامٍ قَطُّ أَخَفَّ صَلاَةً وَلاَ أَتَمَّ صَلاَةً مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "470": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 470b\nIn-book reference  : Book 4, Hadith 218\nUSC-MSA web (English) reference  : Book 4, Hadith 952\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي لأَدْخُلُ الصَّلاَةَ أُرِيدُ إِطَالَتَهَا فَأَسْمَعُ بُكَاءَ الصَّبِيِّ فَأُخَفِّفُ مِنْ شِدَّةِ وَجْدِ أُمِّهِ بِهِ \" ."
  },
  "471": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 471c\nIn-book reference  : Book 4, Hadith 221\nUSC-MSA web (English) reference  : Book 4, Hadith 955\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، أَنَّ مَطَرَ بْنَ نَاجِيَةَ، لَمَّا ظَهَرَ عَلَى الْكُوفَةِ أَمَرَ أَبَا عُبَيْدَةَ أَنْ يُصَلِّيَ، بِالنَّاسِ . وَسَاقَ الْحَدِيثَ ."
  },
  "472": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 472\nIn-book reference  : Book 4, Hadith 222\nUSC-MSA web (English) reference  : Book 4, Hadith 956\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ إِنِّي لاَ آلُو أَنْ أُصَلِّيَ بِكُمْ كَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي بِنَا . قَالَ فَكَانَ أَنَسٌ يَصْنَعُ شَيْئًا لاَ أَرَاكُمْ تَصْنَعُونَهُ كَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ انْتَصَبَ قَائِمًا حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ . وَإِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ مَكَثَ حَتَّى يَقُولَ الْقَائِلُ قَدْ نَسِيَ ."
  },
  "473": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 473\nIn-book reference  : Book 4, Hadith 223\nUSC-MSA web (English) reference  : Book 4, Hadith 957\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ مَا صَلَّيْتُ خَلْفَ أَحَدٍ أَوْجَزَ صَلاَةً مِنْ صَلاَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي تَمَامٍ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم مُتَقَارِبَةً وَكَانَتْ صَلاَةُ أَبِي بَكْرٍ مُتَقَارِبَةً فَلَمَّا كَانَ عُمَرُ بْنُ الْخَطَّابِ مَدَّ فِي صَلاَةِ الْفَجْرِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" . قَامَ حَتَّى نَقُولَ قَدْ أَوْهَمَ . ثُمَّ يَسْجُدُ وَيَقْعُدُ بَيْنَ السَّجْدَتَيْنِ حَتَّى نَقُولَ قَدْ أَوْهَمَ ."
  },
  "474": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 474d\nIn-book reference  : Book 4, Hadith 227\nUSC-MSA web (English) reference  : Book 4, Hadith 961\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، حَدَّثَنَا أَبَانٌ، وَغَيْرُهُ، عَنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ الْبَرَاءِ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم لاَ يَحْنُو أَحَدٌ مِنَّا ظَهْرَهُ حَتَّى نَرَاهُ قَدْ سَجَدَ . فَقَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ قَالَ حَدَّثَنَا الْكُوفِيُّونَ أَبَانٌ وَغَيْرُهُ قَالَ حَتَّى نَرَاهُ يَسْجُدُ ."
  },
  "475": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 475\nIn-book reference  : Book 4, Hadith 228\nUSC-MSA web (English) reference  : Book 4, Hadith 962\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحْرِزُ بْنُ عَوْنِ بْنِ أَبِي عَوْنٍ، حَدَّثَنَا خَلَفُ بْنُ خَلِيفَةَ الأَشْجَعِيُّ أَبُو أَحْمَدَ، عَنِ الْوَلِيدِ بْنِ سَرِيعٍ، مَوْلَى آلِ عَمْرِو بْنِ حُرَيْثٍ عَنْ عَمْرِو بْنِ حُرَيْثٍ، قَالَ صَلَّيْتُ خَلْفَ النَّبِيِّ صلى الله عليه وسلم الْفَجْرَ فَسَمِعْتُهُ يَقْرَأُ { فَلاَ أُقْسِمُ بِالْخُنَّسِ * الْجَوَارِ الْكُنَّسِ} وَكَانَ لاَ يَحْنِي رَجُلٌ مِنَّا ظَهْرَهُ حَتَّى يَسْتَتِمَّ سَاجِدًا ."
  },
  "476": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 476d\nIn-book reference  : Book 4, Hadith 232\nUSC-MSA web (English) reference  : Book 4, Hadith 966\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، قَالَ وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ فِي رِوَايَةِ مُعَاذٍ \" كَمَا يُنَقَّى الثَّوْبُ الأَبْيَضُ مِنَ الدَّرَنِ \" . وَفِي رِوَايَةِ يَزِيدَ \" مِنَ الدَّنَسِ \" ."
  },
  "477": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 477\nIn-book reference  : Book 4, Hadith 233\nUSC-MSA web (English) reference  : Book 4, Hadith 967\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مَرْوَانُ بْنُ مُحَمَّدٍ الدِّمَشْقِيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الْعَزِيزِ، عَنْ عَطِيَّةَ بْنِ قَيْسٍ، عَنْ قَزْعَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ \" رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَوَاتِ وَالأَرْضِ وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ أَهْلَ الثَّنَاءِ وَالْمَجْدِ أَحَقُّ مَا قَالَ الْعَبْدُ وَكُلُّنَا لَكَ عَبْدٌ اللَّهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ \" ."
  },
  "478": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 478b\nIn-book reference  : Book 4, Hadith 235\nUSC-MSA web (English) reference  : Book 4, Hadith 969\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا حَفْصٌ، حَدَّثَنَا هِشَامُ بْنُ حَسَّانَ، حَدَّثَنَا قَيْسُ بْنُ سَعْدٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم إِلَى قَوْلِهِ \" وَمِلْءَ مَا شِئْتَ مِنْ شَىْءٍ بَعْدُ \" . وَلَمْ يَذْكُرْ مَا بَعْدَهُ ."
  },
  "479": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 479b\nIn-book reference  : Book 4, Hadith 237\nUSC-MSA web (English) reference  : Book 4, Hadith 971\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُفْيَانُ، عَنْ سُلَيْمَانَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ سُحَيْمٍ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ مَعْبَدِ بْنِ عَبَّاسٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ كَشَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم السِّتْرَ وَرَأْسُهُ مَعْصُوبٌ فِي مَرَضِهِ الَّذِي مَاتَ فِيهِ فَقَالَ \" اللَّهُمَّ هَلْ بَلَّغْتُ \" . ثَلاَثَ مَرَّاتٍ \" إِنَّهُ لَمْ يَبْقَ مِنْ مُبَشِّرَاتِ النُّبُوَّةِ إِلاَّ الرُّؤْيَا يَرَاهَا الْعَبْدُ الصَّالِحُ أَوْ تُرَى لَهُ \" . ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ سُفْيَانَ ."
  },
  "480": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 480f\nIn-book reference  : Book 4, Hadith 243\nUSC-MSA web (English) reference  : Book 4, Hadith 977\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ، عَنْ حَاتِمِ بْنِ إِسْمَاعِيلَ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ عَلِيٍّ، وَلَمْ يَذْكُرْ فِي السُّجُودِ ."
  },
  "481": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 481\nIn-book reference  : Book 4, Hadith 244\nUSC-MSA web (English) reference  : Book 4, Hadith 978\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنْ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ نُهِيتُ أَنْ أَقْرَأَ، وَأَنَا رَاكِعٌ، . لاَ يَذْكُرُ فِي الإِسْنَادِ عَلِيًّا ."
  },
  "482": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 482\nIn-book reference  : Book 4, Hadith 245\nUSC-MSA web (English) reference  : Book 4, Hadith 979\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ أَنَّهُ سَمِعَ أَبَا صَالِحٍ، ذَكْوَانَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ فَأَكْثِرُوا الدُّعَاءَ \" ."
  },
  "483": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 483\nIn-book reference  : Book 4, Hadith 246\nUSC-MSA web (English) reference  : Book 4, Hadith 980\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَيُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَقُولُ فِي سُجُودِهِ \" اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ وَأَوَّلَهُ وَآخِرَهُ وَعَلاَنِيَتَهُ وَسِرَّهُ \" ."
  },
  "484": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 484d\nIn-book reference  : Book 4, Hadith 250\nUSC-MSA web (English) reference  : Book 4, Hadith 984\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الأَعْلَى، حَدَّثَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكْثِرُ مِنْ قَوْلِ \" سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ \" . قَالَتْ فَقُلْتُ يَا رَسُولَ اللَّهِ أَرَاكَ تُكْثِرُ مِنْ قَوْلِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ . فَقَالَ \" خَبَّرَنِي رَبِّي أَنِّي سَأَرَى عَلاَمَةً فِي أُمَّتِي فَإِذَا رَأَيْتُهَا أَكْثَرْتُ مِنْ قَوْلِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ أَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ . فَقَدْ رَأَيْتُهَا { إِذَا جَاءَ نَصْرُ اللَّهِ وَالْفَتْحُ} فَتْحُ مَكَّةَ { وَرَأَيْتَ النَّاسَ يَدْخُلُونَ فِي دِينِ اللَّهِ أَفْوَاجًا * فَسَبِّحْ بِحَمْدِ رَبِّكَ وَاسْتَغْفِرْهُ إِنَّهُ كَانَ تَوَّابًا} \" ."
  },
  "485": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 485\nIn-book reference  : Book 4, Hadith 251\nUSC-MSA web (English) reference  : Book 4, Hadith 985\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ قُلْتُ لِعَطَاءٍ كَيْفَ تَقُولُ أَنْتَ فِي الرُّكُوعِ قَالَ أَمَّا سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ فَأَخْبَرَنِي ابْنُ أَبِي مُلَيْكَةَ عَنْ عَائِشَةَ قَالَتِ افْتَقَدْتُ النَّبِيَّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَظَنَنْتُ أَنَّهُ ذَهَبَ إِلَى بَعْضِ نِسَائِهِ فَتَحَسَّسْتُ ثُمَّ رَجَعْتُ فَإِذَا هُوَ رَاكِعٌ أَوْ سَاجِدٌ يَقُولُ \" سُبْحَانَكَ وَبِحَمْدِكَ لاَ إِلَهَ إِلاَّ أَنْتَ \" . فَقُلْتُ بِأَبِي أَنْتَ وَأُمِّي إِنِّي لَفِي شَأْنٍ وَإِنَّكَ لَفِي آخَرَ ."
  },
  "486": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 486\nIn-book reference  : Book 4, Hadith 252\nUSC-MSA web (English) reference  : Book 4, Hadith 986\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ عَائِشَةَ، قَالَتْ فَقَدْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم لَيْلَةً مِنَ الْفِرَاشِ فَالْتَمَسْتُهُ فَوَقَعَتْ يَدِي عَلَى بَطْنِ قَدَمَيْهِ وَهُوَ فِي الْمَسْجِدِ وَهُمَا مَنْصُوبَتَانِ وَهُوَ يَقُولُ \" اللَّهُمَّ أَعُوذُ بِرِضَاكَ مِنْ سَخَطِكَ وَبِمُعَافَاتِكَ مِنْ عُقُوبَتِكَ وَأَعُوذُ بِكَ مِنْكَ لاَ أُحْصِي ثَنَاءً عَلَيْكَ أَنْتَ كَمَا أَثْنَيْتَ عَلَى نَفْسِكَ \" ."
  },
  "487": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 487b\nIn-book reference  : Book 4, Hadith 254\nUSC-MSA web (English) reference  : Book 4, Hadith 988\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، أَخْبَرَنِي قَتَادَةُ، قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، قَالَ أَبُو دَاوُدَ وَحَدَّثَنِي هِشَامٌ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ ."
  },
  "488": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 488\nIn-book reference  : Book 4, Hadith 255\nUSC-MSA web (English) reference  : Book 4, Hadith 989\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، قَالَ سَمِعْتُ الأَوْزَاعِيَّ، قَالَ حَدَّثَنِي الْوَلِيدُ بْنُ هِشَامٍ الْمُعَيْطِيُّ، حَدَّثَنِي مَعْدَانُ بْنُ أَبِي طَلْحَةَ الْيَعْمَرِيُّ، قَالَ لَقِيتُ ثَوْبَانَ مَوْلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ أَخْبِرْنِي بِعَمَلٍ أَعْمَلُهُ يُدْخِلُنِي اللَّهُ بِهِ الْجَنَّةَ . أَوْ قَالَ قُلْتُ بِأَحَبِّ الأَعْمَالِ إِلَى اللَّهِ . فَسَكَتَ ثُمَّ سَأَلْتُهُ فَسَكَتَ ثُمَّ سَأَلْتُهُ الثَّالِثَةَ فَقَالَ سَأَلْتُ عَنْ ذَلِكَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ \" عَلَيْكَ بِكَثْرَةِ السُّجُودِ لِلَّهِ فَإِنَّكَ لاَ تَسْجُدُ لِلَّهِ سَجْدَةً إِلاَّ رَفَعَكَ اللَّهُ بِهَا دَرَجَةً وَحَطَّ عَنْكَ بِهَا خَطِيئَةً \" . قَالَ مَعْدَانُ ثُمَّ لَقِيتُ أَبَا الدَّرْدَاءِ فَسَأَلْتُهُ فَقَالَ لِي مِثْلَ مَا قَالَ لِي ثَوْبَانُ ."
  },
  "489": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 489\nIn-book reference  : Book 4, Hadith 256\nUSC-MSA web (English) reference  : Book 4, Hadith 990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا هِقْلُ بْنُ زِيَادٍ، قَالَ سَمِعْتُ الأَوْزَاعِيَّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنِي رَبِيعَةُ بْنُ كَعْبٍ الأَسْلَمِيُّ، قَالَ كُنْتُ أَبِيتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ بِوَضُوئِهِ وَحَاجَتِهِ فَقَالَ لِي \" سَلْ \" . فَقُلْتُ أَسْأَلُكَ مُرَافَقَتَكَ فِي الْجَنَّةِ . قَالَ \" أَوَغَيْرَ ذَلِكَ \" . قُلْتُ هُوَ ذَاكَ . قَالَ \" فَأَعِنِّي عَلَى نَفْسِكَ بِكَثْرَةِ السُّجُودِ \" ."
  },
  "490": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 490e\nIn-book reference  : Book 4, Hadith 261\nUSC-MSA web (English) reference  : Book 4, Hadith 995\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي ابْنُ جُرَيْجٍ، عَنْ عَبْدِ اللَّهِ بْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أُمِرْتُ أَنْ أَسْجُدَ عَلَى سَبْعٍ وَلاَ أَكْفِتَ الشَّعْرَ وَلاَ الثِّيَابَ الْجَبْهَةِ وَالأَنْفِ وَالْيَدَيْنِ وَالرُّكْبَتَيْنِ وَالْقَدَمَيْنِ \" ."
  },
  "491": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 491\nIn-book reference  : Book 4, Hadith 262\nUSC-MSA web (English) reference  : Book 4, Hadith 995\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنِ ابْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِذَا سَجَدَ الْعَبْدُ سَجَدَ مَعَهُ سَبْعَةُ أَطْرَافٍ وَجْهُهُ وَكَفَّاهُ وَرُكْبَتَاهُ وَقَدَمَاهُ \" ."
  },
  "492": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 492\nIn-book reference  : Book 4, Hadith 263\nUSC-MSA web (English) reference  : Book 4, Hadith 996\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ الْعَامِرِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ بُكَيْرًا، حَدَّثَهُ أَنَّ كُرَيْبًا مَوْلَى ابْنِ عَبَّاسٍ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ رَأَى عَبْدَ اللَّهِ بْنَ الْحَارِثِ يُصَلِّي وَرَأْسُهُ مَعْقُوصٌ مِنْ وَرَائِهِ فَقَامَ فَجَعَلَ يَحُلُّهُ فَلَمَّا انْصَرَفَ أَقْبَلَ إِلَى ابْنِ عَبَّاسٍ فَقَالَ مَا لَكَ وَرَأْسِي فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّمَا مَثَلُ هَذَا مَثَلُ الَّذِي يُصَلِّي وَهُوَ مَكْتُوفٌ \" ."
  },
  "493": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 493b\nIn-book reference  : Book 4, Hadith 265\nUSC-MSA web (English) reference  : Book 4, Hadith 998\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح قَالَ وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - قَالاَ حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ ابْنِ جَعْفَرٍ \" وَلاَ يَتَبَسَّطْ أَحَدُكُمْ ذِرَاعَيْهِ انْبِسَاطَ الْكَلْبِ \" ."
  },
  "494": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 494\nIn-book reference  : Book 4, Hadith 266\nUSC-MSA web (English) reference  : Book 4, Hadith 999\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ إِيَادٍ، عَنْ إِيَادٍ، عَنِ الْبَرَاءِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا سَجَدْتَ فَضَعْ كَفَّيْكَ وَارْفَعْ مِرْفَقَيْكَ \" ."
  },
  "495": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 495b\nIn-book reference  : Book 4, Hadith 268\nUSC-MSA web (English) reference  : Book 4, Hadith 1001\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، وَاللَّيْثُ بْنُ سَعْدٍ، كِلاَهُمَا عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، بِهَذَا الإِسْنَادِ . وَفِي رِوَايَةِ عَمْرِو بْنِ الْحَارِثِ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَجَدَ يُجَنِّحُ فِي سُجُودِهِ حَتَّى يُرَى وَضَحُ إِبْطَيْهِ . وَفِي رِوَايَةِ اللَّيْثِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا سَجَدَ فَرَّجَ يَدَيْهِ عَنْ إِبْطَيْهِ حَتَّى إِنِّي لأَرَى بَيَاضَ إِبْطَيْهِ ."
  },
  "496": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 496\nIn-book reference  : Book 4, Hadith 269\nUSC-MSA web (English) reference  : Book 4, Hadith 1002\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ سُفْيَانَ، - قَالَ يَحْيَى أَخْبَرَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، - عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، عَنْ عَمِّهِ، يَزِيدَ بْنِ الأَصَمِّ عَنْ مَيْمُونَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا سَجَدَ لَوْ شَاءَتْ بَهْمَةٌ أَنْ تَمُرَّ بَيْنَ يَدَيْهِ لَمَرَّتْ ."
  },
  "497": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 497b\nIn-book reference  : Book 4, Hadith 271\nUSC-MSA web (English) reference  : Book 4, Hadith 1004\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِعَمْرٍو - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، عَنْ مَيْمُونَةَ بِنْتِ الْحَارِثِ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا سَجَدَ جَافَى حَتَّى يَرَى مَنْ خَلْفَهُ وَضَحَ إِبْطَيْهِ . قَالَ وَكِيعٌ يَعْنِي بَيَاضَهُمَا ."
  },
  "498": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 498\nIn-book reference  : Book 4, Hadith 272\nUSC-MSA web (English) reference  : Book 4, Hadith 1005\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ، - يَعْنِي الأَحْمَرَ - عَنْ حُسَيْنٍ الْمُعَلِّمِ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لَهُ - قَالَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنْ بُدَيْلِ بْنِ مَيْسَرَةَ، عَنْ أَبِي الْجَوْزَاءِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَسْتَفْتِحُ الصَّلاَةَ بِالتَّكْبِيرِ وَالْقِرَاءَةَ بِـ { الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ} وَكَانَ إِذَا رَكَعَ لَمْ يُشْخِصْ رَأْسَهُ وَلَمْ يُصَوِّبْهُ وَلِكَنْ بَيْنَ ذَلِكَ وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ قَائِمًا وَكَانَ إِذَا رَفَعَ رَأْسَهُ مِنَ السَّجْدَةِ لَمْ يَسْجُدْ حَتَّى يَسْتَوِيَ جَالِسًا وَكَانَ يَقُولُ فِي كُلِّ رَكْعَتَيْنِ التَّحِيَّةَ وَكَانَ يَفْرِشُ رِجْلَهُ الْيُسْرَى وَيَنْصِبُ رِجْلَهُ الْيُمْنَى وَكَانَ يَنْهَى عَنْ عُقْبَةِ الشَّيْطَانِ وَيَنْهَى أَنْ يَفْتَرِشَ الرَّجُلُ ذِرَاعَيْهِ افْتِرَاشَ السَّبُعِ وَكَانَ يَخْتِمُ الصَّلاَةَ بِالتَّسْلِيمِ . وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ عَنْ أَبِي خَالِدٍ وَكَانَ يَنْهَى عَنْ عَقِبِ الشَّيْطَانِ ."
  },
  "499": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 499b\nIn-book reference  : Book 4, Hadith 274\nUSC-MSA web (English) reference  : Book 4, Hadith 1007\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ ابْنُ نُمَيْرٍ، حَدَّثَنَا عُمَرُ بْنُ عُبَيْدٍ الطَّنَافِسِيُّ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِيهِ، قَالَ كُنَّا نُصَلِّي وَالدَّوَابُّ تَمُرُّ بَيْنَ أَيْدِينَا فَذَكَرْنَا ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" مِثْلُ مُؤْخِرَةِ الرَّحْلِ تَكُونُ بَيْنَ يَدَىْ أَحَدِكُمْ ثُمَّ لاَ يَضُرُّهُ مَا مَرَّ بَيْنَ يَدَيْهِ \" . وَقَالَ ابْنُ نُمَيْرٍ \" فَلاَ يَضُرُّهُ مَنْ مَرَّ بَيْنَ يَدَيْهِ \" ."
  },
  "500": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 500b\nIn-book reference  : Book 4, Hadith 276\nUSC-MSA web (English) reference  : Book 4, Hadith 1009\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، أَخْبَرَنَا حَيْوَةُ، عَنْ أَبِي الأَسْوَدِ، مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ فِي غَزْوَةِ تَبُوكَ عَنْ سُتْرَةِ الْمُصَلِّي فَقَالَ \" كَمُؤْخِرَةِ الرَّحْلِ \" ."
  },
  "501": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 501b\nIn-book reference  : Book 4, Hadith 278\nUSC-MSA web (English) reference  : Book 4, Hadith 1011\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَرْكُزُ - وَقَالَ أَبُو بَكْرٍ يَغْرِزُ - الْعَنَزَةَ وَيُصَلِّي إِلَيْهَا . زَادَ ابْنُ أَبِي شَيْبَةَ قَالَ عُبَيْدُ اللَّهِ وَهْىَ الْحَرْبَةُ ."
  },
  "502": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 502b\nIn-book reference  : Book 4, Hadith 280\nUSC-MSA web (English) reference  : Book 4, Hadith 1013\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُصَلِّي إِلَى رَاحِلَتِهِ . وَقَالَ ابْنُ نُمَيْرٍ إِنَّ النَّبِيَّ صلى الله عليه وسلم صَلَّى إِلَى بَعِيرٍ ."
  },
  "503": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 503e\nIn-book reference  : Book 4, Hadith 285\nUSC-MSA web (English) reference  : Book 4, Hadith 1018\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، قَالاَ حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا شُعْبَةُ، بِالإِسْنَادَيْنِ جَمِيعًا مِثْلَهُ . وَزَادَ فِي حَدِيثِ الْحَكَمِ فَجَعَلَ النَّاسُ يَأْخُذُونَ مِنْ فَضْلِ وَضُوئِهِ ."
  },
  "504": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 504d\nIn-book reference  : Book 4, Hadith 289\nUSC-MSA web (English) reference  : Book 4, Hadith 1022\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . وَلَمْ يَذْكُرْ فِيهِ مِنًى وَلاَ عَرَفَةَ وَقَالَ فِي حَجَّةِ الْوَدَاعِ أَوْ يَوْمَ الْفَتْحِ ."
  },
  "505": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 505b\nIn-book reference  : Book 4, Hadith 291\nUSC-MSA web (English) reference  : Book 4, Hadith 1024\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا ابْنُ هِلاَلٍ، - يَعْنِي حُمَيْدًا - قَالَ بَيْنَمَا أَنَا وَصَاحِبٌ، لِي نَتَذَاكَرُ حَدِيثًا إِذْ قَالَ أَبُو صَالِحٍ السَّمَّانُ أَنَا أُحَدِّثُكَ، مَا سَمِعْتُ مِنْ أَبِي سَعِيدٍ، وَرَأَيْتُ، مِنْهُ قَالَ بَيْنَمَا أَنَا مَعَ أَبِي سَعِيدٍ، يُصَلِّي يَوْمَ الْجُمُعَةِ إِلَى شَىْءٍ يَسْتُرُهُ مِنَ النَّاسِ إِذْ جَاءَ رَجُلٌ شَابٌّ مِنْ بَنِي أَبِي مُعَيْطٍ أَرَادَ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ فَدَفَعَ فِي نَحْرِهِ فَنَظَرَ فَلَمْ يَجِدْ مَسَاغًا إِلاَّ بَيْنَ يَدَىْ أَبِي سَعِيدٍ فَعَادَ فَدَفَعَ فِي نَحْرِهِ أَشَدَّ مِنَ الدَّفْعَةِ الأُولَى فَمَثَلَ قَائِمًا فَنَالَ مِنْ أَبِي سَعِيدٍ ثُمَّ زَاحَمَ النَّاسَ فَخَرَجَ فَدَخَلَ عَلَى مَرْوَانَ فَشَكَا إِلَيْهِ مَا لَقِيَ - قَالَ - وَدَخَلَ أَبُو سَعِيدٍ عَلَى مَرْوَانَ فَقَالَ لَهُ مَرْوَانُ مَا لَكَ وَلاِبْنِ أَخِيكَ جَاءَ يَشْكُوكَ . فَقَالَ أَبُو سَعِيدٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِذَا صَلَّى أَحَدُكُمْ إِلَى شَىْءٍ يَسْتُرُهُ مِنَ النَّاسِ فَأَرَادَ أَحَدٌ أَنْ يَجْتَازَ بَيْنَ يَدَيْهِ فَلْيَدْفَعْ فِي نَحْرِهِ فَإِنْ أَبَى فَلْيُقَاتِلْهُ فَإِنَّمَا هُوَ شَيْطَانٌ \" ."
  },
  "506": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 506b\nIn-book reference  : Book 4, Hadith 293\nUSC-MSA web (English) reference  : Book 4, Hadith 1026\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ عُثْمَانَ، حَدَّثَنَا صَدَقَةُ بْنُ يَسَارٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ . بِمِثْلِهِ ."
  },
  "507": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 507b\nIn-book reference  : Book 4, Hadith 295\nUSC-MSA web (English) reference  : Book 4, Hadith 1028\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ هَاشِمِ بْنِ حَيَّانَ الْعَبْدِيُّ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، أَنَّ زَيْدَ بْنَ خَالِدٍ الْجُهَنِيَّ، أَرْسَلَ إِلَى أَبِي جُهَيْمٍ الأَنْصَارِيِّ مَا سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ فَذَكَرَ بِمَعْنَى حَدِيثِ مَالِكٍ ."
  },
  "508": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 508\nIn-book reference  : Book 4, Hadith 296\nUSC-MSA web (English) reference  : Book 4, Hadith 1029\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، حَدَّثَنِي أَبِي، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، قَالَ كَانَ بَيْنَ مُصَلَّى رَسُولِ اللَّهِ صلى الله عليه وسلم وَبَيْنَ الْجِدَارِ مَمَرُّ الشَّاةِ ."
  },
  "509": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 509b\nIn-book reference  : Book 4, Hadith 298\nUSC-MSA web (English) reference  : Book 4, Hadith 1031\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مَكِّيٌّ، قَالَ يَزِيدُ أَخْبَرَنَا قَالَ كَانَ سَلَمَةُ يَتَحَرَّى الصَّلاَةَ عِنْدَ الأُسْطُوَانَةِ الَّتِي عِنْدَ الْمُصْحَفِ فَقُلْتُ لَهُ يَا أَبَا مُسْلِمٍ أَرَاكَ تَتَحَرَّى الصَّلاَةَ عِنْدَ هَذِهِ الأُسْطُوَانَةِ . قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم يَتَحَرَّى الصَّلاَةَ عِنْدَهَا ."
  },
  "510": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 510b\nIn-book reference  : Book 4, Hadith 300\nUSC-MSA web (English) reference  : Book 4, Hadith 1033\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح قَالَ وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي ح، قَالَ وَحَدَّثَنَا إِسْحَاقُ، أَيْضًا أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ سَلْمَ بْنَ أَبِي الذَّيَّالِ، ح قَالَ وَحَدَّثَنِي يُوسُفُ بْنُ حَمَّادٍ الْمَعْنِيُّ، حَدَّثَنَا زِيَادٌ الْبَكَّائِيُّ، عَنْ عَاصِمٍ الأَحْوَلِ، كُلُّ هَؤُلاَءِ عَنْ حُمَيْدِ بْنِ هِلاَلٍ، بِإِسْنَادِ يُونُسَ كَنَحْوِ حَدِيثِهِ ."
  },
  "511": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 511\nIn-book reference  : Book 4, Hadith 301\nUSC-MSA web (English) reference  : Book 4, Hadith 1034\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، - وَهُوَ ابْنُ زِيَادٍ - حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ الأَصَمِّ، حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَقْطَعُ الصَّلاَةَ الْمَرْأَةُ وَالْحِمَارُ وَالْكَلْبُ وَيَقِي ذَلِكَ مِثْلُ مُؤْخِرَةِ الرَّحْلِ \" ."
  },
  "512": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 512f\nIn-book reference  : Book 4, Hadith 307\nUSC-MSA web (English) reference  : Book 4, Hadith 1040\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ أَبِي النَّضْرِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَنَامُ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَرِجْلاَىَ فِي قِبْلَتِهِ فَإِذَا سَجَدَ غَمَزَنِي فَقَبَضْتُ رِجْلَىَّ وَإِذَا قَامَ بَسَطْتُهُمَا - قَالَتْ - وَالْبُيُوتُ يَوْمَئِذٍ لَيْسَ فِيهَا مَصَابِيحُ ."
  },
  "513": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 513\nIn-book reference  : Book 4, Hadith 308\nUSC-MSA web (English) reference  : Book 4, Hadith 1041\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، ح قَالَ وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبَّادُ بْنُ الْعَوَّامِ، جَمِيعًا عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادِ بْنِ الْهَادِ، قَالَ حَدَّثَتْنِي مَيْمُونَةُ، زَوْجُ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي وَأَنَا حِذَاءَهُ وَأَنَا حَائِضٌ وَرُبَّمَا أَصَابَنِي ثَوْبُهُ إِذَا سَجَدَ ."
  },
  "514": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 514\nIn-book reference  : Book 4, Hadith 309\nUSC-MSA web (English) reference  : Book 4, Hadith 1042\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ زُهَيْرٌ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، قَالَ سَمِعْتُهُ عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ وَأَنَا إِلَى جَنْبِهِ وَأَنَا حَائِضٌ وَعَلَىَّ مِرْطٌ وَعَلَيْهِ بَعْضُهُ إِلَى جَنْبِهِ ."
  },
  "515": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 515c\nIn-book reference  : Book 4, Hadith 312\nUSC-MSA web (English) reference  : Book 4, Hadith 1045\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ عَمْرٌو حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَادَى رَجُلٌ النَّبِيَّ صلى الله عليه وسلم فَقَالَ أَيُصَلِّي أَحَدُنَا فِي ثَوْبٍ وَاحِدٍ فَقَالَ \" أَوَكُلُّكُمْ يَجِدُ ثَوْبَيْنِ \" ."
  },
  "516": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 516\nIn-book reference  : Book 4, Hadith 313\nUSC-MSA web (English) reference  : Book 4, Hadith 1046\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، قَالَ زُهَيْرٌ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يُصَلِّي أَحَدُكُمْ فِي الثَّوْبِ الْوَاحِدِ لَيْسَ عَلَى عَاتِقَيْهِ مِنْهُ شَىْءٌ \" ."
  },
  "517": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 517d\nIn-book reference  : Book 4, Hadith 317\nUSC-MSA web (English) reference  : Book 4, Hadith 1050\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَعِيسَى بْنُ حَمَّادٍ، قَالاَ حَدَّثَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي أُمَامَةَ بْنِ سَهْلِ بْنِ حُنَيْفٍ، عَنْ عُمَرَ بْنِ أَبِي سَلَمَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِي ثَوْبٍ وَاحِدٍ مُلْتَحِفًا مُخَالِفًا بَيْنَ طَرَفَيْهِ . زَادَ عِيسَى بْنُ حَمَّادٍ فِي رِوَايَتِهِ قَالَ عَلَى مَنْكِبَيْهِ ."
  },
  "518": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 518c\nIn-book reference  : Book 4, Hadith 320\nUSC-MSA web (English) reference  : Book 4, Hadith 1053\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، أَنَّ أَبَا الزُّبَيْرِ الْمَكِّيَّ، حَدَّثَهُ أَنَّهُ، رَأَى جَابِرَ بْنَ عَبْدِ اللَّهِ يُصَلِّي فِي ثَوْبٍ مُتَوَشِّحًا بِهِ وَعِنْدَهُ ثِيَابُهُ . وَقَالَ جَابِرٌ إِنَّهُ رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ذَلِكَ ."
  },
  "519": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayers",
    "book_num": "4",
    "reference": "Reference  : Sahih Muslim 519b\nIn-book reference  : Book 4, Hadith 322\nUSC-MSA web (English) reference  : Book 4, Hadith 1055\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/4",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح قَالَ وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . وَفِي رِوَايَةِ أَبِي كُرَيْبٍ وَاضِعًا طَرَفَيْهِ عَلَى عَاتِقَيْهِ . وَرِوَايَةُ أَبِي بَكْرٍ وَسُوَيْدٍ مُتَوَشِّحًا بِهِ ."
  }
}