{
  "2160": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2160\nIn-book reference  : Book 39, Hadith 1\nUSC-MSA web (English) reference  : Book 26, Hadith 5374\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ، مَرْزُوقٍ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي زِيَادٌ، أَنَّ ثَابِتًا، مَوْلَى عَبْدِ الرَّحْمَنِ بْنِ زَيْدٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يُسَلِّمُ الرَّاكِبُ عَلَى الْمَاشِي وَالْمَاشِي عَلَى الْقَاعِدِ وَالْقَلِيلُ عَلَى الْكَثِيرِ \" ."
  },
  "2161": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2161\nIn-book reference  : Book 39, Hadith 2\nUSC-MSA web (English) reference  : Book 26, Hadith 5375\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا عُثْمَانُ بْنُ حَكِيمٍ، عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَبِيهِ، قَالَ قَالَ أَبُو طَلْحَةَ كُنَّا قُعُودًا بِالأَفْنِيَةِ نَتَحَدَّثُ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَامَ عَلَيْنَا فَقَالَ \" مَا لَكُمْ وَلِمَجَالِسِ الصُّعُدَاتِ اجْتَنِبُوا مَجَالِسَ الصُّعُدَاتِ \" . فَقُلْنَا إِنَّمَا قَعَدْنَا لِغَيْرِ مَا بَاسٍ قَعَدْنَا نَتَذَاكَرُ وَنَتَحَدَّثُ . قَالَ \" إِمَّا لاَ فَأَدُّوا حَقَّهَا غَضُّ الْبَصَرِ وَرَدُّ السَّلاَمِ وَحُسْنُ الْكَلاَمِ \" ."
  },
  "2121": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2121d\nIn-book reference  : Book 39, Hadith 4\nUSC-MSA web (English) reference  : Book 26, Hadith 5377\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ الْمَدَنِيُّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ، رَافِعٍ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنْ هِشَامٍ، - يَعْنِي ابْنَ سَعْدٍ - كِلاَهُمَا عَنْ زَيْدِ بْنِ أَسْلَمَ، بِهَذَا الإِسْنَادِ ."
  },
  "2162": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2162b\nIn-book reference  : Book 39, Hadith 6\nUSC-MSA web (English) reference  : Book 26, Hadith 5379\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" حَقُّ الْمُسْلِمِ عَلَى الْمُسْلِمِ سِتٌّ \" . قِيلَ مَا هُنَّ يَا رَسُولَ اللَّهِ قَالَ \" إِذَا لَقِيتَهُ فَسَلِّمْ عَلَيْهِ وَإِذَا دَعَاكَ فَأَجِبْهُ وَإِذَا اسْتَنْصَحَكَ فَانْصَحْ لَهُ وَإِذَا عَطَسَ فَحَمِدَ اللَّهَ فَسَمِّتْهُ وَإِذَا مَرِضَ فَعُدْهُ وَإِذَا مَاتَ فَاتَّبِعْهُ \" ."
  },
  "2163": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2163b\nIn-book reference  : Book 39, Hadith 8\nUSC-MSA web (English) reference  : Book 26, Hadith 5381\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - قَالاَ حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لَهُمَا - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسٍ، أَنَّعليه وسلم قَالُوا لِلنَّبِيِّ صلى الله عليه وسلم إِنَّ أَهْلَ الْكِتَابِ يُسَلِّمُونَ عَلَيْنَا فَكَيْفَ نَرُدُّ عَلَيْهِمْ قَالَ \" قُولُوا وَعَلَيْكُمْ \" ."
  },
  "2164": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2164b\nIn-book reference  : Book 39, Hadith 10\nUSC-MSA web (English) reference  : Book 26, Hadith 5383\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ \" فَقُولُوا وَعَلَيْكَ \" ."
  },
  "2165": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2165d\nIn-book reference  : Book 39, Hadith 14\nUSC-MSA web (English) reference  : Book 26, Hadith 5387\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا يَعْلَى بْنُ عُبَيْدٍ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَفَطِنَتْ بِهِمْ عَائِشَةُ فَسَبَّتْهُمْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَهْ يَا عَائِشَةُ فَإِنَّ اللَّهَ لاَ يُحِبُّ الْفُحْشَ وَالتَّفَحُّشَ \" . وَزَادَ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { وَإِذَا جَاءُوكَ حَيَّوْكَ بِمَا لَمْ يُحَيِّكَ بِهِ اللَّهُ} إِلَى آخِرِ الآيَةِ ."
  },
  "2166": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2166\nIn-book reference  : Book 39, Hadith 15\nUSC-MSA web (English) reference  : Book 26, Hadith 5388\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَلَّمَ نَاسٌ مِنْ يَهُودَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا السَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ . فَقَالَ \" وَعَلَيْكُمْ \" . فَقَالَتْ عَائِشَةُ وَغَضِبَتْ أَلَمْ تَسْمَعْ مَا قَالُوا قَالَ \" بَلَى قَدْ سَمِعْتُ فَرَدَدْتُ عَلَيْهِمْ وَإِنَّا نُجَابُ عَلَيْهِمْ وَلاَ يُجَابُونَ عَلَيْنَا \" ."
  },
  "2167": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2167b\nIn-book reference  : Book 39, Hadith 17\nUSC-MSA web (English) reference  : Book 26, Hadith 5390\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ، بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ وَكِيعٍ \" إِذَا لَقِيتُمُ الْيَهُودَ \" . وَفِي حَدِيثِ ابْنِ جَعْفَرٍ عَنْ شُعْبَةَ قَالَ فِي أَهْلِ الْكِتَابِ . وَفِي حَدِيثِ جَرِيرٍ \" إِذَا لَقِيتُمُوهُمْ \" . وَلَمْ يُسَمِّ أَحَدًا مِنَ الْمُشْرِكِينَ ."
  },
  "2168": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2168c\nIn-book reference  : Book 39, Hadith 20\nUSC-MSA web (English) reference  : Book 26, Hadith 5392\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ الْوَلِيدِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَيَّارٍ، قَالَ كُنْتُ أَمْشِي مَعَ ثَابِتٍ الْبُنَانِيِّ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ . وَحَدَّثَ ثَابِتٌ أَنَّهُ كَانَ يَمْشِي مَعَ أَنَسٍ فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ . وَحَدَّثَ أَنَسٌ أَنَّهُ كَانَ يَمْشِي مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَّ بِصِبْيَانٍ فَسَلَّمَ عَلَيْهِمْ ."
  },
  "2169": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2169b\nIn-book reference  : Book 39, Hadith 22\nUSC-MSA web (English) reference  : Book 26, Hadith 5394\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2170": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2170e\nIn-book reference  : Book 39, Hadith 26\nUSC-MSA web (English) reference  : Book 26, Hadith 5398\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2171": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2171\nIn-book reference  : Book 39, Hadith 27\nUSC-MSA web (English) reference  : Book 26, Hadith 5399\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَعَلِيُّ بْنُ حُجْرٍ، قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ ابْنُ حُجْرٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَلاَ لاَ يَبِيتَنَّ رَجُلٌ عِنْدَ امْرَأَةٍ ثَيِّبٍ إِلاَّ أَنْ يَكُونَ نَاكِحًا أَوْ ذَا مَحْرَمٍ \" ."
  },
  "2172": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2172c\nIn-book reference  : Book 39, Hadith 30\nUSC-MSA web (English) reference  : Book 26, Hadith 5402\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ سَمِعْتُ اللَّيْثَ بْنَ سَعْدٍ، يَقُولُ الْحَمْوُ أَخُ الزَّوْجِ وَمَا أَشْبَهَهُ مِنْ أَقَارِبِ الزَّوْجِ ابْنُ الْعَمِّ وَنَحْوُهُ ."
  },
  "2173": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2173\nIn-book reference  : Book 39, Hadith 31\nUSC-MSA web (English) reference  : Book 26, Hadith 5403\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ أَنَّ عَبْدَ الرَّحْمَنِ بْنَ جُبَيْرٍ حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ حَدَّثَهُ أَنَّ نَفَرًا مِنْ بَنِي هَاشِمٍ دَخَلُوا عَلَى أَسْمَاءَ بِنْتِ عُمَيْسٍ فَدَخَلَ أَبُو بَكْرٍ الصِّدِّيقُ وَهِيَ تَحْتَهُ يَوْمَئِذٍ فَرَآهُمْ فَكَرِهَ ذَلِكَ فَذَكَرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقَالَ لَمْ أَرَ إِلاَّ خَيْرًا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ اللَّهَ قَدْ بَرَّأَهَا مِنْ ذَلِكَ \" . ثُمَّ قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ فَقَالَ \" لاَ يَدْخُلَنَّ رَجُلٌ بَعْدَ يَوْمِي هَذَا عَلَى مُغِيبَةٍ إِلاَّ وَمَعَهُ رَجُلٌ أَوِ اثْنَانِ \" ."
  },
  "2174": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2174\nIn-book reference  : Book 39, Hadith 32\nUSC-MSA web (English) reference  : Book 26, Hadith 5404\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ مَعَ إِحْدَى نِسَائِهِ فَمَرَّ بِهِ رَجُلٌ فَدَعَاهُ فَجَاءَ فَقَالَ \" يَا فُلاَنُ هَذِهِ زَوْجَتِي فُلاَنَةُ \" . فَقَالَ يَا رَسُولَ اللَّهِ مَنْ كُنْتُ أَظُنُّ بِهِ فَلَمْ أَكُنْ أَظُنُّ بِكَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ الشَّيْطَانَ يَجْرِي مِنَ الإِنْسَانِ مَجْرَى الدَّمِ \" ."
  },
  "2175": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2175b\nIn-book reference  : Book 39, Hadith 34\nUSC-MSA web (English) reference  : Book 26, Hadith 5405\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنَا عَلِيُّ بْنُ حُسَيْنٍ، أَنَّ صَفِيَّةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّهَا جَاءَتْ إِلَى النَّبِيِّ صلى الله عليه وسلم تَزُورُهُ فِي اعْتِكَافِهِ فِي الْمَسْجِدِ فِي الْعَشْرِ الأَوَاخِرِ مِنْ رَمَضَانَ فَتَحَدَّثَتْ عِنْدَهُ سَاعَةً ثُمَّ قَامَتْ تَنْقَلِبُ وَقَامَ النَّبِيُّ صلى الله عليه وسلم يَقْلِبُهَا . ثُمَّ ذَكَرَ بِمَعْنَى حَدِيثِ مَعْمَرٍ غَيْرَ أَنَّهُ قَالَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" إِنَّ الشَّيْطَانَ يَبْلُغُ مِنَ الإِنْسَانِ مَبْلَغَ الدَّمِ \" . وَلَمْ يَقُلْ \" يَجْرِي \" ."
  },
  "2176": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2176b\nIn-book reference  : Book 39, Hadith 36\nUSC-MSA web (English) reference  : Book 26, Hadith 5407\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ الْمُنْذِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ - ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا حَبَّانُ، حَدَّثَنَا أَبَانٌ، قَالاَ جَمِيعًا حَدَّثَنَا يَحْيَى بْنُ، أَبِي كَثِيرٍ أَنَّ إِسْحَاقَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، حَدَّثَهُ فِي، هَذَا الإِسْنَادِ بِمِثْلِهِ فِي الْمَعْنَى ."
  },
  "2177": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2177e\nIn-book reference  : Book 39, Hadith 41\nUSC-MSA web (English) reference  : Book 26, Hadith 5412\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2178": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2178\nIn-book reference  : Book 39, Hadith 42\nUSC-MSA web (English) reference  : Book 26, Hadith 5413\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ يُقِيمَنَّ أَحَدُكُمْ أَخَاهُ يَوْمَ الْجُمُعَةِ ثُمَّ لْيُخَالِفْ إِلَى مَقْعَدِهِ فَيَقْعُدَ فِيهِ وَلَكِنْ يَقُولُ افْسَحُوا \" ."
  },
  "2179": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2179\nIn-book reference  : Book 39, Hadith 43\nUSC-MSA web (English) reference  : Book 26, Hadith 5414\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، أَخْبَرَنَا أَبُو عَوَانَةَ، وَقَالَ، قُتَيْبَةُ أَيْضًا حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - كِلاَهُمَا عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا قَامَ أَحَدُكُمْ \" . وَفِي حَدِيثِ أَبِي عَوَانَةَ \" مَنْ قَامَ مِنْ مَجْلِسِهِ ثُمَّ رَجَعَ إِلَيْهِ فَهُوَ أَحَقُّ بِهِ \" ."
  },
  "2180": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2180\nIn-book reference  : Book 39, Hadith 44\nUSC-MSA web (English) reference  : Book 26, Hadith 5415\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ، بْنُ إِبْرَاهِيمَ أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ هِشَامٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَيْضًا - وَاللَّفْظُ هَذَا - حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ زَيْنَبَ، بِنْتِ أُمِّ سَلَمَةَ عَنْ أُمِّ سَلَمَةَ، أَنَّ مُخَنَّثًا، كَانَ عِنْدَهَا وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْبَيْتِ فَقَالَ لأَخِي أُمِّ سَلَمَةَ يَا عَبْدَ اللَّهِ بْنَ أَبِي أُمَيَّةَ إِنْ فَتَحَ اللَّهُ عَلَيْكُمُ الطَّائِفَ غَدًا فَإِنِّي أَدُلُّكَ عَلَى بِنْتِ غَيْلاَنَ فَإِنَّهَا تُقْبِلُ بِأَرْبَعٍ وَتُدْبِرُ بِثَمَانٍ . قَالَ فَسَمِعَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" لاَ يَدْخُلْ هَؤُلاَءِ عَلَيْكُمْ \" ."
  },
  "2181": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2181\nIn-book reference  : Book 39, Hadith 45\nUSC-MSA web (English) reference  : Book 26, Hadith 5416\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ يَدْخُلُ عَلَى أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم مُخَنَّثٌ فَكَانُوا يَعُدُّونَهُ مِنْ غَيْرِ أُولِي الإِرْبَةِ - قَالَ - فَدَخَلَ النَّبِيُّ صلى الله عليه وسلم يَوْمًا وَهُوَ عِنْدَ بَعْضِ نِسَائِهِ وَهُوَ يَنْعَتُ امْرَأَةً قَالَ إِذَا أَقْبَلَتْ أَقْبَلَتْ بِأَرْبَعٍ وَإِذَا أَدْبَرَتْ أَدْبَرَتْ بِثَمَانٍ . فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَلاَ أَرَى هَذَا يَعْرِفُ مَا هَا هُنَا لاَ يَدْخُلَنَّ عَلَيْكُنَّ \" . قَالَتْ فَحَجَبُوهُ ."
  },
  "2182": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2182b\nIn-book reference  : Book 39, Hadith 47\nUSC-MSA web (English) reference  : Book 26, Hadith 5418\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ الْغُبَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، أَنَّ أَسْمَاءَ، قَالَتْ كُنْتُ أَخْدُمُ الزُّبَيْرَ خِدْمَةَ الْبَيْتِ وَكَانَ لَهُ فَرَسٌ وَكُنْتُ أَسُوسُهُ فَلَمْ يَكُنْ مِنَ الْخِدْمَةِ شَىْءٌ أَشَدَّ عَلَىَّ مِنْ سِيَاسَةِ الْفَرَسِ كُنْتُ أَحْتَشُّ لَهُ وَأَقُومُ عَلَيْهِ وَأَسُوسُهُ . قَالَ ثُمَّ إِنَّهَا أَصَابَتْ خَادِمًا جَاءَ النَّبِيَّ صلى الله عليه وسلم سَبْىٌ فَأَعْطَاهَا خَادِمًا . قَالَتْ كَفَتْنِي سِيَاسَةَ الْفَرَسِ فَأَلْقَتْ عَنِّي مَئُونَتَهُ فَجَاءَنِي رَجُلٌ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ . قَالَتْ إِنِّي إِنْ رَخَّصْتُ لَكَ أَبَى ذَاكَ الزُّبَيْرُ فَتَعَالَ فَاطْلُبْ إِلَىَّ وَالزُّبَيْرُ شَاهِدٌ فَجَاءَ فَقَالَ يَا أُمَّ عَبْدِ اللَّهِ إِنِّي رَجُلٌ فَقِيرٌ أَرَدْتُ أَنْ أَبِيعَ فِي ظِلِّ دَارِكِ . فَقَالَتْ مَا لَكَ بِالْمَدِينَةِ إِلاَّ دَارِي فَقَالَ لَهَا الزُّبَيْرُ مَا لَكِ أَنْ تَمْنَعِي رَجُلاً فَقِيرًا يَبِيعُ فَكَانَ يَبِيعُ إِلَى أَنْ كَسَبَ فَبِعْتُهُ الْجَارِيَةَ فَدَخَلَ عَلَىَّ الزُّبَيْرُ وَثَمَنُهَا فِي حَجْرِي . فَقَالَ هَبِيهَا لِي . قَالَتْ إِنِّي قَدْ تَصَدَّقْتُ بِهَا ."
  },
  "2183": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2183b\nIn-book reference  : Book 39, Hadith 49\nUSC-MSA web (English) reference  : Book 26, Hadith 5420\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، وَابْنُ، نُمَيْرٍ ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالاَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ أَيُّوبَ بْنَ مُوسَى، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ مَالِكٍ ."
  },
  "2184": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2184c\nIn-book reference  : Book 39, Hadith 52\nUSC-MSA web (English) reference  : Book 26, Hadith 5423\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ."
  },
  "2185": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2185\nIn-book reference  : Book 39, Hadith 53\nUSC-MSA web (English) reference  : Book 26, Hadith 5424\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ الدَّرَاوَرْدِيُّ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ - عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا قَالَتْ كَانَ إِذَا اشْتَكَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَقَاهُ جِبْرِيلُ قَالَ بِاسْمِ اللَّهِ يُبْرِيكَ وَمِنْ كُلِّ دَاءٍ يَشْفِيكَ وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ وَشَرِّ كُلِّ ذِي عَيْنٍ ."
  },
  "2186": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2186\nIn-book reference  : Book 39, Hadith 54\nUSC-MSA web (English) reference  : Book 26, Hadith 5425\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ صُهَيْبٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، أَنَّ جِبْرِيلَ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا مُحَمَّدُ اشْتَكَيْتَ فَقَالَ \" نَعَمْ \" . قَالَ بِاسْمِ اللَّهِ أَرْقِيكَ مِنْ كُلِّ شَىْءٍ يُؤْذِيكَ مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ اللَّهُ يَشْفِيكَ بِاسْمِ اللَّهِ أَرْقِيكَ ."
  },
  "2187": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2187\nIn-book reference  : Book 39, Hadith 55\nUSC-MSA web (English) reference  : Book 26, Hadith 5426\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْعَيْنُ حَقٌّ \" ."
  },
  "2188": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2188\nIn-book reference  : Book 39, Hadith 56\nUSC-MSA web (English) reference  : Book 26, Hadith 5427\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، وَأَحْمَدُ بْنُ خِرَاشٍ، قَالَ عَبْدُ اللَّهِ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وُهَيْبٌ، عَنِ ابْنِ، طَاوُسٍ عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" الْعَيْنُ حَقٌّ وَلَوْ كَانَ شَىْءٌ سَابَقَ الْقَدَرَ سَبَقَتْهُ الْعَيْنُ وَإِذَا اسْتُغْسِلْتُمْ فَاغْسِلُوا \" ."
  },
  "2189": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2189b\nIn-book reference  : Book 39, Hadith 58\nUSC-MSA web (English) reference  : Book 26, Hadith 5429\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ سُحِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم . وَسَاقَ أَبُو كُرَيْبٍ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ ابْنِ نُمَيْرٍ وَقَالَ فِيهِ فَذَهَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْبِئْرِ فَنَظَرَ إِلَيْهَا وَعَلَيْهَا نَخْلٌ . وَقَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ فَأَخْرِجْهُ . وَلَمْ يَقُلْ أَفَلاَ أَحْرَقْتَهُ وَلَمْ يَذْكُرْ \" فَأَمَرْتُ بِهَا فَدُفِنَتْ \" ."
  },
  "2190": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2190b\nIn-book reference  : Book 39, Hadith 60\nUSC-MSA web (English) reference  : Book 26, Hadith 5431\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا شُعْبَةُ، - سَمِعْتُ هِشَامَ، بْنَ زَيْدٍ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ أَنَّ يَهُودِيَّةً، جَعَلَتْ سَمًّا فِي لَحْمٍ ثُمَّ أَتَتْ بِهِ رَسُولَ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ خَالِدٍ ."
  },
  "2191": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2191g\nIn-book reference  : Book 39, Hadith 67\nUSC-MSA web (English) reference  : Book 26, Hadith 5438\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كِلاَهُمَا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2192": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2192c\nIn-book reference  : Book 39, Hadith 70\nUSC-MSA web (English) reference  : Book 26, Hadith 5441\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا رَوْحٌ، ح وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ، وَأَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، قَالاَ حَدَّثَنَا أَبُو عَاصِمٍ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، أَخْبَرَنِي زِيَادٌ، كُلُّهُمْ عَنِ ابْنِ شِهَابٍ، بِإِسْنَادِ مَالِكٍ . نَحْوَ حَدِيثِهِ . وَلَيْسَ فِي حَدِيثِ أَحَدٍ مِنْهُمْ رَجَاءَ بَرَكَتِهَا . إِلاَّ فِي حَدِيثِ مَالِكٍ وَفِي حَدِيثِ يُونُسَ وَزِيَادٍ أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى نَفَثَ عَلَى نَفْسِهِ بَالْمُعَوِّذَاتِ وَمَسَحَ عَنْهُ بِيَدِهِ ."
  },
  "2193": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2193b\nIn-book reference  : Book 39, Hadith 72\nUSC-MSA web (English) reference  : Book 26, Hadith 5443\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَهْلِ بَيْتٍ مِنَ الأَنْصَارِ فِي الرُّقْيَةِ مِنَ الْحُمَةِ ."
  },
  "2194": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2194\nIn-book reference  : Book 39, Hadith 73\nUSC-MSA web (English) reference  : Book 26, Hadith 5444\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ إِذَا اشْتَكَى الإِنْسَانُ الشَّىْءَ مِنْهُ أَوْ كَانَتْ بِهِ قَرْحَةٌ أَوْ جَرْحٌ قَالَ النَّبِيُّ صلى الله عليه وسلم بِإِصْبَعِهِ هَكَذَا وَوَضَعَ سُفْيَانُ سَبَّابَتَهُ بِالأَرْضِ ثُمَّ رَفَعَهَا \" بِاسْمِ اللَّهِ تُرْبَةُ أَرْضِنَا بِرِيقَةِ بَعْضِنَا لِيُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا \" . قَالَ ابْنُ أَبِي شَيْبَةَ \" يُشْفَى \" . وَقَالَ زُهَيْرٌ \" لِيُشْفَى سَقِيمُنَا \" ."
  },
  "2195": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2195c\nIn-book reference  : Book 39, Hadith 76\nUSC-MSA web (English) reference  : Book 26, Hadith 5447\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ، شَدَّادٍ عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنِي أَنْ أَسْتَرْقِيَ مِنَ الْعَيْنِ ."
  },
  "2196": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2196b\nIn-book reference  : Book 39, Hadith 78\nUSC-MSA web (English) reference  : Book 26, Hadith 5449\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، ح وَحَدَّثَنِي زُهَيْرُ، بْنُ حَرْبٍ حَدَّثَنَا حُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا حَسَنٌ، - وَهُوَ ابْنُ صَالِحٍ - كِلاَهُمَا عَنْ عَاصِمٍ، عَنْ يُوسُفَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، قَالَ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الرُّقْيَةِ مِنَ الْعَيْنِ وَالْحُمَةِ وَالنَّمْلَةِ . وَفِي حَدِيثِ سُفْيَانَ يُوسُفُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَارِثِ ."
  },
  "2197": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2197\nIn-book reference  : Book 39, Hadith 79\nUSC-MSA web (English) reference  : Book 26, Hadith 5450\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي أَبُو الرَّبِيعِ، سُلَيْمَانُ بْنُ دَاوُدَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، حَدَّثَنِي مُحَمَّدُ بْنُ الْوَلِيدِ، الزُّبَيْدِيُّ عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ زَيْنَبَ بِنْتِ أُمِّ سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِجَارِيَةٍ فِي بَيْتِ أُمِّ سَلَمَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم رَأَى بِوَجْهِهَا سَفْعَةً فَقَالَ \" بِهَا نَظْرَةٌ فَاسْتَرْقُوا لَهَا \" . يَعْنِي بِوَجْهِهَا صُفْرَةً ."
  },
  "2198": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2198\nIn-book reference  : Book 39, Hadith 80\nUSC-MSA web (English) reference  : Book 26, Hadith 5451\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ وَأَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ رَخَّصَ النَّبِيُّ صلى الله عليه وسلم لآلِ حَزْمٍ فِي رُقْيَةِ الْحَيَّةِ وَقَالَ لأَسْمَاءَ بِنْتِ عُمَيْسٍ \" مَا لِي أَرَى أَجْسَامَ بَنِي أَخِي ضَارِعَةً تُصِيبُهُمُ الْحَاجَةُ \" . قَالَتْ لاَ وَلَكِنِ الْعَيْنُ تُسْرِعُ إِلَيْهِمْ . قَالَ \" ارْقِيهِمْ \" . قَالَتْ فَعَرَضْتُ عَلَيْهِ فَقَالَ \" ارْقِيهِمْ \" ."
  },
  "2199": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2199e\nIn-book reference  : Book 39, Hadith 85\nUSC-MSA web (English) reference  : Book 26, Hadith 5456\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الرُّقَى فَجَاءَ آلُ عَمْرِو بْنِ حَزْمٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّهُ كَانَتْ عِنْدَنَا رُقْيَةٌ نَرْقِي بِهَا مِنَ الْعَقْرَبِ وَإِنَّكَ نَهَيْتَ عَنِ الرُّقَى . قَالَ فَعَرَضُوهَا عَلَيْهِ . فَقَالَ \" مَا أَرَى بَأْسًا مَنِ اسْتَطَاعَ مِنْكُمْ أَنْ يَنْفَعَ أَخَاهُ فَلْيَنْفَعْهُ \" ."
  },
  "2200": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2200\nIn-book reference  : Book 39, Hadith 86\nUSC-MSA web (English) reference  : Book 26, Hadith 5457\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ جُبَيْرٍ عَنْ أَبِيهِ، عَنْ عَوْفِ بْنِ مَالِكٍ الأَشْجَعِيِّ، قَالَ كُنَّا نَرْقِي فِي الْجَاهِلِيَّةِ فَقُلْنَا يَا رَسُولَ اللَّهِ كَيْفَ تَرَى فِي ذَلِكَ فَقَالَ \" اعْرِضُوا عَلَىَّ رُقَاكُمْ لاَ بَأْسَ بِالرُّقَى مَا لَمْ يَكُنْ فِيهِ شِرْكٌ \" ."
  },
  "2201": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2201d\nIn-book reference  : Book 39, Hadith 90\nUSC-MSA web (English) reference  : Book 26, Hadith 5461\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ . نَحْوَهُ غَيْرَ أَنَّهُ قَالَ فَقَامَ مَعَهَا رَجُلٌ مِنَّا مَا كُنَّا نَأْبِنُهُ بِرُقْيَةٍ ."
  },
  "2202": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2202\nIn-book reference  : Book 39, Hadith 91\nUSC-MSA web (English) reference  : Book 26, Hadith 5462\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، أَنَّهُ شَكَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَجَعًا يَجِدُهُ فِي جَسَدِهِ مُنْذُ أَسْلَمَ . فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ضَعْ يَدَكَ عَلَى الَّذِي تَأَلَّمَ مِنْ جَسَدِكَ وَقُلْ بِاسْمِ اللَّهِ . ثَلاَثًا . وَقُلْ سَبْعَ مَرَّاتٍ أَعُوذُ بِاللَّهِ وَقُدْرَتِهِ مِنْ شَرِّ مَا أَجِدُ وَأُحَاذِرُ \" ."
  },
  "2203": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2203c\nIn-book reference  : Book 39, Hadith 94\nUSC-MSA web (English) reference  : Book 26, Hadith 5465\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ عُثْمَانَ بْنِ أَبِي الْعَاصِ الثَّقَفِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ . ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِهِمْ ."
  },
  "2204": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2204\nIn-book reference  : Book 39, Hadith 95\nUSC-MSA web (English) reference  : Book 26, Hadith 5466\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَأَبُو الطَّاهِرِ، وَأَحْمَدُ بْنُ عِيسَى، قَالُوا حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" لِكُلِّ دَاءٍ دَوَاءٌ فَإِذَا أُصِيبَ دَوَاءُ الدَّاءِ بَرَأَ بِإِذْنِ اللَّهِ عَزَّ وَجَلَّ \" ."
  },
  "2205": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2205b\nIn-book reference  : Book 39, Hadith 97\nUSC-MSA web (English) reference  : Book 26, Hadith 5468\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنِي أَبِي، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ سُلَيْمَانَ، عَنْ عَاصِمِ بْنِ عُمَرَ بْنِ قَتَادَةَ، قَالَ جَاءَنَا جَابِرُ بْنُ عَبْدِ اللَّهِ فِي أَهْلِنَا وَرَجُلٌ يَشْتَكِي خُرَاجًا بِهِ أَوْ جِرَاحًا فَقَالَ مَا تَشْتَكِي قَالَ خُرَاجٌ بِي قَدْ شَقَّ عَلَىَّ . فَقَالَ يَا غُلاَمُ ائْتِنِي بِحَجَّامٍ . فَقَالَ لَهُ مَا تَصْنَعُ بِالْحَجَّامِ يَا أَبَا عَبْدِ اللَّهِ قَالَ أُرِيدُ أَنْ أُعَلِّقَ فِيهِ مِحْجَمًا . قَالَ وَاللَّهِ إِنَّ الذُّبَابَ لَيُصِيبُنِي أَوْ يُصِيبُنِي الثَّوْبُ فَيُؤْذِينِي وَيَشُقُّ عَلَىَّ . فَلَمَّا رَأَى تَبَرُّمَهُ مِنْ ذَلِكَ قَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنْ كَانَ فِي شَىْءٍ مِنْ أَدْوِيَتِكُمْ خَيْرٌ فَفِي شَرْطَةِ مَحْجَمٍ أَوْ شَرْبَةٍ مِنْ عَسَلٍ أَوْ لَذْعَةٍ بِنَارٍ \" . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَمَا أُحِبُّ أَنْ أَكْتَوِيَ \" . قَالَ فَجَاءَ بِحَجَّامٍ فَشَرَطَهُ فَذَهَبَ عَنْهُ مَا يَجِدُ ."
  },
  "2206": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2206\nIn-book reference  : Book 39, Hadith 98\nUSC-MSA web (English) reference  : Book 26, Hadith 5469\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ أُمَّ سَلَمَةَ، اسْتَأْذَنَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي الْحِجَامَةِ فَأَمَرَ النَّبِيُّ صلى الله عليه وسلم أَبَا طَيْبَةَ أَنْ يَحْجُمَهَا . قَالَ حَسِبْتُ أَنَّهُ قَالَ كَانَ أَخَاهَا مِنَ الرَّضَاعَةِ أَوْ غُلاَمًا لَمْ يَحْتَلِمْ ."
  },
  "2207": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2207c\nIn-book reference  : Book 39, Hadith 101\nUSC-MSA web (English) reference  : Book 26, Hadith 5472\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ، قَالَ سَمِعْتُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبَا سُفْيَانَ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، قَالَ رُمِيَ أُبَىٌّ يَوْمَ الأَحْزَابِ عَلَى أَكْحَلِهِ فَكَوَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "2208": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2208\nIn-book reference  : Book 39, Hadith 102\nUSC-MSA web (English) reference  : Book 26, Hadith 5473\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ رُمِيَ سَعْدُ بْنُ مُعَاذٍ فِي أَكْحَلِهِ - قَالَ - فَحَسَمَهُ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ بِمِشْقَصٍ ثُمَّ وَرِمَتْ فَحَسَمَهُ الثَّانِيَةَ ."
  },
  "1202": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 1202d\nIn-book reference  : Book 39, Hadith 103\nUSC-MSA web (English) reference  : Book 26, Hadith 5474\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم احْتَجَمَ وَأَعْطَى الْحَجَّامَ أَجْرَهُ وَاسْتَعَطَ ."
  },
  "1577": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 1577d\nIn-book reference  : Book 39, Hadith 104\nUSC-MSA web (English) reference  : Book 26, Hadith 5475\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالَ أَبُو بَكْرٍ حَدَّثَنَا وَكِيعٌ، وَقَالَ، أَبُو كُرَيْبٍ - وَاللَّفْظُ لَهُ - أَخْبَرَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، عَنْ عَمْرِو بْنِ عَامِرٍ الأَنْصَارِيِّ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ احْتَجَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَانَ لاَ يَظْلِمُ أَحَدًا أَجْرَهُ ."
  },
  "2209": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2209d\nIn-book reference  : Book 39, Hadith 108\nUSC-MSA web (English) reference  : Book 26, Hadith 5479\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا رَوْحٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" الْحُمَّى مِنْ فَيْحِ جَهَنَّمَ فَأَطْفِئُوهَا بِالْمَاءِ \" ."
  },
  "2210": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2210b\nIn-book reference  : Book 39, Hadith 110\nUSC-MSA web (English) reference  : Book 26, Hadith 5481\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا خَالِدُ بْنُ الْحَارِثِ، وَعَبْدَةُ بْنُ سُلَيْمَانَ، جَمِيعًا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2211": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2211b\nIn-book reference  : Book 39, Hadith 112\nUSC-MSA web (English) reference  : Book 26, Hadith 5483\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِ ابْنِ نُمَيْرٍ صَبَّتِ الْمَاءَ بَيْنَهَا وَبَيْنَ جَيْبِهَا . وَلَمْ يَذْكُرْ فِي حَدِيثِ أَبِي أُسَامَةَ \" أَنَّهَا مِنْ فَيْحِ جَهَنَّمَ \" . قَالَ أَبُو أَحْمَدَ قَالَ إِبْرَاهِيمُ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرٍ حَدَّثَنَا أَبُو أُسَامَةَ بِهَذَا الإِسْنَادِ ."
  },
  "2212": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2212b\nIn-book reference  : Book 39, Hadith 114\nUSC-MSA web (English) reference  : Book 26, Hadith 5485\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ أَبِيهِ، عَنْ عَبَايَةَ بْنِ رِفَاعَةَ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الْحُمَّى مِنْ فَوْرِ جَهَنَّمَ فَابْرُدُوهَا عَنْكُمْ بِالْمَاءِ \" . وَلَمْ يَذْكُرْ أَبُو بَكْرٍ \" عَنْكُمْ \" . وَقَالَ قَالَ أَخْبَرَنِي رَافِعُ بْنُ خَدِيجٍ ."
  },
  "2213": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2213\nIn-book reference  : Book 39, Hadith 115\nUSC-MSA web (English) reference  : Book 26, Hadith 5486\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، حَدَّثَنِي مُوسَى بْنُ أَبِي، عَائِشَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ عَائِشَةَ، قَالَتْ لَدَدْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ فَأَشَارَ أَنْ لاَ تَلُدُّونِي . فَقُلْنَا كَرَاهِيَةُ الْمَرِيضِ لِلدَّوَاءِ . فَلَمَّا أَفَاقَ قَالَ \" لاَ يَبْقَى أَحَدٌ مِنْكُمْ إِلاَّ لُدَّ غَيْرُ الْعَبَّاسِ فَإِنَّهُ لَمْ يَشْهَدْكُمْ \" ."
  },
  "287": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 287d, 2214a\nIn-book reference  : Book 39, Hadith 116\nUSC-MSA web (English) reference  : Book 26, Hadith 5487\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ وَابْنُ أَبِي عُمَرَ - وَاللَّفْظُ لِزُهَيْرٍ - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ قَيْسٍ بِنْتِ مِحْصَنٍ، أُخْتِ عُكَّاشَةَ بْنِ مِحْصَنٍ قَالَتْ دَخَلْتُ بِابْنٍ لِي عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَمْ يَأْكُلِ الطَّعَامَ فَبَالَ عَلَيْهِ فَدَعَا بِمَاءٍ فَرَشَّهُ .\nقَالَتْ وَدَخَلْتُ عَلَيْهِ بِابْنٍ لِي قَدْ أَعْلَقْتُ عَلَيْهِ مِنَ الْعُذْرَةِ فَقَالَ \" عَلاَمَهْ تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الْعِلاَقِ عَلَيْكُنَّ بِهَذَا الْعُودِ الْهِنْدِيِّ فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ يُسْعَطُ مِنَ الْعُذْرَةِ وَيُلَدُّ مِنْ ذَاتِ الْجَنْبِ \" ."
  },
  "2214": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2214b, 287e\nIn-book reference  : Book 39, Hadith 117\nUSC-MSA web (English) reference  : Book 26, Hadith 5488\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أُمَّ قَيْسٍ بِنْتَ مِحْصَنٍ، - وَكَانَتْ مِنَ الْمُهَاجِرَاتِ الأُوَلِ اللاَّتِي بَايَعْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهِيَ أُخْتُ عُكَّاشَةَ بْنِ مِحْصَنٍ أَحَدِ بَنِي أَسَدِ بْنِ خُزَيْمَةَ - قَالَ أَخْبَرَتْنِي أَنَّهَا أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم بِابْنٍ لَهَا لَمْ يَبْلُغْ أَنْ يَأْكُلَ الطَّعَامَ وَقَدْ أَعْلَقَتْ عَلَيْهِ مِنَ الْعُذْرَةِ - قَالَ يُونُسُ أَعْلَقَتْ غَمَزَتْ فَهِيَ تَخَافُ أَنْ يَكُونَ بِهِ عُذْرَةٌ - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" عَلاَمَهْ تَدْغَرْنَ أَوْلاَدَكُنَّ بِهَذَا الإِعْلاَقِ عَلَيْكُمْ بِهَذَا الْعُودِ الْهِنْدِيِّ - يَعْنِي بِهِ الْكُسْتَ - فَإِنَّ فِيهِ سَبْعَةَ أَشْفِيَةٍ مِنْهَا ذَاتُ الْجَنْبِ \" .\nقَالَ عُبَيْدُ اللَّهِ وَأَخْبَرَتْنِي أَنَّ ابْنَهَا ذَاكَ بَالَ فِي حَجْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَاءٍ فَنَضَحَهُ عَلَى بَوْلِهِ وَلَمْ يَغْسِلْهُ غَسْلاً ."
  },
  "2215": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2215c\nIn-book reference  : Book 39, Hadith 120\nUSC-MSA web (English) reference  : Book 26, Hadith 5490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَا مِنْ دَاءٍ إِلاَّ فِي الْحَبَّةِ السَّوْدَاءِ مِنْهُ شِفَاءٌ إِلاَّ السَّامَ \" ."
  },
  "2216": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2216\nIn-book reference  : Book 39, Hadith 121\nUSC-MSA web (English) reference  : Book 26, Hadith 5491\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّهَا كَانَتْ إِذَا مَاتَ الْمَيِّتُ مِنْ أَهْلِهَا فَاجْتَمَعَ لِذَلِكَ النِّسَاءُ ثُمَّ تَفَرَّقْنَ إِلاَّ أَهْلَهَا وَخَاصَّتَهَا - أَمَرَتْ بِبُرْمَةٍ مِنْ تَلْبِينَةٍ فَطُبِخَتْ ثُمَّ صُنِعَ ثَرِيدٌ فَصُبَّتِ التَّلْبِينَةُ عَلَيْهَا ثُمَّ قَالَتْ كُلْنَ مِنْهَا فَإِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" التَّلْبِينَةُ مَجَمَّةٌ لِفُؤَادِ الْمَرِيضِ تُذْهِبُ بَعْضَ الْحُزْنِ \" ."
  },
  "2217": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2217b\nIn-book reference  : Book 39, Hadith 123\nUSC-MSA web (English) reference  : Book 26, Hadith 5492\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِيهِ عَمْرُو بْنُ زُرَارَةَ، أَخْبَرَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي ابْنَ عَطَاءٍ - عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَبِي الْمُتَوَكِّلِ النَّاجِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ إِنَّ أَخِي عَرِبَ بَطْنُهُ . فَقَالَ لَهُ \" اسْقِهِ عَسَلاً \" . بِمَعْنَى حَدِيثِ شُعْبَةَ ."
  },
  "2218": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2218l\nIn-book reference  : Book 39, Hadith 135\nUSC-MSA web (English) reference  : Book 26, Hadith 5503\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِيهِ وَهْبُ بْنُ بَقِيَّةَ، أَخْبَرَنَا خَالِدٌ، - يَعْنِي الطَّحَّانَ - عَنِ الشَّيْبَانِيِّ، عَنْ حَبِيبِ، بْنِ أَبِي ثَابِتٍ عَنْ إِبْرَاهِيمَ بْنِ سَعْدِ بْنِ مَالِكٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِنَحْوِ حَدِيثِهِمْ ."
  },
  "2219": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2219d\nIn-book reference  : Book 39, Hadith 139\nUSC-MSA web (English) reference  : Book 26, Hadith 5506\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ، عَامِرِ بْنِ رَبِيعَةَ أَنَّ عُمَرَ، خَرَجَ إِلَى الشَّامِ فَلَمَّا جَاءَ سَرْغَ بَلَغَهُ أَنَّ الْوَبَاءَ قَدْ وَقَعَ بِالشَّامِ . فَأَخْبَرَهُ عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا سَمِعْتُمْ بِهِ بِأَرْضٍ فَلاَ تَقْدَمُوا عَلَيْهِ . وَإِذَا وَقَعَ بِأَرْضٍ وَأَنْتُمْ بِهَا فَلاَ تَخْرُجُوا فِرَارًا مِنْهُ \" . فَرَجَعَ عُمَرُ بْنُ الْخَطَّابِ مِنْ سَرْغَ . وَعَنِ ابْنِ شِهَابٍ عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ أَنَّ عُمَرَ إِنَّمَا انْصَرَفَ بِالنَّاسِ مِنْ حَدِيثِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ ."
  },
  "2220": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2220d\nIn-book reference  : Book 39, Hadith 146\nUSC-MSA web (English) reference  : Book 26, Hadith 5513\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ عَدْوَى وَلاَ هَامَةَ وَلاَ نَوْءَ وَلاَ صَفَرَ \" ."
  },
  "2221": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2221c\nIn-book reference  : Book 39, Hadith 145\nUSC-MSA web (English) reference  : Book 26, Hadith 5512\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، حَدَّثَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2222": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2222c\nIn-book reference  : Book 39, Hadith 149\nUSC-MSA web (English) reference  : Book 26, Hadith 5516\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" لاَ عَدْوَى وَلاَ صَفَرَ وَلاَ غُولَ \" . وَسَمِعْتُ أَبَا الزُّبَيْرِ يَذْكُرُ أَنَّ جَابِرًا فَسَّرَ لَهُمْ قَوْلَهُ \" وَلاَ صَفَرَ \" . فَقَالَ أَبُو الزُّبَيْرِ الصَّفَرُ الْبَطْنُ . فَقِيلَ لِجَابِرٍ كَيْفَ قَالَ كَانَ يُقَالُ دَوَابُّ الْبَطْنِ . قَالَ وَلَمْ يُفَسِّرِ الْغُولَ . قَالَ أَبُو الزُّبَيْرِ هَذِهِ الْغُولُ الَّتِي تَغَوَّلُ ."
  },
  "2223": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2223d\nIn-book reference  : Book 39, Hadith 155\nUSC-MSA web (English) reference  : Book 26, Hadith 5522\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا هِشَامُ بْنُ حَسَّانٍ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ عَدْوَى وَلاَ هَامَةَ وَلاَ طِيَرَةَ وَأُحِبُّ الْفَأْلَ الصَّالِحَ \" ."
  },
  "2224": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2224b\nIn-book reference  : Book 39, Hadith 153\nUSC-MSA web (English) reference  : Book 26, Hadith 5520\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ عَدْوَى وَلاَ طِيَرَةَ وَيُعْجِبُنِي الْفَأْلُ \" . قَالَ قِيلَ وَمَا الْفَأْلُ قَالَ \" الْكَلِمَةُ الطَّيِّبَةُ \" ."
  },
  "2225": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2225f\nIn-book reference  : Book 39, Hadith 161\nUSC-MSA web (English) reference  : Book 26, Hadith 5528\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي عُتْبَةُ بْنُ مُسْلِمٍ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنْ كَانَ الشُّؤْمُ فِي شَىْءٍ فَفِي الْفَرَسِ وَالْمَسْكَنِ وَالْمَرْأَةِ \" ."
  },
  "2226": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2226b\nIn-book reference  : Book 39, Hadith 163\nUSC-MSA web (English) reference  : Book 26, Hadith 5530\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2227": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2227\nIn-book reference  : Book 39, Hadith 164\nUSC-MSA web (English) reference  : Book 26, Hadith 5531\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ، عَنِ ابْنِ، جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرًا، يُخْبِرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنْ كَانَ فِي شَىْءٍ فَفِي الرَّبْعِ وَالْخَادِمِ وَالْفَرَسِ \" ."
  },
  "537": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 537e\nIn-book reference  : Book 39, Hadith 167\nUSC-MSA web (English) reference  : Book 26, Hadith 5534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ حَجَّاجٍ الصَّوَّافِ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا الأَوْزَاعِيُّ، كِلاَهُمَا عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ هِلاَلِ بْنِ أَبِي مَيْمُونَةَ، عَنْ عَطَاءِ بْنِ، يَسَارٍ عَنْ مُعَاوِيَةَ بْنِ الْحَكَمِ السُّلَمِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمَعْنَى حَدِيثِ الزُّهْرِيِّ عَنْ أَبِي سَلَمَةَ عَنْ مُعَاوِيَةَ وَزَادَ فِي حَدِيثِ يَحْيَى بْنِ أَبِي كَثِيرٍ قَالَ قُلْتُ وَمِنَّا رِجَالٌ يَخُطُّونَ قَالَ \" كَانَ نَبِيٌّ مِنَ الأَنْبِيَاءِ يَخُطُّ فَمَنْ وَافَقَ خَطُّهُ فَذَاكَ \" ."
  },
  "2228": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2228c\nIn-book reference  : Book 39, Hadith 170\nUSC-MSA web (English) reference  : Book 26, Hadith 5537\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي مُحَمَّدُ بْنُ عَمْرٍو، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ نَحْوَ رِوَايَةِ مَعْقِلٍ عَنِ الزُّهْرِيِّ، ."
  },
  "2229": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2229b\nIn-book reference  : Book 39, Hadith 172\nUSC-MSA web (English) reference  : Book 26, Hadith 5539\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا أَبُو عَمْرٍو الأَوْزَاعِيُّ، ح وَحَدَّثَنَا أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنِي سَلَمَةُ بْنُ، شَبِيبٍ حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - يَعْنِي ابْنَ عُبَيْدِ اللَّهِ - كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ يُونُسَ، قَالَ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ أَخْبَرَنِي رِجَالٌ مِنْ أَصْحَابِ رَسُولِ اللَّهِ مِنَ الأَنْصَارِ وَفِي حَدِيثِ الأَوْزَاعِيِّ \" وَلَكِنْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ \" . وَفِي حَدِيثِ يُونُسَ \" وَلَكِنَّهُمْ يَرْقَوْنَ فِيهِ وَيَزِيدُونَ \" . وَزَادَ فِي حَدِيثِ يُونُسَ وَقَالَ اللَّهُ \" حَتَّى إِذَا فُزِّعَ عَنْ قُلُوبِهِمْ قَالُوا مَاذَا قَالَ رَبُّكُمْ قَالُوا الْحَقَّ \" . وَفِي حَدِيثِ مَعْقِلٍ كَمَا قَالَ الأَوْزَاعِيُّ \" وَلَكِنَّهُمْ يَقْرِفُونَ فِيهِ وَيَزِيدُونَ \" ."
  },
  "2230": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2230\nIn-book reference  : Book 39, Hadith 173\nUSC-MSA web (English) reference  : Book 26, Hadith 5540\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ صَفِيَّةَ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ أَتَى عَرَّافًا فَسَأَلَهُ عَنْ شَىْءٍ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ لَيْلَةً \" ."
  },
  "2231": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2231\nIn-book reference  : Book 39, Hadith 174\nUSC-MSA web (English) reference  : Book 26, Hadith 5541\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، وَهُشَيْمُ بْنُ بَشِيرٍ، عَنْ يَعْلَى بْنِ عَطَاءٍ، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، قَالَ كَانَ فِي وَفْدِ ثَقِيفٍ رَجُلٌ مَجْذُومٌ فَأَرْسَلَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم \" إِنَّا قَدْ بَايَعْنَاكَ فَارْجِعْ \" ."
  },
  "2232": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2232b\nIn-book reference  : Book 39, Hadith 176\nUSC-MSA web (English) reference  : Book 26, Hadith 5543\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، أَخْبَرَنَا هِشَامٌ، بِهَذَا الإِسْنَادِ وَقَالَ الأَبْتَرُ وَذُو الطُّفْيَتَيْنِ ."
  },
  "2233": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2233j\nIn-book reference  : Book 39, Hadith 185\nUSC-MSA web (English) reference  : Book 26, Hadith 5552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، أَنَّ نَافِعًا، حَدَّثَهُ أَنَّ أَبَا لُبَابَةَ مَرَّ بِابْنِ عُمَرَ وَهُوَ عِنْدَ الأُطُمِ الَّذِي عِنْدَ دَارِ عُمَرَ بْنِ الْخَطَّابِ يَرْصُدُ حَيَّةً بِنَحْوِ حَدِيثِ اللَّيْثِ بْنِ سَعْدٍ ."
  },
  "2234": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2234c\nIn-book reference  : Book 39, Hadith 189\nUSC-MSA web (English) reference  : Book 26, Hadith 5556\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا عُمَرُ بْنُ حَفْصِ بْنِ غِيَاثٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، حَدَّثَنِي إِبْرَاهِيمُ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ بَيْنَمَا نَحْنُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَارٍ . بِمِثْلِ حَدِيثِ جَرِيرٍ وَأَبِي مُعَاوِيَةَ ."
  },
  "2235": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2235\nIn-book reference  : Book 39, Hadith 188\nUSC-MSA web (English) reference  : Book 26, Hadith 5555\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَمَرَ مُحْرِمًا بِقَتْلِ حَيَّةٍ بِمِنًى ."
  },
  "2236": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2236c\nIn-book reference  : Book 39, Hadith 192\nUSC-MSA web (English) reference  : Book 26, Hadith 5559\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ عَجْلاَنَ، حَدَّثَنِي صَيْفِيٌّ، عَنْ أَبِي السَّائِبِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ سَمِعْتُهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ بِالْمَدِينَةِ نَفَرًا مِنَ الْجِنِّ قَدْ أَسْلَمُوا فَمَنْ رَأَى شَيْئًا مِنْ هَذِهِ الْعَوَامِرِ فَلْيُؤْذِنْهُ ثَلاَثًا فَإِنْ بَدَا لَهُ بَعْدُ فَلْيَقْتُلْهُ فَإِنَّهُ شَيْطَانٌ \" ."
  },
  "2237": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2237b\nIn-book reference  : Book 39, Hadith 194\nUSC-MSA web (English) reference  : Book 26, Hadith 5561\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ، بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ جُبَيْرِ بْنِ شَيْبَةَ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، أَخْبَرَهُ أَنَّ أُمَّ شَرِيكٍ أَخْبَرَتْهُ أَنَّهَا، اسْتَأْمَرَتِ النَّبِيَّ صلى الله عليه وسلم فِي قَتْلِ الْوِزْغَانِ فَأَمَرَ بِقَتْلِهَا . وَأُمُّ شَرِيكٍ إِحْدَى نِسَاءِ بَنِي عَامِرِ بْنِ لُؤَىٍّ . اتَّفَقَ لَفْظُ حَدِيثِ ابْنِ أَبِي خَلَفٍ وَعَبْدِ بْنِ حُمَيْدٍ وَحَدِيثُ ابْنِ وَهْبٍ قَرِيبٌ مِنْهُ ."
  },
  "2238": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2238\nIn-book reference  : Book 39, Hadith 195\nUSC-MSA web (English) reference  : Book 26, Hadith 5562\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ بِقَتْلِ الْوَزَغِ وَسَمَّاهُ فُوَيْسِقًا ."
  },
  "2239": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2239\nIn-book reference  : Book 39, Hadith 196\nUSC-MSA web (English) reference  : Book 26, Hadith 5563\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِلْوَزَغِ \" الْفُوَيْسِقُ \" . زَادَ حَرْمَلَةُ قَالَتْ وَلَمْ أَسْمَعْهُ أَمَرَ بِقَتْلِهِ ."
  },
  "2240": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2240c\nIn-book reference  : Book 39, Hadith 199\nUSC-MSA web (English) reference  : Book 26, Hadith 5566\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ زَكَرِيَّاءَ، عَنْ سُهَيْلٍ، حَدَّثَتْنِي أُخْتِي، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ \" فِي أَوَّلِ ضَرْبَةٍ سَبْعِينَ حَسَنَةً \" ."
  },
  "2241": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2241c\nIn-book reference  : Book 39, Hadith 202\nUSC-MSA web (English) reference  : Book 26, Hadith 5569\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" نَزَلَ نَبِيٌّ مِنَ الأَنْبِيَاءِ تَحْتَ شَجَرَةٍ فَلَدَغَتْهُ نَمْلَةٌ فَأَمَرَ بِجِهَازِهِ فَأُخْرِجَ مِنْ تَحْتِهَا وَأَمَرَ بِهَا فَأُحْرِقَتْ فِي النَّارِ - قَالَ - فَأَوْحَى اللَّهُ إِلَيْهِ فَهَلاَّ نَمْلَةً وَاحِدَةً \" ."
  },
  "2242": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2242c\nIn-book reference  : Book 39, Hadith 205\nUSC-MSA web (English) reference  : Book 26, Hadith 5572\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَاهُ هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ اللَّهِ بْنُ جَعْفَرٍ، عَنْ مَعْنِ بْنِ عِيسَى، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِذَلِكَ ."
  },
  "2243": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2243d\nIn-book reference  : Book 39, Hadith 209\nUSC-MSA web (English) reference  : Book 26, Hadith 5576\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِهِمْ ."
  },
  "2244": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2244\nIn-book reference  : Book 39, Hadith 210\nUSC-MSA web (English) reference  : Book 26, Hadith 5577\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، فِيمَا قُرِئَ عَلَيْهِ عَنْ سُمَىٍّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ اشْتَدَّ عَلَيْهِ الْعَطَشُ فَوَجَدَ بِئْرًا فَنَزَلَ فِيهَا فَشَرِبَ ثُمَّ خَرَجَ فَإِذَا كَلْبٌ يَلْهَثُ يَأْكُلُ الثَّرَى مِنَ الْعَطَشِ فَقَالَ الرَّجُلُ لَقَدْ بَلَغَ هَذَا الْكَلْبَ مِنَ الْعَطَشِ مِثْلُ الَّذِي كَانَ بَلَغَ مِنِّي . فَنَزَلَ الْبِئْرَ فَمَلأَ خُفَّهُ مَاءً ثُمَّ أَمْسَكَهُ بِفِيهِ حَتَّى رَقِيَ فَسَقَى الْكَلْبَ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ \" . قَالُوا يَا رَسُولَ اللَّهِ وَإِنَّ لَنَا فِي هَذِهِ الْبَهَائِمِ لأَجْرًا فَقَالَ \" فِي كُلِّ كَبِدٍ رَطْبَةٍ أَجْرٌ \" ."
  },
  "2245": {
    "collection": "Sahih Muslim",
    "book": "The Book of Greetings",
    "book_num": "39",
    "reference": "Reference  : Sahih Muslim 2245b\nIn-book reference  : Book 39, Hadith 212\nUSC-MSA web (English) reference  : Book 26, Hadith 5579\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/39",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" بَيْنَمَا كَلْبٌ يُطِيفُ بِرَكِيَّةٍ قَدْ كَادَ يَقْتُلُهُ الْعَطَشُ إِذْ رَأَتْهُ بَغِيٌّ مِنْ بَغَايَا بَنِي إِسْرَائِيلَ فَنَزَعَتْ مُوقَهَا فَاسْتَقَتْ لَهُ بِهِ فَسَقَتْهُ إِيَّاهُ فَغُفِرَ لَهَا بِهِ \" ."
  }
}