{
  "685": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 685c\nIn-book reference  : Book 6, Hadith 3\nUSC-MSA web (English) reference  : Book 4, Hadith 1460\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا ابْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّ الصَّلاَةَ، أَوَّلَ مَا فُرِضَتْ رَكْعَتَيْنِ فَأُقِرَّتْ صَلاَةُ السَّفَرِ وَأُتِمَّتْ صَلاَةُ الْحَضَرِ . قَالَ الزُّهْرِيُّ فَقُلْتُ لِعُرْوَةَ مَا بَالُ عَائِشَةَ تُتِمُّ فِي السَّفَرِ قَالَ إِنَّهَا تَأَوَّلَتْ كَمَا تَأَوَّلَ عُثْمَانُ ."
  },
  "686": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 686b\nIn-book reference  : Book 6, Hadith 5\nUSC-MSA web (English) reference  : Book 4, Hadith 1462\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا يَحْيَى، عَنِ ابْنِ جُرَيْجٍ، قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي عَمَّارٍ، عَنْ عَبْدِ اللَّهِ بْنِ بَابَيْهِ، عَنْ يَعْلَى بْنِ أُمَيَّةَ، قَالَ قُلْتُ لِعُمَرَ بْنِ الْخَطَّابِ . بِمِثْلِ حَدِيثِ ابْنِ إِدْرِيسَ ."
  },
  "687": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 687b\nIn-book reference  : Book 6, Hadith 7\nUSC-MSA web (English) reference  : Book 4, Hadith 1464\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، جَمِيعًا عَنِ الْقَاسِمِ بْنِ مَالِكٍ، - قَالَ عَمْرٌو حَدَّثَنَا قَاسِمُ بْنُ مَالِكٍ الْمُزَنِيُّ، - حَدَّثَنَا أَيُّوبُ بْنُ عَائِذٍ الطَّائِيُّ، عَنْ بُكَيْرِ بْنِ الأَخْنَسِ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ إِنَّ اللَّهَ فَرَضَ الصَّلاَةَ عَلَى لِسَانِ نَبِيِّكُمْ صلى الله عليه وسلم عَلَى الْمُسَافِرِ رَكْعَتَيْنِ وَعَلَى الْمُقِيمِ أَرْبَعًا وَفِي الْخَوْفِ رَكْعَةً ."
  },
  "688": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 688b\nIn-book reference  : Book 6, Hadith 9\nUSC-MSA web (English) reference  : Book 4, Hadith 1466\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي جَمِيعًا، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "689": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 689b\nIn-book reference  : Book 6, Hadith 11\nUSC-MSA web (English) reference  : Book 4, Hadith 1468\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - عَنْ عُمَرَ بْنِ مُحَمَّدٍ، عَنْ حَفْصِ بْنِ عَاصِمٍ، قَالَ مَرِضْتُ مَرَضًا فَجَاءَ ابْنُ عُمَرَ يَعُودُنِي قَالَ وَسَأَلْتُهُ عَنِ السُّبْحَةِ، فِي السَّفَرِ فَقَالَ صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ فَمَا رَأَيْتُهُ يُسَبِّحُ وَلَوْ كُنْتُ مُسَبِّحًا لأَتْمَمْتُ وَقَدْ قَالَ اللَّهُ تَعَالَى { لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ إِسْوَةٌ حَسَنَةٌ}"
  },
  "690": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 690b\nIn-book reference  : Book 6, Hadith 13\nUSC-MSA web (English) reference  : Book 4, Hadith 1470\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، حَدَّثَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، وَإِبْرَاهِيمُ بْنُ مَيْسَرَةَ، سَمِعَا أَنَسَ بْنَ مَالِكٍ، يَقُولُ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم الظُّهْرَ بِالْمَدِينَةِ أَرْبَعًا وَصَلَّيْتُ مَعَهُ الْعَصْرَ بِذِي الْحُلَيْفَةِ رَكْعَتَيْنِ ."
  },
  "691": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 691\nIn-book reference  : Book 6, Hadith 14\nUSC-MSA web (English) reference  : Book 4, Hadith 1471\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، كِلاَهُمَا عَنْ غُنْدَرٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، غُنْدَرٌ - عَنْ شُعْبَةَ، عَنْ يَحْيَى بْنِ يَزِيدَ الْهُنَائِيِّ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنْ قَصْرِ الصَّلاَةِ، فَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَرَجَ مَسِيرَةَ ثَلاَثَةِ أَمْيَالٍ أَوْ ثَلاَثَةِ فَرَاسِخَ - شُعْبَةُ الشَّاكُّ - صَلَّى رَكْعَتَيْنِ ."
  },
  "692": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 692b\nIn-book reference  : Book 6, Hadith 16\nUSC-MSA web (English) reference  : Book 4, Hadith 1472\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ . وَقَالَ عَنِ ابْنِ السِّمْطِ، وَلَمْ يُسَمِّ شُرَحْبِيلَ وَقَالَ إِنَّهُ أَتَى أَرْضًا يُقَالُ لَهَا دَوْمِينُ مِنْ حِمْصَ عَلَى رَأْسِ ثَمَانِيَةَ عَشَرَ مِيلاً ."
  },
  "693": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 693d\nIn-book reference  : Book 6, Hadith 20\nUSC-MSA web (English) reference  : Book 4, Hadith 1476\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، جَمِيعًا عَنِ الثَّوْرِيِّ، عَنْ يَحْيَى بْنِ أَبِي إِسْحَاقَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ وَلَمْ يَذْكُرِ الْحَجَّ ."
  },
  "694": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 694f\nIn-book reference  : Book 6, Hadith 26\nUSC-MSA web (English) reference  : Book 4, Hadith 1482\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، قَالَ حَدَّثَنِي عَبْدُ الصَّمَدِ، قَالاَ حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَلَمْ يَقُولاَ فِي الْحَدِيثِ بِمِنًى . وَلَكِنْ قَالاَ صَلَّى فِي السَّفَرِ ."
  },
  "695": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 695b\nIn-book reference  : Book 6, Hadith 28\nUSC-MSA web (English) reference  : Book 4, Hadith 1484\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا إِسْحَاقُ، وَابْنُ، خَشْرَمٍ قَالاَ أَخْبَرَنَا عِيسَى، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "696": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 696b\nIn-book reference  : Book 6, Hadith 30\nUSC-MSA web (English) reference  : Book 4, Hadith 1486\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، حَدَّثَنِي حَارِثَةُ بْنُ وَهْبٍ الْخُزَاعِيُّ، قَالَ صَلَّيْتُ خَلْفَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِنًى وَالنَّاسُ أَكْثَرُ مَا كَانُوا فَصَلَّى رَكْعَتَيْنِ فِي حَجَّةِ الْوَدَاعِ . قَالَ مُسْلِمٌ حَارِثَةُ بْنُ وَهْبٍ الْخُزَاعِيُّ هُوَ أَخُو عُبَيْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ لأُمِّهِ ."
  },
  "697": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 697c\nIn-book reference  : Book 6, Hadith 33\nUSC-MSA web (English) reference  : Book 4, Hadith 1489\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ نَادَى بِالصَّلاَةِ بِضَجْنَانَ ثُمَّ ذَكَرَ بِمِثْلِهِ وَقَالَ أَلاَ صَلُّوا فِي رِحَالِكُمْ . وَلَمْ يُعِدْ ثَانِيَةً أَلاَ صَلُّوا فِي الرِّحَالِ . مِنْ قَوْلِ ابْنِ عُمَرَ ."
  },
  "698": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 698\nIn-book reference  : Book 6, Hadith 34\nUSC-MSA web (English) reference  : Book 4, Hadith 1490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، قَالَ حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَمُطِرْنَا فَقَالَ \" لِيُصَلِّ مَنْ شَاءَ مِنْكُمْ فِي رَحْلِهِ \" ."
  },
  "699": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 699f\nIn-book reference  : Book 6, Hadith 40\nUSC-MSA web (English) reference  : Book 4, Hadith 1496\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ الْحَضْرَمِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، - قَالَ وُهَيْبٌ لَمْ يَسْمَعْهُ مِنْهُ - قَالَ أَمَرَ ابْنُ عَبَّاسٍ مُؤَذِّنَهُ فِي يَوْمِ جُمُعَةٍ فِي يَوْمٍ مَطِيرٍ . بِنَحْوِ حَدِيثِهِمْ ."
  },
  "700": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 700i\nIn-book reference  : Book 6, Hadith 49\nUSC-MSA web (English) reference  : Book 4, Hadith 1505\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَبِّحُ عَلَى الرَّاحِلَةِ قِبَلَ أَىِّ وَجْهٍ تَوَجَّهَ وَيُوتِرُ عَلَيْهَا غَيْرَ أَنَّهُ لاَ يُصَلِّي عَلَيْهَا الْمَكْتُوبَةَ ."
  },
  "701": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 701\nIn-book reference  : Book 6, Hadith 50\nUSC-MSA web (English) reference  : Book 4, Hadith 1506\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عَمْرُو بْنُ سَوَّادٍ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرِ بْنِ رَبِيعَةَ، أَخْبَرَهُ أَنَّ أَبَاهُ أَخْبَرَهُ أَنَّهُ، رَأَى رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي السُّبْحَةَ بِاللَّيْلِ فِي السَّفَرِ عَلَى ظَهْرِ رَاحِلَتِهِ حَيْثُ تَوَجَّهَتْ ."
  },
  "702": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 702\nIn-book reference  : Book 6, Hadith 51\nUSC-MSA web (English) reference  : Book 4, Hadith 1507\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ تَلَقَّيْنَا أَنَسَ بْنَ مَالِكٍ حِينَ قَدِمَ الشَّامَ فَتَلَقَّيْنَاهُ بِعَيْنِ التَّمْرِ فَرَأَيْتُهُ يُصَلِّي عَلَى حِمَارٍ وَوَجْهُهُ ذَلِكَ الْجَانِبَ - وَأَوْمَأَ هَمَّامٌ عَنْ يَسَارِ الْقِبْلَةِ - فَقُلْتُ لَهُ رَأَيْتُكَ تُصَلِّي لِغَيْرِ الْقِبْلَةِ . قَالَ لَوْلاَ أَنِّي رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَفْعَلُهُ لَمْ أَفْعَلْهُ ."
  },
  "703": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 703d\nIn-book reference  : Book 6, Hadith 55\nUSC-MSA web (English) reference  : Book 4, Hadith 1511\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ أَبَاهُ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم إِذَا أَعْجَلَهُ السَّيْرُ فِي السَّفَرِ يُؤَخِّرُ صَلاَةَ الْمَغْرِبِ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ صَلاَةِ الْعِشَاءِ ."
  },
  "704": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 704c\nIn-book reference  : Book 6, Hadith 58\nUSC-MSA web (English) reference  : Book 4, Hadith 1514\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَعَمْرُو بْنُ سَوَّادٍ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي جَابِرُ بْنُ إِسْمَاعِيلَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم إِذَا عَجِلَ عَلَيْهِ السَّفَرُ يُؤَخِّرُ الظُّهْرَ إِلَى أَوَّلِ وَقْتِ الْعَصْرِ فَيَجْمَعُ بَيْنَهُمَا وَيُؤَخِّرُ الْمَغْرِبَ حَتَّى يَجْمَعَ بَيْنَهَا وَبَيْنَ الْعِشَاءِ حِينَ يَغِيبُ الشَّفَقُ ."
  },
  "705": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 705h\nIn-book reference  : Book 6, Hadith 68\nUSC-MSA web (English) reference  : Book 4, Hadith 1524\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عِمْرَانُ بْنُ حُدَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ، قَالَ قَالَ رَجُلٌ لاِبْنِ عَبَّاسٍ الصَّلاَةَ فَسَكَتَ . ثُمَّ قَالَ الصَّلاَةَ . فَسَكَتَ ثُمَّ قَالَ الصَّلاَةَ فَسَكَتَ . ثُمَّ قَالَ لاَ أُمَّ لَكَ أَتُعَلِّمُنَا بِالصَّلاَةِ وَكُنَّا نَجْمَعُ بَيْنَ الصَّلاَتَيْنِ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "706": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 706b\nIn-book reference  : Book 6, Hadith 63\nUSC-MSA web (English) reference  : Book 4, Hadith 1519\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، حَدَّثَنَا أَبُو الزُّبَيْرِ، حَدَّثَنَا عَامِرُ بْنُ وَاثِلَةَ أَبُو الطُّفَيْلِ، حَدَّثَنَا مُعَاذُ بْنُ جَبَلٍ، قَالَ جَمَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي غَزْوَةِ تَبُوكَ بَيْنَ الظُّهْرِ وَالْعَصْرِ وَبَيْنَ الْمَغْرِبِ وَالْعِشَاءِ . قَالَ فَقُلْتُ مَا حَمَلَهُ عَلَى ذَلِكَ قَالَ فَقَالَ أَرَادَ أَنْ لاَ يُحْرِجَ أُمَّتَهُ ."
  },
  "707": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 707b\nIn-book reference  : Book 6, Hadith 70\nUSC-MSA web (English) reference  : Book 4, Hadith 1526\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، وَعِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "708": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 708b\nIn-book reference  : Book 6, Hadith 72\nUSC-MSA web (English) reference  : Book 4, Hadith 1528\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ السُّدِّيِّ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَنْصَرِفُ عَنْ يَمِينِهِ ."
  },
  "709": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 709b\nIn-book reference  : Book 6, Hadith 74\nUSC-MSA web (English) reference  : Book 4, Hadith 1530\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ مِسْعَرٍ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ يُقْبِلُ عَلَيْنَا بِوَجْهِهِ ."
  },
  "710": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 710d\nIn-book reference  : Book 6, Hadith 78\nUSC-MSA web (English) reference  : Book 4, Hadith 1534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِهِ . قَالَ حَمَّادٌ ثُمَّ لَقِيتُ عَمْرًا فَحَدَّثَنِي بِهِ وَلَمْ يَرْفَعْهُ ."
  },
  "711": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 711b\nIn-book reference  : Book 6, Hadith 80\nUSC-MSA web (English) reference  : Book 4, Hadith 1536\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنِ ابْنِ بُحَيْنَةَ، قَالَ أُقِيمَتْ صَلاَةُ الصُّبْحِ فَرَأَى رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً يُصَلِّي وَالْمُؤَذِّنُ يُقِيمُ فَقَالَ \" أَتُصَلِّي الصُّبْحَ أَرْبَعًا \" ."
  },
  "712": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 712\nIn-book reference  : Book 6, Hadith 81\nUSC-MSA web (English) reference  : Book 4, Hadith 1537\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ يَعْنِي ابْنَ زِيَادٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ عَاصِمٍ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ دَخَلَ رَجُلٌ الْمَسْجِدَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم فِي صَلاَةِ الْغَدَاةِ فَصَلَّى رَكْعَتَيْنِ فِي جَانِبِ الْمَسْجِدِ ثُمَّ دَخَلَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا سَلَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ \" يَا فُلاَنُ بِأَىِّ الصَّلاَتَيْنِ اعْتَدَدْتَ أَبِصَلاَتِكَ وَحْدَكَ أَمْ بِصَلاَتِكَ مَعَنَا \" ."
  },
  "713": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 713b\nIn-book reference  : Book 6, Hadith 83\nUSC-MSA web (English) reference  : Book 4, Hadith 1539\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا عُمَارَةُ بْنُ غَزِيَّةَ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ الْمَلِكِ بْنِ سَعِيدِ بْنِ سُوَيْدٍ الأَنْصَارِيِّ، عَنْ أَبِي حُمَيْدٍ، أَوْ عَنْ أَبِي أُسَيْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "714": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 714b\nIn-book reference  : Book 6, Hadith 85\nUSC-MSA web (English) reference  : Book 4, Hadith 1541\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، قَالَ حَدَّثَنِي عَمْرُو بْنُ يَحْيَى الأَنْصَارِيُّ، حَدَّثَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ حَبَّانَ، عَنْ عَمْرِو بْنِ سُلَيْمِ بْنِ خَلْدَةَ الأَنْصَارِيِّ، عَنْ أَبِي قَتَادَةَ، صَاحِبِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ دَخَلْتُ الْمَسْجِدَ وَرَسُولُ اللَّهِ صلى الله عليه وسلم جَالِسٌ بَيْنَ ظَهْرَانَىِ النَّاسِ - قَالَ - فَجَلَسْتُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا مَنَعَكَ أَنْ تَرْكَعَ رَكْعَتَيْنِ قَبْلَ أَنْ تَجْلِسَ \" . قَالَ فَقُلْتُ يَا رَسُولَ اللَّهِ رَأَيْتُكَ جَالِسًا وَالنَّاسُ جُلُوسٌ . قَالَ \" فَإِذَا دَخَلَ أَحَدُكُمُ الْمَسْجِدَ فَلاَ يَجْلِسْ حَتَّى يَرْكَعَ رَكْعَتَيْنِ \" ."
  },
  "715": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 715c\nIn-book reference  : Book 6, Hadith 88\nUSC-MSA web (English) reference  : Book 4, Hadith 1544\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ وَهْبِ بْنِ كَيْسَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي غَزَاةٍ فَأَبْطَأَ بِي جَمَلِي وَأَعْيَى ثُمَّ قَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَبْلِي وَقَدِمْتُ بِالْغَدَاةِ فَجِئْتُ الْمَسْجِدَ فَوَجَدْتُهُ عَلَى بَابِ الْمَسْجِدِ قَالَ \" الآنَ حِينَ قَدِمْتَ \" . قُلْتُ نَعَمْ . قَالَ \" فَدَعْ جَمَلَكَ وَادْخُلْ فَصَلِّ رَكْعَتَيْنِ \" . قَالَ فَدَخَلْتُ فَصَلَّيْتُ ثُمَّ رَجَعْتُ ."
  },
  "716": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 716\nIn-book reference  : Book 6, Hadith 89\nUSC-MSA web (English) reference  : Book 4, Hadith 1545\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا الضَّحَّاكُ يَعْنِي أَبَا عَاصِمٍ، ح وَحَدَّثَنِي مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالاَ جَمِيعًا أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي ابْنُ شِهَابٍ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ عَبْدِ اللَّهِ بْنِ كَعْبٍ، أَخْبَرَهُ عَنْ أَبِيهِ عَبْدِ اللَّهِ بْنِ كَعْبٍ، وَعَنْ عَمِّهِ، عُبَيْدِ اللَّهِ بْنِ كَعْبٍ عَنْ كَعْبِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يَقْدَمُ مِنْ سَفَرٍ إِلاَّ نَهَارًا فِي الضُّحَى فَإِذَا قَدِمَ بَدَأَ بِالْمَسْجِدِ فَصَلَّى فِيهِ رَكْعَتَيْنِ ثُمَّ جَلَسَ فِيهِ ."
  },
  "717": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 717b\nIn-book reference  : Book 6, Hadith 91\nUSC-MSA web (English) reference  : Book 4, Hadith 1547\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسُ بْنُ الْحَسَنِ الْقَيْسِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ قُلْتُ لِعَائِشَةَ أَكَانَ النَّبِيُّ صلى الله عليه وسلم يُصَلِّي الضُّحَى قَالَتْ لاَ إِلاَّ أَنْ يَجِيءَ مِنْ مَغِيبِهِ"
  },
  "718": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 718\nIn-book reference  : Book 6, Hadith 92\nUSC-MSA web (English) reference  : Book 4, Hadith 1548\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يُصَلِّي سُبْحَةَ الضُّحَى قَطُّ . وَإِنِّي لأُسَبِّحُهَا وَإِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَدَعُ الْعَمَلَ وَهُوَ يُحِبُّ أَنْ يَعْمَلَ بِهِ خَشْيَةَ أَنْ يَعْمَلَ بِهِ النَّاسُ فَيُفْرَضَ عَلَيْهِمْ ."
  },
  "719": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 719d\nIn-book reference  : Book 6, Hadith 96\nUSC-MSA web (English) reference  : Book 4, Hadith 1552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ مُعَاذِ بْنِ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "336": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 336g\nIn-book reference  : Book 6, Hadith 100\nUSC-MSA web (English) reference  : Book 4, Hadith 1556\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا وُهَيْبُ بْنُ خَالِدٍ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ أَبِي مُرَّةَ، مَوْلَى عَقِيلٍ عَنْ أُمِّ هَانِئٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى فِي بَيْتِهَا عَامَ الْفَتْحِ ثَمَانِيَ رَكَعَاتٍ فِي ثَوْبٍ وَاحِدٍ قَدْ خَالَفَ بَيْنَ طَرَفَيْهِ ."
  },
  "720": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 720\nIn-book reference  : Book 6, Hadith 101\nUSC-MSA web (English) reference  : Book 4, Hadith 1557\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ، حَدَّثَنَا مَهْدِيٌّ، - وَهُوَ ابْنُ مَيْمُونٍ - حَدَّثَنَا وَاصِلٌ، مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ أَبِي الأَسْوَدِ الدُّؤَلِيِّ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ \" يُصْبِحُ عَلَى كُلِّ سُلاَمَى مِنْ أَحَدِكُمْ صَدَقَةٌ فَكُلُّ تَسْبِيحَةٍ صَدَقَةٌ وَكُلُّ تَحْمِيدَةٍ صَدَقَةٌ وَكُلُّ تَهْلِيلَةٍ صَدَقَةٌ وَكُلُّ تَكْبِيرَةٍ صَدَقَةٌ وَأَمْرٌ بِالْمَعْرُوفِ صَدَقَةٌ وَنَهْىٌ عَنِ الْمُنْكَرِ صَدَقَةٌ وَيُجْزِئُ مِنْ ذَلِكَ رَكْعَتَانِ يَرْكَعُهُمَا مِنَ الضُّحَى \" ."
  },
  "721": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 721c\nIn-book reference  : Book 6, Hadith 104\nUSC-MSA web (English) reference  : Book 4, Hadith 1560\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُخْتَارٍ، عَنْ عَبْدِ اللَّهِ الدَّانَاجِ، قَالَ حَدَّثَنِي أَبُو رَافِعٍ الصَّائِغُ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ أَوْصَانِي خَلِيلِي أَبُو الْقَاسِمِ صلى الله عليه وسلم بِثَلاَثٍ . فَذَكَرَ مِثْلَ حَدِيثِ أَبِي عُثْمَانَ عَنْ أَبِي هُرَيْرَةَ ."
  },
  "722": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 722\nIn-book reference  : Book 6, Hadith 105\nUSC-MSA web (English) reference  : Book 4, Hadith 1561\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، عَنِ الضَّحَّاكِ بْنِ عُثْمَانَ، عَنْ إِبْرَاهِيمَ بْنِ عَبْدِ اللَّهِ بْنِ حُنَيْنٍ، عَنْ أَبِي مُرَّةَ، مَوْلَى أُمِّ هَانِئٍ عَنْ أَبِي الدَّرْدَاءِ، قَالَ أَوْصَانِي حَبِيبِي صلى الله عليه وسلم بِثَلاَثٍ لَنْ أَدَعَهُنَّ مَا عِشْتُ بِصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَصَلاَةِ الضُّحَى وَبِأَنْ لاَ أَنَامَ حَتَّى أُوتِرَ ."
  },
  "723": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 723e\nIn-book reference  : Book 6, Hadith 110\nUSC-MSA web (English) reference  : Book 4, Hadith 1566\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَخْبَرَتْنِي حَفْصَةُ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا أَضَاءَ لَهُ الْفَجْرُ صَلَّى رَكْعَتَيْنِ ."
  },
  "724": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 724g\nIn-book reference  : Book 6, Hadith 117\nUSC-MSA web (English) reference  : Book 4, Hadith 1572\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ جَمِيعًا عَنْ حَفْصِ بْنِ غِيَاثٍ، - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا حَفْصٌ، - عَنِ ابْنِ جُرَيْجٍ، عَنْ عَطَاءٍ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي شَىْءٍ مِنَ النَّوَافِلِ أَسْرَعَ مِنْهُ إِلَى الرَّكْعَتَيْنِ قَبْلَ الْفَجْرِ ."
  },
  "725": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 725b\nIn-book reference  : Book 6, Hadith 119\nUSC-MSA web (English) reference  : Book 4, Hadith 1574\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيْبٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ قَالَ أَبِي حَدَّثَنَا قَتَادَةُ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ فِي شَأْنِ الرَّكْعَتَيْنِ عِنْدَ طُلُوعِ الْفَجْرِ \" لَهُمَا أَحَبُّ إِلَىَّ مِنَ الدُّنْيَا جَمِيعًا \" ."
  },
  "726": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 726\nIn-book reference  : Book 6, Hadith 120\nUSC-MSA web (English) reference  : Book 4, Hadith 1575\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ يَزِيدَ، - هُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ فِي رَكْعَتَىِ الْفَجْرِ { قُلْ يَا أَيُّهَا الْكَافِرُونَ} وَ { قُلْ هُوَ اللَّهُ أَحَدٌ}"
  },
  "727": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 727c\nIn-book reference  : Book 6, Hadith 123\nUSC-MSA web (English) reference  : Book 4, Hadith 1578\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُثْمَانَ بْنِ حَكِيمٍ، فِي هَذَا الإِسْنَادِ . بِمِثْلِ حَدِيثِ مَرْوَانَ الْفَزَارِيِّ ."
  },
  "728": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 728d\nIn-book reference  : Book 6, Hadith 127\nUSC-MSA web (English) reference  : Book 4, Hadith 1582\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، وَعَبْدُ اللَّهِ بْنُ هَاشِمٍ الْعَبْدِيُّ، قَالاَ حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، قَالَ النُّعْمَانُ بْنُ سَالِمٍ أَخْبَرَنِي قَالَ سَمِعْتُ عَمْرَو بْنَ أَوْسٍ، يُحَدِّثُ عَنْ عَنْبَسَةَ، عَنْ أُمِّ حَبِيبَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا مِنْ عَبْدٍ مُسْلِمٍ تَوَضَّأَ فَأَسْبَغَ الْوُضُوءَ ثُمَّ صَلَّى لِلَّهِ كُلَّ يَوْمٍ \" . فَذَكَرَ بِمِثْلِهِ ."
  },
  "729": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 729\nIn-book reference  : Book 6, Hadith 128\nUSC-MSA web (English) reference  : Book 4, Hadith 1583\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ ابْنُ سَعِيدٍ - عَنْ عُبَيْدِ اللَّهِ، قَالَ أَخْبَرَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَبْلَ الظُّهْرِ سَجْدَتَيْنِ وَبَعْدَهَا سَجْدَتَيْنِ وَبَعْدَ الْمَغْرِبِ سَجْدَتَيْنِ وَبَعْدَ الْعِشَاءِ سَجْدَتَيْنِ وَبَعْدَ الْجُمُعَةِ سَجْدَتَيْنِ فَأَمَّا الْمَغْرِبُ وَالْعِشَاءُ وَالْجُمُعَةُ فَصَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم فِي بَيْتِهِ ."
  },
  "730": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 730e\nIn-book reference  : Book 6, Hadith 133\nUSC-MSA web (English) reference  : Book 4, Hadith 1588\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنْ هِشَامِ بْنِ حَسَّانَ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ الْعُقَيْلِيِّ، قَالَ سَأَلْنَا عَائِشَةَ عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُكْثِرُ الصَّلاَةَ قَائِمًا وَقَاعِدًا فَإِذَا افْتَتَحَ الصَّلاَةَ قَائِمًا رَكَعَ قَائِمًا وَإِذَا افْتَتَحَ الصَّلاَةَ قَاعِدًا رَكَعَ قَاعِدًا ."
  },
  "731": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 731d\nIn-book reference  : Book 6, Hadith 137\nUSC-MSA web (English) reference  : Book 4, Hadith 1592\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرٍو، حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ بْنِ وَقَّاصٍ، قَالَ قُلْتُ لِعَائِشَةَ كَيْفَ كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الرَّكْعَتَيْنِ وَهُوَ جَالِسٌ قَالَتْ كَانَ يَقْرَأُ فِيهِمَا فَإِذَا أَرَادَ أَنْ يَرْكَعَ قَامَ فَرَكَعَ ."
  },
  "732": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 732d\nIn-book reference  : Book 6, Hadith 141\nUSC-MSA web (English) reference  : Book 4, Hadith 1596\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَحَسَنٌ الْحُلْوَانِيُّ، كِلاَهُمَا عَنْ زَيْدٍ، قَالَ حَسَنٌ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنِي الضَّحَّاكُ بْنُ عُثْمَانَ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا بَدَّنَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَثَقُلَ كَانَ أَكْثَرُ صَلاَتِهِ جَالِسًا ."
  },
  "733": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 733b\nIn-book reference  : Book 6, Hadith 143\nUSC-MSA web (English) reference  : Book 4, Hadith 1598\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، جَمِيعًا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّهُمَا قَالاَ بِعَامٍ وَاحِدٍ أَوِ اثْنَيْنِ ."
  },
  "734": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 734\nIn-book reference  : Book 6, Hadith 144\nUSC-MSA web (English) reference  : Book 4, Hadith 1599\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ حَسَنِ بْنِ صَالِحٍ، عَنْ سِمَاكٍ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ سَمُرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم لَمْ يَمُتْ حَتَّى صَلَّى قَاعِدًا ."
  },
  "735": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 735b\nIn-book reference  : Book 6, Hadith 146\nUSC-MSA web (English) reference  : Book 4, Hadith 1601\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِهَذَا الإِسْنَادِ وَفِي رِوَايَةِ شُعْبَةَ عَنْ أَبِي يَحْيَى الأَعْرَجِ، ."
  },
  "736": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 736b-c\nIn-book reference  : Book 6, Hadith 148\nUSC-MSA web (English) reference  : Book 4, Hadith 1603\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي فِيمَا بَيْنَ أَنْ يَفْرُغَ مِنْ صَلاَةِ الْعِشَاءِ - وَهِيَ الَّتِي يَدْعُو النَّاسُ الْعَتَمَةَ - إِلَى الْفَجْرِ إِحْدَى عَشْرَةَ رَكْعَةً يُسَلِّمُ بَيْنَ كُلِّ رَكْعَتَيْنِ وَيُوتِرُ بِوَاحِدَةٍ فَإِذَا سَكَتَ الْمُؤَذِّنُ مِنْ صَلاَةِ الْفَجْرِ وَتَبَيَّنَ لَهُ الْفَجْرُ وَجَاءَهُ الْمُؤَذِّنُ قَامَ فَرَكَعَ رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ اضْطَجَعَ عَلَى شِقِّهِ الأَيْمَنِ حَتَّى يَأْتِيَهُ الْمُؤَذِّنُ لِلإِقَامَةِ . وَحَدَّثَنِيهِ حَرْمَلَةُ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ . وَسَاقَ حَرْمَلَةُ الْحَدِيثَ بِمِثْلِهِ غَيْرَ أَنَّهُ لَمْ يَذْكُرْ وَتَبَيَّنَ لَهُ الْفَجْرُ وَجَاءَهُ الْمُؤَذِّنُ . وَلَمْ يَذْكُرِ الإِقَامَةَ . وَسَائِرُ الْحَدِيثِ بِمِثْلِ حَدِيثِ عَمْرٍو سَوَاءً ."
  },
  "737": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 737c\nIn-book reference  : Book 6, Hadith 151\nUSC-MSA web (English) reference  : Book 4, Hadith 1606\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عِرَاكِ بْنِ مَالِكٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي ثَلاَثَ عَشْرَةَ رَكْعَةً بِرَكْعَتَىِ الْفَجْرِ ."
  },
  "738": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 738e\nIn-book reference  : Book 6, Hadith 156\nUSC-MSA web (English) reference  : Book 4, Hadith 1611\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا حَنْظَلَةُ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، قَالَ سَمِعْتُ عَائِشَةَ، تَقُولُ كَانَتْ صَلاَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ اللَّيْلِ عَشَرَ رَكَعَاتٍ وَيُوتِرُ بِسَجْدَةٍ وَيَرْكَعُ رَكْعَتَىِ الْفَجْرِ فَتِلْكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ."
  },
  "739": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 739\nIn-book reference  : Book 6, Hadith 157\nUSC-MSA web (English) reference  : Book 4, Hadith 1612\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَأَلْتُ الأَسْوَدَ بْنَ يَزِيدَ عَمَّا حَدَّثَتْهُ عَائِشَةُ، عَنْ صَلاَةِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ يَنَامُ أَوَّلَ اللَّيْلِ وَيُحْيِي آخِرَهُ ثُمَّ إِنْ كَانَتْ لَهُ حَاجَةٌ إِلَى أَهْلِهِ قَضَى حَاجَتَهُ ثُمَّ يَنَامُ فَإِذَا كَانَ عِنْدَ النِّدَاءِ الأَوَّلِ - قَالَتْ - وَثَبَ - وَلاَ وَاللَّهِ مَا قَالَتْ قَامَ - فَأَفَاضَ عَلَيْهِ الْمَاءَ - وَلاَ وَاللَّهِ مَا قَالَتِ اغْتَسَلَ . وَأَنَا أَعْلَمُ مَا تُرِيدُ - وَإِنْ لَمْ يَكُنْ جُنُبًا تَوَضَّأَ وُضُوءَ الرَّجُلِ لِلصَّلاَةِ ثُمَّ صَلَّى الرَّكْعَتَيْنِ ."
  },
  "740": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 740\nIn-book reference  : Book 6, Hadith 158\nUSC-MSA web (English) reference  : Book 4, Hadith 1613\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا عَمَّارُ بْنُ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ حَتَّى يَكُونَ آخِرَ صَلاَتِهِ الْوِتْرُ ."
  },
  "741": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 741\nIn-book reference  : Book 6, Hadith 159\nUSC-MSA web (English) reference  : Book 4, Hadith 1614\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ أَشْعَثَ، عَنْ أَبِيهِ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ عَمَلِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ يُحِبُّ الدَّائِمَ . قَالَ قُلْتُ أَىَّ حِينٍ كَانَ يُصَلِّي فَقَالَتْ كَانَ إِذَا سَمِعَ الصَّارِخَ قَامَ فَصَلَّى ."
  },
  "742": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 742\nIn-book reference  : Book 6, Hadith 160\nUSC-MSA web (English) reference  : Book 4, Hadith 1615\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، عَنْ سَعْدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ مَا أَلْفَى رَسُولَ اللَّهِ صلى الله عليه وسلم السَّحَرُ الأَعْلَى فِي بَيْتِي - أَوْ عِنْدِي - إِلاَّ نَائِمًا ."
  },
  "743": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 743b\nIn-book reference  : Book 6, Hadith 162\nUSC-MSA web (English) reference  : Book 4, Hadith 1617\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ زِيَادِ بْنِ سَعْدٍ، عَنِ ابْنِ أَبِي عَتَّابٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ."
  },
  "744": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 744b\nIn-book reference  : Book 6, Hadith 164\nUSC-MSA web (English) reference  : Book 4, Hadith 1619\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ رَبِيعَةَ بْنِ أَبِي عَبْدِ الرَّحْمَنِ، عَنِ الْقَاسِمِ بْنِ مُحَمَّدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي صَلاَتَهُ بِاللَّيْلِ وَهِيَ مُعْتَرِضَةٌ بَيْنَ يَدَيْهِ فَإِذَا بَقِيَ الْوِتْرُ أَيْقَظَهَا فَأَوْتَرَتْ ."
  },
  "745": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 745c\nIn-book reference  : Book 6, Hadith 167\nUSC-MSA web (English) reference  : Book 4, Hadith 1622\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، حَدَّثَنَا حَسَّانُ، - قَاضِي كِرْمَانَ - عَنْ سَعِيدِ بْنِ مَسْرُوقٍ، عَنْ أَبِي الضُّحَى، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ كُلَّ اللَّيْلِ قَدْ أَوْتَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَانْتَهَى وِتْرُهُ إِلَى آخِرِ اللَّيْلِ ."
  },
  "746": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 746f\nIn-book reference  : Book 6, Hadith 173\nUSC-MSA web (English) reference  : Book 4, Hadith 1628\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى، - وَهُوَ ابْنُ يُونُسَ - عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ، عَنْ سَعْدِ بْنِ هِشَامٍ الأَنْصَارِيِّ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا عَمِلَ عَمَلاً أَثْبَتَهُ وَكَانَ إِذَا نَامَ مِنَ اللَّيْلِ أَوْ مَرِضَ صَلَّى مِنَ النَّهَارِ ثِنْتَىْ عَشْرَةَ رَكْعَةً . قَالَتْ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَمَا صَامَ شَهْرًا مُتَتَابِعًا إِلاَّ رَمَضَانَ ."
  },
  "747": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 747\nIn-book reference  : Book 6, Hadith 174\nUSC-MSA web (English) reference  : Book 4, Hadith 1629\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، ح وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، وَعُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، أَخْبَرَاهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدٍ الْقَارِيِّ، قَالَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ نَامَ عَنْ حِزْبِهِ أَوْ عَنْ شَىْءٍ مِنْهُ فَقَرَأَهُ فِيمَا بَيْنَ صَلاَةِ الْفَجْرِ وَصَلاَةِ الظُّهْرِ كُتِبَ لَهُ كَأَنَّمَا قَرَأَهُ مِنَ اللَّيْلِ \" ."
  },
  "748": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 748b\nIn-book reference  : Book 6, Hadith 176\nUSC-MSA web (English) reference  : Book 4, Hadith 1631\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامِ بْنِ أَبِي عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْقَاسِمُ الشَّيْبَانِيُّ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى أَهْلِ قُبَاءٍ وَهُمْ يُصَلُّونَ فَقَالَ \" صَلاَةُ الأَوَّابِينَ إِذَا رَمِضَتِ الْفِصَالُ \" ."
  },
  "749": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 749i\nIn-book reference  : Book 6, Hadith 192\nUSC-MSA web (English) reference  : Book 4, Hadith 1647\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ عُقْبَةَ بْنَ حُرَيْثٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" صَلاَةُ اللَّيْلِ مَثْنَى مَثْنَى فَإِذَا رَأَيْتَ أَنَّ الصُّبْحَ يُدْرِكُكَ فَأَوْتِرْ بِوَاحِدَةٍ \" . فَقِيلَ لاِبْنِ عُمَرَ مَا مَثْنَى مَثْنَى قَالَ أَنْ يُسَلِّمَ فِي كُلِّ رَكْعَتَيْنِ ."
  },
  "750": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 750\nIn-book reference  : Book 6, Hadith 182\nUSC-MSA web (English) reference  : Book 4, Hadith 1637\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، وَسُرَيْجُ بْنُ يُونُسَ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنِ ابْنِ أَبِي زَائِدَةَ، - قَالَ هَارُونُ حَدَّثَنَا ابْنُ أَبِي زَائِدَةَ، - أَخْبَرَنِي عَاصِمٌ الأَحْوَلُ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" بَادِرُوا الصُّبْحَ بِالْوِتْرِ \" ."
  },
  "751": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 751c\nIn-book reference  : Book 6, Hadith 185\nUSC-MSA web (English) reference  : Book 4, Hadith 1640\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي نَافِعٌ، أَنَّ ابْنَ عُمَرَ، كَانَ يَقُولُ مَنْ صَلَّى مِنَ اللَّيْلِ فَلْيَجْعَلْ آخِرَ صَلاَتِهِ وِتْرًا قَبْلَ الصُّبْحِ كَذَلِكَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُهُمْ ."
  },
  "752": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 752b\nIn-book reference  : Book 6, Hadith 187\nUSC-MSA web (English) reference  : Book 4, Hadith 1642\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ أَبِي مِجْلَزٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" الْوِتْرُ رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" ."
  },
  "753": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 753\nIn-book reference  : Book 6, Hadith 188\nUSC-MSA web (English) reference  : Book 4, Hadith 1643\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي مِجْلَزٍ، قَالَ سَأَلْتُ ابْنَ عَبَّاسٍ عَنِ الْوِتْرِ، فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" . وَسَأَلْتُ ابْنَ عُمَرَ فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" رَكْعَةٌ مِنْ آخِرِ اللَّيْلِ \" ."
  },
  "754": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 754b\nIn-book reference  : Book 6, Hadith 194\nUSC-MSA web (English) reference  : Book 4, Hadith 1649\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنِي عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنْ يَحْيَى، قَالَ أَخْبَرَنِي أَبُو نَضْرَةَ الْعَوَقِيُّ، أَنَّ أَبَا سَعِيدٍ، أَخْبَرَهُمْ أَنَّهُمْ، سَأَلُوا النَّبِيَّ صلى الله عليه وسلم عَنِ الْوِتْرِ فَقَالَ \" أَوْتِرُوا قَبْلَ الصُّبْحِ \" ."
  },
  "755": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 755b\nIn-book reference  : Book 6, Hadith 196\nUSC-MSA web (English) reference  : Book 4, Hadith 1651\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" أَيُّكُمْ خَافَ أَنْ لاَ يَقُومَ مِنْ آخِرِ اللَّيْلِ فَلْيُوتِرْ ثُمَّ لْيَرْقُدْ وَمَنْ وَثِقَ بِقِيَامٍ مِنَ اللَّيْلِ فَلْيُوتِرْ مِنْ آخِرِهِ فَإِنَّ قِرَاءَةَ آخِرِ اللَّيْلِ مَحْضُورَةٌ وَذَلِكَ أَفْضَلُ \" ."
  },
  "756": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 756b\nIn-book reference  : Book 6, Hadith 198\nUSC-MSA web (English) reference  : Book 4, Hadith 1653\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ الصَّلاَةِ أَفْضَلُ قَالَ \" طُولُ الْقُنُوتِ \" . قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ ."
  },
  "757": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 757b\nIn-book reference  : Book 6, Hadith 200\nUSC-MSA web (English) reference  : Book 4, Hadith 1655\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ مِنَ اللَّيْلِ سَاعَةً لاَ يُوَافِقُهَا عَبْدٌ مُسْلِمٌ يَسْأَلُ اللَّهَ خَيْرًا إِلاَّ أَعْطَاهُ إِيَّاهُ \" ."
  },
  "758": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 758f\nIn-book reference  : Book 6, Hadith 206\nUSC-MSA web (English) reference  : Book 4, Hadith 1661\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، بِهَذَا الإِسْنَادِ . غَيْرَ أَنَّ حَدِيثَ، مَنْصُورٍ أَتَمُّ وَأَكْثَرُ ."
  },
  "759": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 759b\nIn-book reference  : Book 6, Hadith 208\nUSC-MSA web (English) reference  : Book 4, Hadith 1663\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ فِيهِ بِعَزِيمَةٍ فَيَقُولُ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" . فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ ثُمَّ كَانَ الأَمْرُ عَلَى ذَلِكَ فِي خِلاَفَةِ أَبِي بَكْرٍ وَصَدْرًا مِنْ خِلاَفَةِ عُمَرَ عَلَى ذَلِكَ ."
  },
  "760": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 760b\nIn-book reference  : Book 6, Hadith 210\nUSC-MSA web (English) reference  : Book 4, Hadith 1665\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ يَقُمْ لَيْلَةَ الْقَدْرِ فَيُوَافِقُهَا - أُرَاهُ قَالَ - إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ \" ."
  },
  "761": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 761b\nIn-book reference  : Book 6, Hadith 212\nUSC-MSA web (English) reference  : Book 4, Hadith 1667\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ مِنْ جَوْفِ اللَّيْلِ فَصَلَّى فِي الْمَسْجِدِ فَصَلَّى رِجَالٌ بِصَلاَتِهِ فَأَصْبَحَ النَّاسُ يَتَحَدَّثُونَ بِذَلِكَ فَاجْتَمَعَ أَكْثَرُ مِنْهُمْ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي اللَّيْلَةِ الثَّانِيَةِ فَصَلَّوْا بِصَلاَتِهِ فَأَصْبَحَ النَّاسُ يَذْكُرُونَ ذَلِكَ فَكَثُرَ أَهْلُ الْمَسْجِدِ مِنَ اللَّيْلَةِ الثَّالِثَةِ فَخَرَجَ فَصَلَّوْا بِصَلاَتِهِ فَلَمَّا كَانَتِ اللَّيْلَةُ الرَّابِعَةُ عَجَزَ الْمَسْجِدُ عَنْ أَهْلِهِ فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم فَطَفِقَ رِجَالٌ مِنْهُمْ يَقُولُونَ الصَّلاَةَ . فَلَمْ يَخْرُجْ إِلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى خَرَجَ لِصَلاَةِ الْفَجْرِ فَلَمَّا قَضَى الْفَجْرَ أَقْبَلَ عَلَى النَّاسِ ثُمَّ تَشَهَّدَ فَقَالَ \" أَمَّا بَعْدُ فَإِنَّهُ لَمْ يَخْفَ عَلَىَّ شَأْنُكُمُ اللَّيْلَةَ وَلَكِنِّي خَشِيتُ أَنْ تُفْرَضَ عَلَيْكُمْ صَلاَةُ اللَّيْلِ فَتَعْجِزُوا عَنْهَا \" ."
  },
  "762": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 762c\nIn-book reference  : Book 6, Hadith 215\nUSC-MSA web (English) reference  : Book 4, Hadith 1670\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ . نَحْوَهُ وَلَمْ يَذْكُرْ إِنَّمَا شَكَّ شُعْبَةُ . وَمَا بَعْدَهُ ."
  },
  "763": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 763o\nIn-book reference  : Book 6, Hadith 230\nUSC-MSA web (English) reference  : Book 4, Hadith 1685\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بِتُّ عِنْدَ خَالَتِي مَيْمُونَةَ . نَحْوَ حَدِيثِ ابْنِ جُرَيْجٍ وَقَيْسِ بْنِ سَعْدٍ ."
  },
  "764": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 764\nIn-book reference  : Book 6, Hadith 231\nUSC-MSA web (English) reference  : Book 4, Hadith 1686\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي جَمْرَةَ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي مِنَ اللَّيْلِ ثَلاَثَ عَشْرَةَ رَكْعَةً ."
  },
  "765": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 765\nIn-book reference  : Book 6, Hadith 232\nUSC-MSA web (English) reference  : Book 4, Hadith 1687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ أَبِيهِ، أَنَّ عَبْدَ اللَّهِ بْنَ قَيْسِ بْنِ مَخْرَمَةَ، أَخْبَرَهُ عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، أَنَّهُ قَالَ لأَرْمُقَنَّ صَلاَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّيْلَةَ فَصَلَّى . رَكْعَتَيْنِ خَفِيفَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا ثُمَّ أَوْتَرَ فَذَلِكَ ثَلاَثَ عَشْرَةَ رَكْعَةً ."
  },
  "766": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 766\nIn-book reference  : Book 6, Hadith 233\nUSC-MSA web (English) reference  : Book 4, Hadith 1688\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرٍ الْمَدَائِنِيُّ أَبُو جَعْفَرٍ، حَدَّثَنَا وَرْقَاءُ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كُنْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي سَفَرٍ فَانْتَهَيْنَا إِلَى مَشْرَعَةٍ فَقَالَ \" أَلاَ تُشْرِعُ يَا جَابِرُ \" . قُلْتُ بَلَى - قَالَ - فَنَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَشْرَعْتُ - قَالَ - ثُمَّ ذَهَبَ لِحَاجَتِهِ وَوَضَعْتُ لَهُ وَضُوءًا - قَالَ - فَجَاءَ فَتَوَضَّأَ ثُمَّ قَامَ فَصَلَّى فِي ثَوْبٍ وَاحِدٍ خَالَفَ بَيْنَ طَرَفَيْهِ فَقُمْتُ خَلْفَهُ فَأَخَذَ بِأُذُنِي فَجَعَلَنِي عَنْ يَمِينِهِ ."
  },
  "767": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 767\nIn-book reference  : Book 6, Hadith 234\nUSC-MSA web (English) reference  : Book 4, Hadith 1689\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ جَمِيعًا عَنْ هُشَيْمٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا هُشَيْمٌ، - أَخْبَرَنَا أَبُو حُرَّةَ، عَنِ الْحَسَنِ، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا قَامَ مِنَ اللَّيْلِ لِيُصَلِّيَ افْتَتَحَ صَلاَتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ ."
  },
  "768": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 768\nIn-book reference  : Book 6, Hadith 235\nUSC-MSA web (English) reference  : Book 4, Hadith 1690\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ مُحَمَّدٍ، عَنْ أَبِي، هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَلْيَفْتَتِحْ صَلاَتَهُ بِرَكْعَتَيْنِ خَفِيفَتَيْنِ."
  },
  "769": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 769c\nIn-book reference  : Book 6, Hadith 238\nUSC-MSA web (English) reference  : Book 4, Hadith 1693\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا مَهْدِيٌّ، - وَهُوَ ابْنُ مَيْمُونٍ - حَدَّثَنَا عِمْرَانُ، الْقَصِيرُ عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ وَاللَّفْظُ قَرِيبٌ مِنْ أَلْفَاظِهِمْ ."
  },
  "770": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 770\nIn-book reference  : Book 6, Hadith 239\nUSC-MSA web (English) reference  : Book 4, Hadith 1694\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَأَبُو مَعْنٍ الرَّقَاشِيُّ قَالُوا حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، حَدَّثَنِي أَبُو سَلَمَةَ، بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ قَالَ سَأَلْتُ عَائِشَةَ أُمَّ الْمُؤْمِنِينَ بِأَىِّ شَىْءٍ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم يَفْتَتِحُ صَلاَتَهُ إِذَا قَامَ مِنَ اللَّيْلِ قَالَتْ كَانَ إِذَا قَامَ مِنَ اللَّيْلِ افْتَتَحَ صَلاَتَهُ \" اللَّهُمَّ رَبَّ جِبْرَائِيلَ وَمِيكَائِيلَ وَإِسْرَافِيلَ فَاطِرَ السَّمَوَاتِ وَالأَرْضِ عَالِمَ الْغَيْبِ وَالشَّهَادَةِ أَنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيمَا كَانُوا فِيهِ يَخْتَلِفُونَ اهْدِنِي لِمَا اخْتُلِفَ فِيهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِي مَنْ تَشَاءُ إِلَى صِرَاطٍ مُسْتَقِيمٍ \" ."
  },
  "771": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 771b\nIn-book reference  : Book 6, Hadith 241\nUSC-MSA web (English) reference  : Book 4, Hadith 1696\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ، إِبْرَاهِيمَ أَخْبَرَنَا أَبُو النَّضْرِ، قَالَ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي سَلَمَةَ، عَنْ عَمِّهِ، الْمَاجِشُونِ بْنِ أَبِي سَلَمَةَ عَنِ الأَعْرَجِ، بِهَذَا الإِسْنَادِ وَقَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا اسْتَفْتَحَ الصَّلاَةَ كَبَّرَ ثُمَّ قَالَ \" وَجَّهْتُ وَجْهِي \" . وَقَالَ \" وَأَنَا أَوَّلُ الْمُسْلِمِينَ \" . وَقَالَ وَإِذَا رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ قَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا وَلَكَ الْحَمْدُ \" . وَقَالَ \" وَصَوَّرَهُ فَأَحْسَنَ صُوَرَهُ \" . وَقَالَ وَإِذَا سَلَّمَ قَالَ \" اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ \" . إِلَى آخِرِ الْحَدِيثِ وَلَمْ يَقُلْ بَيْنَ التَّشَهُّدِ وَالتَّسْلِيمِ ."
  },
  "772": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 772\nIn-book reference  : Book 6, Hadith 242\nUSC-MSA web (English) reference  : Book 4, Hadith 1697\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، كُلُّهُمْ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنِ الْمُسْتَوْرِدِ بْنِ الأَحْنَفِ، عَنْ صِلَةَ بْنِ زُفَرَ، عَنْ حُذَيْفَةَ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ فَافْتَتَحَ الْبَقَرَةَ فَقُلْتُ يَرْكَعُ عِنْدَ الْمِائَةِ . ثُمَّ مَضَى فَقُلْتُ يُصَلِّي بِهَا فِي رَكْعَةٍ فَمَضَى فَقُلْتُ يَرْكَعُ بِهَا . ثُمَّ افْتَتَحَ النِّسَاءَ فَقَرَأَهَا ثُمَّ افْتَتَحَ آلَ عِمْرَانَ فَقَرَأَهَا يَقْرَأُ مُتَرَسِّلاً إِذَا مَرَّ بِآيَةٍ فِيهَا تَسْبِيحٌ سَبَّحَ وَإِذَا مَرَّ بِسُؤَالٍ سَأَلَ وَإِذَا مَرَّ بِتَعَوُّذٍ تَعَوَّذَ ثُمَّ رَكَعَ فَجَعَلَ يَقُولُ \" سُبْحَانَ رَبِّيَ الْعَظِيمِ \" . فَكَانَ رُكُوعُهُ نَحْوًا مِنْ قِيَامِهِ ثُمَّ قَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ \" . ثُمَّ قَامَ طَوِيلاً قَرِيبًا مِمَّا رَكَعَ ثُمَّ سَجَدَ فَقَالَ \" سُبْحَانَ رَبِّيَ الأَعْلَى \" . فَكَانَ سُجُودُهُ قَرِيبًا مِنْ قِيَامِهِ . قَالَ وَفِي حَدِيثِ جَرِيرٍ مِنَ الزِّيَادَةِ فَقَالَ \" سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ\" ."
  },
  "773": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 773b\nIn-book reference  : Book 6, Hadith 244\nUSC-MSA web (English) reference  : Book 4, Hadith 1699\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ إِسْمَاعِيلُ بْنُ الْخَلِيلِ، وَسُوَيْدُ بْنُ سَعِيدٍ، عَنْ عَلِيِّ بْنِ مُسْهِرٍ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "774": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 774\nIn-book reference  : Book 6, Hadith 245\nUSC-MSA web (English) reference  : Book 4, Hadith 1700\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ، قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، قَالَ ذُكِرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلٌ نَامَ لَيْلَةً حَتَّى أَصْبَحَ قَالَ \" ذَاكَ رَجُلٌ بَالَ الشَّيْطَانُ فِي أُذُنَيْهِ \" . أَوْ قَالَ \" فِي أُذُنِهِ \" ."
  },
  "775": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 775\nIn-book reference  : Book 6, Hadith 246\nUSC-MSA web (English) reference  : Book 4, Hadith 1701\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ عَلِيِّ بْنِ حُسَيْنٍ، أَنَّ الْحُسَيْنَ بْنَ عَلِيٍّ، حَدَّثَهُ عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم طَرَقَهُ وَفَاطِمَةَ فَقَالَ \" أَلاَ تُصَلُّونَ \" . فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا أَنْفُسُنَا بِيَدِ اللَّهِ فَإِذَا شَاءَ أَنْ يَبْعَثَنَا بَعَثَنَا . فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ قُلْتُ لَهُ ذَلِكَ ثُمَّ سَمِعْتُهُ وَهُوَ مُدْبِرٌ يَضْرِبُ فَخِذَهُ وَيَقُولُ \" وَكَانَ الإِنْسَانُ أَكْثَرَ شَىْءٍ جَدَلاً \" ."
  },
  "776": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 776\nIn-book reference  : Book 6, Hadith 247\nUSC-MSA web (English) reference  : Book 4, Hadith 1702\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالَ عَمْرٌو حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم \" يَعْقِدُ الشَّيْطَانُ عَلَى قَافِيَةِ رَأْسِ أَحَدِكُمْ ثَلاَثَ عُقَدٍ إِذَا نَامَ بِكُلِّ عُقْدَةٍ يَضْرِبُ عَلَيْكَ لَيْلاً طَوِيلاً فَإِذَا اسْتَيْقَظَ فَذَكَرَ اللَّهَ انْحَلَّتْ عُقْدَةٌ وَإِذَا تَوَضَّأَ انْحَلَّتْ عُقْدَتَانِ فَإِذَا صَلَّى انْحَلَّتِ الْعُقَدُ فَأَصْبَحَ نَشِيطًا طَيِّبَ النَّفْسِ وَإِلاَّ أَصْبَحَ خَبِيثَ النَّفْسِ كَسْلاَنَ \" ."
  },
  "777": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 777b\nIn-book reference  : Book 6, Hadith 249\nUSC-MSA web (English) reference  : Book 4, Hadith 1704\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، أَخْبَرَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" صَلُّوا فِي بُيُوتِكُمْ وَلاَ تَتَّخِذُوهَا قُبُورًا \" ."
  },
  "778": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 778\nIn-book reference  : Book 6, Hadith 250\nUSC-MSA web (English) reference  : Book 4, Hadith 1705\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا قَضَى أَحَدُكُمُ الصَّلاَةَ فِي مَسْجِدِهِ فَلْيَجْعَلْ لِبَيْتِهِ نَصِيبًا مِنْ صَلاَتِهِ فَإِنَّ اللَّهَ جَاعِلٌ فِي بَيْتِهِ مِنْ صَلاَتِهِ خَيْرًا \" ."
  },
  "779": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 779\nIn-book reference  : Book 6, Hadith 251\nUSC-MSA web (English) reference  : Book 4, Hadith 1706\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَثَلُ الْبَيْتِ الَّذِي يُذْكَرُ اللَّهُ فِيهِ وَالْبَيْتِ الَّذِي لاَ يُذْكَرُ اللَّهُ فِيهِ مَثَلُ الْحَىِّ وَالْمَيِّتِ \" ."
  },
  "780": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 780\nIn-book reference  : Book 6, Hadith 252\nUSC-MSA web (English) reference  : Book 4, Hadith 1707\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ تَجْعَلُوا بُيُوتَكُمْ مَقَابِرَ إِنَّ الشَّيْطَانَ يَنْفِرُ مِنَ الْبَيْتِ الَّذِي تُقْرَأُ فِيهِ سُورَةُ الْبَقَرَةِ \" ."
  },
  "781": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 781b\nIn-book reference  : Book 6, Hadith 254\nUSC-MSA web (English) reference  : Book 4, Hadith 1709\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، قَالَ سَمِعْتُ أَبَا النَّضْرِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم اتَّخَذَ حُجْرَةً فِي الْمَسْجِدِ مِنْ حَصِيرٍ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهَا لَيَالِيَ حَتَّى اجْتَمَعَ إِلَيْهِ نَاسٌ . فَذَكَرَ نَحْوَهُ وَزَادَ فِيهِ \" وَلَوْ كُتِبَ عَلَيْكُمْ مَا قُمْتُمْ بِهِ \" ."
  },
  "782": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 782b\nIn-book reference  : Book 6, Hadith 256\nUSC-MSA web (English) reference  : Book 4, Hadith 1711\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، أَنَّهُ سَمِعَ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ أَىُّ الْعَمَلِ أَحَبُّ إِلَى اللَّهِ قَالَ \" أَدْوَمُهُ وَإِنْ قَلَّ \" ."
  },
  "783": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 783b\nIn-book reference  : Book 6, Hadith 258\nUSC-MSA web (English) reference  : Book 4, Hadith 1713\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سَعْدُ بْنُ سَعِيدٍ، أَخْبَرَنِي الْقَاسِمُ بْنُ مُحَمَّدٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَحَبُّ الأَعْمَالِ إِلَى اللَّهِ تَعَالَى أَدْوَمُهَا وَإِنْ قَلَّ \" . قَالَ وَكَانَتْ عَائِشَةُ إِذَا عَمِلَتِ الْعَمَلَ لَزِمَتْهُ ."
  },
  "784": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 784b\nIn-book reference  : Book 6, Hadith 260\nUSC-MSA web (English) reference  : Book 4, Hadith 1715\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ."
  },
  "785": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 785b\nIn-book reference  : Book 6, Hadith 262\nUSC-MSA web (English) reference  : Book 4, Hadith 1717\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ، عُرْوَةَ ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ هِشَامٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَعِنْدِي امْرَأَةٌ فَقَالَ \" مَنْ هَذِهِ \" . فَقُلْتُ امْرَأَةٌ لاَ تَنَامُ تُصَلِّي . قَالَ \" عَلَيْكُمْ مِنَ الْعَمَلِ مَا تُطِيقُونَ فَوَاللَّهِ لاَ يَمَلُّ اللَّهُ حَتَّى تَمَلُّوا \" . وَكَانَ أَحَبَّ الدِّينِ إِلَيْهِ مَا دَاوَمَ عَلَيْهِ صَاحِبُهُ وَفِي حَدِيثِ أَبِي أُسَامَةَ أَنَّهَا امْرَأَةٌ مِنْ بَنِي أَسَدٍ ."
  },
  "786": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 786\nIn-book reference  : Book 6, Hadith 263\nUSC-MSA web (English) reference  : Book 4, Hadith 1718\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، جَمِيعًا عَنْ هِشَامِ بْنِ عُرْوَةَ، ح وَحَدَّثَنَا قُتَيْبَةُ، بْنُ سَعِيدٍ - وَاللَّفْظُ لَهُ - عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" إِذَا نَعَسَ أَحَدُكُمْ فِي الصَّلاَةِ فَلْيَرْقُدْ حَتَّى يَذْهَبَ عَنْهُ النَّوْمُ فَإِنَّ أَحَدَكُمْ إِذَا صَلَّى وَهُوَ نَاعِسٌ لَعَلَّهُ يَذْهَبُ يَسْتَغْفِرُ فَيَسُبُّ نَفْسَهُ \" ."
  },
  "787": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 787\nIn-book reference  : Book 6, Hadith 264\nUSC-MSA web (English) reference  : Book 4, Hadith 1719\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا قَامَ أَحَدُكُمْ مِنَ اللَّيْلِ فَاسْتَعْجَمَ الْقُرْآنُ عَلَى لِسَانِهِ فَلَمْ يَدْرِ مَا يَقُولُ فَلْيَضْطَجِعْ \" ."
  },
  "788": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 788b\nIn-book reference  : Book 6, Hadith 266\nUSC-MSA web (English) reference  : Book 4, Hadith 1721\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ، وَأَبُو مُعَاوِيَةَ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَسْتَمِعُ قِرَاءَةَ رَجُلٍ فِي الْمَسْجِدِ . فَقَالَ \" رَحِمَهُ اللَّهُ لَقَدْ أَذْكَرَنِي آيَةً كُنْتُ أُنْسِيتُهَا \" ."
  },
  "789": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 789b\nIn-book reference  : Book 6, Hadith 268\nUSC-MSA web (English) reference  : Book 4, Hadith 1723\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى، وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي كُلُّهُمْ، عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ الْمُسَيَّبِيُّ حَدَّثَنَا أَنَسٌ، - يَعْنِي ابْنَ عِيَاضٍ - جَمِيعًا عَنْ مُوسَى بْنِ عُقْبَةَ، كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ . بِمَعْنَى حَدِيثِ مَالِكٍ وَزَادَ فِي حَدِيثِ مُوسَى بْنِ عُقْبَةَ \" وَإِذَا قَامَ صَاحِبُ الْقُرْآنِ فَقَرَأَهُ بِاللَّيْلِ وَالنَّهَارِ ذَكَرَهُ وَإِذَا لَمْ يَقُمْ بِهِ نَسِيَهُ \""
  },
  "790": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 790c\nIn-book reference  : Book 6, Hadith 271\nUSC-MSA web (English) reference  : Book 4, Hadith 1726\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي عَبْدَةُ، بْنُ أَبِي لُبَابَةَ عَنْ شَقِيقِ بْنِ سَلَمَةَ، قَالَ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" بِئْسَمَا لِلرَّجُلِ أَنْ يَقُولَ نَسِيتُ سُورَةَ كَيْتَ وَكَيْتَ أَوْ نَسِيتُ آيَةَ كَيْتَ وَكَيْتَ بَلْ هُوَ نُسِّيَ \" ."
  },
  "791": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 791\nIn-book reference  : Book 6, Hadith 272\nUSC-MSA web (English) reference  : Book 4, Hadith 1727\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" تَعَاهَدُوا هَذَا الْقُرْآنَ فَوَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَهُوَ أَشَدُّ تَفَلُّتًا مِنَ الإِبِلِ فِي عُقُلِهَا \" . وَلَفْظُ الْحَدِيثِ لاِبْنِ بَرَّادٍ."
  },
  "792": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 792c\nIn-book reference  : Book 6, Hadith 275\nUSC-MSA web (English) reference  : Book 4, Hadith 1730\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي بِشْرُ بْنُ الْحَكَمِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ الْهَادِ - عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَا أَذِنَ اللَّهُ لِشَىْءٍ مَا أَذِنَ لِنَبِيٍّ حَسَنِ الصَّوْتِ يَتَغَنَّى بِالْقُرْآنِ يَجْهَرُ بِهِ \" ."
  },
  "793": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 793e\nIn-book reference  : Book 6, Hadith 280\nUSC-MSA web (English) reference  : Book 4, Hadith 1735\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا طَلْحَةُ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَبِي مُوسَى \" لَوْ رَأَيْتَنِي وَأَنَا أَسْتَمِعُ لِقِرَاءَتِكَ الْبَارِحَةَ لَقَدْ أُوتِيتَ مِزْمَارًا مِنْ مَزَامِيرِ آلِ دَاوُدَ \" ."
  },
  "794": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 794c\nIn-book reference  : Book 6, Hadith 283\nUSC-MSA web (English) reference  : Book 4, Hadith 1738\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ح وَحَدَّثَنَا عُبَيْدُ، اللَّهِ بْنُ مُعَاذٍ حَدَّثَنَا أَبِي قَالاَ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ نَحْوَهُ وَفِي حَدِيثِ خَالِدِ بْنِ الْحَارِثِ قَالَ عَلَى رَاحِلَةٍ يَسِيرُ وَهُوَ يَقْرَأُ سُورَةَ الْفَتْحِ ."
  },
  "795": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 795c\nIn-book reference  : Book 6, Hadith 286\nUSC-MSA web (English) reference  : Book 4, Hadith 1741\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، وَأَبُو دَاوُدَ قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ . فَذَكَرَا نَحْوَهُ غَيْرَ أَنَّهُمَا قَالاَ تَنْقُزُ ."
  },
  "796": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 796\nIn-book reference  : Book 6, Hadith 287\nUSC-MSA web (English) reference  : Book 4, Hadith 1742\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَحَجَّاجُ بْنُ الشَّاعِرِ، - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، حَدَّثَنَا يَزِيدُ بْنُ الْهَادِ، أَنَّ عَبْدَ اللَّهِ بْنَ خَبَّابٍ، حَدَّثَهُ أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ حَدَّثَهُ أَنَّ أُسَيْدَ بْنَ حُضَيْرٍ بَيْنَمَا هُوَ لَيْلَةً يَقْرَأُ فِي مِرْبَدِهِ إِذْ جَالَتْ فَرَسُهُ فَقَرَأَ ثُمَّ جَالَتْ أُخْرَى فَقَرَأَ ثُمَّ جَالَتْ أَيْضًا قَالَ أُسَيْدٌ فَخَشِيتُ أَنْ تَطَأَ يَحْيَى فَقُمْتُ إِلَيْهَا فَإِذَا مِثْلُ الظُّلَّةِ فَوْقَ رَأْسِي فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا - قَالَ - فَغَدَوْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ بَيْنَمَا أَنَا الْبَارِحَةَ مِنْ جَوْفِ اللَّيْلِ أَقْرَأُ فِي مِرْبَدِي إِذْ جَالَتْ فَرَسِي . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اقْرَإِ ابْنَ حُضَيْرٍ \" . قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اقْرَإِ ابْنَ حُضَيْرٍ \" . قَالَ فَقَرَأْتُ ثُمَّ جَالَتْ أَيْضًا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اقْرَإِ ابْنَ حُضَيْرٍ \" . قَالَ فَانْصَرَفْتُ . وَكَانَ يَحْيَى قَرِيبًا مِنْهَا خَشِيتُ أَنْ تَطَأَهُ فَرَأَيْتُ مِثْلَ الظُّلَّةِ فِيهَا أَمْثَالُ السُّرُجِ عَرَجَتْ فِي الْجَوِّ حَتَّى مَا أَرَاهَا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تِلْكَ الْمَلاَئِكَةُ كَانَتْ تَسْتَمِعُ لَكَ وَلَوْ قَرَأْتَ لأَصْبَحَتْ يَرَاهَا النَّاسُ مَا تَسْتَتِرُ مِنْهُمْ \" ."
  },
  "797": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 797b\nIn-book reference  : Book 6, Hadith 289\nUSC-MSA web (English) reference  : Book 4, Hadith 1744\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا هَمَّامٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، بْنُ سَعِيدٍ عَنْ شُعْبَةَ، كِلاَهُمَا عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ هَمَّامٍ بَدَلَ الْمُنَافِقِ الْفَاجِرِ ."
  },
  "798": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 798b\nIn-book reference  : Book 6, Hadith 291\nUSC-MSA web (English) reference  : Book 4, Hadith 1746\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ سَعِيدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ، بْنُ أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ الدَّسْتَوَائِيِّ، كِلاَهُمَا عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ . وَقَالَ فِي حَدِيثِ وَكِيعٍ \" وَالَّذِي يَقْرَأُ وَهُوَ يَشْتَدُّ عَلَيْهِ لَهُ أَجْرَانِ \" ."
  },
  "799": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 799c\nIn-book reference  : Book 6, Hadith 294\nUSC-MSA web (English) reference  : Book 4, Hadith 1749\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأُبَىٍّ بِمِثْلِهِ ."
  },
  "800": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 800c\nIn-book reference  : Book 6, Hadith 297\nUSC-MSA web (English) reference  : Book 4, Hadith 1752\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي مِسْعَرٌ، - وَقَالَ أَبُو كُرَيْبٍ عَنْ مِسْعَرٍ، - عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ إِبْرَاهِيمَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم لِعَبْدِ اللَّهِ بْنِ مَسْعُودٍ \" اقْرَأْ عَلَىَّ \" . قَالَ أَقْرَأُ عَلَيْكَ وَعَلَيْكَ أُنْزِلَ قَالَ \" إِنِّي أُحِبُّ أَنْ أَسْمَعَهُ مِنْ غَيْرِي \" قَالَ فَقَرَأَ عَلَيْهِ مِنْ أَوَّلِ سُورَةِ النِّسَاءِ إِلَى قَوْلِهِ { فَكَيْفَ إِذَا جِئْنَا مِنْ كُلِّ أُمَّةٍ بِشَهِيدٍ وَجِئْنَا بِكَ عَلَى هَؤُلاَءِ شَهِيدًا} فَبَكَى . قَالَ مِسْعَرٌ فَحَدَّثَنِي مَعْنٌ عَنْ جَعْفَرِ بْنِ عَمْرِو بْنِ حُرَيْثٍ عَنْ أَبِيهِ عَنِ ابْنِ مَسْعُودٍ قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم \" شَهِيدًا عَلَيْهِمْ مَا دُمْتُ فِيهِمْ أَوْ مَا كُنْتُ فِيهِمْ \" . شَكَّ مِسْعَرٌ ."
  },
  "801": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 801b\nIn-book reference  : Book 6, Hadith 299\nUSC-MSA web (English) reference  : Book 4, Hadith 1754\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . وَلَيْسَ فِي حَدِيثِ أَبِي مُعَاوِيَةَ فَقَالَ لِي \" أَحْسَنْتَ \" ."
  },
  "802": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 802\nIn-book reference  : Book 6, Hadith 300\nUSC-MSA web (English) reference  : Book 4, Hadith 1755\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ،عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلاَثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ \" . قُلْنَا نَعَمْ . قَالَ \" فَثَلاَثُ آيَاتٍ يَقْرَأُ بِهِنَّ أَحَدُكُمْ فِي صَلاَتِهِ خَيْرٌ لَهُ مِنْ ثَلاَثِ خَلِفَاتٍ عِظَامٍ سِمَانٍ \" ."
  },
  "803": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 803\nIn-book reference  : Book 6, Hadith 301\nUSC-MSA web (English) reference  : Book 4, Hadith 1756\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، عَنْ مُوسَى بْنِ عُلَىٍّ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَنَحْنُ فِي الصُّفَّةِ فَقَالَ \" أَيُّكُمْ يُحِبُّ أَنْ يَغْدُوَ كُلَّ يَوْمٍ إِلَى بُطْحَانَ أَوْ إِلَى الْعَقِيقِ فَيَأْتِيَ مِنْهُ بِنَاقَتَيْنِ كَوْمَاوَيْنِ فِي غَيْرِ إِثْمٍ وَلاَ قَطْعِ رَحِمٍ \" . فَقُلْنَا يَا رَسُولَ اللَّهِ نُحِبُّ ذَلِكَ . قَالَ \" أَفَلاَ يَغْدُو أَحَدُكُمْ إِلَى الْمَسْجِدِ فَيَعْلَمَ أَوْ يَقْرَأَ آيَتَيْنِ مِنْ كِتَابِ اللَّهِ عَزَّ وَجَلَّ خَيْرٌ لَهُ مِنْ نَاقَتَيْنِ وَثَلاَثٌ خَيْرٌ لَهُ مِنْ ثَلاَثٍ وَأَرْبَعٌ خَيْرٌ لَهُ مِنْ أَرْبَعٍ وَمِنْ أَعْدَادِهِنَّ مِنَ الإِبِلِ \" ."
  },
  "804": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 804b\nIn-book reference  : Book 6, Hadith 303\nUSC-MSA web (English) reference  : Book 4, Hadith 1758\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى، - يَعْنِي ابْنَ حَسَّانَ - حَدَّثَنَا مُعَاوِيَةُ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّهُ قَالَ \" وَكَأَنَّهُمَا \" . فِي كِلَيْهِمَا وَلَمْ يَذْكُرْ قَوْلَ مُعَاوِيَةَ بَلَغَنِي ."
  },
  "805": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 805\nIn-book reference  : Book 6, Hadith 304\nUSC-MSA web (English) reference  : Book 4, Hadith 1759\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا يَزِيدُ بْنُ عَبْدِ رَبِّهِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنْ مُحَمَّدِ بْنِ مُهَاجِرٍ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ الْجُرَشِيِّ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، قَالَ سَمِعْتُ النَّوَّاسَ، بْنَ سَمْعَانَ الْكِلاَبِيَّ يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" يُؤْتَى بِالْقُرْآنِ يَوْمَ الْقِيَامَةِ وَأَهْلِهِ الَّذِينَ كَانُوا يَعْمَلُونَ بِهِ تَقْدُمُهُ سُورَةُ الْبَقَرَةِ وَآلُ عِمْرَانَ \" . وَضَرَبَ لَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَةَ أَمْثَالٍ مَا نَسِيتُهُنَّ بَعْدُ قَالَ \" كَأَنَّهُمَا غَمَامَتَانِ أَوْ ظُلَّتَانِ سَوْدَاوَانِ بَيْنَهُمَا شَرْقٌ أَوْ كَأَنَّهُمَا حِزْقَانِ مِنْ طَيْرٍ صَوَافَّ تُحَاجَّانِ عَنْ صَاحِبِهِمَا"
  },
  "806": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 806\nIn-book reference  : Book 6, Hadith 305\nUSC-MSA web (English) reference  : Book 4, Hadith 1760\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا حَسَنُ بْنُ الرَّبِيعِ، وَأَحْمَدُ بْنُ جَوَّاسٍ الْحَنَفِيُّ، قَالاَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عِيسَى، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَيْنَمَا جِبْرِيلُ قَاعِدٌ عِنْدَ النَّبِيِّ صلى الله عليه وسلم سَمِعَ نَقِيضًا مِنْ فَوْقِهِ فَرَفَعَ رَأْسَهُ فَقَالَ هَذَا بَابٌ مِنَ السَّمَاءِ فُتِحَ الْيَوْمَ لَمْ يُفْتَحْ قَطُّ إِلاَّ الْيَوْمَ فَنَزَلَ مِنْهُ مَلَكٌ فَقَالَ هَذَا مَلَكٌ نَزَلَ إِلَى الأَرْضِ لَمْ يَنْزِلْ قَطُّ إِلاَّ الْيَوْمَ فَسَلَّمَ وَقَالَ أَبْشِرْ بِنُورَيْنِ أُوتِيتَهُمَا لَمْ يُؤْتَهُمَا نَبِيٌّ قَبْلَكَ فَاتِحَةُ الْكِتَابِ وَخَوَاتِيمُ سُورَةِ الْبَقَرَةِ لَنْ تَقْرَأَ بِحَرْفٍ مِنْهُمَا إِلاَّ أُعْطِيتَهُ ."
  },
  "807": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 807b\nIn-book reference  : Book 6, Hadith 307\nUSC-MSA web (English) reference  : Book 4, Hadith 1762\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِهَذَا الإِسْنَادِ ."
  },
  "808": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 808c\nIn-book reference  : Book 6, Hadith 310\nUSC-MSA web (English) reference  : Book 4, Hadith 1765\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ أَبِي مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَهُ ."
  },
  "809": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 809b\nIn-book reference  : Book 6, Hadith 312\nUSC-MSA web (English) reference  : Book 4, Hadith 1767\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا هَمَّامٌ، جَمِيعًا عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ قَالَ شُعْبَةُ مِنْ آخِرِ الْكَهْفِ . وَقَالَ هَمَّامٌ مِنْ أَوَّلِ الْكَهْفِ كَمَا قَالَ هِشَامٌ."
  },
  "810": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 810\nIn-book reference  : Book 6, Hadith 313\nUSC-MSA web (English) reference  : Book 4, Hadith 1768\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي السَّلِيلِ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ الأَنْصَارِيِّ، عَنْ أُبَىِّ بْنِ كَعْبٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَىُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ \" . قَالَ قُلْتُ اللَّهُ وَرَسُولُهُ أَعْلَمُ . قَالَ \" يَا أَبَا الْمُنْذِرِ أَتَدْرِي أَىُّ آيَةٍ مِنْ كِتَابِ اللَّهِ مَعَكَ أَعْظَمُ \" . قَالَ قُلْتُ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَىُّ الْقَيُّومُ . قَالَ فَضَرَبَ فِي صَدْرِي وَقَالَ \" وَاللَّهِ لِيَهْنِكَ الْعِلْمُ أَبَا الْمُنْذِرِ \" ."
  },
  "811": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 811b\nIn-book reference  : Book 6, Hadith 315\nUSC-MSA web (English) reference  : Book 4, Hadith 1770\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُحَمَّدُ بْنُ بَكْرٍ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانٌ الْعَطَّارُ، جَمِيعًا عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِهِمَا مِنْ قَوْلِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ اللَّهَ جَزَّأَ الْقُرْآنَ ثَلاَثَةَ أَجْزَاءٍ فَجَعَلَ قُلْ هُوَ اللَّهُ أَحَدٌ جُزْءًا مِنْ أَجْزَاءِ الْقُرْآنِ \" ."
  },
  "812": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 812b\nIn-book reference  : Book 6, Hadith 317\nUSC-MSA web (English) reference  : Book 4, Hadith 1772\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ بَشِيرٍ أَبِي إِسْمَاعِيلَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" أَقْرَأُ عَلَيْكُمْ ثُلُثَ الْقُرْآنِ \" . فَقَرَأَ { قُلْ هُوَ اللَّهُ أَحَدٌ * اللَّهُ الصَّمَدُ} حَتَّى خَتَمَهَا ."
  },
  "813": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 813\nIn-book reference  : Book 6, Hadith 318\nUSC-MSA web (English) reference  : Book 4, Hadith 1773\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، عَنْ سَعِيدِ بْنِ أَبِي هِلاَلٍ، أَنَّ أَبَا الرِّجَالِ، مُحَمَّدَ بْنَ عَبْدِ الرَّحْمَنِ حَدَّثَهُ عَنْ أُمِّهِ، عَمْرَةَ بِنْتِ عَبْدِ الرَّحْمَنِ وَكَانَتْ فِي حَجْرِ عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم عَنْ عَائِشَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ رَجُلاً عَلَى سَرِيَّةٍ وَكَانَ يَقْرَأُ لأَصْحَابِهِ فِي صَلاَتِهِمْ فَيَخْتِمُ بِـ { قُلْ هُوَ اللَّهُ أَحَدٌ} فَلَمَّا رَجَعُوا ذُكِرَ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" سَلُوهُ لأَىِّ شَىْءٍ يَصْنَعُ ذَلِكَ \" . فَسَأَلُوهُ فَقَالَ لأَنَّهَا صِفَةُ الرَّحْمَنِ فَأَنَا أُحِبُّ أَنْ أَقْرَأَ بِهَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَخْبِرُوهُ أَنَّ اللَّهَ يُحِبُّهُ \"."
  },
  "814": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 814c\nIn-book reference  : Book 6, Hadith 321\nUSC-MSA web (English) reference  : Book 4, Hadith 1776\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كِلاَهُمَا عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ مِثْلَهُ . وَفِي رِوَايَةِ أَبِي أُسَامَةَ عَنْ عُقْبَةَ، بْنِ عَامِرٍ الْجُهَنِيِّ وَكَانَ مِنْ رُفَعَاءِ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم ."
  },
  "815": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 815b\nIn-book reference  : Book 6, Hadith 323\nUSC-MSA web (English) reference  : Book 4, Hadith 1778\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ حَسَدَ إِلاَّ عَلَى اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ هَذَا الْكِتَابَ فَقَامَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ وَرَجُلٌ آتَاهُ اللَّهُ مَالاً فَتَصَدَّقَ بِهِ آنَاءَ اللَّيْلِ وَآنَاءَ النَّهَارِ \" ."
  },
  "816": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 816\nIn-book reference  : Book 6, Hadith 324\nUSC-MSA web (English) reference  : Book 4, Hadith 1779\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مَسْعُودٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ حَسَدَ إِلاَّ فِي اثْنَتَيْنِ رَجُلٌ آتَاهُ اللَّهُ مَالاً فَسَلَّطَهُ عَلَى هَلَكَتِهِ فِي الْحَقِّ وَرَجُلٌ آتَاهُ اللَّهُ حِكْمَةً فَهُوَ يَقْضِي بِهَا وَيُعَلِّمُهَا \" ."
  },
  "817": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 817b\nIn-book reference  : Book 6, Hadith 326\nUSC-MSA web (English) reference  : Book 4, Hadith 1781\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي عَامِرُ بْنُ وَاثِلَةَ اللَّيْثِيُّ، أَنَّ نَافِعَ بْنَ، عَبْدِ الْحَارِثِ الْخُزَاعِيَّ لَقِيَ عُمَرَ بْنَ الْخَطَّابِ بِعُسْفَانَ . بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنِ الزُّهْرِيِّ، ."
  },
  "818": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 818c\nIn-book reference  : Book 6, Hadith 329\nUSC-MSA web (English) reference  : Book 4, Hadith 1784\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، كَرِوَايَةِ يُونُسَ بِإِسْنَادِهِ ."
  },
  "819": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 819b\nIn-book reference  : Book 6, Hadith 331\nUSC-MSA web (English) reference  : Book 4, Hadith 1786\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ."
  },
  "820": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 820b\nIn-book reference  : Book 6, Hadith 333\nUSC-MSA web (English) reference  : Book 4, Hadith 1788\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنِي إِسْمَاعِيلُ بْنُ أَبِي، خَالِدٍ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عِيسَى، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، أَخْبَرَنِي أُبَىُّ بْنُ كَعْبٍ، أَنَّهُ كَانَ جَالِسًا فِي الْمَسْجِدِ إِذْ دَخَلَ رَجُلٌ فَصَلَّى فَقَرَأَ قِرَاءَةً وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ ."
  },
  "821": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 821b\nIn-book reference  : Book 6, Hadith 335\nUSC-MSA web (English) reference  : Book 4, Hadith 1790\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "822": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 822f\nIn-book reference  : Book 6, Hadith 341\nUSC-MSA web (English) reference  : Book 4, Hadith 1796\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، أَنَّهُ سَمِعَ أَبَا وَائِلٍ، يُحَدِّثُ أَنَّ رَجُلاً، جَاءَ إِلَى ابْنِ مَسْعُودٍ فَقَالَ إِنِّي قَرَأْتُ الْمُفَصَّلَ اللَّيْلَةَ كُلَّهُ فِي رَكْعَةٍ . فَقَالَ عَبْدُ اللَّهِ هَذًّا كَهَذِّ الشِّعْرِ فَقَالَ عَبْدُ اللَّهِ لَقَدْ عَرَفْتُ النَّظَائِرَ الَّتِي كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقْرُنُ بَيْنَهُنَّ - قَالَ - فَذَكَرَ عِشْرِينَ سُورَةً مِنَ الْمُفَصَّلِ سُورَتَيْنِ سُورَتَيْنِ فِي كُلِّ رَكْعَةٍ ."
  },
  "823": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 823b\nIn-book reference  : Book 6, Hadith 343\nUSC-MSA web (English) reference  : Book 4, Hadith 1798\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ كَانَ يَقْرَأُ هَذَا الْحَرْفَ \" فَهَلْ مِنْ مُدَّكِرٍ \" ."
  },
  "824": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 824d\nIn-book reference  : Book 6, Hadith 347\nUSC-MSA web (English) reference  : Book 4, Hadith 1802\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي عَبْدُ الأَعْلَى، حَدَّثَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنْ عَلْقَمَةَ، قَالَ أَتَيْتُ الشَّامَ فَلَقِيتُ أَبَا الدَّرْدَاءِ فَذَكَرَ بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ ."
  },
  "825": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 825\nIn-book reference  : Book 6, Hadith 348\nUSC-MSA web (English) reference  : Book 4, Hadith 1803\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الصَّلاَةِ بَعْدَ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَعَنِ الصَّلاَةِ بَعْدَ الصُّبْحِ حَتَّى تَطْلُعَ الشَّمْسُ ."
  },
  "826": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 826b\nIn-book reference  : Book 6, Hadith 350\nUSC-MSA web (English) reference  : Book 4, Hadith 1804\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي أَبُو غَسَّانَ، الْمِسْمَعِيُّ حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا مُعَاذُ، بْنُ هِشَامٍ حَدَّثَنِي أَبِي كُلُّهُمْ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِ سَعِيدٍ وَهِشَامٍ بَعْدَ الصُّبْحِ حَتَّى تَشْرُقَ الشَّمْسُ ."
  },
  "827": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 827\nIn-book reference  : Book 6, Hadith 351\nUSC-MSA web (English) reference  : Book 4, Hadith 1805\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ قَالَ أَخْبَرَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ صَلاَةَ بَعْدَ صَلاَةِ الْعَصْرِ حَتَّى تَغْرُبَ الشَّمْسُ وَلاَ صَلاَةَ بَعْدَ صَلاَةِ الْفَجْرِ حَتَّى تَطْلُعَ الشَّمْسُ \" ."
  },
  "828": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 828b\nIn-book reference  : Book 6, Hadith 353\nUSC-MSA web (English) reference  : Book 4, Hadith 1807\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ، نُمَيْرٍ حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ بِشْرٍ، قَالاَ جَمِيعًا حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَحَرَّوْا بِصَلاَتِكُمْ طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا فَإِنَّهَا تَطْلُعُ بِقَرْنَىْ شَيْطَانٍ \" ."
  },
  "829": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 829\nIn-book reference  : Book 6, Hadith 354\nUSC-MSA web (English) reference  : Book 4, Hadith 1808\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ، نُمَيْرٍ حَدَّثَنَا أَبِي وَابْنُ، بِشْرٍ قَالُوا جَمِيعًا حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا بَدَا حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَبْرُزَ وَإِذَا غَابَ حَاجِبُ الشَّمْسِ فَأَخِّرُوا الصَّلاَةَ حَتَّى تَغِيبَ \" ."
  },
  "830": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 830b\nIn-book reference  : Book 6, Hadith 356\nUSC-MSA web (English) reference  : Book 4, Hadith 1810\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ خَيْرِ بْنِ نُعَيْمٍ الْحَضْرَمِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ هُبَيْرَةَ السَّبَائِيِّ، - وَكَانَ ثِقَةً - عَنْ أَبِي تَمِيمٍ الْجَيْشَانِيِّ، عَنْ أَبِي بَصْرَةَ الْغِفَارِيِّ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم الْعَصْرَ . بِمِثْلِهِ ."
  },
  "831": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 831\nIn-book reference  : Book 6, Hadith 357\nUSC-MSA web (English) reference  : Book 4, Hadith 1811\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ مُوسَى بْنِ عُلَىٍّ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ الْجُهَنِيَّ، يَقُولُ ثَلاَثُ سَاعَاتٍ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَنْهَانَا أَنْ نُصَلِّيَ فِيهِنَّ أَوْ أَنْ نَقْبُرَ فِيهِنَّ مَوْتَانَا حِينَ تَطْلُعُ الشَّمْسُ بَازِغَةً حَتَّى تَرْتَفِعَ وَحِينَ يَقُومُ قَائِمُ الظَّهِيرَةِ حَتَّى تَمِيلَ الشَّمْسُ وَحِينَ تَضَيَّفُ الشَّمْسُ لِلْغُرُوبِ حَتَّى تَغْرُبَ ."
  },
  "832": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 832\nIn-book reference  : Book 6, Hadith 358\nUSC-MSA web (English) reference  : Book 4, Hadith 1812\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا شَدَّادُ بْنُ عَبْدِ اللَّهِ أَبُو عَمَّارٍ، وَيَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي أُمَامَةَ، - قَالَ عِكْرِمَةُ وَلَقِيَ شَدَّادٌ أَبَا أُمَامَةَ وَوَاثِلَةَ وَصَحِبَ أَنَسًا إِلَى الشَّامِ وَأَثْنَى عَلَيْهِ فَضْلاً وَخَيْرًا - عَنْ أَبِي أُمَامَةَ قَالَ قَالَ عَمْرُو بْنُ عَبَسَةَ السُّلَمِيُّ كُنْتُ وَأَنَا فِي الْجَاهِلِيَّةِ أَظُنُّ أَنَّ النَّاسَ عَلَى ضَلاَلَةٍ وَأَنَّهُمْ لَيْسُوا عَلَى شَىْءٍ وَهُمْ يَعْبُدُونَ الأَوْثَانَ فَسَمِعْتُ بِرَجُلٍ بِمَكَّةَ يُخْبِرُ أَخْبَارًا فَقَعَدْتُ عَلَى رَاحِلَتِي فَقَدِمْتُ عَلَيْهِ فَإِذَا رَسُولُ اللَّهِ صلى الله عليه وسلم مُسْتَخْفِيًا جُرَءَاءُ عَلَيْهِ قَوْمُهُ فَتَلَطَّفْتُ حَتَّى دَخَلْتُ عَلَيْهِ بِمَكَّةَ فَقُلْتُ لَهُ مَا أَنْتَ قَالَ \" أَنَا نَبِيٌّ \" . فَقُلْتُ وَمَا نَبِيٌّ قَالَ \" أَرْسَلَنِي اللَّهُ \" . فَقُلْتُ وَبِأَىِّ شَىْءٍ أَرْسَلَكَ قَالَ \" أَرْسَلَنِي بِصِلَةِ الأَرْحَامِ وَكَسْرِ الأَوْثَانِ وَأَنْ يُوَحَّدَ اللَّهُ لاَ يُشْرَكُ بِهِ شَىْءٌ \" . قُلْتُ لَهُ فَمَنْ مَعَكَ عَلَى هَذَا قَالَ \" حُرٌّ وَعَبْدٌ \" . قَالَ وَمَعَهُ يَوْمَئِذٍ أَبُو بَكْرٍ وَبِلاَلٌ مِمَّنْ آمَنَ بِهِ . فَقُلْتُ إِنِّي مُتَّبِعُكَ . قَالَ \" إِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ يَوْمَكَ هَذَا أَلاَ تَرَى حَالِي وَحَالَ النَّاسِ وَلَكِنِ ارْجِعْ إِلَى أَهْلِكَ فَإِذَا سَمِعْتَ بِي قَدْ ظَهَرْتُ فَأْتِنِي \" . قَالَ فَذَهَبْتُ إِلَى أَهْلِي وَقَدِمَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَكُنْتُ فِي أَهْلِي فَجَعَلْتُ أَتَخَبَّرُ الأَخْبَارَ وَأَسْأَلُ النَّاسَ حِينَ قَدِمَ الْمَدِينَةَ حَتَّى قَدِمَ عَلَىَّ نَفَرٌ مِنْ أَهْلِ يَثْرِبَ مِنْ أَهْلِ الْمَدِينَةِ فَقُلْتُ مَا فَعَلَ هَذَا الرَّجُلُ الَّذِي قَدِمَ الْمَدِينَةَ فَقَالُوا النَّاسُ إِلَيْهِ سِرَاعٌ وَقَدْ أَرَادَ قَوْمُهُ قَتْلَهُ فَلَمْ يَسْتَطِيعُوا ذَلِكَ . فَقَدِمْتُ الْمَدِينَةَ فَدَخَلْتُ عَلَيْهِ فَقُلْتُ يَا رَسُولَ اللَّهِ أَتَعْرِفُنِي قَالَ \" نَعَمْ أَنْتَ الَّذِي لَقِيتَنِي بِمَكَّةَ \" . قَالَ فَقُلْتُ بَلَى . فَقُلْتُ يَا نَبِيَّ اللَّهِ أَخْبِرْنِي عَمَّا عَلَّمَكَ اللَّهُ وَأَجْهَلُهُ . أَخْبِرْنِي عَنِ الصَّلاَةِ قَالَ \" صَلِّ صَلاَةَ الصُّبْحِ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ حَتَّى تَطْلُعَ الشَّمْسُ حَتَّى تَرْتَفِعَ فَإِنَّهَا تَطْلُعُ حِينَ تَطْلُعُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ ثُمَّ صَلِّ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى يَسْتَقِلَّ الظِّلُّ بِالرُّمْحِ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ فَإِنَّ حِينَئِذٍ تُسْجَرُ جَهَنَّمُ فَإِذَا أَقْبَلَ الْفَىْءُ فَصَلِّ فَإِنَّ الصَّلاَةَ مَشْهُودَةٌ مَحْضُورَةٌ حَتَّى تُصَلِّيَ الْعَصْرَ ثُمَّ أَقْصِرْ عَنِ الصَّلاَةِ حَتَّى تَغْرُبَ الشَّمْسُ فَإِنَّهَا تَغْرُبُ بَيْنَ قَرْنَىْ شَيْطَانٍ وَحِينَئِذٍ يَسْجُدُ لَهَا الْكُفَّارُ \" . قَالَ فَقُلْتُ يَا نَبِيَّ اللَّهِ فَالْوُضُوءُ حَدِّثْنِي عَنْهُ قَالَ \" مَا مِنْكُمْ رَجُلٌ يُقَرِّبُ وَضُوءَهُ فَيَتَمَضْمَضُ وَيَسْتَنْشِقُ فَيَنْتَثِرُ إِلاَّ خَرَّتْ خَطَايَا وَجْهِهِ وَفِيهِ وَخَيَاشِيمِهِ ثُمَّ إِذَا غَسَلَ وَجْهَهُ كَمَا أَمَرَهُ اللَّهُ إِلاَّ خَرَّتْ خَطَايَا وَجْهِهِ مِنْ أَطْرَافِ لِحْيَتِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ يَدَيْهِ إِلَى الْمِرْفَقَيْنِ إِلاَّ خَرَّتْ خَطَايَا يَدَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ ثُمَّ يَمْسَحُ رَأْسَهُ إِلاَّ خَرَّتْ خَطَايَا رَأْسِهِ مِنْ أَطْرَافِ شَعْرِهِ مَعَ الْمَاءِ ثُمَّ يَغْسِلُ قَدَمَيْهِ إِلَى الْكَعْبَيْنِ إِلاَّ خَرَّتْ خَطَايَا رِجْلَيْهِ مِنْ أَنَامِلِهِ مَعَ الْمَاءِ فَإِنْ هُوَ قَامَ فَصَلَّى فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَمَجَّدَهُ بِالَّذِي هُوَ لَهُ أَهْلٌ وَفَرَّغَ قَلْبَهُ لِلَّهِ إِلاَّ انْصَرَفَ مِنْ خَطِيئَتِهِ كَهَيْئَتِهِ يَوْمَ وَلَدَتْهُ أُمُّهُ \" . فَحَدَّثَ عَمْرُو بْنُ عَبَسَةَ بِهَذَا الْحَدِيثِ أَبَا أُمَامَةَ صَاحِبَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ أَبُو أُمَامَةَ يَا عَمْرَو بْنَ عَبَسَةَ انْظُرْ مَا تَقُولُ فِي مَقَامٍ وَاحِدٍ يُعْطَى هَذَا الرَّجُلُ فَقَالَ عَمْرٌو يَا أَبَا أُمَامَةَ لَقَدْ كَبِرَتْ سِنِّي وَرَقَّ عَظْمِي وَاقْتَرَبَ أَجَلِي وَمَا بِي حَاجَةٌ أَنْ أَكْذِبَ عَلَى اللَّهِ وَلاَ عَلَى رَسُولِ اللَّهِ لَوْ لَمْ أَسْمَعْهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلاَّ مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلاَثًا - حَتَّى عَدَّ سَبْعَ مَرَّاتٍ - مَا حَدَّثْتُ بِهِ أَبَدًا وَلَكِنِّي سَمِعْتُهُ أَكْثَرَ مِنْ ذَلِكَ ."
  },
  "833": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 833b\nIn-book reference  : Book 6, Hadith 360\nUSC-MSA web (English) reference  : Book 4, Hadith 1814\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ ابْنِ طَاوُسٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ لَمْ يَدَعْ رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ . قَالَ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَتَحَرَّوْا طُلُوعَ الشَّمْسِ وَلاَ غُرُوبَهَا فَتُصَلُّوا عِنْدَ ذَلِكَ \" ."
  },
  "834": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 834\nIn-book reference  : Book 6, Hadith 361\nUSC-MSA web (English) reference  : Book 4, Hadith 1815\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرٌو، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ بُكَيْرٍ، عَنْ كُرَيْبٍ، مَوْلَى ابْنِ عَبَّاسٍ أَنَّ عَبْدَ اللَّهِ بْنَ عَبَّاسٍ، وَعَبْدَ الرَّحْمَنِ، بْنَ أَزْهَرَ وَالْمِسْوَرَ بْنَ مَخْرَمَةَ أَرْسَلُوهُ إِلَى عَائِشَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا اقْرَأْ عَلَيْهَا السَّلاَمَ مِنَّا جَمِيعًا وَسَلْهَا عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ وَقُلْ إِنَّا أُخْبِرْنَا أَنَّكِ تُصَلِّينَهُمَا وَقَدْ بَلَغَنَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنْهُمَا . قَالَ ابْنُ عَبَّاسٍ وَكُنْتُ أَصْرِفُ مَعَ عُمَرَ بْنِ الْخَطَّابِ النَّاسَ عَنْهَا . قَالَ كُرَيْبٌ فَدَخَلْتُ عَلَيْهَا وَبَلَّغْتُهَا مَا أَرْسَلُونِي بِهِ . فَقَالَتْ سَلْ أُمَّ سَلَمَةَ . فَخَرَجْتُ إِلَيْهِمْ فَأَخْبَرْتُهُمْ بِقَوْلِهَا فَرَدُّونِي إِلَى أُمِّ سَلَمَةَ بِمِثْلِ مَا أَرْسَلُونِي بِهِ إِلَى عَائِشَةَ . فَقَالَتْ أُمُّ سَلَمَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَنْهَى عَنْهُمَا ثُمَّ رَأَيْتُهُ يُصَلِّيهِمَا أَمَّا حِينَ صَلاَّهُمَا فَإِنَّهُ صَلَّى الْعَصْرَ ثُمَّ دَخَلَ وَعِنْدِي نِسْوَةٌ مِنْ بَنِي حَرَامٍ مِنَ الأَنْصَارِ فَصَلاَّهُمَا فَأَرْسَلْتُ إِلَيْهِ الْجَارِيَةَ فَقُلْتُ قُومِي بِجَنْبِهِ فَقُولِي لَهُ تَقُولُ أُمُّ سَلَمَةَ يَا رَسُولَ اللَّهِ إِنِّي أَسْمَعُكَ تَنْهَى عَنْ هَاتَيْنِ الرَّكْعَتَيْنِ وَأَرَاكَ تُصَلِّيهِمَا فَإِنْ أَشَارَ بِيَدِهِ فَاسْتَأْخِرِي عَنْهُ - قَالَ - فَفَعَلَتِ الْجَارِيَةُ فَأَشَارَ بِيَدِهِ فَاسْتَأْخَرَتْ عَنْهُ فَلَمَّا انْصَرَفَ قَالَ \" يَا بِنْتَ أَبِي أُمَيَّةَ سَأَلْتِ عَنِ الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ إِنَّهُ أَتَانِي نَاسٌ مِنْ عَبْدِ الْقَيْسِ بِالإِسْلاَمِ مِنْ قَوْمِهِمْ فَشَغَلُونِي عَنِ الرَّكْعَتَيْنِ اللَّتَيْنِ بَعْدَ الظُّهْرِ فَهُمَا هَاتَانِ \" ."
  },
  "835": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 835d\nIn-book reference  : Book 6, Hadith 365\nUSC-MSA web (English) reference  : Book 4, Hadith 1819\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، وَمَسْرُوقٍ، قَالاَ نَشْهَدُ عَلَى عَائِشَةَ أَنَّهَا قَالَتْ مَا كَانَ يَوْمُهُ الَّذِي كَانَ يَكُونُ عِنْدِي إِلاَّ صَلاَّهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم فِي بَيْتِي . تَعْنِي الرَّكْعَتَيْنِ بَعْدَ الْعَصْرِ ."
  },
  "836": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 836\nIn-book reference  : Book 6, Hadith 366\nUSC-MSA web (English) reference  : Book 4, Hadith 1820\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنِ ابْنِ فُضَيْلٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، - عَنْ مُخْتَارِ بْنِ فُلْفُلٍ، قَالَ سَأَلْتُ أَنَسَ بْنَ مَالِكٍ عَنِ التَّطَوُّعِ، بَعْدَ الْعَصْرِ فَقَالَ كَانَ عُمَرُ يَضْرِبُ الأَيْدِي عَلَى صَلاَةٍ بَعْدَ الْعَصْرِ وَكُنَّا نُصَلِّي عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم رَكْعَتَيْنِ بَعْدَ غُرُوبِ الشَّمْسِ قَبْلَ صَلاَةِ الْمَغْرِبِ . فَقُلْتُ لَهُ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَّهُمَا قَالَ كَانَ يَرَانَا نُصَلِّيهِمَا . فَلَمْ يَأْمُرْنَا وَلَمْ يَنْهَنَا."
  },
  "837": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 837\nIn-book reference  : Book 6, Hadith 367\nUSC-MSA web (English) reference  : Book 4, Hadith 1821\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ صُهَيْبٍ - عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا بِالْمَدِينَةِ فَإِذَا أَذَّنَ الْمُؤَذِّنُ لِصَلاَةِ الْمَغْرِبِ ابْتَدَرُوا السَّوَارِيَ فَيَرْكَعُونَ رَكْعَتَيْنِ رَكْعَتَيْنِ حَتَّى إِنَّ الرَّجُلَ الْغَرِيبَ لَيَدْخُلُ الْمَسْجِدَ فَيَحْسِبُ أَنَّ الصَّلاَةَ قَدْ صُلِّيَتْ مِنْ كَثْرَةِ مَنْ يُصَلِّيهِمَا ."
  },
  "838": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 838b\nIn-book reference  : Book 6, Hadith 369\nUSC-MSA web (English) reference  : Book 4, Hadith 1823\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الأَعْلَى، عَنِ الْجُرَيْرِيِّ، عَنْ عَبْدِ اللَّهِ، بْنِ بُرَيْدَةَ عَنْ عَبْدِ اللَّهِ بْنِ مُغَفَّلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم . مِثْلَهُ إِلاَّ أَنَّهُ قَالَ فِي الرَّابِعَةِ \" لِمَنْ شَاءَ \" ."
  },
  "839": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 839c\nIn-book reference  : Book 6, Hadith 372\nUSC-MSA web (English) reference  : Book 4, Hadith 1825\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنْ مُوسَى بْنِ، عُقْبَةَ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْخَوْفِ فِي بَعْضِ أَيَّامِهِ فَقَامَتْ طَائِفَةٌ مَعَهُ وَطَائِفَةٌ بِإِزَاءِ الْعَدُوِّ فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ذَهَبُوا وَجَاءَ الآخَرُونَ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَضَتِ الطَّائِفَتَانِ رَكْعَةً رَكْعَةً - قَالَ - وَقَالَ ابْنُ عُمَرَ فَإِذَا كَانَ خَوْفٌ أَكْثَرَ مِنْ ذَلِكَ فَصَلِّ رَاكِبًا أَوْ قَائِمًا تُومِئُ إِيمَاءً ."
  },
  "840": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 840b\nIn-book reference  : Book 6, Hadith 374\nUSC-MSA web (English) reference  : Book 4, Hadith 1827\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ غَزَوْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَوْمًا مِنْ جُهَيْنَةَ فَقَاتَلُونَا قِتَالاً شَدِيدًا فَلَمَّا صَلَّيْنَا الظُّهْرَ قَالَ الْمُشْرِكُونَ لَوْ مِلْنَا عَلَيْهِمْ مَيْلَةً لاَقْتَطَعْنَاهُمْ . فَأَخْبَرَ جِبْرِيلُ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَلِكَ فَذَكَرَ ذَلِكَ لَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - وَقَالُوا إِنَّهُ سَتَأْتِيهِمْ صَلاَةٌ هِيَ أَحَبُّ إِلَيْهِمْ مِنَ الأَوْلاَدِ فَلَمَّا حَضَرَتِ الْعَصْرُ - قَالَ - صَفَّنَا صَفَّيْنِ وَالْمُشْرِكُونَ بَيْنَنَا وَبَيْنَ الْقِبْلَةِ - قَالَ - فَكَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ وَسَجَدَ مَعَهُ الصَّفُّ الأَوَّلُ فَلَمَّا قَامُوا سَجَدَ الصَّفُّ الثَّانِي ثُمَّ تَأَخَّرَ الصَّفُّ الأَوَّلُ وَتَقَدَّمَ الصَّفُّ الثَّانِي فَقَامُوا مَقَامَ الأَوَّلِ فَكَبَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَكَبَّرْنَا وَرَكَعَ فَرَكَعْنَا ثُمَّ سَجَدَ وَسَجَدَ مَعَهُ الصَّفُّ الأَوَّلُ وَقَامَ الثَّانِي فَلَمَّا سَجَدَ سَجَدَ الصَّفُّ الثَّانِي ثُمَّ جَلَسُوا جَمِيعًا سَلَّمَ عَلَيْهِمْ رَسُولُ اللَّهِ صلى الله عليه وسلم . قَالَ أَبُو الزُّبَيْرِ ثُمَّ خَصَّ جَابِرٌ أَنْ قَالَ كَمَا يُصَلِّي أُمَرَاؤُكُمْ هَؤُلاَءِ ."
  },
  "841": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 841\nIn-book reference  : Book 6, Hadith 375\nUSC-MSA web (English) reference  : Book 4, Hadith 1828\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ، الْقَاسِمِ عَنْ أَبِيهِ، عَنْ صَالِحِ بْنِ خَوَّاتِ بْنِ جُبَيْرٍ، عَنْ سَهْلِ بْنِ أَبِي حَثْمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَلَّى بِأَصْحَابِهِ فِي الْخَوْفِ فَصَفَّهُمْ خَلْفَهُ صَفَّيْنِ فَصَلَّى بِالَّذِينَ يَلُونَهُ رَكْعَةً ثُمَّ قَامَ فَلَمْ يَزَلْ قَائِمًا حَتَّى صَلَّى الَّذِينَ خَلْفَهُمْ رَكْعَةً ثُمَّ تَقَدَّمُوا وَتَأَخَّرَ الَّذِينَ كَانُوا قُدَّامَهُمْ فَصَلَّى بِهِمْ رَكْعَةً ثُمَّ قَعَدَ حَتَّى صَلَّى الَّذِينَ تَخَلَّفُوا رَكْعَةً ثُمَّ سَلَّمَ ."
  },
  "842": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 842\nIn-book reference  : Book 6, Hadith 376\nUSC-MSA web (English) reference  : Book 4, Hadith 1829\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ صَالِحِ، بْنِ خَوَّاتٍ عَمَّنْ صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ ذَاتِ الرِّقَاعِ صَلاَةَ الْخَوْفِ أَنَّ طَائِفَةً صَفَّتْ مَعَهُ وَطَائِفَةٌ وِجَاهَ الْعَدُوِّ . فَصَلَّى بِالَّذِينَ مَعَهُ رَكْعَةً ثُمَّ ثَبَتَ قَائِمًا وَأَتَمُّوا لأَنْفُسِهِمْ . ثُمَّ انْصَرَفُوا فَصَفُّوا وِجَاهَ الْعَدُوِّ وَجَاءَتِ الطَّائِفَةُ الأُخْرَى فَصَلَّى بِهِمُ الرَّكْعَةَ الَّتِي بَقِيَتْ ثُمَّ ثَبَتَ جَالِسًا وَأَتَمُّوا لأَنْفُسِهِمْ ثُمَّ سَلَّمَ بِهِمْ ."
  },
  "843": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Travellers",
    "book_num": "6",
    "reference": "Reference  : Sahih Muslim 843b\nIn-book reference  : Book 6, Hadith 378\nUSC-MSA web (English) reference  : Book 4, Hadith 1831\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/6",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى، - يَعْنِي ابْنَ حَسَّانَ - حَدَّثَنَا مُعَاوِيَةُ، - وَهُوَ ابْنُ سَلاَّمٍ - أَخْبَرَنِي يَحْيَى، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرًا، أَخْبَرَهُ أَنَّهُ، صَلَّى مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الْخَوْفِ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم بِإِحْدَى الطَّائِفَتَيْنِ رَكْعَتَيْنِ ثُمَّ صَلَّى بِالطَّائِفَةِ الأُخْرَى رَكْعَتَيْنِ فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم أَرْبَعَ رَكَعَاتٍ وَصَلَّى بِكُلِّ طَائِفَةٍ رَكْعَتَيْنِ ."
  }
}