{
  "2381": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2381\nIn-book reference  : Book 44, Hadith 1\nUSC-MSA web (English) reference  : Book 31, Hadith 5868\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَعَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، قَالَ عَبْدُ اللَّهِ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا حَبَّانُ بْنُ هِلاَلٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا ثَابِتٌ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ، حَدَّثَهُ قَالَ نَظَرْتُ إِلَى أَقْدَامِ الْمُشْرِكِينَ عَلَى رُءُوسِنَا وَنَحْنُ فِي الْغَارِ فَقُلْتُ يَا رَسُولَ اللَّهِ لَوْ أَنَّ أَحَدَهُمْ نَظَرَ إِلَى قَدَمَيْهِ أَبْصَرَنَا تَحْتَ قَدَمَيْهِ فَقَالَ \" يَا أَبَا بَكْرٍ مَا ظَنُّكَ بِاثْنَيْنِ اللَّهُ ثَالِثُهُمَا \" ."
  },
  "2382": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2382b\nIn-book reference  : Book 44, Hadith 3\nUSC-MSA web (English) reference  : Book 31, Hadith 5870\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَالِمٍ أَبِي النَّضْرِ، عَنْ عُبَيْدِ، بْنِ حُنَيْنٍ وَبُسْرِ بْنِ سَعِيدٍ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ خَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ يَوْمًا . بِمِثْلِ حَدِيثِ مَالِكٍ ."
  },
  "2383": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2383\nIn-book reference  : Book 44, Hadith 210\nUSC-MSA web (English) reference  : Book 31, Hadith 6067\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ عِيسَى، حَدَّثَنِي مَالِكٌ، عَنْ أَبِي النَّضْرِ، عَنْ عَامِرِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ أَبِي يَقُولُ، مَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِحَىٍّ يَمْشِي أَنَّهُ فِي الْجَنَّةِ إِلاَّ لِعَبْدِ اللَّهِ بْنِ سَلاَمٍ ."
  },
  "2384": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2384\nIn-book reference  : Book 44, Hadith 9\nUSC-MSA web (English) reference  : Book 31, Hadith 5876\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ خَالِدٍ، عَنْ أَبِي عُثْمَانَ، أَخْبَرَنِي عَمْرُو بْنُ الْعَاصِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَهُ عَلَى جَيْشِ ذَاتِ السَّلاَسِلِ فَأَتَيْتُهُ فَقُلْتُ أَىُّ النَّاسِ أَحَبُّ إِلَيْكَ قَالَ \" عَائِشَةُ \" . قُلْتُ مِنَ الرِّجَالِ قَالَ \" أَبُوهَا \" . قُلْتُ ثُمَّ مَنْ قَالَ \" عُمَرُ \" . فَعَدَّ رِجَالاً ."
  },
  "2385": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2385\nIn-book reference  : Book 44, Hadith 10\nUSC-MSA web (English) reference  : Book 31, Hadith 5877\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، عَنْ أَبِي عُمَيْسٍ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا جَعْفَرُ بْنُ عَوْنٍ، أَخْبَرَنَا أَبُو عُمَيْسٍ، عَنِ ابْنِ، أَبِي مُلَيْكَةَ سَمِعْتُ عَائِشَةَ، وَسُئِلَتْ، مَنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُسْتَخْلِفًا لَوِ اسْتَخْلَفَهُ قَالَتْ أَبُو بَكْرٍ . فَقِيلَ لَهَا ثُمَّ مَنْ بَعْدَ أَبِي بَكْرٍ قَالَتْ عُمَرُ . ثُمَّ قِيلَ لَهَا مَنْ بَعْدَ عُمَرَ قَالَتْ أَبُو عُبَيْدَةَ بْنُ الْجَرَّاحِ . ثُمَّ انْتَهَتْ إِلَى هَذَا ."
  },
  "2386": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2386a, b\nIn-book reference  : Book 44, Hadith 11\nUSC-MSA web (English) reference  : Book 31, Hadith 5878\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبَّادُ بْنُ مُوسَى، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، أَخْبَرَنِي أَبِي، عَنْ مُحَمَّدِ بْنِ جُبَيْرِ، بْنِ مُطْعِمٍ عَنْ أَبِيهِ، أَنَّ امْرَأَةً، سَأَلَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم شَيْئًا فَأَمَرَهَا أَنْ تَرْجِعَ إِلَيْهِ فَقَالَتْ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جِئْتُ فَلَمْ أَجِدْكَ قَالَ أَبِي كَأَنَّهَا تَعْنِي الْمَوْتَ . قَالَ \" فَإِنْ لَمْ تَجِدِينِي فَأْتِي أَبَا بَكْرٍ \" .\nوَحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ أَبِيهِ، أَخْبَرَنِي مُحَمَّدُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، أَنَّ أَبَاهُ، جُبَيْرَ بْنَ مُطْعِمٍ أَخْبَرَهُ أَنَّ امْرَأَةً أَتَتْ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَلَّمَتْهُ فِي شَىْءٍ فَأَمَرَهَا بِأَمْرٍ . بِمِثْلِ حَدِيثِ عَبَّادِ بْنِ مُوسَى ."
  },
  "2387": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2387\nIn-book reference  : Book 44, Hadith 12\nUSC-MSA web (English) reference  : Book 31, Hadith 5879\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، حَدَّثَنَا صَالِحُ بْنُ كَيْسَانَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم فِي مَرَضِهِ \" ادْعِي لِي أَبَا بَكْرٍ وَأَخَاكِ حَتَّى أَكْتُبَ كِتَابًا فَإِنِّي أَخَافُ أَنْ يَتَمَنَّى مُتَمَنٍّ وَيَقُولَ قَائِلٌ أَنَا أَوْلَى . وَيَأْبَى اللَّهُ وَالْمُؤْمِنُونَ إِلاَّ أَبَا بَكْرٍ \" ."
  },
  "1028": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 1028b\nIn-book reference  : Book 44, Hadith 13\nUSC-MSA web (English) reference  : Book 31, Hadith 5880\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ كَيْسَانَ - عَنْ أَبِي حَازِمٍ الأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ أَصْبَحَ مِنْكُمُ الْيَوْمَ صَائِمًا \" . قَالَ أَبُو بَكْرٍ أَنَا . قَالَ \" فَمَنْ تَبِعَ مِنْكُمُ الْيَوْمَ جَنَازَةً \" . قَالَ أَبُو بَكْرٍ أَنَا . قَالَ \" فَمَنْ أَطْعَمَ مِنْكُمُ الْيَوْمَ مِسْكِينًا \" . قَالَ أَبُو بَكْرٍ أَنَا . قَالَ \" فَمَنْ عَادَ مِنْكُمُ الْيَوْمَ مَرِيضًا \" . قَالَ أَبُو بَكْرٍ أَنَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا اجْتَمَعْنَ فِي امْرِئٍ إِلاَّ دَخَلَ الْجَنَّةَ \" ."
  },
  "2388": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2388d\nIn-book reference  : Book 44, Hadith 17\nUSC-MSA web (English) reference  : Book 31, Hadith 5884\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ مِسْعَرٍ، كِلاَهُمَا عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "2389": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2389b\nIn-book reference  : Book 44, Hadith 19\nUSC-MSA web (English) reference  : Book 31, Hadith 5886\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنْ عُمَرَ بْنِ سَعِيدٍ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ ."
  },
  "2390": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2390\nIn-book reference  : Book 44, Hadith 20\nUSC-MSA web (English) reference  : Book 31, Hadith 5887\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، عَنْ صَالِحِ بْنِ كَيْسَانَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لَهُمْ - قَالُوا حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي أَبُو أُمَامَةَ، بْنُ سَهْلٍ أَنَّهُ سَمِعَ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" بَيْنَا أَنَا نَائِمٌ رَأَيْتُ النَّاسَ يُعْرَضُونَ وَعَلَيْهِمْ قُمُصٌ مِنْهَا مَا يَبْلُغُ الثُّدِيَّ وَمِنْهَا مَا يَبْلُغُ دُونَ ذَلِكَ وَمَرَّ عُمَرُ بْنُ الْخَطَّابِ وَعَلَيْهِ قَمِيصٌ يَجُرُّهُ \" . قَالُوا مَاذَا أَوَّلْتَ ذَلِكَ يَا رَسُولَ اللَّهِ قَالَ \" الدِّينَ \" ."
  },
  "2391": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2391b\nIn-book reference  : Book 44, Hadith 22\nUSC-MSA web (English) reference  : Book 31, Hadith 5889\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، ح وَحَدَّثَنَا الْحُلْوَانِيُّ، وَعَبْدُ بْنُ، حُمَيْدٍ كِلاَهُمَا عَنْ يَعْقُوبَ بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، بِإِسْنَادِ يُونُسَ نَحْوَ حَدِيثِهِ ."
  },
  "2392": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2392d\nIn-book reference  : Book 44, Hadith 26\nUSC-MSA web (English) reference  : Book 31, Hadith 5893\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" بَيْنَا أَنَا نَائِمٌ أُرِيتُ أَنِّي أَنْزِعُ عَلَى حَوْضِي أَسْقِي النَّاسَ فَجَاءَنِي أَبُو بَكْرٍ فَأَخَذَ الدَّلْوَ مِنْ يَدِي لِيُرَوِّحَنِي فَنَزَعَ دَلْوَيْنِ وَفِي نَزْعِهِ ضُعْفٌ وَاللَّهُ يَغْفِرُ لَهُ فَجَاءَ ابْنُ الْخَطَّابِ فَأَخَذَ مِنْهُ فَلَمْ أَرَ نَزْعَ رَجُلٍ قَطُّ أَقْوَى مِنْهُ حَتَّى تَوَلَّى النَّاسُ وَالْحَوْضُ مَلآنُ يَتَفَجَّرُ \" ."
  },
  "2393": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2393b\nIn-book reference  : Book 44, Hadith 28\nUSC-MSA web (English) reference  : Book 31, Hadith 5895\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنِي مُوسَى بْنُ عُقْبَةَ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ رُؤْيَا، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي أَبِي بَكْرٍ وَعُمَرَ بْنِ الْخَطَّابِ رضى الله عنهما بِنَحْوِ حَدِيثِهِمْ ."
  },
  "2394": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2394b\nIn-book reference  : Book 44, Hadith 30\nUSC-MSA web (English) reference  : Book 31, Hadith 5897\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، وَابْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، ح\nوَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، ح\nوَحَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ الْمُنْكَدِرِ، سَمِعْتُ جَابِرًا، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ ابْنِ نُمَيْرٍ وَزُهَيْرٍ ."
  },
  "2395": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2395a, b\nIn-book reference  : Book 44, Hadith 31\nUSC-MSA web (English) reference  : Book 31, Hadith 5898\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، أَنَّ ابْنَ شِهَابٍ، أَخْبَرَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" بَيْنَا أَنَا نَائِمٌ إِذْ رَأَيْتُنِي فِي الْجَنَّةِ فَإِذَا امْرَأَةٌ تَوَضَّأُ إِلَى جَانِبِ قَصْرٍ فَقُلْتُ لِمَنْ هَذَا فَقَالُوا لِعُمَرَ بْنِ الْخَطَّابِ . فَذَكَرْتُ غَيْرَةَ عُمَرَ فَوَلَّيْتُ مُدْبِرًا \" . قَالَ أَبُو هُرَيْرَةَ فَبَكَى عُمَرُ وَنَحْنُ جَمِيعًا فِي ذَلِكَ الْمَجْلِسِ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ عُمَرُ بِأَبِي أَنْتَ يَا رَسُولَ اللَّهِ أَعَلَيْكَ أَغَارُ\nوَحَدَّثَنِيهِ عَمْرٌو النَّاقِدُ، وَحَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالُوا حَدَّثَنَا يَعْقُوبُ بْنُ، إِبْرَاهِيمَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2396": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2396\nIn-book reference  : Book 44, Hadith 32\nUSC-MSA web (English) reference  : Book 31, Hadith 5899\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ يَعْنِي ابْنَ سَعْدٍ، ح وَحَدَّثَنَا حَسَنٌ، الْحُلْوَانِيُّ وَعَبْدُ بْنُ حُمَيْدٍ قَالَ عَبْدٌ أَخْبَرَنِي وَقَالَ، حَسَنٌ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي عَبْدُ الْحَمِيدِ بْنُ عَبْدِ الرَّحْمَنِ، بْنِ زَيْدٍ أَنَّ مُحَمَّدَ بْنَ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَخْبَرَهُ أَنَّ أَبَاهُ سَعْدًا قَالَ اسْتَأْذَنَ عُمَرُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ نِسَاءٌ مِنْ قُرَيْشٍ يُكَلِّمْنَهُ وَيَسْتَكْثِرْنَهُ عَالِيَةً أَصْوَاتُهُنَّ فَلَمَّا اسْتَأْذَنَ عُمَرُ قُمْنَ يَبْتَدِرْنَ الْحِجَابَ فَأَذِنَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَرَسُولُ اللَّهِ صلى الله عليه وسلم يَضْحَكُ فَقَالَ عُمَرُ أَضْحَكَ اللَّهُ سِنَّكَ يَا رَسُولَ اللَّهِ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" عَجِبْتُ مِنْ هَؤُلاَءِ اللاَّتِي كُنَّ عِنْدِي فَلَمَّا سَمِعْنَ صَوْتَكَ ابْتَدَرْنَ الْحِجَابَ \" . قَالَ عُمَرُ فَأَنْتَ يَا رَسُولَ اللَّهِ أَحَقُّ أَنْ يَهَبْنَ . ثُمَّ قَالَ عُمَرُ أَىْ عَدُوَّاتِ أَنْفُسِهِنَّ أَتَهَبْنَنِي وَلاَ تَهَبْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم قُلْنَ نَعَمْ أَنْتَ أَغْلَظُ وَأَفَظُّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَالَّذِي نَفْسِي بِيَدِهِ مَا لَقِيَكَ الشَّيْطَانُ قَطُّ سَالِكًا فَجًّا إِلاَّ سَلَكَ فَجًّا غَيْرَ فَجِّكَ \" ."
  },
  "2397": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2397\nIn-book reference  : Book 44, Hadith 33\nUSC-MSA web (English) reference  : Book 31, Hadith 5900\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، حَدَّثَنَا بِهِ عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، أَخْبَرَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ عُمَرَ بْنَ الْخَطَّابِ، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ نِسْوَةٌ قَدْ رَفَعْنَ أَصْوَاتَهُنَّ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَلَمَّا اسْتَأْذَنَ عُمَرُ ابْتَدَرْنَ الْحِجَابَ . فَذَكَرَ نَحْوَ حَدِيثِ الزُّهْرِيِّ ."
  },
  "2398": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2398b\nIn-book reference  : Book 44, Hadith 35\nUSC-MSA web (English) reference  : Book 31, Hadith 5902\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا ابْنُ عُيَيْنَةَ، كِلاَهُمَا عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2399": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2399\nIn-book reference  : Book 44, Hadith 36\nUSC-MSA web (English) reference  : Book 31, Hadith 5903\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا سَعِيدُ بْنُ عَامِرٍ، قَالَ جُوَيْرِيَةُ بْنُ أَسْمَاءَ أَخْبَرَنَا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ عُمَرُ وَافَقْتُ رَبِّي فِي ثَلاَثٍ فِي مَقَامِ إِبْرَاهِيمَ وَفِي الْحِجَابِ وَفِي أُسَارَى بَدْرٍ ."
  },
  "2400": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2400b\nIn-book reference  : Book 44, Hadith 38\nUSC-MSA web (English) reference  : Book 31, Hadith 5905\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ فِي مَعْنَى حَدِيثِ أَبِي أُسَامَةَ وَزَادَ قَالَ فَتَرَكَ الصَّلاَةَ عَلَيْهِمْ ."
  },
  "2401": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2401\nIn-book reference  : Book 44, Hadith 39\nUSC-MSA web (English) reference  : Book 31, Hadith 5906\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنُونَ ابْنَ جَعْفَرٍ - عَنْ مُحَمَّدِ بْنِ أَبِي حَرْمَلَةَ، عَنْ عَطَاءٍ، وَسُلَيْمَانَ، ابْنَىْ يَسَارٍ وَأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ أَنَّ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُضْطَجِعًا فِي بَيْتِي كَاشِفًا عَنْ فَخِذَيْهِ أَوْ سَاقَيْهِ فَاسْتَأْذَنَ أَبُو بَكْرٍ فَأَذِنَ لَهُ وَهُوَ عَلَى تِلْكَ الْحَالِ فَتَحَدَّثَ ثُمَّ اسْتَأْذَنَ عُمَرُ فَأَذِنَ لَهُ وَهُوَ كَذَلِكَ فَتَحَدَّثَ ثُمَّ اسْتَأْذَنَ عُثْمَانُ فَجَلَسَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَوَّى ثِيَابَهُ - قَالَ مُحَمَّدٌ وَلاَ أَقُولُ ذَلِكَ فِي يَوْمٍ وَاحِدٍ - فَدَخَلَ فَتَحَدَّثَ فَلَمَّا خَرَجَ قَالَتْ عَائِشَةُ دَخَلَ أَبُو بَكْرٍ فَلَمْ تَهْتَشَّ لَهُ وَلَمْ تُبَالِهِ ثُمَّ دَخَلَ عُمَرُ فَلَمْ تَهْتَشَّ لَهُ وَلَمْ تُبَالِهِ ثُمَّ دَخَلَ عُثْمَانُ فَجَلَسْتَ وَسَوَّيْتَ ثِيَابَكَ فَقَالَ \" أَلاَ أَسْتَحِي مِنْ رَجُلٍ تَسْتَحِي مِنْهُ الْمَلاَئِكَةُ \" ."
  },
  "2402": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2402b\nIn-book reference  : Book 44, Hadith 41\nUSC-MSA web (English) reference  : Book 31, Hadith 5908\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ عَمْرٌو النَّاقِدُ، وَالْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، كُلُّهُمْ عَنْ يَعْقُوبَ، بْنِ إِبْرَاهِيمَ بْنِ سَعْدٍ حَدَّثَنَا أَبِي، عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي يَحْيَى، بْنُ سَعِيدِ بْنِ الْعَاصِ أَنَّ سَعِيدَ بْنَ الْعَاصِ، أَخْبَرَهُ أَنَّ عُثْمَانَ وَعَائِشَةَ حَدَّثَاهُ أَنَّ أَبَا بَكْرٍ الصِّدِّيقَ اسْتَأْذَنَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ بِمِثْلِ حَدِيثِ عُقَيْلٍ عَنِ الزُّهْرِيِّ ."
  },
  "2403": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2403e\nIn-book reference  : Book 44, Hadith 46\nUSC-MSA web (English) reference  : Book 31, Hadith 5912\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا سَعِيدُ بْنُ أَبِي، مَرْيَمَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرِ بْنِ أَبِي كَثِيرٍ، أَخْبَرَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، عَنْ سَعِيدِ، بْنِ الْمُسَيَّبِ عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا إِلَى حَائِطٍ بِالْمَدِينَةِ لِحَاجَتِهِ فَخَرَجْتُ فِي إِثْرِهِ . وَاقْتَصَّ الْحَدِيثَ بِمَعْنَى حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ وَذَكَرَ فِي الْحَدِيثِ قَالَ ابْنُ الْمُسَيَّبِ . فَتَأَوَّلْتُ ذَلِكَ قُبُورَهُمُ اجْتَمَعَتْ هَا هُنَا وَانْفَرَدَ عُثْمَانُ ."
  },
  "2404": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2404e\nIn-book reference  : Book 44, Hadith 51\nUSC-MSA web (English) reference  : Book 31, Hadith 5916\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، سَمِعْتُ إِبْرَاهِيمَ، بْنَ سَعْدٍ عَنْ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ لِعَلِيٍّ \" أَمَا تَرْضَى أَنْ تَكُونَ مِنِّي بِمَنْزِلَةِ هَارُونَ مِنْ مُوسَى \" ."
  },
  "2405": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2405\nIn-book reference  : Book 44, Hadith 52\nUSC-MSA web (English) reference  : Book 31, Hadith 5917\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ يَوْمَ خَيْبَرَ \" لأُعْطِيَنَّ هَذِهِ الرَّايَةَ رَجُلاً يُحِبُّ اللَّهَ وَرَسُولَهُ يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ \" . قَالَ عُمَرُ بْنُ الْخَطَّابِ مَا أَحْبَبْتُ الإِمَارَةَ إِلاَّ يَوْمَئِذٍ - قَالَ - فَتَسَاوَرْتُ لَهَا رَجَاءَ أَنْ أُدْعَى لَهَا - قَالَ - فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلِيَّ بْنَ أَبِي طَالِبٍ فَأَعْطَاهُ إِيَّاهَا وَقَالَ \" امْشِ وَلاَ تَلْتَفِتْ حَتَّى يَفْتَحَ اللَّهُ عَلَيْكَ \" . قَالَ فَسَارَ عَلِيٌّ شَيْئًا ثُمَّ وَقَفَ وَلَمْ يَلْتَفِتْ فَصَرَخَ يَا رَسُولَ اللَّهِ عَلَى مَاذَا أُقَاتِلُ النَّاسَ قَالَ \" قَاتِلْهُمْ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ فَإِذَا فَعَلُوا ذَلِكَ فَقَدْ مَنَعُوا مِنْكَ دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ \" ."
  },
  "2406": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2406\nIn-book reference  : Book 44, Hadith 53\nUSC-MSA web (English) reference  : Book 31, Hadith 5918\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ أَبِي حَازِمٍ - عَنْ أَبِي، حَازِمٍ عَنْ سَهْلٍ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ هَذَا - حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ أَبِي حَازِمٍ، أَخْبَرَنِي سَهْلُ بْنُ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ يَوْمَ خَيْبَرَ \" لأُعْطِيَنَّ هَذِهِ الرَّايَةَ رَجُلاً يَفْتَحُ اللَّهُ عَلَى يَدَيْهِ يُحِبُّ اللَّهَ وَرَسُولَهُ وَيُحِبُّهُ اللَّهُ وَرَسُولُهُ \" . قَالَ فَبَاتَ النَّاسُ يَدُوكُونَ لَيْلَتَهُمْ أَيُّهُمْ يُعْطَاهَا - قَالَ - فَلَمَّا أَصْبَحَ النَّاسُ غَدَوْا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم كُلُّهُمْ يَرْجُونَ أَنْ يُعْطَاهَا فَقَالَ \" أَيْنَ عَلِيُّ بْنُ أَبِي طَالِبٍ \" . فَقَالُوا هُوَ يَا رَسُولَ اللَّهِ يَشْتَكِي عَيْنَيْهِ - قَالَ - فَأَرْسَلُوا إِلَيْهِ فَأُتِيَ بِهِ فَبَصَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي عَيْنَيْهِ وَدَعَا لَهُ فَبَرَأَ حَتَّى كَأَنْ لَمْ يَكُنْ بِهِ وَجَعٌ فَأَعْطَاهُ الرَّايَةَ فَقَالَ عَلِيٌّ يَا رَسُولَ اللَّهِ أُقَاتِلُهُمْ حَتَّى يَكُونُوا مِثْلَنَا . فَقَالَ \" انْفُذْ عَلَى رِسْلِكَ حَتَّى تَنْزِلَ بِسَاحَتِهِمْ ثُمَّ ادْعُهُمْ إِلَى الإِسْلاَمِ وَأَخْبِرْهُمْ بِمَا يَجِبُ عَلَيْهِمْ مِنْ حَقِّ اللَّهِ فِيهِ فَوَاللَّهِ لأَنْ يَهْدِيَ اللَّهُ بِكَ رَجُلاً وَاحِدًا خَيْرٌ لَكَ مِنْ أَنْ يَكُونَ لَكَ حُمْرُ النَّعَمِ \" ."
  },
  "2407": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2407\nIn-book reference  : Book 44, Hadith 54\nUSC-MSA web (English) reference  : Book 31, Hadith 5919\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ يَزِيدَ بْنِ أَبِي، عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ كَانَ عَلِيٌّ قَدْ تَخَلَّفَ عَنِ النَّبِيِّ صلى الله عليه وسلم فِي خَيْبَرَ وَكَانَ رَمِدًا فَقَالَ أَنَا أَتَخَلَّفُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَخَرَجَ عَلِيٌّ فَلَحِقَ بِالنَّبِيِّ صلى الله عليه وسلم فَلَمَّا كَانَ مَسَاءُ اللَّيْلَةِ الَّتِي فَتَحَهَا اللَّهُ فِي صَبَاحِهَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لأُعْطِيَنَّ الرَّايَةَ - أَوْ لَيَأْخُذَنَّ بِالرَّايَةِ - غَدًا رَجُلٌ يُحِبُّهُ اللَّهُ وَرَسُولُهُ أَوْ قَالَ يُحِبُّ اللَّهَ وَرَسُولَهُ يَفْتَحُ اللَّهُ عَلَيْهِ \" . فَإِذَا نَحْنُ بِعَلِيٍّ وَمَا نَرْجُوهُ فَقَالُوا هَذَا عَلِيٌّ . فَأَعْطَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم الرَّايَةَ فَفَتَحَ اللَّهُ عَلَيْهِ ."
  },
  "2408": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2408d\nIn-book reference  : Book 44, Hadith 58\nUSC-MSA web (English) reference  : Book 31, Hadith 5923\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَكَّارِ بْنِ الرَّيَّانِ، حَدَّثَنَا حَسَّانُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ - عَنْ سَعِيدٍ، - وَهُوَ ابْنُ مَسْرُوقٍ - عَنْ يَزِيدَ بْنِ حَيَّانَ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ دَخَلْنَا عَلَيْهِ فَقُلْنَا لَهُ لَقَدْ رَأَيْتَ خَيْرًا . لَقَدْ صَاحَبْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَصَلَّيْتَ خَلْفَهُ . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ أَبِي حَيَّانَ غَيْرَ أَنَّهُ قَالَ \" أَلاَ وَإِنِّي تَارِكٌ فِيكُمْ ثَقَلَيْنِ أَحَدُهُمَا كِتَابُ اللَّهِ عَزَّ وَجَلَّ هُوَ حَبْلُ اللَّهِ مَنِ اتَّبَعَهُ كَانَ عَلَى الْهُدَى وَمَنْ تَرَكَهُ كَانَ عَلَى ضَلاَلَةٍ \" . وَفِيهِ فَقُلْنَا مَنْ أَهْلُ بَيْتِهِ نِسَاؤُهُ قَالَ لاَ وَايْمُ اللَّهِ إِنَّ الْمَرْأَةَ تَكُونُ مَعَ الرَّجُلِ الْعَصْرَ مِنَ الدَّهْرِ ثُمَّ يُطَلِّقُهَا فَتَرْجِعُ إِلَى أَبِيهَا وَقَوْمِهَا أَهْلُ بَيْتِهِ أَصْلُهُ وَعَصَبَتُهُ الَّذِينَ حُرِمُوا الصَّدَقَةَ بَعْدَهُ ."
  },
  "2409": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2409\nIn-book reference  : Book 44, Hadith 59\nUSC-MSA web (English) reference  : Book 31, Hadith 5924\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ أَبِي حَازِمٍ - عَنْ أَبِي، حَازِمٍ عَنْ سَهْلِ بْنِ سَعْدٍ، قَالَ اسْتُعْمِلَ عَلَى الْمَدِينَةِ رَجُلٌ مِنْ آلِ مَرْوَانَ - قَالَ - فَدَعَا سَهْلَ بْنَ سَعْدٍ فَأَمَرَهُ أَنْ يَشْتِمَ عَلِيًّا - قَالَ - فَأَبَى سَهْلٌ فَقَالَ لَهُ أَمَّا إِذْ أَبَيْتَ فَقُلْ لَعَنَ اللَّهُ أَبَا التُّرَابِ . فَقَالَ سَهْلٌ مَا كَانَ لِعَلِيٍّ اسْمٌ أَحَبَّ إِلَيْهِ مِنْ أَبِي التُّرَابِ وَإِنْ كَانَ لَيَفْرَحُ إِذَا دُعِيَ بِهَا . فَقَالَ لَهُ أَخْبِرْنَا عَنْ قِصَّتِهِ لِمَ سُمِّيَ أَبَا تُرَابٍ قَالَ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْتَ فَاطِمَةَ فَلَمْ يَجِدْ عَلِيًّا فِي الْبَيْتِ فَقَالَ \" أَيْنَ ابْنُ عَمِّكِ \" . فَقَالَتْ كَانَ بَيْنِي وَبَيْنَهُ شَىْءٌ فَغَاضَبَنِي فَخَرَجَ فَلَمْ يَقِلْ عِنْدِي فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لإِنْسَانٍ \" انْظُرْ أَيْنَ هُوَ \" . فَجَاءَ فَقَالَ يَا رَسُولَ اللَّهِ هُوَ فِي الْمَسْجِدِ رَاقِدٌ . فَجَاءَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ مُضْطَجِعٌ قَدْ سَقَطَ رِدَاؤُهُ عَنْ شِقِّهِ فَأَصَابَهُ تُرَابٌ فَجَعَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَمْسَحُهُ عَنْهُ وَيَقُولُ \" قُمْ أَبَا التُّرَابِ قُمْ أَبَا التُّرَابِ \" ."
  },
  "2410": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2410c\nIn-book reference  : Book 44, Hadith 62\nUSC-MSA web (English) reference  : Book 31, Hadith 5927\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، يَقُولُ سَمِعْتُ عَبْدَ اللَّهِ بْنَ عَامِرِ بْنِ رَبِيعَةَ، يَقُولُ قَالَتْ عَائِشَةُ أَرِقَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ لَيْلَةٍ . بِمِثْلِ حَدِيثِ سُلَيْمَانَ بْنِ بِلاَلٍ ."
  },
  "2411": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2411b\nIn-book reference  : Book 44, Hadith 64\nUSC-MSA web (English) reference  : Book 31, Hadith 5929\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ح حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ الْحَنْظَلِيُّ، عَنْ مُحَمَّدِ بْنِ بِشْرٍ، عَنْ مِسْعَرٍ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ مِسْعَرٍ، كُلُّهُمْ عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ عَبْدِ اللَّهِ بْنِ شَدَّادٍ، عَنْ عَلِيٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2412": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2412c\nIn-book reference  : Book 44, Hadith 67\nUSC-MSA web (English) reference  : Book 31, Hadith 5932\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ بُكَيْرِ بْنِ مِسْمَارٍ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم جَمَعَ لَهُ أَبَوَيْهِ يَوْمَ أُحُدٍ . قَالَ كَانَ رَجُلٌ مِنَ الْمُشْرِكِينَ قَدْ أَحْرَقَ الْمُسْلِمِينَ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" ارْمِ فِدَاكَ أَبِي وَأُمِّي \" . قَالَ فَنَزَعْتُ لَهُ بِسَهْمٍ لَيْسَ فِيهِ نَصْلٌ فَأَصَبْتُ جَنْبَهُ فَسَقَطَ فَانْكَشَفَتْ عَوْرَتُهُ فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى نَظَرْتُ إِلَى نَوَاجِذِهِ ."
  },
  "1748": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 1748d\nIn-book reference  : Book 44, Hadith 69\nUSC-MSA web (English) reference  : Book 31, Hadith 5934\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، أَنَّهُ قَالَ أُنْزِلَتْ فِيَّ أَرْبَعُ آيَاتٍ . وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ زُهَيْرٍ عَنْ سِمَاكٍ وَزَادَ فِي حَدِيثِ شُعْبَةَ قَالَ فَكَانُوا إِذَا أَرَادُوا أَنْ يُطْعِمُوهَا شَجَرُوا فَاهَا بِعَصًا ثُمَّ أَوْجَرُوهَا . وَفِي حَدِيثِهِ أَيْضًا فَضَرَبَ بِهِ أَنْفَ سَعْدٍ فَفَزَرَهُ وَكَانَ أَنْفُ سَعْدٍ مَفْزُورًا ."
  },
  "2413": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2413b\nIn-book reference  : Book 44, Hadith 71\nUSC-MSA web (English) reference  : Book 31, Hadith 5936\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الأَسَدِيُّ، عَنْ إِسْرَائِيلَ، عَنِ الْمِقْدَامِ بْنِ شُرَيْحٍ، عَنْ أَبِيهِ، عَنْ سَعْدٍ، قَالَ كُنَّا مَعَ النَّبِيِّ صلى الله عليه وسلم سِتَّةَ نَفَرٍ فَقَالَ الْمُشْرِكُونَ لِلنَّبِيِّ صلى الله عليه وسلم اطْرُدْ هَؤُلاَءِ لاَ يَجْتَرِئُونَ عَلَيْنَا . قَالَ وَكُنْتُ أَنَا وَابْنُ مَسْعُودٍ وَرَجُلٌ مِنْ هُذَيْلٍ وَبِلاَلٌ وَرَجُلاَنِ لَسْتُ أُسَمِّيهِمَا فَوَقَعَ فِي نَفْسِ رَسُولِ اللَّهِ صلى الله عليه وسلم مَا شَاءَ اللَّهُ أَنْ يَقَعَ فَحَدَّثَ نَفْسَهُ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { وَلاَ تَطْرُدِ الَّذِينَ يَدْعُونَ رَبَّهُمْ بِالْغَدَاةِ وَالْعَشِيِّ يُرِيدُونَ وَجْهَهُ}"
  },
  "2414": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2414\nIn-book reference  : Book 44, Hadith 72\nUSC-MSA web (English) reference  : Book 31, Hadith 5937\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، وَحَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالُوا حَدَّثَنَا الْمُعْتَمِرُ، - وَهُوَ ابْنُ سُلَيْمَانَ - قَالَ سَمِعْتُ أَبِي، عَنْ أَبِي عُثْمَانَ، قَالَ لَمْ يَبْقَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ تِلْكَ الأَيَّامِ الَّتِي قَاتَلَ فِيهِنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم غَيْرُ طَلْحَةَ وَسَعْدٍ . عَنْ حَدِيثِهِمَا ."
  },
  "2415": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2415b\nIn-book reference  : Book 44, Hadith 74\nUSC-MSA web (English) reference  : Book 31, Hadith 5939\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ وَكِيعٍ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ ابْنِ عُيَيْنَةَ ."
  },
  "2416": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2416b\nIn-book reference  : Book 44, Hadith 76\nUSC-MSA web (English) reference  : Book 31, Hadith 5941\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، قَالَ لَمَّا كَانَ يَوْمُ الْخَنْدَقِ كُنْتُ أَنَا وَعُمَرُ بْنُ أَبِي سَلَمَةَ فِي الأُطُمِ الَّذِي فِيهِ النِّسْوَةُ يَعْنِي نِسْوَةَ النَّبِيِّ صلى الله عليه وسلم وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ ابْنِ مُسْهِرٍ فِي هَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ عَبْدَ اللَّهِ بْنَ عُرْوَةَ فِي الْحَدِيثِ وَلَكِنْ أَدْرَجَ الْقِصَّةَ فِي حَدِيثِ هِشَامٍ عَنْ أَبِيهِ عَنِ ابْنِ الزُّبَيْرِ ."
  },
  "2417": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2417b\nIn-book reference  : Book 44, Hadith 78\nUSC-MSA web (English) reference  : Book 31, Hadith 5943\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ يَزِيدَ بْنِ خُنَيْسٍ، وَأَحْمَدُ بْنُ يُوسُفَ الأَزْدِيُّ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ سُهَيْلِ، بْنِ أَبِي صَالِحٍ عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ عَلَى جَبَلِ حِرَاءٍ فَتَحَرَّكَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اسْكُنْ حِرَاءُ فَمَا عَلَيْكَ إِلاَّ نَبِيٌّ أَوْ صِدِّيقٌ أَوْ شَهِيدٌ \" . وَعَلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَأَبُو بَكْرٍ وَعُمَرُ وَعُثْمَانُ وَعَلِيٌّ وَطَلْحَةُ وَالزُّبَيْرُ وَسَعْدُ بْنُ أَبِي وَقَّاصٍ رضى الله عنهم ."
  },
  "2418": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2418c\nIn-book reference  : Book 44, Hadith 81\nUSC-MSA web (English) reference  : Book 31, Hadith 5946\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا إِسْمَاعِيلُ، عَنِ الْبَهِيِّ، عَنْ عُرْوَةَ، قَالَ قَالَتْ لِي عَائِشَةُ كَانَ أَبَوَاكَ مِنَ الَّذِينَ اسْتَجَابُوا لِلَّهِ وَالرَّسُولِ مِنْ بَعْدِ مَا أَصَابَهُمُ الْقَرْحُ ."
  },
  "2419": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2419b\nIn-book reference  : Book 44, Hadith 83\nUSC-MSA web (English) reference  : Book 31, Hadith 5948\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ سَلَمَةَ - عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ أَهْلَ الْيَمَنِ، قَدِمُوا عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا ابْعَثْ مَعَنَا رَجُلاً يُعَلِّمْنَا السُّنَّةَ وَالإِسْلاَمَ . قَالَ فَأَخَذَ بِيَدِ أَبِي عُبَيْدَةَ فَقَالَ \" هَذَا أَمِينُ هَذِهِ الأُمَّةِ \" ."
  },
  "2420": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2420b\nIn-book reference  : Book 44, Hadith 85\nUSC-MSA web (English) reference  : Book 31, Hadith 5950\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو دَاوُدَ الْحَفَرِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي إِسْحَاقَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2421": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2421b\nIn-book reference  : Book 44, Hadith 87\nUSC-MSA web (English) reference  : Book 31, Hadith 5952\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي يَزِيدَ، عَنْ نَافِعِ بْنِ جُبَيْرِ، بْنِ مُطْعِمٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي طَائِفَةٍ مِنَ النَّهَارِ لاَ يُكَلِّمُنِي وَلاَ أُكَلِّمُهُ حَتَّى جَاءَ سُوقَ بَنِي قَيْنُقَاعَ ثُمَّ انْصَرَفَ حَتَّى أَتَى خِبَاءَ فَاطِمَةَ فَقَالَ \" أَثَمَّ لُكَعُ أَثَمَّ لُكَعُ \" . يَعْنِي حَسَنًا فَظَنَنَّا أَنَّهُ إِنَّمَا تَحْبِسُهُ أُمُّهُ لأَنْ تُغَسِّلَهُ وَتُلْبِسَهُ سِخَابًا فَلَمْ يَلْبَثْ أَنْ جَاءَ يَسْعَى حَتَّى اعْتَنَقَ كُلُّ وَاحِدٍ مِنْهُمَا صَاحِبَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ وَأَحْبِبْ مَنْ يُحِبُّهُ \" ."
  },
  "2422": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2422b\nIn-book reference  : Book 44, Hadith 89\nUSC-MSA web (English) reference  : Book 31, Hadith 5953\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، وَأَبُو بَكْرِ بْنُ نَافِعٍ قَالَ ابْنُ نَافِعٍ حَدَّثَنَا غُنْدَرٌ، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، - وَهُوَ ابْنُ ثَابِتٍ - عَنِ الْبَرَاءِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَاضِعًا الْحَسَنَ بْنَ عَلِيٍّ عَلَى عَاتِقِهِ وَهُوَ يَقُولُ \" اللَّهُمَّ إِنِّي أُحِبُّهُ فَأَحِبَّهُ \" ."
  },
  "2423": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2423\nIn-book reference  : Book 44, Hadith 90\nUSC-MSA web (English) reference  : Book 31, Hadith 5954\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الرُّومِيِّ الْيَمَامِيُّ، وَعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالاَ حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا إِيَاسٌ، عَنْ أَبِيهِ، قَالَ لَقَدْ قُدْتُ بِنَبِيِّ اللَّهِ صلى الله عليه وسلم وَالْحَسَنِ وَالْحُسَيْنِ بَغْلَتَهُ الشَّهْبَاءَ حَتَّى أَدْخَلْتُهُمْ حُجْرَةَ النَّبِيِّ صلى الله عليه وسلم هَذَا قُدَّامَهُ وَهَذَا خَلْفَهُ ."
  },
  "2424": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2424\nIn-book reference  : Book 44, Hadith 91\nUSC-MSA web (English) reference  : Book 31, Hadith 5955\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ زَكَرِيَّاءَ، عَنْ مُصْعَبِ بْنِ شَيْبَةَ، عَنْ صَفِيَّةَ بِنْتِ شَيْبَةَ، قَالَتْ قَالَتْ عَائِشَةُ خَرَجَ النَّبِيُّ صلى الله عليه وسلم غَدَاةً وَعَلَيْهِ مِرْطٌ مُرَحَّلٌ مِنْ شَعْرٍ أَسْوَدَ فَجَاءَ الْحَسَنُ بْنُ عَلِيٍّ فَأَدْخَلَهُ ثُمَّ جَاءَ الْحُسَيْنُ فَدَخَلَ مَعَهُ ثُمَّ جَاءَتْ فَاطِمَةُ فَأَدْخَلَهَا ثُمَّ جَاءَ عَلِيٌّ فَأَدْخَلَهُ ثُمَّ قَالَ { إِنَّمَا يُرِيدُ اللَّهُ لِيُذْهِبَ عَنْكُمُ الرِّجْسَ أَهْلَ الْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيرًا}"
  },
  "2425": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2425b\nIn-book reference  : Book 44, Hadith 93\nUSC-MSA web (English) reference  : Book 31, Hadith 5957\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا مُوسَى بْنُ عُقْبَةَ، حَدَّثَنِي سَالِمٌ، عَنْ عَبْدِ اللَّهِ، بِمِثْلِهِ ."
  },
  "2426": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2426b\nIn-book reference  : Book 44, Hadith 95\nUSC-MSA web (English) reference  : Book 31, Hadith 5959\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ، - يَعْنِي ابْنَ حَمْزَةَ - عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ وَهُوَ عَلَى الْمِنْبَرِ \" إِنْ تَطْعَنُوا فِي إِمَارَتِهِ - يُرِيدُ أُسَامَةَ بْنَ زَيْدٍ - فَقَدْ طَعَنْتُمْ فِي إِمَارَةِ أَبِيهِ مِنْ قَبْلِهِ وَايْمُ اللَّهِ إِنْ كَانَ لَخَلِيقًا لَهَا . وَايْمُ اللَّهِ إِنْ كَانَ لأَحَبَّ النَّاسِ إِلَىَّ . وَايْمُ اللَّهِ إِنَّ هَذَا لَهَا لَخَلِيقٌ - يُرِيدُ أُسَامَةَ بْنَ زَيْدٍ - وَايْمُ اللَّهِ إِنْ كَانَ لأَحَبَّهُمْ إِلَىَّ مِنْ بَعْدِهِ فَأُوصِيكُمْ بِهِ فَإِنَّهُ مِنْ صَالِحِيكُمْ \" ."
  },
  "2427": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2427b\nIn-book reference  : Book 44, Hadith 97\nUSC-MSA web (English) reference  : Book 31, Hadith 5961\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو أُسَامَةَ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، بِمِثْلِ حَدِيثِ ابْنِ عُلَيَّةَ وَإِسْنَادِهِ ."
  },
  "2428": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2428b\nIn-book reference  : Book 44, Hadith 99\nUSC-MSA web (English) reference  : Book 31, Hadith 5963\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عَاصِمٍ، حَدَّثَنِي مُوَرِّقٌ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا قَدِمَ مِنْ سَفَرٍ تُلُقِّيَ بِنَا - قَالَ - فَتُلُقِّيَ بِي وَبِالْحَسَنِ أَوْ بِالْحُسَيْنِ - قَالَ - فَحَمَلَ أَحَدَنَا بَيْنَ يَدَيْهِ وَالآخَرَ خَلْفَهُ حَتَّى دَخَلْنَا الْمَدِينَةَ ."
  },
  "2429": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2429\nIn-book reference  : Book 44, Hadith 100\nUSC-MSA web (English) reference  : Book 31, Hadith 5964\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ، أَبِي يَعْقُوبَ عَنِ الْحَسَنِ بْنِ سَعْدٍ، مَوْلَى الْحَسَنِ بْنِ عَلِيٍّ عَنْ عَبْدِ اللَّهِ بْنِ جَعْفَرٍ، قَالَ أَرْدَفَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ خَلْفَهُ فَأَسَرَّ إِلَىَّ حَدِيثًا لاَ أُحَدِّثُ بِهِ أَحَدًا مِنَ النَّاسِ ."
  },
  "2430": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2430\nIn-book reference  : Book 44, Hadith 101\nUSC-MSA web (English) reference  : Book 31, Hadith 5965\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ وَوَكِيعٌ وَأَبُو مُعَاوِيَةَ ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، وَاللَّفْظُ، حَدِيثُ أَبِي أُسَامَةَ ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ جَعْفَرٍ، يَقُولُ سَمِعْتُ عَلِيًّا، بِالْكُوفَةِ يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" خَيْرُ نِسَائِهَا مَرْيَمُ بِنْتُ عِمْرَانَ وَخَيْرُ نِسَائِهَا خَدِيجَةُ بِنْتُ خُوَيْلِدٍ \" . قَالَ أَبُو كُرَيْبٍ وَأَشَارَ وَكِيعٌ إِلَى السَّمَاءِ وَالأَرْضِ ."
  },
  "2431": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2431\nIn-book reference  : Book 44, Hadith 102\nUSC-MSA web (English) reference  : Book 31, Hadith 5966\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا مُحَمَّدُ، بْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ، بْنُ مُعَاذٍ الْعَنْبَرِيُّ - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ مُرَّةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كَمَلَ مِنَ الرِّجَالِ كَثِيرٌ وَلَمْ يَكْمُلْ مِنَ النِّسَاءِ غَيْرُ مَرْيَمَ بِنْتِ عِمْرَانَ وَآسِيَةَ امْرَأَةِ فِرْعَوْنَ وَإِنَّ فَضْلَ عَائِشَةَ عَلَى النِّسَاءِ كَفَضْلِ الثَّرِيدِ عَلَى سَائِرِ الطَّعَامِ \" ."
  },
  "2432": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2432\nIn-book reference  : Book 44, Hadith 103\nUSC-MSA web (English) reference  : Book 31, Hadith 5967\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَابْنُ نُمَيْرٍ قَالُوا حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، قَالَ أَتَى جِبْرِيلُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هَذِهِ خَدِيجَةُ قَدْ أَتَتْكَ مَعَهَا إِنَاءٌ فِيهِ إِدَامٌ أَوْ طَعَامٌ أَوْ شَرَابٌ فَإِذَا هِيَ أَتَتْكَ فَاقْرَأْ عَلَيْهَا السَّلاَمَ مِنْ رَبِّهَا عَزَّ وَجَلَّ وَمِنِّي وَبَشِّرْهَا بِبَيْتٍ فِي الْجَنَّةِ مِنْ قَصَبٍ لاَ صَخَبَ فِيهِ وَلاَ نَصَبَ . قَالَ أَبُو بَكْرٍ فِي رِوَايَتِهِ عَنْ أَبِي هُرَيْرَةَ وَلَمْ يَقُلْ سَمِعْتُ . وَلَمْ يَقُلْ فِي الْحَدِيثِ وَمِنِّي ."
  },
  "2433": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2433b\nIn-book reference  : Book 44, Hadith 105\nUSC-MSA web (English) reference  : Book 31, Hadith 5969\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، وَجَرِيرٌ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ ابْنِ أَبِي أَوْفَى، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2434": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2434\nIn-book reference  : Book 44, Hadith 106\nUSC-MSA web (English) reference  : Book 31, Hadith 5970\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ بَشَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم خَدِيجَةَ بِنْتَ خُوَيْلِدٍ بِبَيْتٍ فِي الْجَنَّةِ ."
  },
  "2435": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2435d\nIn-book reference  : Book 44, Hadith 110\nUSC-MSA web (English) reference  : Book 31, Hadith 5974\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ مَا غِرْتُ لِلنَّبِيِّ صلى الله عليه وسلم عَلَى امْرَأَةٍ مِنْ نِسَائِهِ مَا غِرْتُ عَلَى خَدِيجَةَ لِكَثْرَةِ ذِكْرِهِ إِيَّاهَا وَمَا رَأَيْتُهَا قَطُّ ."
  },
  "2436": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2436\nIn-book reference  : Book 44, Hadith 111\nUSC-MSA web (English) reference  : Book 31, Hadith 5975\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمْ يَتَزَوَّجِ النَّبِيُّ صلى الله عليه وسلم عَلَى خَدِيجَةَ حَتَّى مَاتَتْ ."
  },
  "2437": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2437\nIn-book reference  : Book 44, Hadith 112\nUSC-MSA web (English) reference  : Book 31, Hadith 5976\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتِ اسْتَأْذَنَتْ هَالَةُ بِنْتُ خُوَيْلِدٍ أُخْتُ خَدِيجَةَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَعَرَفَ اسْتِئْذَانَ خَدِيجَةَ فَارْتَاحَ لِذَلِكَ فَقَالَ \" اللَّهُمَّ هَالَةُ بِنْتُ خُوَيْلِدٍ \" . فَغِرْتُ فَقُلْتُ وَمَا تَذْكُرُ مِنْ عَجُوزٍ مِنْ عَجَائِزِ قُرَيْشٍ حَمْرَاءِ الشِّدْقَيْنِ هَلَكَتْ فِي الدَّهْرِ فَأَبْدَلَكَ اللَّهُ خَيْرًا مِنْهَا ."
  },
  "2438": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2438b\nIn-book reference  : Book 44, Hadith 114\nUSC-MSA web (English) reference  : Book 31, Hadith 5978\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، جَمِيعًا عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2439": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2439b\nIn-book reference  : Book 44, Hadith 116\nUSC-MSA web (English) reference  : Book 31, Hadith 5980\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ لاَ وَرَبِّ إِبْرَاهِيمَ . وَلَمْ يَذْكُرْ مَا بَعْدَهُ ."
  },
  "2440": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2440b\nIn-book reference  : Book 44, Hadith 118\nUSC-MSA web (English) reference  : Book 31, Hadith 5982\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ وَقَالَ فِي حَدِيثِ جَرِيرٍ كُنْتُ أَلْعَبُ بِالْبَنَاتِ فِي بَيْتِهِ وَهُنَّ اللُّعَبُ ."
  },
  "2441": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2441\nIn-book reference  : Book 44, Hadith 119\nUSC-MSA web (English) reference  : Book 31, Hadith 5983\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ النَّاسَ، كَانُوا يَتَحَرَّوْنَ بِهَدَايَاهُمْ يَوْمَ عَائِشَةَ يَبْتَغُونَ بِذَلِكَ مَرْضَاةَ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "2442": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2442b\nIn-book reference  : Book 44, Hadith 121\nUSC-MSA web (English) reference  : Book 31, Hadith 5984\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِيهِ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، قَالَ عَبْدُ اللَّهِ بْنُ عُثْمَانَ حَدَّثَنِيهِ عَنْ عَبْدِ، اللَّهِ بْنِ الْمُبَارَكِ عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . مِثْلَهُ فِي الْمَعْنَى غَيْرَ أَنَّهُ قَالَ فَلَمَّا وَقَعْتُ بِهَا لَمْ أَنْشَبْهَا أَنْ أَثْخَنْتُهَا غَلَبَةً ."
  },
  "2443": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2443\nIn-book reference  : Book 44, Hadith 122\nUSC-MSA web (English) reference  : Book 31, Hadith 5985\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ وَجَدْتُ فِي كِتَابِي عَنْ أَبِي أُسَامَةَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَيَتَفَقَّدُ يَقُولُ \" أَيْنَ أَنَا الْيَوْمَ أَيْنَ أَنَا غَدًا \" . اسْتِبْطَاءً لِيَوْمِ عَائِشَةَ . قَالَتْ فَلَمَّا كَانَ يَوْمِي قَبَضَهُ اللَّهُ بَيْنَ سَحْرِي وَنَحْرِي ."
  },
  "2444": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2444e\nIn-book reference  : Book 44, Hadith 127\nUSC-MSA web (English) reference  : Book 31, Hadith 5990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَعُرْوَةُ بْنُ الزُّبَيْرِ، فِي رِجَالٍ مِنْ أَهْلِ الْعِلْمِ أَنَّ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهُوَ صَحِيحٌ \" إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ فِي الْجَنَّةِ ثُمَّ يُخَيَّرُ \" . قَالَتْ عَائِشَةُ فَلَمَّا نَزَلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَرَأْسُهُ عَلَى فَخِذِي غُشِيَ عَلَيْهِ سَاعَةً ثُمَّ أَفَاقَ فَأَشْخَصَ بَصَرَهُ إِلَى السَّقْفِ ثُمَّ قَالَ \" اللَّهُمَّ الرَّفِيقَ الأَعْلَى \" . قَالَتْ عَائِشَةُ قُلْتُ إِذًا لاَ يَخْتَارُنَا . قَالَتْ عَائِشَةُ وَعَرَفْتُ الْحَدِيثَ الَّذِي كَانَ يُحَدِّثُنَا بِهِ وَهُوَ صَحِيحٌ فِي قَوْلِهِ \" إِنَّهُ لَمْ يُقْبَضْ نَبِيٌّ قَطُّ حَتَّى يَرَى مَقْعَدَهُ مِنَ الْجَنَّةِ ثُمَّ يُخَيَّرُ \" . قَالَتْ عَائِشَةُ فَكَانَتْ تِلْكَ آخِرُ كَلِمَةٍ تَكَلَّمَ بِهَا رَسُولُ اللَّهِ صلى الله عليه وسلم قَوْلَهُ \" اللَّهُمَّ الرَّفِيقَ الأَعْلَى \" ."
  },
  "2445": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2445\nIn-book reference  : Book 44, Hadith 128\nUSC-MSA web (English) reference  : Book 31, Hadith 5991\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، كِلاَهُمَا عَنْ أَبِي نُعَيْمٍ، قَالَ عَبْدٌ حَدَّثَنَا أَبُو نُعَيْمٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ أَيْمَنَ، حَدَّثَنِي ابْنُ أَبِي مُلَيْكَةَ، عَنِ الْقَاسِمِ، بْنِ مُحَمَّدٍ عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا خَرَجَ أَقْرَعَ بَيْنَ نِسَائِهِ فَطَارَتِ الْقُرْعَةُ عَلَى عَائِشَةَ وَحَفْصَةَ فَخَرَجَتَا مَعَهُ جَمِيعًا وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا كَانَ بِاللَّيْلِ سَارَ مَعَ عَائِشَةَ يَتَحَدَّثُ مَعَهَا فَقَالَتْ حَفْصَةُ لِعَائِشَةَ أَلاَ تَرْكَبِينَ اللَّيْلَةَ بَعِيرِي وَأَرْكَبُ بَعِيرَكِ فَتَنْظُرِينَ وَأَنْظُرُ قَالَتْ بَلَى . فَرَكِبَتْ عَائِشَةُ عَلَى بَعِيرِ حَفْصَةَ وَرَكِبَتْ حَفْصَةُ عَلَى بَعِيرِ عَائِشَةَ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى جَمَلِ عَائِشَةَ وَعَلَيْهِ حَفْصَةُ فَسَلَّمَ ثُمَّ صَارَ مَعَهَا حَتَّى نَزَلُوا فَافْتَقَدَتْهُ عَائِشَةُ فَغَارَتْ فَلَمَّا نَزَلُوا جَعَلَتْ تَجْعَلُ رِجْلَهَا بَيْنَ الإِذْخِرِ وَتَقُولُ يَا رَبِّ سَلِّطْ عَلَىَّ عَقْرَبًا أَوْ حَيَّةً تَلْدَغُنِي رَسُولُكَ وَلاَ أَسْتَطِيعُ أَنْ أَقُولَ لَهُ شَيْئًا ."
  },
  "2446": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2446b\nIn-book reference  : Book 44, Hadith 130\nUSC-MSA web (English) reference  : Book 31, Hadith 5993\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، يَعْنُونَ ابْنَ جَعْفَرٍ ح وَحَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - كِلاَهُمَا عَنْ عَبْدِ اللَّهِ بْنِ، عَبْدِ الرَّحْمَنِ عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِهِ وَلَيْسَ فِي حَدِيثِهِمَا سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم . وَفِي حَدِيثِ إِسْمَاعِيلَ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ ."
  },
  "2447": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2447d\nIn-book reference  : Book 44, Hadith 134\nUSC-MSA web (English) reference  : Book 31, Hadith 5997\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا عَائِشُ هَذَا جِبْرِيلُ يَقْرَأُ عَلَيْكِ السَّلاَمَ \" . قَالَتْ فَقُلْتُ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ . قَالَتْ وَهُوَ يَرَى مَا لاَ أَرَى ."
  },
  "2448": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2448b\nIn-book reference  : Book 44, Hadith 136\nUSC-MSA web (English) reference  : Book 31, Hadith 5998\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِيهِ الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا مُوسَى بْنُ إِسْمَاعِيلَ، حَدَّثَنَا سَعِيدُ، بْنُ سَلَمَةَ عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ عَيَايَاءُ طَبَاقَاءُ . وَلَمْ يَشُكَّ وَقَالَ قَلِيلاَتُ الْمَسَارِحِ . وَقَالَ وَصِفْرُ رِدَائِهَا وَخَيْرُ نِسَائِهَا وَعَقْرُ جَارَتِهَا . وَقَالَ وَلاَ تَنْقُثُ مِيرَتَنَا تَنْقِيثًا . وَقَالَ وَأَعْطَانِي مِنْ كُلِّ ذَابِحَةٍ زَوْجًا ."
  },
  "2449": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2449e\nIn-book reference  : Book 44, Hadith 141\nUSC-MSA web (English) reference  : Book 31, Hadith 6002\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِيهِ أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا وَهْبٌ، - يَعْنِي ابْنَ جَرِيرٍ - عَنْ أَبِيهِ، قَالَ سَمِعْتُ النُّعْمَانَ، - يَعْنِي ابْنَ رَاشِدٍ - يُحَدِّثُ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2450": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2450c\nIn-book reference  : Book 44, Hadith 144\nUSC-MSA web (English) reference  : Book 31, Hadith 6005\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ زَكَرِيَّاءَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا زَكَرِيَّاءُ، عَنْ فِرَاسٍ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتِ اجْتَمَعَ نِسَاءُ النَّبِيِّ صلى الله عليه وسلم فَلَمْ يُغَادِرْ مِنْهُنَّ امْرَأَةً فَجَاءَتْ فَاطِمَةُ تَمْشِي كَأَنَّ مِشْيَتَهَا مِشْيَةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" مَرْحَبًا بِابْنَتِي \" . فَأَجْلَسَهَا عَنْ يَمِينِهِ أَوْ عَنْ شِمَالِهِ ثُمَّ إِنَّهُ أَسَرَّ إِلَيْهَا حَدِيثًا فَبَكَتْ فَاطِمَةُ ثُمَّ إِنَّهُ سَارَّهَا فَضَحِكَتْ أَيْضًا فَقُلْتُ لَهَا مَا يُبْكِيكِ فَقَالَتْ مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَقُلْتُ مَا رَأَيْتُ كَالْيَوْمِ فَرَحًا أَقْرَبَ مِنْ حُزْنٍ . فَقُلْتُ لَهَا حِينَ بَكَتْ أَخَصَّكِ رَسُولُ اللَّهِ صلى الله عليه وسلم بِحَدِيثِهِ دُونَنَا ثُمَّ تَبْكِينَ وَسَأَلْتُهَا عَمَّا قَالَ فَقَالَتْ مَا كُنْتُ لأُفْشِيَ سِرَّ رَسُولِ اللَّهِ صلى الله عليه وسلم . حَتَّى إِذَا قُبِضَ سَأَلْتُهَا فَقَالَتْ إِنَّهُ كَانَ حَدَّثَنِي \" أَنَّ جِبْرِيلَ كَانَ يُعَارِضُهُ بِالْقُرْآنِ كُلَّ عَامٍ مَرَّةً وَإِنَّهُ عَارَضَهُ بِهِ فِي الْعَامِ مَرَّتَيْنِ وَلاَ أُرَانِي إِلاَّ قَدْ حَضَرَ أَجَلِي وَإِنَّكِ أَوَّلُ أَهْلِي لُحُوقًا بِي وَنِعْمَ السَّلَفُ أَنَا لَكِ \" . فَبَكَيْتُ لِذَلِكِ ثُمَّ إِنَّهُ سَارَّنِي فَقَالَ \" أَلاَ تَرْضَيْنَ أَنْ تَكُونِي سَيِّدَةَ نِسَاءِ الْمُؤْمِنِينَ أَوْ سَيِّدَةَ نِسَاءِ هَذِهِ الأُمَّةِ \" . فَضَحِكْتُ لِذَلِكِ ."
  },
  "2451": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2451\nIn-book reference  : Book 44, Hadith 145\nUSC-MSA web (English) reference  : Book 31, Hadith 6006\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبْدُ الأَعْلَى بْنُ حَمَّادٍ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى الْقَيْسِيُّ، كِلاَهُمَا عَنِ الْمُعْتَمِرِ، - قَالَ ابْنُ حَمَّادٍ حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، - قَالَ سَمِعْتُ أَبِي، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ سَلْمَانَ، قَالَ لاَ تَكُونَنَّ إِنِ اسْتَطَعْتَ أَوَّلَ مَنْ يَدْخُلُ السُّوقَ وَلاَ آخِرَ مَنْ يَخْرُجُ مِنْهَا فَإِنَّهَا مَعْرَكَةُ الشَّيْطَانِ وَبِهَا يَنْصِبُ رَايَتَهُ . قَالَ وَأُنْبِئْتُ أَنَّ جِبْرِيلَ عَلَيْهِ السَّلاَمُ أَتَى نَبِيَّ اللَّهِ صلى الله عليه وسلم وَعِنْدَهُ أُمُّ سَلَمَةَ - قَالَ - فَجَعَلَ يَتَحَدَّثُ ثُمَّ قَامَ فَقَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم لأُمِّ سَلَمَةَ \" مَنْ هَذَا \" . أَوْ كَمَا قَالَ قَالَتْ هَذَا دِحْيَةُ - قَالَ - فَقَالَتْ أُمُّ سَلَمَةَ ايْمُ اللَّهِ مَا حَسِبْتُهُ إِلاَّ إِيَّاهُ حَتَّى سَمِعْتُ خُطْبَةَ نَبِيِّ اللَّهِ صلى الله عليه وسلم يُخْبِرُ خَبَرَنَا أَوْ كَمَا قَالَ قَالَ فَقُلْتُ لأَبِي عُثْمَانَ مِمَّنْ سَمِعْتَ هَذَا قَالَ مِنْ أُسَامَةَ بْنِ زَيْدٍ ."
  },
  "2452": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2452\nIn-book reference  : Book 44, Hadith 146\nUSC-MSA web (English) reference  : Book 31, Hadith 6007\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ أَبُو أَحْمَدَ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى السِّيْنَانِيُّ، أَخْبَرَنَا طَلْحَةُ بْنُ يَحْيَى بْنِ طَلْحَةَ، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَسْرَعُكُنَّ لَحَاقًا بِي أَطْوَلُكُنَّ يَدًا \" . قَالَتْ فَكُنَّ يَتَطَاوَلْنَ أَيَّتُهُنَّ أَطْوَلُ يَدًا . قَالَتْ فَكَانَتْ أَطْوَلَنَا يَدًا زَيْنَبُ لأَنَّهَا كَانَتْ تَعْمَلُ بِيَدِهَا وَتَصَدَّقُ ."
  },
  "2453": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2453\nIn-book reference  : Book 44, Hadith 147\nUSC-MSA web (English) reference  : Book 31, Hadith 6008\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ سُلَيْمَانَ بْنِ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ انْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى أُمِّ أَيْمَنَ فَانْطَلَقْتُ مَعَهُ فَنَاوَلَتْهُ إِنَاءً فِيهِ شَرَابٌ - قَالَ - فَلاَ أَدْرِي أَصَادَفَتْهُ صَائِمًا أَوْ لَمْ يُرِدْهُ فَجَعَلَتْ تَصْخَبُ عَلَيْهِ وَتَذَمَّرُ عَلَيْهِ ."
  },
  "2454": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2454\nIn-book reference  : Book 44, Hadith 148\nUSC-MSA web (English) reference  : Book 31, Hadith 6009\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، أَخْبَرَنِي عَمْرُو بْنُ عَاصِمٍ الْكِلاَبِيُّ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ أَبُو بَكْرٍ رضى الله عنه بَعْدَ وَفَاةِ رَسُولِ اللَّهِ صلى الله عليه وسلم لِعُمَرَ انْطَلِقْ بِنَا إِلَى أُمِّ أَيْمَنَ نَزُورُهَا كَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَزُورُهَا . فَلَمَّا انْتَهَيْنَا إِلَيْهَا بَكَتْ فَقَالاَ لَهَا مَا يُبْكِيكِ مَا عِنْدَ اللَّهِ خَيْرٌ لِرَسُولِهِ صلى الله عليه وسلم . فَقَالَتْ مَا أَبْكِي أَنْ لاَ أَكُونَ أَعْلَمُ أَنَّ مَا عِنْدَ اللَّهِ خَيْرٌ لِرَسُولِهِ صلى الله عليه وسلم وَلَكِنْ أَبْكِي أَنَّ الْوَحْىَ قَدِ انْقَطَعَ مِنَ السَّمَاءِ . فَهَيَّجَتْهُمَا عَلَى الْبُكَاءِ فَجَعَلاَ يَبْكِيَانِ مَعَهَا ."
  },
  "2455": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2455\nIn-book reference  : Book 44, Hadith 149\nUSC-MSA web (English) reference  : Book 31, Hadith 6010\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، عَنْ إِسْحَاقَ بْنِ عَبْدِ، اللَّهِ عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم لاَ يَدْخُلُ عَلَى أَحَدٍ مِنَ النِّسَاءِ إِلاَّ عَلَى أَزْوَاجِهِ إِلاَّ أُمِّ سُلَيْمٍ فَإِنَّهُ كَانَ يَدْخُلُ عَلَيْهَا فَقِيلَ لَهُ فِي ذَلِكَ فَقَالَ \" إِنِّي أَرْحَمُهَا قُتِلَ أَخُوهَا مَعِي \" ."
  },
  "2456": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2456\nIn-book reference  : Book 44, Hadith 150\nUSC-MSA web (English) reference  : Book 31, Hadith 6011\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرٌ، - يَعْنِي ابْنَ السَّرِيِّ - حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" دَخَلْتُ الْجَنَّةَ فَسَمِعْتُ خَشْفَةً فَقُلْتُ مَنْ هَذَا قَالُوا هَذِهِ الْغُمَيْصَاءُ بِنْتُ مِلْحَانَ أُمُّ أَنَسِ بْنِ مَالِكٍ \" ."
  },
  "2457": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2457\nIn-book reference  : Book 44, Hadith 151\nUSC-MSA web (English) reference  : Book 31, Hadith 6012\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَبُو جَعْفَرٍ، مُحَمَّدُ بْنُ الْفَرَجِ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، أَخْبَرَنِي عَبْدُ الْعَزِيزِ، بْنُ أَبِي سَلَمَةَ أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أُرِيتُ الْجَنَّةَ فَرَأَيْتُ امْرَأَةَ أَبِي طَلْحَةَ ثُمَّ سَمِعْتُ خَشْخَشَةً أَمَامِي فَإِذَا بِلاَلٌ \" ."
  },
  "2144": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2144e\nIn-book reference  : Book 44, Hadith 153\nUSC-MSA web (English) reference  : Book 31, Hadith 6014\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ، الْمُغِيرَةِ حَدَّثَنَا ثَابِتٌ، حَدَّثَنِي أَنَسُ بْنُ مَالِكٍ، قَالَ مَاتَ ابْنٌ لأَبِي طَلْحَةَ . وَاقْتَصَّ الْحَدِيثَ بِمِثْلِهِ ."
  },
  "2458": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2458\nIn-book reference  : Book 44, Hadith 154\nUSC-MSA web (English) reference  : Book 31, Hadith 6015\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُبَيْدُ بْنُ يَعِيشَ، وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ أَبِي حَيَّانَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ يَحْيَى بْنُ سَعِيدٍ عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِبِلاَلٍ عِنْدَ صَلاَةِ الْغَدَاةِ \" يَا بِلاَلُ حَدِّثْنِي بِأَرْجَى عَمَلٍ عَمِلْتَهُ عِنْدَكَ فِي الإِسْلاَمِ مَنْفَعَةً فَإِنِّي سَمِعْتُ اللَّيْلَةَ خَشْفَ نَعْلَيْكَ بَيْنَ يَدَىَّ فِي الْجَنَّةِ \" . قَالَ بِلاَلٌ مَا عَمِلْتُ عَمَلاً فِي الإِسْلاَمِ أَرْجَى عِنْدِي مَنْفَعَةً مِنْ أَنِّي لاَ أَتَطَهَّرُ طُهُورًا تَامًّا فِي سَاعَةٍ مِنْ لَيْلٍ وَلاَ نَهَارٍ إِلاَّ صَلَّيْتُ بِذَلِكَ الطُّهُورِ مَا كَتَبَ اللَّهُ لِي أَنْ أُصَلِّيَ ."
  },
  "2459": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2459\nIn-book reference  : Book 44, Hadith 155\nUSC-MSA web (English) reference  : Book 31, Hadith 6016\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، وَسَهْلُ بْنُ عُثْمَانَ، وَعَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ، زُرَارَةَ الْحَضْرَمِيُّ وَسُوَيْدُ بْنُ سَعِيدٍ وَالْوَلِيدُ بْنُ شُجَاعٍ قَالَ سَهْلٌ وَمِنْجَابٌ أَخْبَرَنَا وَقَالَ، الآخَرُونَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ { لَيْسَ عَلَى الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ جُنَاحٌ فِيمَا طَعِمُوا إِذَا مَا اتَّقَوْا وَآمَنُوا} إِلَى آخِرِ الآيَةِ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" قِيلَ لِي أَنْتَ مِنْهُمْ \" ."
  },
  "2460": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2460c\nIn-book reference  : Book 44, Hadith 158\nUSC-MSA web (English) reference  : Book 31, Hadith 6018\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالُوا حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَسْوَدِ، عَنْ أَبِي مُوسَى، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا أُرَى أَنَّ عَبْدَ اللَّهِ مِنْ أَهْلِ الْبَيْتِ . أَوْ مَا ذَكَرَ مِنْ نَحْوِ هَذَا ."
  },
  "2461": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2461c\nIn-book reference  : Book 44, Hadith 161\nUSC-MSA web (English) reference  : Book 31, Hadith 6021\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، - هُوَ ابْنُ مُوسَى - عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ مَالِكِ بْنِ الْحَارِثِ، عَنْ أَبِي الأَحْوَصِ، قَالَ أَتَيْتُ أَبَا مُوسَى فَوَجَدْتُ عَبْدَ اللَّهِ وَأَبَا مُوسَى ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عُبَيْدَةَ، حَدَّثَنَا أَبِي، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ وَهْبٍ، قَالَ كُنْتُ جَالِسًا مَعَ حُذَيْفَةَ وَأَبِي مُوسَى وَسَاقَ الْحَدِيثَ وَحَدِيثُ قُطْبَةَ أَتَمُّ وَأَكْثَرُ ."
  },
  "2462": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2462\nIn-book reference  : Book 44, Hadith 162\nUSC-MSA web (English) reference  : Book 31, Hadith 6022\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، حَدَّثَنَا الأَعْمَشُ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، أَنَّهُ قَالَ { وَمَنْ يَغْلُلْ يَأْتِ بِمَا غَلَّ يَوْمَ الْقِيَامَةِ} ثُمَّ قَالَ عَلَى قِرَاءَةِ مَنْ تَأْمُرُونِي أَنْ أَقْرَأَ فَلَقَدْ قَرَأْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِضْعًا وَسَبْعِينَ سُورَةً وَلَقَدْ عَلِمَ أَصْحَابُ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنِّي أَعْلَمُهُمْ بِكِتَابِ اللَّهِ وَلَوْ أَعْلَمُ أَنَّ أَحَدًا أَعْلَمُ مِنِّي لَرَحَلْتُ إِلَيْهِ . قَالَ شَقِيقٌ فَجَلَسْتُ فِي حَلَقِ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم فَمَا سَمِعْتُ أَحَدًا يَرُدُّ ذَلِكَ عَلَيْهِ وَلاَ يَعِيبُهُ ."
  },
  "2463": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2463\nIn-book reference  : Book 44, Hadith 163\nUSC-MSA web (English) reference  : Book 31, Hadith 6023\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا قُطْبَةُ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ وَالَّذِي لاَ إِلَهَ غَيْرُهُ مَا مِنْ كِتَابِ اللَّهِ سُورَةٌ إِلاَّ أَنَا أَعْلَمُ حَيْثُ نَزَلَتْ وَمَا مِنْ آيَةٍ إِلاَّ أَنَا أَعْلَمُ فِيمَا أُنْزِلَتْ وَلَوْ أَعْلَمُ أَحَدًا هُوَ أَعْلَمُ بِكِتَابِ اللَّهِ مِنِّي تَبْلُغُهُ الإِبِلُ لَرَكِبْتُ إِلَيْهِ ."
  },
  "2464": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2464f\nIn-book reference  : Book 44, Hadith 169\nUSC-MSA web (English) reference  : Book 31, Hadith 6028\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَزَادَ قَالَ شُعْبَةُ بَدَأَ بِهَذَيْنِ لاَ أَدْرِي بِأَيِّهِمَا بَدَأَ ."
  },
  "2465": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2465b\nIn-book reference  : Book 44, Hadith 171\nUSC-MSA web (English) reference  : Book 31, Hadith 6030\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَبُو دَاوُدَ، سُلَيْمَانُ بْنُ مَعْبَدٍ حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، قَالَ قُلْتُ لأَنَسِ بْنِ مَالِكٍ مَنْ جَمَعَ الْقُرْآنَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَرْبَعَةٌ كُلُّهُمْ مِنَ الأَنْصَارِ أُبَىُّ بْنُ كَعْبٍ وَمُعَاذُ بْنُ جَبَلٍ وَزَيْدُ بْنُ ثَابِتٍ وَرَجُلٌ مِنَ الأَنْصَارِ يُكْنَى أَبَا زَيْدٍ ."
  },
  "799": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 799f\nIn-book reference  : Book 44, Hadith 174\nUSC-MSA web (English) reference  : Book 31, Hadith 6032\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأُبَىٍّ بِمِثْلِهِ ."
  },
  "2466": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2466b\nIn-book reference  : Book 44, Hadith 176\nUSC-MSA web (English) reference  : Book 31, Hadith 6034\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ الأَوْدِيُّ، حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي، سُفْيَانُ عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اهْتَزَّ عَرْشُ الرَّحْمَنِ لِمَوْتِ سَعْدِ بْنِ مُعَاذٍ \" ."
  },
  "2467": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2467\nIn-book reference  : Book 44, Hadith 177\nUSC-MSA web (English) reference  : Book 31, Hadith 6035\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَطَاءٍ الْخَفَّافُ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ وَجِنَازَتُهُ مَوْضُوعَةٌ - يَعْنِي سَعْدًا - \" اهْتَزَّ لَهَا عَرْشُ الرَّحْمَنِ \" ."
  },
  "2468": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2468c\nIn-book reference  : Book 44, Hadith 180\nUSC-MSA web (English) reference  : Book 31, Hadith 6038\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا أُمَيَّةُ بْنُ خَالِدٍ، حَدَّثَنَا شُعْبَةُ، بِهَذَا الْحَدِيثِ بِالإِسْنَادَيْنِ جَمِيعًا كَرِوَايَةِ أَبِي دَاوُدَ ."
  },
  "2469": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2469b\nIn-book reference  : Book 44, Hadith 182\nUSC-MSA web (English) reference  : Book 31, Hadith 6039\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا سَالِمُ بْنُ نُوحٍ، حَدَّثَنَا عُمَرُ بْنُ عَامِرٍ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ أُكَيْدِرَ، دُومَةِ الْجَنْدَلِ أَهْدَى لِرَسُولِ اللَّهِ صلى الله عليه وسلم . حُلَّةً فَذَكَرَ نَحْوَهُ وَلَمْ يَذْكُرْ فِيهِ وَكَانَ يَنْهَى عَنِ الْحَرِيرِ ."
  },
  "2470": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2470\nIn-book reference  : Book 44, Hadith 183\nUSC-MSA web (English) reference  : Book 31, Hadith 6040\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَخَذَ سَيْفًا يَوْمَ أُحُدٍ فَقَالَ \" مَنْ يَأْخُذُ مِنِّي هَذَا \" . فَبَسَطُوا أَيْدِيَهُمْ كُلُّ إِنْسَانٍ مِنْهُمْ يَقُولُ أَنَا أَنَا . قَالَ \" فَمَنْ يَأْخُذُهُ بِحَقِّهِ \" . قَالَ فَأَحْجَمَ الْقَوْمُ فَقَالَ سِمَاكُ بْنُ خَرَشَةَ أَبُو دُجَانَةَ أَنَا آخُذُهُ بِحَقِّهِ . قَالَ فَأَخَذَهُ فَفَلَقَ بِهِ هَامَ الْمُشْرِكِينَ ."
  },
  "2471": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2471d\nIn-book reference  : Book 44, Hadith 187\nUSC-MSA web (English) reference  : Book 31, Hadith 6044\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ عَدِيٍّ، أَخْبَرَنَا عُبَيْدُ اللَّهِ، بْنُ عَمْرٍو عَنْ عَبْدِ الْكَرِيمِ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ جِيءَ بِأَبِي يَوْمَ أُحُدٍ مُجَدَّعًا فَوُضِعَ بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم . فَذَكَرَ نَحْوَ حَدِيثِهِمْ ."
  },
  "2472": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2472\nIn-book reference  : Book 44, Hadith 188\nUSC-MSA web (English) reference  : Book 31, Hadith 6045\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ عُمَرَ بْنِ سَلِيطٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ كِنَانَةَ، بْنِ نُعَيْمٍ عَنْ أَبِي بَرْزَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ فِي مَغْزًى لَهُ فَأَفَاءَ اللَّهُ عَلَيْهِ فَقَالَ لأَصْحَابِهِ \" هَلْ تَفْقِدُونَ مِنْ أَحَدٍ \" . قَالُوا نَعَمْ فُلاَنًا وَفُلاَنًا وَفُلاَنًا . ثُمَّ قَالَ \" هَلْ تَفْقِدُونَ مِنْ أَحَدٍ \" . قَالُوا نَعَمْ فُلاَنًا وَفُلاَنًا وَفُلاَنًا . ثُمَّ قَالَ \" هَلْ تَفْقِدُونَ مِنْ أَحَدٍ \" . قَالُوا لاَ . قَالَ \" لَكِنِّي أَفْقِدُ جُلَيْبِيبًا فَاطْلُبُوهُ \" . فَطُلِبَ فِي الْقَتْلَى فَوَجَدُوهُ إِلَى جَنْبِ سَبْعَةٍ قَدْ قَتَلَهُمْ ثُمَّ قَتَلُوهُ فَأَتَى النَّبِيُّ صلى الله عليه وسلم فَوَقَفَ عَلَيْهِ فَقَالَ \" قَتَلَ سَبْعَةً ثُمَّ قَتَلُوهُ هَذَا مِنِّي وَأَنَا مِنْهُ هَذَا مِنِّي وَأَنَا مِنْهُ \" . قَالَ فَوَضَعَهُ عَلَى سَاعِدَيْهِ لَيْسَ لَهُ إِلاَّ سَاعِدَا النَّبِيِّ صلى الله عليه وسلم قَالَ فَحُفِرَ لَهُ وَوُضِعَ فِي قَبْرِهِ . وَلَمْ يَذْكُرْ غَسْلاً ."
  },
  "2473": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2473c\nIn-book reference  : Book 44, Hadith 191\nUSC-MSA web (English) reference  : Book 31, Hadith 6048\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، حَدَّثَنِي ابْنُ أَبِي عَدِيٍّ، قَالَ أَنْبَأَنَا ابْنُ عَوْنٍ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، قَالَ قَالَ أَبُو ذَرٍّ يَا ابْنَ أَخِي صَلَّيْتُ سَنَتَيْنِ قَبْلَ مَبْعَثِ النَّبِيِّ صلى الله عليه وسلم . قَالَ قُلْتُ فَأَيْنَ كُنْتَ تَوَجَّهُ قَالَ حَيْثُ وَجَّهَنِيَ اللَّهُ . وَاقْتَصَّ الْحَدِيثَ بِنَحْوِ حَدِيثِ سُلَيْمَانَ بْنِ الْمُغِيرَةِ وَقَالَ فِي الْحَدِيثِ فَتَنَافَرَا إِلَى رَجُلٍ مِنَ الْكُهَّانِ . قَالَ فَلَمْ يَزَلْ أَخِي أُنَيْسٌ يَمْدَحُهُ حَتَّى غَلَبَهُ - قَالَ - فَأَخَذْنَا صِرْمَتَهُ فَضَمَمْنَاهَا إِلَى صِرْمَتِنَا . وَقَالَ أَيْضًا فِي حَدِيثِهِ قَالَ فَجَاءَ النَّبِيُّ صلى الله عليه وسلم فَطَافَ بِالْبَيْتِ وَصَلَّى رَكْعَتَيْنِ خَلْفَ الْمَقَامِ - قَالَ - فَأَتَيْتُهُ فَإِنِّي لأَوَّلُ النَّاسِ حَيَّاهُ بِتَحِيَّةِ الإِسْلاَمِ - قَالَ - قُلْتُ السَّلاَمُ عَلَيْكَ يَا رَسُولَ اللَّهِ . قَالَ \" وَعَلَيْكَ السَّلاَمُ مَنْ أَنْتَ \" . وَفِي حَدِيثِهِ أَيْضًا فَقَالَ \" مُنْذُ كَمْ أَنْتَ هَا هُنَا \" . قَالَ قُلْتُ مُنْذُ خَمْسَ عَشْرَةَ . وَفِيهِ فَقَالَ أَبُو بَكْرٍ أَتْحِفْنِي بِضِيَافَتِهِ اللَّيْلَةَ ."
  },
  "2474": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2474\nIn-book reference  : Book 44, Hadith 192\nUSC-MSA web (English) reference  : Book 31, Hadith 6049\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنُ عَرْعَرَةَ السَّامِيُّ، وَمُحَمَّدُ بْنُ حَاتِمٍ، - وَتَقَارَبَا فِي سِيَاقِ الْحَدِيثِ وَاللَّفْظُ لاِبْنِ حَاتِمٍ - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ حَدَّثَنَا الْمُثَنَّى بْنُ سَعِيدٍ عَنْ أَبِي جَمْرَةَ عَنِ ابْنِ عَبَّاسٍ قَالَ لَمَّا بَلَغَ أَبَا ذَرٍّ مَبْعَثُ النَّبِيِّ صلى الله عليه وسلم بِمَكَّةَ قَالَ لأَخِيهِ ارْكَبْ إِلَى هَذَا الْوَادِي فَاعْلَمْ لِي عِلْمَ هَذَا الرَّجُلِ الَّذِي يَزْعُمُ أَنَّهُ يَأْتِيهِ الْخَبَرُ مِنَ السَّمَاءِ فَاسْمَعْ مِنْ قَوْلِهِ ثُمَّ ائْتِنِي . فَانْطَلَقَ الآخَرُ حَتَّى قَدِمَ مَكَّةَ وَسَمِعَ مِنْ قَوْلِهِ ثُمَّ رَجَعَ إِلَى أَبِي ذَرٍّ فَقَالَ رَأَيْتُهُ يَأْمُرُ بِمَكَارِمِ الأَخْلاَقِ وَكَلاَمًا مَا هُوَ بِالشِّعْرِ . فَقَالَ مَا شَفَيْتَنِي فِيمَا أَرَدْتُ . فَتَزَوَّدَ وَحَمَلَ شَنَّةً لَهُ فِيهَا مَاءٌ حَتَّى قَدِمَ مَكَّةَ فَأَتَى الْمَسْجِدَ فَالْتَمَسَ النَّبِيَّ صلى الله عليه وسلم وَلاَ يَعْرِفُهُ وَكَرِهَ أَنْ يَسْأَلَ عَنْهُ حَتَّى أَدْرَكَهُ - يَعْنِي اللَّيْلَ - فَاضْطَجَعَ فَرَآهُ عَلِيٌّ فَعَرَفَ أَنَّهُ غَرِيبٌ فَلَمَّا رَآهُ تَبِعَهُ فَلَمْ يَسْأَلْ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَىْءٍ حَتَّى أَصْبَحَ ثُمَّ احْتَمَلَ قُرَيْبَتَهُ وَزَادَهُ إِلَى الْمَسْجِدِ فَظَلَّ ذَلِكَ الْيَوْمَ وَلاَ يَرَى النَّبِيَّ صلى الله عليه وسلم حَتَّى أَمْسَى فَعَادَ إِلَى مَضْجَعِهِ فَمَرَّ بِهِ عَلِيٌّ فَقَالَ مَا أَنَى لِلرَّجُلِ أَنْ يَعْلَمَ مَنْزِلَهُ فَأَقَامَهُ فَذَهَبَ بِهِ مَعَهُ وَلاَ يَسْأَلُ وَاحِدٌ مِنْهُمَا صَاحِبَهُ عَنْ شَىْءٍ حَتَّى إِذَا كَانَ يَوْمُ الثَّالِثِ فَعَلَ مِثْلَ ذَلِكَ فَأَقَامَهُ عَلِيٌّ مَعَهُ ثُمَّ قَالَ لَهُ أَلاَ تُحَدِّثُنِي مَا الَّذِي أَقْدَمَكَ هَذَا الْبَلَدَ قَالَ إِنْ أَعْطَيْتَنِي عَهْدًا وَمِيثَاقًا لَتُرْشِدَنِّي فَعَلْتُ . فَفَعَلَ فَأَخْبَرَهُ فَقَالَ فَإِنَّهُ حَقٌّ وَهُوَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَإِذَا أَصْبَحْتَ فَاتَّبِعْنِي فَإِنِّي إِنْ رَأَيْتُ شَيْئًا أَخَافُ عَلَيْكَ قُمْتُ كَأَنِّي أُرِيقُ الْمَاءَ فَإِنْ مَضَيْتُ فَاتَّبِعْنِي حَتَّى تَدْخُلَ مَدْخَلِي . فَفَعَلَ فَانْطَلَقَ يَقْفُوهُ حَتَّى دَخَلَ عَلَى النَّبِيِّ صلى الله عليه وسلم وَدَخَلَ مَعَهُ فَسَمِعَ مِنْ قَوْلِهِ وَأَسْلَمَ مَكَانَهُ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" ارْجِعْ إِلَى قَوْمِكَ فَأَخْبِرْهُمْ حَتَّى يَأْتِيَكَ أَمْرِي \" . فَقَالَ وَالَّذِي نَفْسِي بِيَدِهِ لأَصْرُخَنَّ بِهَا بَيْنَ ظَهْرَانَيْهِمْ . فَخَرَجَ حَتَّى أَتَى الْمَسْجِدَ فَنَادَى بِأَعْلَى صَوْتِهِ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ . وَثَارَ الْقَوْمُ فَضَرَبُوهُ حَتَّى أَضْجَعُوهُ فَأَتَى الْعَبَّاسُ فَأَكَبَّ عَلَيْهِ فَقَالَ وَيْلَكُمْ أَلَسْتُمْ تَعْلَمُونَ أَنَّهُ مِنْ غِفَارٍ وَأَنَّ طَرِيقَ تُجَّارِكُمْ إِلَى الشَّامِ عَلَيْهِمْ . فَأَنْقَذَهُ مِنْهُمْ ثُمَّ عَادَ مِنَ الْغَدِ بِمِثْلِهَا وَثَارُوا إِلَيْهِ فَضَرَبُوهُ فَأَكَبَّ عَلَيْهِ الْعَبَّاسُ فَأَنْقَذَهُ ."
  },
  "2475": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2475b\nIn-book reference  : Book 44, Hadith 194\nUSC-MSA web (English) reference  : Book 31, Hadith 6051\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو أُسَامَةَ عَنْ إِسْمَاعِيلَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، قَالَ مَا حَجَبَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم مُنْذُ أَسْلَمْتُ وَلاَ رَآنِي إِلاَّ تَبَسَّمَ فِي وَجْهِي . زَادَ ابْنُ نُمَيْرٍ فِي حَدِيثِهِ عَنِ ابْنِ إِدْرِيسَ وَلَقَدْ شَكَوْتُ إِلَيْهِ أَنِّي لاَ أَثْبُتُ عَلَى الْخَيْلِ فَضَرَبَ بِيَدِهِ فِي صَدْرِي وَقَالَ \" اللَّهُمَّ ثَبِّتْهُ وَاجْعَلْهُ هَادِيًا مَهْدِيًّا \" ."
  },
  "2476": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2476c\nIn-book reference  : Book 44, Hadith 197\nUSC-MSA web (English) reference  : Book 31, Hadith 6054\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ، - يَعْنِي الْفَزَارِيَّ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ وَقَالَ فِي حَدِيثِ مَرْوَانَ فَجَاءَ بَشِيرُ جَرِيرٍ أَبُو أَرْطَاةَ حُصَيْنُ بْنُ رَبِيعَةَ يُبَشِّرُ النَّبِيَّ صلى الله عليه وسلم ."
  },
  "2477": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2477\nIn-book reference  : Book 44, Hadith 198\nUSC-MSA web (English) reference  : Book 31, Hadith 6055\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَأَبُو بَكْرِ بْنُ النَّضْرِ قَالاَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا وَرْقَاءُ بْنُ عُمَرَ الْيَشْكُرِيُّ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ بْنَ أَبِي يَزِيدَ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّوسلم أَتَى الْخَلاَءَ فَوَضَعْتُ لَهُ وَضُوءًا فَلَمَّا خَرَجَ قَالَ \" مَنْ وَضَعَ هَذَا \" . فِي رِوَايَةِ زُهَيْرٍ قَالُوا . وَفِي رِوَايَةِ أَبِي بَكْرٍ قُلْتُ ابْنُ عَبَّاسٍ . قَالَ \" اللَّهُمَّ فَقِّهْهُ \" ."
  },
  "2478": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2478\nIn-book reference  : Book 44, Hadith 199\nUSC-MSA web (English) reference  : Book 31, Hadith 6056\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، وَخَلَفُ بْنُ هِشَامٍ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ كُلُّهُمْ عَنْ حَمَّادِ، بْنِ زَيْدٍ - قَالَ أَبُو الرَّبِيعِ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، - حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ فِي يَدِي قِطْعَةَ إِسْتَبْرَقٍ وَلَيْسَ مَكَانٌ أُرِيدُ مِنَ الْجَنَّةِ إِلاَّ طَارَتْ إِلَيْهِ - قَالَ - فَقَصَصْتُهُ عَلَى حَفْصَةَ فَقَصَّتْهُ حَفْصَةُ عَلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَرَى عَبْدَ اللَّهِ رَجُلاً صَالِحًا \" ."
  },
  "2479": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2479b\nIn-book reference  : Book 44, Hadith 201\nUSC-MSA web (English) reference  : Book 31, Hadith 6058\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُوسَى بْنُ خَالِدٍ، خَتَنُ الْفِرْيَابِيِّ عَنْ أَبِي إِسْحَاقَ الْفَزَارِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ كُنْتُ أَبِيتُ فِي الْمَسْجِدِ وَلَمْ يَكُنْ لِي أَهْلٌ فَرَأَيْتُ فِي الْمَنَامِ كَأَنَّمَا انْطُلِقَ بِي إِلَى بِئْرٍ . فَذَكَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ الزُّهْرِيِّ عَنْ سَالِمٍ عَنْ أَبِيهِ ."
  },
  "2480": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2480c\nIn-book reference  : Book 44, Hadith 204\nUSC-MSA web (English) reference  : Book 31, Hadith 6061\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ هِشَامِ بْنِ زَيْدٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ مِثْلَ ذَلِكَ ."
  },
  "2481": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2481c\nIn-book reference  : Book 44, Hadith 207\nUSC-MSA web (English) reference  : Book 31, Hadith 6064\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا جَعْفَرٌ، - يَعْنِي ابْنَ سُلَيْمَانَ - عَنِ الْجَعْدِ أَبِي عُثْمَانَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، قَالَ مَرَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَمِعَتْ أُمِّي أُمُّ سُلَيْمٍ صَوْتَهُ فَقَالَتْ بِأَبِي وَأُمِّي يَا رَسُولَ اللَّهِ أُنَيْسٌ . فَدَعَا لِي رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثَ دَعَوَاتٍ قَدْ رَأَيْتُ مِنْهَا اثْنَتَيْنِ فِي الدُّنْيَا وَأَنَا أَرْجُو الثَّالِثَةَ فِي الآخِرَةِ ."
  },
  "2482": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2482b\nIn-book reference  : Book 44, Hadith 209\nUSC-MSA web (English) reference  : Book 31, Hadith 6066\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَارِمُ بْنُ الْفَضْلِ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ أَسَرَّ إِلَىَّ نَبِيُّ اللَّهِ صلى الله عليه وسلم سِرًّا فَمَا أَخْبَرْتُ بِهِ أَحَدًا بَعْدُ . وَلَقَدْ سَأَلَتْنِي عَنْهُ أُمُّ سُلَيْمٍ فَمَا أَخْبَرْتُهَا بِهِ ."
  },
  "2484": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2484c\nIn-book reference  : Book 44, Hadith 213\nUSC-MSA web (English) reference  : Book 31, Hadith 6070\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - وَاللَّفْظُ لِقُتَيْبَةَ - حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ سُلَيْمَانَ بْنِ مُسْهِرٍ، عَنْ خَرَشَةَ بْنِ الْحُرِّ، قَالَ كُنْتُ جَالِسًا فِي حَلْقَةٍ فِي مَسْجِدِ الْمَدِينَةِ - قَالَ - وَفِيهَا شَيْخٌ حَسَنُ الْهَيْئَةِ وَهُوَ عَبْدُ اللَّهِ بْنُ سَلاَمٍ - قَالَ - فَجَعَلَ يُحَدِّثُهُمْ حَدِيثًا حَسَنًا - قَالَ - فَلَمَّا قَامَ قَالَ الْقَوْمُ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا . قَالَ فَقُلْتُ وَاللَّهِ لأَتْبَعَنَّهُ فَلأَعْلَمَنَّ مَكَانَ بَيْتِهِ . قَالَ فَتَبِعْتُهُ فَانْطَلَقَ حَتَّى كَادَ أَنْ يَخْرُجَ مِنَ الْمَدِينَةِ ثُمَّ دَخَلَ مَنْزِلَهُ - قَالَ - فَاسْتَأْذَنْتُ عَلَيْهِ فَأَذِنَ لِي فَقَالَ مَا حَاجَتُكَ يَا ابْنَ أَخِي قَالَ فَقُلْتُ لَهُ سَمِعْتُ الْقَوْمَ يَقُولُونَ لَكَ لَمَّا قُمْتَ مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا . فَأَعْجَبَنِي أَنْ أَكُونَ مَعَكَ قَالَ اللَّهُ أَعْلَمُ بِأَهْلِ الْجَنَّةِ وَسَأُحَدِّثُكَ مِمَّ قَالُوا ذَاكَ إِنِّي بَيْنَمَا أَنَا نَائِمٌ إِذْ أَتَانِي رَجُلٌ فَقَالَ لِي قُمْ . فَأَخَذَ بِيَدِي فَانْطَلَقْتُ مَعَهُ - قَالَ - فَإِذَا أَنَا بِجَوَادَّ عَنْ شِمَالِي - قَالَ - فَأَخَذْتُ لآخُذَ فِيهَا فَقَالَ لِي لاَ تَأْخُذْ فِيهَا فَإِنَّهَا طُرُقُ أَصْحَابِ الشِّمَالِ - قَالَ - فَإِذَا جَوَادُّ مَنْهَجٌ عَلَى يَمِيِنِي فَقَالَ لِي خُذْ هَا هُنَا . فَأَتَى بِي جَبَلاً فَقَالَ لِي اصْعَدْ - قَالَ - فَجَعَلْتُ إِذَا أَرَدْتُ أَنْ أَصْعَدَ خَرَرْتُ عَلَى اسْتِي - قَالَ - حَتَّى فَعَلْتُ ذَلِكَ مِرَارًا - قَالَ - ثُمَّ انْطَلَقَ بِي حَتَّى أَتَى بِي عَمُودًا رَأْسُهُ فِي السَّمَاءِ وَأَسْفَلُهُ فِي الأَرْضِ فِي أَعْلاَهُ حَلْقَةٌ فَقَالَ لِيَ . اصْعَدْ فَوْقَ هَذَا . قَالَ قُلْتُ كَيْفَ أَصْعَدُ هَذَا وَرَأْسُهُ فِي السَّمَاءِ - قَالَ - فَأَخَذَ بِيَدِي فَزَجَلَ بِي - قَالَ - فَإِذَا أَنَا مُتَعَلِّقٌ بِالْحَلْقَةِ - قَالَ - ثُمَّ ضَرَبَ الْعَمُودَ فَخَرَّ - قَالَ - وَبَقِيتُ مُتَعَلِّقًا بِالْحَلْقَةِ حَتَّى أَصْبَحْتُ - قَالَ - فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقَصَصْتُهَا عَلَيْهِ فَقَالَ \" أَمَّا الطُّرُقُ الَّتِي رَأَيْتَ عَنْ يَسَارِكَ فَهِيَ طُرُقُ أَصْحَابِ الشِّمَالِ - قَالَ - وَأَمَّا الطُّرُقُ الَّتِي رَأَيْتَ عَنْ يَمِينِكَ فَهِيَ طُرُقُ أَصْحَابِ الْيَمِينِ وَأَمَّا الْجَبَلُ فَهُوَ مَنْزِلُ الشُّهَدَاءِ وَلَنْ تَنَالَهُ وَأَمَّا الْعَمُودُ فَهُوَ عَمُودُ الإِسْلاَمِ وَأَمَّا الْعُرْوَةُ فَهِيَ عُرْوَةُ الإِسْلاَمِ وَلَنْ تَزَالَ مُتَمَسِّكًا بِهَا حَتَّى تَمُوتَ \" ."
  },
  "2485": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2485c\nIn-book reference  : Book 44, Hadith 216\nUSC-MSA web (English) reference  : Book 31, Hadith 6073\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ حَسَّانَ بْنَ ثَابِتٍ الأَنْصَارِيَّ، يَسْتَشْهِدُ أَبَا هُرَيْرَةَ أَنْشُدُكَ اللَّهَ هَلْ سَمِعْتَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" يَا حَسَّانُ أَجِبْ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّهُمَّ أَيِّدْهُ بِرُوحِ الْقُدُسِ \" . قَالَ أَبُو هُرَيْرَةَ نَعَمْ ."
  },
  "2486": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2486b\nIn-book reference  : Book 44, Hadith 218\nUSC-MSA web (English) reference  : Book 31, Hadith 6074\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، ح وَحَدَّثَنَا ابْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ، كُلُّهُمْ عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2487": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2487b\nIn-book reference  : Book 44, Hadith 220\nUSC-MSA web (English) reference  : Book 31, Hadith 6076\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ ."
  },
  "2488": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2488b\nIn-book reference  : Book 44, Hadith 222\nUSC-MSA web (English) reference  : Book 31, Hadith 6078\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ ابْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ وَقَالَ قَالَتْ كَانَ يَذُبُّ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . وَلَمْ يَذْكُرْ حَصَانٌ رَزَانٌ ."
  },
  "2489": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2489b\nIn-book reference  : Book 44, Hadith 224\nUSC-MSA web (English) reference  : Book 31, Hadith 6080\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ، حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، بِهَذَا الإِسْنَادِ قَالَتِ اسْتَأْذَنَ حَسَّانُ بْنُ ثَابِتٍ النَّبِيَّ صلى الله عليه وسلم فِي هِجَاءِ الْمُشْرِكِينَ . وَلَمْ يَذْكُرْ أَبَا سُفْيَانَ وَقَالَ بَدَلَ الْخَمِيرِ الْعَجِينِ ."
  },
  "2490": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2490\nIn-book reference  : Book 44, Hadith 225\nUSC-MSA web (English) reference  : Book 31, Hadith 6081\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، بْنِ عَبْدِ الرَّحْمَنِ عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" اهْجُوا قُرَيْشًا فَإِنَّهُ أَشَدُّ عَلَيْهَا مِنْ رَشْقٍ بِالنَّبْلِ \" . فَأَرْسَلَ إِلَى ابْنِ رَوَاحَةَ فَقَالَ \" اهْجُهُمْ \" . فَهَجَاهُمْ فَلَمْ يُرْضِ فَأَرْسَلَ إِلَى كَعْبِ بْنِ مَالِكٍ ثُمَّ أَرْسَلَ إِلَى حَسَّانَ بْنِ ثَابِتٍ فَلَمَّا دَخَلَ عَلَيْهِ قَالَ حَسَّانُ قَدْ آنَ لَكُمْ أَنْ تُرْسِلُوا إِلَى هَذَا الأَسَدِ الضَّارِبِ بِذَنَبِهِ ثُمَّ أَدْلَعَ لِسَانَهُ فَجَعَلَ يُحَرِّكُهُ فَقَالَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لأَفْرِيَنَّهُمْ بِلِسَانِي فَرْىَ الأَدِيمِ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَعْجَلْ فَإِنَّ أَبَا بَكْرٍ أَعْلَمُ قُرَيْشٍ بِأَنْسَابِهَا - وَإِنَّ لِي فِيهِمْ نَسَبًا - حَتَّى يُلَخِّصَ لَكَ نَسَبِي \" . فَأَتَاهُ حَسَّانُ ثُمَّ رَجَعَ فَقَالَ يَا رَسُولَ اللَّهِ قَدْ لَخَّصَ لِي نَسَبَكَ وَالَّذِي بَعَثَكَ بِالْحَقِّ لأَسُلَّنَّكَ مِنْهُمْ كَمَا تُسَلُّ الشَّعَرَةُ مِنَ الْعَجِينِ . قَالَتْ عَائِشَةُ فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِحَسَّانَ \" إِنَّ رُوحَ الْقُدُسِ لاَ يَزَالُ يُؤَيِّدُكَ مَا نَافَحْتَ عَنِ اللَّهِ وَرَسُولِهِ \" . وَقَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" هَجَاهُمْ حَسَّانُ فَشَفَى وَاشْتَفَى \" . قَالَ حَسَّانُ هَجَوْتَ مُحَمَّدًا فَأَجَبْتُ عَنْهُ وَعِنْدَ اللَّهِ فِي ذَاكَ الْجَزَاءُ هَجَوْتَ مُحَمَّدًا بَرًّا تَقِيًّا رَسُولَ اللَّهِ شِيمَتُهُ الْوَفَاءُ فَإِنَّ أَبِي وَوَالِدَهُ وَعِرْضِي لِعِرْضِ مُحَمَّدٍ مِنْكُمْ وِقَاءُ ثَكِلْتُ بُنَيَّتِي إِنْ لَمْ تَرَوْهَا تُثِيرُ النَّقْعَ مِنْ كَنَفَىْ كَدَاءِ يُبَارِينَ الأَعِنَّةَ مُصْعِدَاتٍ عَلَى أَكْتَافِهَا الأَسَلُ الظِّمَاءُ تَظَلُّ جِيَادُنَا مُتَمَطِّرَاتٍ تُلَطِّمُهُنَّ بِالْخُمُرِ النِّسَاءُ فَإِنْ أَعْرَضْتُمُو عَنَّا اعْتَمَرْنَا وَكَانَ الْفَتْحُ وَانْكَشَفَ الْغِطَاءُ وَإِلاَّ فَاصْبِرُوا لِضِرَابِ يَوْمٍ يُعِزُّ اللَّهُ فِيهِ مَنْ يَشَاءُ وَقَالَ اللَّهُ قَدْ أَرْسَلْتُ عَبْدًا يَقُولُ الْحَقَّ لَيْسَ بِهِ خَفَاءُ وَقَالَ اللَّهُ قَدْ يَسَّرْتُ جُنْدًا هُمُ الأَنْصَارُ عُرْضَتُهَا اللِّقَاءُ لَنَا فِي كُلِّ يَوْمٍ مِنْ مَعَدٍّ سِبَابٌ أَوْ قِتَالٌ أَوْ هِجَاءُ فَمَنْ يَهْجُو رَسُولَ اللَّهِ مِنْكُمْ وَيَمْدَحُهُ وَيَنْصُرُهُ سَوَاءُ وَجِبْرِيلٌ رَسُولُ اللَّهِ فِينَا وَرُوحُ الْقُدْسِ لَيْسَ لَهُ كِفَاءُ"
  },
  "2491": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2491\nIn-book reference  : Book 44, Hadith 226\nUSC-MSA web (English) reference  : Book 31, Hadith 6082\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ أَبِي كَثِيرٍ، يَزِيدَ بْنِ عَبْدِ الرَّحْمَنِ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ كُنْتُ أَدْعُو أُمِّي إِلَى الإِسْلاَمِ وَهِيَ مُشْرِكَةٌ فَدَعَوْتُهَا يَوْمًا فَأَسْمَعَتْنِي فِي رَسُولِ اللَّهِ صلى الله عليه وسلم مَا أَكْرَهُ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي كُنْتُ أَدْعُو أُمِّي إِلَى الإِسْلاَمِ فَتَأْبَى عَلَىَّ فَدَعَوْتُهَا الْيَوْمَ فَأَسْمَعَتْنِي فِيكَ مَا أَكْرَهُ فَادْعُ اللَّهَ أَنْ يَهْدِيَ أُمَّ أَبِي هُرَيْرَةَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ اهْدِ أُمَّ أَبِي هُرَيْرَةَ \" . فَخَرَجْتُ مُسْتَبْشِرًا بِدَعْوَةِ نَبِيِّ اللَّهِ صلى الله عليه وسلم فَلَمَّا جِئْتُ فَصِرْتُ إِلَى الْبَابِ فَإِذَا هُوَ مُجَافٌ فَسَمِعَتْ أُمِّي خَشْفَ قَدَمَىَّ فَقَالَتْ مَكَانَكَ يَا أَبَا هُرَيْرَةَ . وَسَمِعْتُ خَضْخَضَةَ الْمَاءِ قَالَ - فَاغْتَسَلَتْ وَلَبِسَتْ دِرْعَهَا وَعَجِلَتْ عَنْ خِمَارِهَا فَفَتَحَتِ الْبَابَ ثُمَّ قَالَتْ يَا أَبَا هُرَيْرَةَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ - قَالَ - فَرَجَعْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَيْتُهُ وَأَنَا أَبْكِي مِنَ الْفَرَحِ - قَالَ - قُلْتُ يَا رَسُولَ اللَّهِ أَبْشِرْ قَدِ اسْتَجَابَ اللَّهُ دَعْوَتَكَ وَهَدَى أُمَّ أَبِي هُرَيْرَةَ . فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ وَقَالَ خَيْرًا - قَالَ - قُلْتُ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يُحَبِّبَنِي أَنَا وَأُمِّي إِلَى عِبَادِهِ الْمُؤْمِنِينَ وَيُحَبِّبَهُمْ إِلَيْنَا - قَالَ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ حَبِّبْ عُبَيْدَكَ هَذَا - يَعْنِي أَبَا هُرَيْرَةَ وَأُمَّهُ - إِلَى عِبَادِكَ الْمُؤْمِنِينَ وَحَبِّبْ إِلَيْهِمُ الْمُؤْمِنِينَ \" . فَمَا خُلِقَ مُؤْمِنٌ يَسْمَعُ بِي وَلاَ يَرَانِي إِلاَّ أَحَبَّنِي ."
  },
  "2492": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2492d\nIn-book reference  : Book 44, Hadith 231\nUSC-MSA web (English) reference  : Book 31, Hadith 6086\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، عَنْ شُعَيْبٍ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ أَبَا هُرَيْرَةَ، قَالَ إِنَّكُمْ تَقُولُونَ إِنَّ أَبَا هُرَيْرَةَ يُكْثِرُ الْحَدِيثَ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ ."
  },
  "2493": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2493\nIn-book reference  : Book 44, Hadith 229\nUSC-MSA web (English) reference  : Book 31, Hadith 6085\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ أَنَّ عُرْوَةَ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ عَائِشَةَ قَالَتْ أَلاَ يُعْجِبُكَ أَبُو هُرَيْرَةَ جَاءَ فَجَلَسَ إِلَى جَنْبِ حُجْرَتِي يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم يُسْمِعُنِي ذَلِكَ وَكُنْتُ أُسَبِّحُ فَقَامَ قَبْلَ أَنْ أَقْضِيَ سُبْحَتِي وَلَوْ أَدْرَكْتُهُ لَرَدَدْتُ عَلَيْهِ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَكُنْ يَسْرُدُ الْحَدِيثَ كَسَرْدِكُمْ ."
  },
  "2494": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2494b\nIn-book reference  : Book 44, Hadith 233\nUSC-MSA web (English) reference  : Book 31, Hadith 6088\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، ح وَحَدَّثَنَا رِفَاعَةُ بْنُ الْهَيْثَمِ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ عَبْدِ اللَّهِ - كُلُّهُمْ عَنْ حُصَيْنٍ، عَنْ سَعْدِ بْنِ عُبَيْدَةَ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ السُّلَمِيِّ، عَنْ عَلِيٍّ، قَالَ بَعَثَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَبَا مَرْثَدٍ الْغَنَوِيَّ وَالزُّبَيْرَ بْنَ الْعَوَّامِ وَكُلُّنَا فَارِسٌ فَقَالَ \" انْطَلِقُوا حَتَّى تَأْتُوا رَوْضَةَ خَاخٍ فَإِنَّ بِهَا امْرَأَةً مِنَ الْمُشْرِكِينَ مَعَهَا كِتَابٌ مِنْ حَاطِبٍ إِلَى الْمُشْرِكِينَ \" . فَذَكَرَ بِمَعْنَى حَدِيثِ عُبَيْدِ اللَّهِ بْنِ أَبِي رَافِعٍ عَنْ عَلِيٍّ ."
  },
  "2495": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2495\nIn-book reference  : Book 44, Hadith 234\nUSC-MSA web (English) reference  : Book 31, Hadith 6089\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ عَبْدًا، لِحَاطِبٍ جَاءَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَشْكُو حَاطِبًا فَقَالَ يَا رَسُولَ اللَّهِ لَيَدْخُلَنَّ حَاطِبٌ النَّارَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كَذَبْتَ لاَ يَدْخُلُهَا فَإِنَّهُ شَهِدَ بَدْرًا وَالْحُدَيْبِيَةَ \" ."
  },
  "2496": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2496\nIn-book reference  : Book 44, Hadith 235\nUSC-MSA web (English) reference  : Book 31, Hadith 6090\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ أَخْبَرَتْنِي أُمُّ مُبَشِّرٍ، أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ عِنْدَ حَفْصَةَ \" لاَ يَدْخُلُ النَّارَ إِنْ شَاءَ اللَّهُ مِنْ أَصْحَابِ الشَّجَرَةِ أَحَدٌ . الَّذِينَ بَايَعُوا تَحْتَهَا \" . قَالَتْ بَلَى يَا رَسُولَ اللَّهِ . فَانْتَهَرَهَا فَقَالَتْ حَفْصَةُ { وَإِنْ مِنْكُمْ إِلاَّ وَارِدُهَا} فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" قَدْ قَالَ اللَّهُ عَزَّ وَجَلَّ { ثُمَّ نُنَجِّي الَّذِينَ اتَّقَوْا وَنَذَرُ الظَّالِمِينَ فِيهَا جِثِيًّا}"
  },
  "2497": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2497\nIn-book reference  : Book 44, Hadith 236\nUSC-MSA web (English) reference  : Book 31, Hadith 6091\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو عَامِرٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي أُسَامَةَ، قَالَ أَبُو عَامِرٍ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا بُرَيْدٌ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ كُنْتُ عِنْدَ النَّبِيِّ صلى الله عليه وسلم وَهُوَ نَازِلٌ بِالْجِعْرَانَةِ بَيْنَ مَكَّةَ وَالْمَدِينَةِ وَمَعَهُ بِلاَلٌ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلٌ أَعْرَابِيٌّ فَقَالَ أَلاَ تُنْجِزُ لِي يَا مُحَمَّدُ مَا وَعَدْتَنِي فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَبْشِرْ \" . فَقَالَ لَهُ الأَعْرَابِيُّ أَكْثَرْتَ عَلَىَّ مِنْ \" أَبْشِرْ \" . فَأَقْبَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى أَبِي مُوسَى وَبِلاَلٍ كَهَيْئَةِ الْغَضْبَانِ فَقَالَ \" إِنَّ هَذَا قَدْ رَدَّ الْبُشْرَى فَاقْبَلاَ أَنْتُمَا \" . فَقَالاَ قَبِلْنَا يَا رَسُولَ اللَّهِ . ثُمَّ دَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِقَدَحٍ فِيهِ مَاءٌ فَغَسَلَ يَدَيْهِ وَوَجْهَهُ فِيهِ وَمَجَّ فِيهِ ثُمَّ قَالَ \" اشْرَبَا مِنْهُ وَأَفْرِغَا عَلَى وُجُوهِكُمَا وَنُحُورِكُمَا وَأَبْشِرَا \" . فَأَخَذَا الْقَدَحَ فَفَعَلاَ مَا أَمَرَهُمَا بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم فَنَادَتْهُمَا أُمُّ سَلَمَةَ مِنْ وَرَاءِ السِّتْرِ أَفْضِلاَ لأُمِّكُمَا مِمَّا فِي إِنَائِكُمَا . فَأَفْضَلاَ لَهَا مِنْهُ طَائِفَةً ."
  },
  "2498": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2498\nIn-book reference  : Book 44, Hadith 237\nUSC-MSA web (English) reference  : Book 31, Hadith 6092\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ أَبُو عَامِرٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لأَبِي عَامِرٍ - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ لَمَّا فَرَغَ النَّبِيُّ صلى الله عليه وسلم مِنْ حُنَيْنٍ بَعَثَ أَبَا عَامِرٍ عَلَى جَيْشٍ إِلَى أَوْطَاسٍ فَلَقِيَ دُرَيْدَ بْنَ الصِّمَّةِ فَقُتِلَ دُرَيْدٌ وَهَزَمَ اللَّهُ أَصْحَابَهُ فَقَالَ أَبُو مُوسَى وَبَعَثَنِي مَعَ أَبِي عَامِرٍ - قَالَ - فَرُمِيَ أَبُو عَامِرٍ فِي رُكْبَتِهِ رَمَاهُ رَجُلٌ مِنْ بَنِي جُشَمٍ بِسَهْمٍ فَأَثْبَتَهُ فِي رُكْبَتِهِ فَانْتَهَيْتُ إِلَيْهِ فَقُلْتُ يَا عَمِّ مَنْ رَمَاكَ فَأَشَارَ أَبُو عَامِرٍ إِلَى أَبِي مُوسَى فَقَالَ إِنَّ ذَاكَ قَاتِلِي تَرَاهُ ذَلِكَ الَّذِي رَمَانِي . قَالَ أَبُو مُوسَى فَقَصَدْتُ لَهُ فَاعْتَمَدْتُهُ فَلَحِقْتُهُ فَلَمَّا رَآنِي وَلَّى عَنِّي ذَاهِبًا فَاتَّبَعْتُهُ وَجَعَلْتُ أَقُولُ لَهُ أَلاَ تَسْتَحْيِي أَلَسْتَ عَرَبِيًّا أَلاَ تَثْبُتُ فَكَفَّ فَالْتَقَيْتُ أَنَا وَهُوَ فَاخْتَلَفْنَا أَنَا وَهُوَ ضَرْبَتَيْنِ فَضَرَبْتُهُ بِالسَّيْفِ فَقَتَلْتُهُ ثُمَّ رَجَعْتُ إِلَى أَبِي عَامِرٍ فَقُلْتُ إِنَّ اللَّهَ قَدْ قَتَلَ صَاحِبَكَ . قَالَ فَانْزِعْ هَذَا السَّهْمَ فَنَزَعْتُهُ فَنَزَا مِنْهُ الْمَاءُ فَقَالَ يَا ابْنَ أَخِي انْطَلِقْ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَقْرِئْهُ مِنِّي السَّلاَمَ وَقُلْ لَهُ يَقُولُ لَكَ أَبُو عَامِرٍ اسْتَغْفِرْ لِي . قَالَ وَاسْتَعْمَلَنِي أَبُو عَامِرٍ عَلَى النَّاسِ وَمَكَثَ يَسِيرًا ثُمَّ إِنَّهُ مَاتَ فَلَمَّا رَجَعْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم دَخَلْتُ عَلَيْهِ وَهُوَ فِي بَيْتٍ عَلَى سَرِيرٍ مُرْمَلٍ وَعَلَيْهِ فِرَاشٌ وَقَدْ أَثَّرَ رِمَالُ السَّرِيرِ بِظَهْرِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَجَنْبَيْهِ فَأَخْبَرْتُهُ بِخَبَرِنَا وَخَبَرِ أَبِي عَامِرٍ وَقُلْتُ لَهُ قَالَ قُلْ لَهُ يَسْتَغْفِرْ لِي . فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَاءٍ فَتَوَضَّأَ مِنْهُ ثُمَّ رَفَعَ يَدَيْهِ ثُمَّ قَالَ \" اللَّهُمَّ اغْفِرْ لِعُبَيْدٍ أَبِي عَامِرٍ \" . حَتَّى رَأَيْتُ بَيَاضَ إِبْطَيْهِ ثُمَّ قَالَ \" اللَّهُمَّ اجْعَلْهُ يَوْمَ الْقِيَامَةِ فَوْقَ كَثِيرٍ مِنْ خَلْقِكَ أَوْ مِنَ النَّاسِ \" . فَقُلْتُ وَلِي يَا رَسُولَ اللَّهِ فَاسْتَغْفِرْ . فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" اللَّهُمَّ اغْفِرْ لِعَبْدِ اللَّهِ بْنِ قَيْسٍ ذَنْبَهُ وَأَدْخِلْهُ يَوْمَ الْقِيَامَةِ مُدْخَلاً كَرِيمًا \" . قَالَ أَبُو بُرْدَةَ إِحْدَاهُمَا لأَبِي عَامِرٍ وَالأُخْرَى لأَبِي مُوسَى ."
  },
  "2499": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2499\nIn-book reference  : Book 44, Hadith 238\nUSC-MSA web (English) reference  : Book 31, Hadith 6093\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا بُرَيْدٌ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي لأَعْرِفُ أَصْوَاتَ رُفْقَةِ الأَشْعَرِيِّينَ بِالْقُرْآنِ حِينَ يَدْخُلُونَ بِاللَّيْلِ وَأَعْرِفُ مَنَازِلَهُمْ مِنْ أَصْوَاتِهِمْ بِالْقُرْآنِ بِاللَّيْلِ وَإِنْ كُنْتُ لَمْ أَرَ مَنَازِلَهُمْ حِينَ نَزَلُوا بِالنَّهَارِ وَمِنْهُمْ حَكِيمٌ إِذَا لَقِيَ الْخَيْلَ - أَوْ قَالَ الْعَدُوَّ - قَالَ لَهُمْ إِنَّ أَصْحَابِي يَأْمُرُونَكُمْ أَنْ تَنْظُرُوهُمْ \" ."
  },
  "2500": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2500\nIn-book reference  : Book 44, Hadith 239\nUSC-MSA web (English) reference  : Book 31, Hadith 6094\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو عَامِرٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ جَمِيعًا عَنْ أَبِي أُسَامَةَ، قَالَ أَبُو عَامِرٍ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي بُرْدَةَ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ الأَشْعَرِيِّينَ إِذَا أَرْمَلُوا فِي الْغَزْوِ أَوْ قَلَّ طَعَامُ عِيَالِهِمْ بِالْمَدِينَةِ جَمَعُوا مَا كَانَ عِنْدَهُمْ فِي ثَوْبٍ وَاحِدٍ ثُمَّ اقْتَسَمُوهُ بَيْنَهُمْ فِي إِنَاءٍ وَاحِدٍ بِالسَّوِيَّةِ فَهُمْ مِنِّي وَأَنَا مِنْهُمْ \" ."
  },
  "2501": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2501\nIn-book reference  : Book 44, Hadith 240\nUSC-MSA web (English) reference  : Book 31, Hadith 6095\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، وَأَحْمَدُ بْنُ جَعْفَرٍ الْمَعْقِرِيُّ، قَالاَ حَدَّثَنَا النَّضْرُ، - وَهُوَ ابْنُ مُحَمَّدٍ الْيَمَامِيُّ - حَدَّثَنَا عِكْرِمَةُ، حَدَّثَنَا أَبُو زُمَيْلٍ، حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ كَانَ الْمُسْلِمُونَ لاَ يَنْظُرُونَ إِلَى أَبِي سُفْيَانَ وَلاَ يُقَاعِدُونَهُ فَقَالَ لِلنَّبِيِّ صلى الله عليه وسلم يَا نَبِيَّ اللَّهِ ثَلاَثٌ أَعْطِنِيهِنَّ قَالَ \" نَعَمْ \" . قَالَ عِنْدِي أَحْسَنُ الْعَرَبِ وَأَجْمَلُهُ أُمُّ حَبِيبَةَ بِنْتُ أَبِي سُفْيَانَ أُزَوِّجُكَهَا قَالَ \" نَعَمْ \" . قَالَ وَمُعَاوِيَةُ تَجْعَلُهُ كَاتِبًا بَيْنَ يَدَيْكَ . قَالَ \" نَعَمْ \" . قَالَ وَتُؤَمِّرُنِي حَتَّى أُقَاتِلَ الْكُفَّارَ كَمَا كُنْتُ أُقَاتِلُ الْمُسْلِمِينَ . قَالَ \" نَعَمْ \" . قَالَ أَبُو زُمَيْلٍ وَلَوْلاَ أَنَّهُ طَلَبَ ذَلِكَ مِنَ النَّبِيِّ صلى الله عليه وسلم مَا أَعْطَاهُ ذَلِكَ لأَنَّهُ لَمْ يَكُنْ يُسْئَلُ شَيْئًا إِلاَّ قَالَ \" نَعَمْ \" ."
  },
  "2502": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2502, 2503\nIn-book reference  : Book 44, Hadith 241\nUSC-MSA web (English) reference  : Book 31, Hadith 6096\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ حَدَّثَنِي بُرَيْدٌ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ بَلَغَنَا مَخْرَجُ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَحْنُ بِالْيَمَنِ فَخَرَجْنَا مُهَاجِرِينَ إِلَيْهِ أَنَا وَأَخَوَانِ لِي أَنَا أَصْغَرُهُمَا أَحَدُهُمَا أَبُو بُرْدَةَ وَالآخَرُ أَبُو رُهْمٍ - إِمَّا قَالَ بِضْعًا وَإِمَّا قَالَ ثَلاَثَةً وَخَمْسِينَ أَوِ اثْنَيْنِ وَخَمْسِينَ رَجُلاً مِنْ قَوْمِي - قَالَ فَرَكِبْنَا سَفِينَةً فَأَلْقَتْنَا سَفِينَتُنَا إِلَى النَّجَاشِيِّ بِالْحَبَشَةِ فَوَافَقْنَا جَعْفَرَ بْنَ أَبِي طَالِبٍ وَأَصْحَابَهُ عِنْدَهُ فَقَالَ جَعْفَرٌ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَنَا هَا هُنَا وَأَمَرَنَا بِالإِقَامَةِ فَأَقِيمُوا مَعَنَا . فَأَقَمْنَا مَعَهُ حَتَّى قَدِمْنَا جَمِيعًا - قَالَ - فَوَافَقْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم حِينَ افْتَتَحَ خَيْبَرَ فَأَسْهَمَ لَنَا - أَوْ قَالَ أَعْطَانَا مِنْهَا - وَمَا قَسَمَ لأَحَدٍ غَابَ عَنْ فَتْحِ خَيْبَرَ مِنْهَا شَيْئًا إِلاَّ لِمَنْ شَهِدَ مَعَهُ إِلاَّ لأَصْحَابِ سَفِينَتِنَا مَعَ جَعْفَرٍ وَأَصْحَابِهِ قَسَمَ لَهُمْ مَعَهُمْ - قَالَ - فَكَانَ نَاسٌ مِنَ النَّاسِ يَقُولُونَ لَنَا - يَعْنِي لأَهْلِ السَّفِينَةِ - نَحْنُ سَبَقْنَاكُمْ بِالْهِجْرَةِ .\nقَالَ فَدَخَلَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ - وَهِيَ مِمَّنْ قَدِمَ مَعَنَا - عَلَى حَفْصَةَ زَوْجِ النَّبِيِّ صلى الله عليه وسلم زَائِرَةً وَقَدْ كَانَتْ هَاجَرَتْ إِلَى النَّجَاشِيِّ فِيمَنْ هَاجَرَ إِلَيْهِ فَدَخَلَ عُمَرُ عَلَى حَفْصَةَ وَأَسْمَاءُ عِنْدَهَا فَقَالَ عُمَرُ حِينَ رَأَى أَسْمَاءَ مَنْ هَذِهِ قَالَتْ أَسْمَاءُ بِنْتُ عُمَيْسٍ . قَالَ عُمَرُ الْحَبَشِيَّةُ هَذِهِ الْبَحْرِيَّةُ هَذِهِ فَقَالَتْ أَسْمَاءُ نَعَمْ . فَقَالَ عُمَرُ سَبَقْنَاكُمْ بِالْهِجْرَةِ فَنَحْنُ أَحَقُّ بِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنْكُمْ . فَغَضِبَتْ وَقَالَتْ كَلِمَةً كَذَبْتَ يَا عُمَرُ كَلاَّ وَاللَّهِ كُنْتُمْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يُطْعِمُ جَائِعَكُمْ وَيَعِظُ جَاهِلَكُمْ وَكُنَّا فِي دَارِ أَوْ فِي أَرْضِ الْبُعَدَاءِ الْبُغَضَاءِ فِي الْحَبَشَةِ وَذَلِكَ فِي اللَّهِ وَفِي رَسُولِهِ وَايْمُ اللَّهِ لاَ أَطْعَمُ طَعَامًا وَلاَ أَشْرَبُ شَرَابًا حَتَّى أَذْكُرَ مَا قُلْتَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَنَحْنُ كُنَّا نُؤْذَى وَنُخَافُ وَسَأَذْكُرُ ذَلِكَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَأَسْأَلُهُ وَوَاللَّهِ لاَ أَكْذِبُ وَلاَ أَزِيغُ وَلاَ أَزِيدُ عَلَى ذَلِكَ . قَالَ فَلَمَّا جَاءَ النَّبِيُّ صلى الله عليه وسلم قَالَتْ يَا نَبِيَّ اللَّهِ إِنَّ عُمَرَ قَالَ كَذَا وَكَذَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ بِأَحَقَّ بِي مِنْكُمْ وَلَهُ وَلأَصْحَابِهِ هِجْرَةٌ وَاحِدَةٌ وَلَكُمْ أَنْتُمْ أَهْلَ السَّفِينَةِ هِجْرَتَانِ \" . قَالَتْ فَلَقَدْ رَأَيْتُ أَبَا مُوسَى وَأَصْحَابَ السَّفِينَةِ يَأْتُونِي أَرْسَالاً يَسْأَلُونِي عَنْ هَذَا الْحَدِيثِ مَا مِنَ الدُّنْيَا شَىْءٌ هُمْ بِهِ أَفْرَحُ وَلاَ أَعْظَمُ فِي أَنْفُسِهِمْ مِمَّا قَالَ لَهُمْ رَسُولُ اللَّهِ صلى الله عليه وسلم . قَالَ أَبُو بُرْدَةَ فَقَالَتْ أَسْمَاءُ فَلَقَدْ رَأَيْتُ أَبَا مُوسَى وَإِنَّهُ لَيَسْتَعِيدُ هَذَا الْحَدِيثَ مِنِّي ."
  },
  "2504": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2504\nIn-book reference  : Book 44, Hadith 242\nUSC-MSA web (English) reference  : Book 31, Hadith 6097\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ مُعَاوِيَةَ، بْنِ قُرَّةَ عَنْ عَائِذِ بْنِ عَمْرٍو، أَنَّ أَبَا سُفْيَانَ، أَتَى عَلَى سَلْمَانَ وَصُهَيْبٍ وَبِلاَلٍ فِي نَفَرٍ فَقَالُوا وَاللَّهِ مَا أَخَذَتْ سُيُوفُ اللَّهِ مِنْ عُنُقِ عَدُوِّ اللَّهِ مَأْخَذَهَا . قَالَ فَقَالَ أَبُو بَكْرٍ أَتَقُولُونَ هَذَا لِشَيْخِ قُرَيْشٍ وَسَيِّدِهِمْ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَأَخْبَرَهُ فَقَالَ \" يَا أَبَا بَكْرٍ لَعَلَّكَ أَغْضَبْتَهُمْ لَئِنْ كُنْتَ أَغْضَبْتَهُمْ لَقَدْ أَغْضَبْتَ رَبَّكَ \" . فَأَتَاهُمْ أَبُو بَكْرٍ فَقَالَ يَا إِخْوَتَاهْ أَغْضَبْتُكُمْ قَالُوا لاَ يَغْفِرُ اللَّهُ لَكَ يَا أُخَىَّ ."
  },
  "2505": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2505\nIn-book reference  : Book 44, Hadith 243\nUSC-MSA web (English) reference  : Book 31, Hadith 6098\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَأَحْمَدُ بْنُ عَبْدَةَ، - وَاللَّفْظُ لإِسْحَاقَ - قَالاَ أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ فِينَا نَزَلَتْ { إِذْ هَمَّتْ طَائِفَتَانِ مِنْكُمْ أَنْ تَفْشَلاَ وَاللَّهُ وَلِيُّهُمَا} بَنُو سَلِمَةَ وَبَنُو حَارِثَةَ وَمَا نُحِبُّ أَنَّهَا لَمْ تَنْزِلْ لِقَوْلِ اللَّهِ عَزَّ وَجَلَّ { وَاللَّهُ وَلِيُّهُمَا} ."
  },
  "2506": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2506a, b\nIn-book reference  : Book 44, Hadith 244\nUSC-MSA web (English) reference  : Book 31, Hadith 6099\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، وَعَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنِ النَّضْرِ بْنِ أَنَسٍ، عَنْ زَيْدِ بْنِ أَرْقَمَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ اغْفِرْ لِلأَنْصَارِ وَلأَبْنَاءِ الأَنْصَارِ وَأَبْنَاءِ أَبْنَاءِ الأَنْصَارِ \" .\nوَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ ."
  },
  "2507": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2507\nIn-book reference  : Book 44, Hadith 245\nUSC-MSA web (English) reference  : Book 31, Hadith 6100\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ، حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا إِسْحَاقُ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ - أَنَّ أَنَسًا، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَغْفَرَ لِلأَنْصَارِ - قَالَ - وَأَحْسِبُهُ قَالَ \" وَلِذَرَارِيِّ الأَنْصَارِ وَلِمَوَالِي الأَنْصَارِ \" . لاَ أَشُكُّ فِيهِ ."
  },
  "2508": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2508\nIn-book reference  : Book 44, Hadith 246\nUSC-MSA web (English) reference  : Book 31, Hadith 6101\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، - وَاللَّفْظُ لِزُهَيْرٍ - حَدَّثَنَا إِسْمَاعِيلُ، عَنْ عَبْدِ الْعَزِيزِ، - وَهُوَ ابْنُ صُهَيْبٍ - عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم رَأَى صِبْيَانًا وَنِسَاءً مُقْبِلِينَ مِنْ عُرْسٍ فَقَامَ نَبِيُّ اللَّهِ صلى الله عليه وسلم مُمْثِلاً فَقَالَ \" اللَّهُمَّ أَنْتُمْ مِنْ أَحَبِّ النَّاسِ إِلَىَّ اللَّهُمَّ أَنْتُمْ مِنْ أَحَبِّ النَّاسِ إِلَىَّ \" . يَعْنِي الأَنْصَارَ ."
  },
  "2509": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2509b\nIn-book reference  : Book 44, Hadith 248\nUSC-MSA web (English) reference  : Book 31, Hadith 6102\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدُ بْنُ الْحَارِثِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ إِدْرِيسَ، كِلاَهُمَا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ ."
  },
  "2510": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2510\nIn-book reference  : Book 44, Hadith 249\nUSC-MSA web (English) reference  : Book 31, Hadith 6103\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، أَخْبَرَنَا شُعْبَةُ، سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الأَنْصَارَ كَرِشِي وَعَيْبَتِي وَإِنَّ النَّاسَ سَيَكْثُرُونَ وَيَقِلُّونَ فَاقْبَلُوا مِنْ مُحْسِنِهِمْ وَاعْفُوا عَنْ مُسِيئِهِمْ \" ."
  },
  "2511": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2511f\nIn-book reference  : Book 44, Hadith 255\nUSC-MSA web (English) reference  : Book 31, Hadith 6109\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيِّ بْنِ بَحْرٍ، حَدَّثَنِي أَبُو دَاوُدَ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى، بْنِ أَبِي كَثِيرٍ حَدَّثَنِي أَبُو سَلَمَةَ، أَنَّ أَبَا أُسَيْدٍ الأَنْصَارِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" خَيْرُ الأَنْصَارِ أَوْ خَيْرُ دُورِ الأَنْصَارِ \" . بِمِثْلِ حَدِيثِهِمْ فِي ذِكْرِ الدُّورِ وَلَمْ يَذْكُرْ قِصَّةَ سَعْدِ بْنِ عُبَادَةَ رضى الله عنه ."
  },
  "2512": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2512\nIn-book reference  : Book 44, Hadith 256\nUSC-MSA web (English) reference  : Book 31, Hadith 6110\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ قَالَ أَبُو سَلَمَةَ وَعُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ سَمِعَا أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ فِي مَجْلِسٍ عَظِيمٍ مِنَ الْمُسْلِمِينَ \" أُحَدِّثُكُمْ بِخَيْرِ دُورِ الأَنْصَارِ \" . قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" بَنُو عَبْدِ الأَشْهَلِ \" . قَالُوا ثُمَّ مَنْ يَا رَسُولَ اللَّهِ قَالَ \" ثُمَّ بَنُو النَّجَّارِ \" . قَالُوا ثُمَّ مَنْ يَا رَسُولَ اللَّهِ قَالَ \" ثُمَّ بَنُو الْحَارِثِ بْنِ الْخَزْرَجِ \" . قَالُوا ثُمَّ مَنْ يَا رَسُولَ اللَّهِ قَالَ \" ثُمَّ بَنُو سَاعِدَةَ \" . قَالُوا ثُمَّ مَنْ يَا رَسُولَ اللَّهِ قَالَ \" ثُمَّ فِي كُلِّ دُورِ الأَنْصَارِ خَيْرٌ \" . فَقَامَ سَعْدُ بْنُ عُبَادَةَ مُغْضَبًا فَقَالَ أَنَحْنُ آخِرُ الأَرْبَعِ حِينَ سَمَّى رَسُولُ اللَّهِ صلى الله عليه وسلم دَارَهُمْ فَأَرَادَ كَلاَمَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لَهُ رِجَالٌ مِنْ قَوْمِهِ اجْلِسْ أَلاَ تَرْضَى أَنْ سَمَّى رَسُولُ اللَّهِ صلى الله عليه وسلم دَارَكُمْ فِي الأَرْبَعِ الدُّورِ الَّتِي سَمَّى فَمَنْ تَرَكَ فَلَمْ يُسَمِّ أَكْثَرُ مِمَّنْ سَمَّى . فَانْتَهَى سَعْدُ بْنُ عُبَادَةَ عَنْ كَلاَمِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "2513": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2513\nIn-book reference  : Book 44, Hadith 257\nUSC-MSA web (English) reference  : Book 31, Hadith 6111\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنِ ابْنِ، عَرْعَرَةَ - وَاللَّفْظُ لِلْجَهْضَمِيِّ - حَدَّثَنِي مُحَمَّدُ بْنُ عَرْعَرَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ يُونُسَ بْنِ عُبَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ خَرَجْتُ مَعَ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ فِي سَفَرٍ فَكَانَ يَخْدُمُنِي فَقُلْتُ لَهُ لاَ تَفْعَلْ . فَقَالَ إِنِّي قَدْ رَأَيْتُ الأَنْصَارَ تَصْنَعُ بِرَسُولِ اللَّهِ صلى الله عليه وسلم شَيْئًا آلَيْتُ أَنْ لاَ أَصْحَبَ أَحَدًا مِنْهُمْ إِلاَّ خَدَمْتُهُ . زَادَ ابْنُ الْمُثَنَّى وَابْنُ بَشَّارٍ فِي حَدِيثِهِمَا وَكَانَ جَرِيرٌ أَكْبَرَ مِنْ أَنَسٍ . وَقَالَ ابْنُ بَشَّارٍ أَسَنَّ مِنْ أَنَسٍ ."
  },
  "2514": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2514c\nIn-book reference  : Book 44, Hadith 260\nUSC-MSA web (English) reference  : Book 31, Hadith 6114\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، فِي هَذَا الإِسْنَادِ ."
  },
  "2515": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2515\nIn-book reference  : Book 44, Hadith 261\nUSC-MSA web (English) reference  : Book 31, Hadith 6115\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ وَسُوَيْدُ بْنُ سَعِيدٍ وَابْنُ أَبِي عُمَرَ قَالُوا حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ، الرَّحْمَنِ بْنُ مَهْدِيٍّ قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، بْنِ نُمَيْرٍ وَعَبْدُ بْنُ حُمَيْدٍ عَنْ أَبِي عَاصِمٍ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، ح\nوَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، كُلُّهُمْ قَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" أَسْلَمُ سَالَمَهَا اللَّهُ وَغِفَارُ غَفَرَ اللَّهُ لَهَا \" ."
  },
  "2516": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2516\nIn-book reference  : Book 44, Hadith 262\nUSC-MSA web (English) reference  : Book 31, Hadith 6116\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي حُسَيْنُ بْنُ حُرَيْثٍ، حَدَّثَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ خُثَيْمِ بْنِ عِرَاكٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَسْلَمُ سَالَمَهَا اللَّهُ وَغِفَارُ غَفَرَ اللَّهُ لَهَا أَمَا إِنِّي لَمْ أَقُلْهَا وَلَكِنْ قَالَهَا اللَّهُ عَزَّ وَجَلَّ \" ."
  },
  "2517": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2517\nIn-book reference  : Book 44, Hadith 263\nUSC-MSA web (English) reference  : Book 31, Hadith 6117\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنِ اللَّيْثِ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ، عَنْ خُفَافِ بْنِ إِيمَاءَ الْغِفَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي صَلاَةٍ \" اللَّهُمَّ الْعَنْ بَنِي لِحْيَانَ وَرِعْلاً وَذَكْوَانَ وَعُصَيَّةَ عَصَوُا اللَّهَ وَرَسُولَهُ غِفَارُ غَفَرَ اللَّهُ لَهَا وَأَسْلَمُ سَالَمَهَا اللَّهُ \" ."
  },
  "2518": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2518c\nIn-book reference  : Book 44, Hadith 266\nUSC-MSA web (English) reference  : Book 31, Hadith 6119\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو دَاوُدَ الطَّيَالِسِيُّ، حَدَّثَنَا حَرْبُ بْنُ شَدَّادٍ، عَنْ يَحْيَى، حَدَّثَنِي أَبُو سَلَمَةَ، حَدَّثَنِي ابْنُ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ . مِثْلَ حَدِيثِ هَؤُلاَءِ عَنِ ابْنِ عُمَرَ ."
  },
  "2519": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2519\nIn-book reference  : Book 44, Hadith 267\nUSC-MSA web (English) reference  : Book 31, Hadith 6120\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ هَارُونَ - أَخْبَرَنَا أَبُو مَالِكٍ، الأَشْجَعِيُّ عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي أَيُّوبَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الأَنْصَارُ وَمُزَيْنَةُ وَجُهَيْنَةُ وَغِفَارُ وَأَشْجَعُ وَمَنْ كَانَ مِنْ بَنِي عَبْدِ اللَّهِ مَوَالِيَّ دُونَ النَّاسِ وَاللَّهُ وَرَسُولُهُ مَوْلاَهُمْ \" ."
  },
  "2520": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2520b\nIn-book reference  : Book 44, Hadith 269\nUSC-MSA web (English) reference  : Book 31, Hadith 6122\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّ فِي الْحَدِيثِ قَالَ سَعْدٌ فِي بَعْضِ هَذَا فِيمَا أَعْلَمُ ."
  },
  "2521": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2521c\nIn-book reference  : Book 44, Hadith 272\nUSC-MSA web (English) reference  : Book 31, Hadith 6125\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِيَانِ ابْنَ عُلَيَّةَ - حَدَّثَنَا أَيُّوبُ، عَنْ مُحَمَّدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لأَسْلَمُ وَغِفَارُ وَشَىْءٌ مِنْ مُزَيْنَةَ وَجُهَيْنَةَ أَوْ شَىْءٌ مِنْ جُهَيْنَةَ وَمُزَيْنَةَ خَيْرٌ عِنْدَ اللَّهِ - قَالَ أَحْسِبُهُ قَالَ - يَوْمَ الْقِيَامَةِ مِنْ أَسَدٍ وَغَطَفَانَ وَهَوَازِنَ وَتَمِيمٍ \" ."
  },
  "2522": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2522e\nIn-book reference  : Book 44, Hadith 277\nUSC-MSA web (English) reference  : Book 31, Hadith 6130\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ وَأَسْلَمُ وَغِفَارُ خَيْرًا مِنْ بَنِي تَمِيمٍ وَبَنِي عَبْدِ اللَّهِ بْنِ غَطَفَانَ وَعَامِرِ بْنِ صَعْصَعَةَ \" . وَمَدَّ بِهَا صَوْتَهُ فَقَالُوا يَا رَسُولَ اللَّهِ فَقَدْ خَابُوا وَخَسِرُوا . قَالَ \" فَإِنَّهُمْ خَيْرٌ \" . وَفِي رِوَايَةِ أَبِي كُرَيْبٍ \" أَرَأَيْتُمْ إِنْ كَانَ جُهَيْنَةُ وَمُزَيْنَةُ وَأَسْلَمُ وَغِفَارُ \" ."
  },
  "2523": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2523\nIn-book reference  : Book 44, Hadith 278\nUSC-MSA web (English) reference  : Book 31, Hadith 6131\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا أَحْمَدُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ عَامِرٍ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، قَالَ أَتَيْتُ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ لِي إِنَّ أَوَّلَ صَدَقَةٍ بَيَّضَتْ وَجْهَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَوُجُوهَ أَصْحَابِهِ صَدَقَةُ طَيِّئٍ جِئْتَ بِهَا إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "2524": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2524\nIn-book reference  : Book 44, Hadith 279\nUSC-MSA web (English) reference  : Book 31, Hadith 6132\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَدِمَ الطُّفَيْلُ وَأَصْحَابُهُ فَقَالُوا يَا رَسُولَ اللَّهِ إِنَّ دَوْسًا قَدْ كَفَرَتْ وَأَبَتْ فَادْعُ اللَّهَ عَلَيْهَا . فَقِيلَ هَلَكَتْ دَوْسٌ فَقَالَ \" اللَّهُمَّ اهْدِ دَوْسًا وَائْتِ بِهِمْ \" ."
  },
  "2525": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2525c\nIn-book reference  : Book 44, Hadith 282\nUSC-MSA web (English) reference  : Book 31, Hadith 6134\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، حَدَّثَنَا مَسْلَمَةُ بْنُ عَلْقَمَةَ الْمَازِنِيُّ، إِمَامُ مَسْجِدِ دَاوُدَ حَدَّثَنَا دَاوُدُ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ثَلاَثُ خِصَالٍ سَمِعْتُهُنَّ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَنِي تَمِيمٍ لاَ أَزَالُ أُحِبُّهُمْ بَعْدُ وَسَاقَ الْحَدِيثَ بِهَذَا الْمَعْنَى غَيْرَ أَنَّهُ قَالَ \" هُمْ أَشَدُّ النَّاسِ قِتَالاً فِي الْمَلاَحِمِ \" . وَلَمْ يَذْكُرِ الدَّجَّالَ ."
  },
  "2526": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2526b\nIn-book reference  : Book 44, Hadith 284\nUSC-MSA web (English) reference  : Book 31, Hadith 6136\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ الْحِزَامِيُّ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَجِدُونَ النَّاسَ مَعَادِنَ \" . بِمِثْلِ حَدِيثِ الزُّهْرِيِّ غَيْرَ أَنَّ فِي حَدِيثِ أَبِي زُرْعَةَ وَالأَعْرَجِ \" تَجِدُونَ مِنْ خَيْرِ النَّاسِ فِي هَذَا الشَّأْنِ أَشَدَّهُمْ لَهُ كَرَاهِيَةً حَتَّى يَقَعَ فِيهِ \" ."
  },
  "2527": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2527f\nIn-book reference  : Book 44, Hadith 290\nUSC-MSA web (English) reference  : Book 31, Hadith 6142\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ الأَوْدِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ مَخْلَدٍ - حَدَّثَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ بِلاَلٍ - حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ مَعْمَرٍ هَذَا سَوَاءً ."
  },
  "2528": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2528\nIn-book reference  : Book 44, Hadith 291\nUSC-MSA web (English) reference  : Book 31, Hadith 6143\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا حَمَّادٌ، - يَعْنِي ابْنَ سَلَمَةَ - عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم آخَى بَيْنَ أَبِي عُبَيْدَةَ بْنِ الْجَرَّاحِ وَبَيْنَ أَبِي طَلْحَةَ ."
  },
  "2529": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2529b\nIn-book reference  : Book 44, Hadith 293\nUSC-MSA web (English) reference  : Book 31, Hadith 6145\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا عَبْدَةُ بْنُ، سُلَيْمَانَ عَنْ عَاصِمٍ، عَنْ أَنَسٍ، قَالَ حَالَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم بَيْنَ قُرَيْشٍ وَالأَنْصَارِ فِي دَارِهِ الَّتِي بِالْمَدِينَةِ ."
  },
  "2530": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2530\nIn-book reference  : Book 44, Hadith 294\nUSC-MSA web (English) reference  : Book 31, Hadith 6146\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ زَكَرِيَّاءَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِيهِ، عَنْ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ حِلْفَ فِي الإِسْلاَمِ وَأَيُّمَا حِلْفٍ كَانَ فِي الْجَاهِلِيَّةِ لَمْ يَزِدْهُ الإِسْلاَمُ إِلاَّ شِدَّةً \" ."
  },
  "2531": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2531\nIn-book reference  : Book 44, Hadith 295\nUSC-MSA web (English) reference  : Book 31, Hadith 6147\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ اللَّهِ بْنُ عُمَرَ بْنِ أَبَانَ، كُلُّهُمْ عَنْ حُسَيْنٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ الْجُعْفِيُّ، - عَنْ مُجَمِّعِ بْنِ يَحْيَى، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، قَالَ صَلَّيْنَا الْمَغْرِبَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قُلْنَا لَوْ جَلَسْنَا حَتَّى نُصَلِّيَ مَعَهُ الْعِشَاءَ - قَالَ - فَجَلَسْنَا فَخَرَجَ عَلَيْنَا فَقَالَ \" مَا زِلْتُمْ هَا هُنَا \" . قُلْنَا يَا رَسُولَ اللَّهِ صَلَّيْنَا مَعَكَ الْمَغْرِبَ ثُمَّ قُلْنَا نَجْلِسُ حَتَّى نُصَلِّيَ مَعَكَ الْعِشَاءَ قَالَ \" أَحْسَنْتُمْ أَوْ أَصَبْتُمْ \" . قَالَ فَرَفَعَ رَأْسَهُ إِلَى السَّمَاءِ وَكَانَ كَثِيرًا مِمَّا يَرْفَعُ رَأْسَهُ إِلَى السَّمَاءِ فَقَالَ \" النُّجُومُ أَمَنَةٌ لِلسَّمَاءِ فَإِذَا ذَهَبَتِ النُّجُومُ أَتَى السَّمَاءَ مَا تُوعَدُ وَأَنَا أَمَنَةٌ لأَصْحَابِي فَإِذَا ذَهَبْتُ أَتَى أَصْحَابِي مَا يُوعَدُونَ وَأَصْحَابِي أَمَنَةٌ لأُمَّتِي فَإِذَا ذَهَبَ أَصْحَابِي أَتَى أُمَّتِي مَا يُوعَدُونَ \" ."
  },
  "2532": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2532b\nIn-book reference  : Book 44, Hadith 297\nUSC-MSA web (English) reference  : Book 31, Hadith 6149\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي سَعِيدُ بْنُ يَحْيَى بْنِ سَعِيدٍ الأُمَوِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرٍ، قَالَ زَعَمَ أَبُو سَعِيدٍ الْخُدْرِيُّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَأْتِي عَلَى النَّاسِ زَمَانٌ يُبْعَثُ مِنْهُمُ الْبَعْثُ فَيَقُولُونَ انْظُرُوا هَلْ تَجِدُونَ فِيكُمْ أَحَدًا مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم فَيُوجَدُ الرَّجُلُ فَيُفْتَحُ لَهُمْ بِهِ ثُمَّ يُبْعَثُ الْبَعْثُ الثَّانِي فَيَقُولُونَ هَلْ فِيهِمْ مَنْ رَأَى أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم فَيُفْتَحُ لَهُمْ بِهِ ثُمَّ يُبْعَثُ الْبَعْثُ الثَّالِثُ فَيُقَالُ انْظُرُوا هَلْ تَرَوْنَ فِيهِمْ مَنْ رَأَى مَنْ رَأَى أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم ثُمَّ يَكُونُ الْبَعْثُ الرَّابِعُ فَيُقَالُ انْظُرُوا هَلْ تَرَوْنَ فِيهِمْ أَحَدًا رَأَى مَنْ رَأَى أَحَدًا رَأَى أَصْحَابَ النَّبِيِّ صلى الله عليه وسلم فَيُوجَدُ الرَّجُلُ فَيُفْتَحُ لَهُمْ بِهِ \" ."
  },
  "2533": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2533d\nIn-book reference  : Book 44, Hadith 301\nUSC-MSA web (English) reference  : Book 31, Hadith 6153\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا أَزْهَرُ بْنُ سَعْدٍ السَّمَّانُ، عَنِ ابْنِ عَوْنٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" خَيْرُ النَّاسِ قَرْنِي ثُمَّ الَّذِينَ يَلُونَهُمْ ثُمَّ الَّذِينَ يَلُونَهُمْ \" . فَلاَ أَدْرِي فِي الثَّالِثَةِ أَوْ فِي الرَّابِعَةِ قَالَ \" ثُمَّ يَتَخَلَّفُ مِنْ بَعْدِهِمْ خَلْفٌ تَسْبِقُ شَهَادَةُ أَحَدِهِمْ يَمِينَهُ وَيَمِينُهُ شَهَادَتَهُ \" ."
  },
  "2534": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2534b\nIn-book reference  : Book 44, Hadith 303\nUSC-MSA web (English) reference  : Book 31, Hadith 6155\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو الْوَلِيدِ، حَدَّثَنَا أَبُو عَوَانَةَ، كِلاَهُمَا عَنْ أَبِي بِشْرٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّ فِي حَدِيثِ شُعْبَةَ قَالَ أَبُو هُرَيْرَةَ فَلاَ أَدْرِي مَرَّتَيْنِ أَوْ ثَلاَثَةً ."
  },
  "2535": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2535c\nIn-book reference  : Book 44, Hadith 306\nUSC-MSA web (English) reference  : Book 31, Hadith 6158\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ الأُمَوِيُّ، قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ \" خَيْرُ هَذِهِ الأُمَّةِ الْقَرْنُ الَّذِينَ بُعِثْتُ فِيهِمْ ثُمَّ الَّذِينَ يَلُونَهُمْ \" . زَادَ فِي حَدِيثِ أَبِي عَوَانَةَ قَالَ وَاللَّهُ أَعْلَمُ أَذَكَرَ الثَّالِثَ أَمْ لاَ . بِمِثْلِ حَدِيثِ زَهْدَمٍ عَنْ عِمْرَانَ وَزَادَ فِي حَدِيثِ هِشَامٍ عَنْ قَتَادَةَ \" وَيَحْلِفُونَ وَلاَ يُسْتَحْلَفُونَ \" ."
  },
  "2536": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2536\nIn-book reference  : Book 44, Hadith 307\nUSC-MSA web (English) reference  : Book 31, Hadith 6159\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَشُجَاعُ بْنُ مَخْلَدٍ، - وَاللَّفْظُ لأَبِي بَكْرٍ - قَالاَ حَدَّثَنَا حُسَيْنٌ، - وَهُوَ ابْنُ عَلِيٍّ الْجُعْفِيُّ - عَنْ زَائِدَةَ، عَنِ السُّدِّيِّ، عَنْ عَبْدِ اللَّهِ الْبَهِيِّ، عَنْ عَائِشَةَ، قَالَتْ سَأَلَ رَجُلٌ النَّبِيَّ صلى الله عليه وسلم أَىُّ النَّاسِ خَيْرٌ قَالَ \" الْقَرْنُ الَّذِي أَنَا فِيهِ ثُمَّ الثَّانِي ثُمَّ الثَّالِثُ \" ."
  },
  "2537": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2537b\nIn-book reference  : Book 44, Hadith 309\nUSC-MSA web (English) reference  : Book 31, Hadith 6161\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، وَرَوَاهُ، اللَّيْثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ خَالِدِ بْنِ مُسَافِرٍ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ مَعْمَرٍ كَمِثْلِ حَدِيثِهِ ."
  },
  "2538": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2538e\nIn-book reference  : Book 44, Hadith 315\nUSC-MSA web (English) reference  : Book 31, Hadith 6166\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا أَبُو الْوَلِيدِ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ حُصَيْنٍ، عَنْ سَالِمٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم \" مَا مِنْ نَفْسٍ مَنْفُوسَةٍ تَبْلُغُ مِائَةَ سَنَةٍ \" . فَقَالَ سَالِمٌ تَذَاكَرْنَا ذَلِكَ عِنْدَهُ إِنَّمَا هِيَ كُلُّ نَفْسٍ مَخْلُوقَةٍ يَوْمَئِذٍ ."
  },
  "2539": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2539\nIn-book reference  : Book 44, Hadith 314\nUSC-MSA web (English) reference  : Book 31, Hadith 6165\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو خَالِدٍ، عَنْ دَاوُدَ، وَاللَّفْظُ، لَهُ ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَيَّانَ، عَنْ دَاوُدَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ لَمَا رَجَعَ النَّبِيُّ صلى الله عليه وسلم مِنْ تَبُوكَ سَأَلُوهُ عَنِ السَّاعَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَأْتِي مِائَةُ سَنَةٍ وَعَلَى الأَرْضِ نَفْسٌ مَنْفُوسَةٌ الْيَوْمَ \" ."
  },
  "2540": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2540\nIn-book reference  : Book 44, Hadith 316\nUSC-MSA web (English) reference  : Book 31, Hadith 6167\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَمُحَمَّدُ بْنُ الْعَلاَءِ قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي، هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَسُبُّوا أَصْحَابِي لاَ تَسُبُّوا أَصْحَابِي فَوَالَّذِي نَفْسِي بِيَدِهِ لَوْ أَنَّ أَحَدَكُمْ أَنْفَقَ مِثْلَ أُحُدٍ ذَهَبًا مَا أَدْرَكَ مُدَّ أَحَدِهِمْ وَلاَ نَصِيفَهُ \" ."
  },
  "2541": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2541b\nIn-book reference  : Book 44, Hadith 318\nUSC-MSA web (English) reference  : Book 31, Hadith 6169\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، جَمِيعًا عَنْ شُعْبَةَ، عَنِ الأَعْمَشِ، بِإِسْنَادِ جَرِيرٍ وَأَبِي مُعَاوِيَةَ . بِمِثْلِ حَدِيثِهِمَا وَلَيْسَ فِي حَدِيثِ شُعْبَةَ وَوَكِيعٍ ذِكْرُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ وَخَالِدِ بْنِ الْوَلِيدِ ."
  },
  "2542": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2542c\nIn-book reference  : Book 44, Hadith 321\nUSC-MSA web (English) reference  : Book 31, Hadith 6172\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا - وَاللَّفْظُ، لاِبْنِ الْمُثَنَّى - حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ أُسَيْرِ بْنِ جَابِرٍ، قَالَ كَانَ عُمَرُ بْنُ الْخَطَّابِ إِذَا أَتَى عَلَيْهِ أَمْدَادُ أَهْلِ الْيَمَنِ سَأَلَهُمْ أَفِيكُمْ أُوَيْسُ بْنُ عَامِرٍ حَتَّى أَتَى عَلَى أُوَيْسٍ فَقَالَ أَنْتَ أُوَيْسُ بْنُ عَامِرٍ قَالَ نَعَمْ . قَالَ مِنْ مُرَادٍ ثُمَّ مِنْ قَرَنٍ قَالَ نَعَمْ . قَالَ فَكَانَ بِكَ بَرَصٌ فَبَرَأْتَ مِنْهُ إِلاَّ مَوْضِعَ دِرْهَمٍ قَالَ نَعَمْ . قَالَ لَكَ وَالِدَةٌ قَالَ نَعَمْ . قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" يَأْتِي عَلَيْكُمْ أُوَيْسُ بْنُ عَامِرٍ مَعَ أَمْدَادِ أَهْلِ الْيَمَنِ مِنْ مُرَادٍ ثُمَّ مِنْ قَرَنٍ كَانَ بِهِ بَرَصٌ فَبَرَأَ مِنْهُ إِلاَّ مَوْضِعَ دِرْهَمٍ لَهُ وَالِدَةٌ هُوَ بِهَا بَرٌّ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ فَإِنِ اسْتَطَعْتَ أَنْ يَسْتَغْفِرَ لَكَ فَافْعَلْ \" . فَاسْتَغْفِرْ لِي . فَاسْتَغْفَرَ لَهُ . فَقَالَ لَهُ عُمَرُ أَيْنَ تُرِيدُ قَالَ الْكُوفَةَ . قَالَ أَلاَ أَكْتُبُ لَكَ إِلَى عَامِلِهَا قَالَ أَكُونُ فِي غَبْرَاءِ النَّاسِ أَحَبُّ إِلَىَّ . قَالَ فَلَمَّا كَانَ مِنَ الْعَامِ الْمُقْبِلِ حَجَّ رَجُلٌ مِنْ أَشْرَافِهِمْ فَوَافَقَ عُمَرَ فَسَأَلَهُ عَنْ أُوَيْسٍ قَالَ تَرَكْتُهُ رَثَّ الْبَيْتِ قَلِيلَ الْمَتَاعِ . قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" يَأْتِي عَلَيْكُمْ أُوَيْسُ بْنُ عَامِرٍ مَعَ أَمْدَادِ أَهْلِ الْيَمَنِ مِنْ مُرَادٍ ثُمَّ مِنْ قَرَنٍ كَانَ بِهِ بَرَصٌ فَبَرَأَ مِنْهُ إِلاَّ مَوْضِعَ دِرْهَمٍ لَهُ وَالِدَةٌ هُوَ بِهَا بَرٌّ لَوْ أَقْسَمَ عَلَى اللَّهِ لأَبَرَّهُ فَإِنِ اسْتَطَعْتَ أَنْ يَسْتَغْفِرَ لَكَ فَافْعَلْ \" . فَأَتَى أُوَيْسًا فَقَالَ اسْتَغْفِرْ لِي . قَالَ أَنْتَ أَحْدَثُ عَهْدًا بِسَفَرٍ صَالِحٍ فَاسْتَغْفِرْ لِي . قَالَ اسْتَغْفِرْ لِي . قَالَ أَنْتَ أَحْدَثُ عَهْدًا بِسَفَرٍ صَالِحٍ فَاسْتَغْفِرْ لِي . قَالَ لَقِيتَ عُمَرَ قَالَ نَعَمْ . فَاسْتَغْفَرَ لَهُ . فَفَطِنَ لَهُ النَّاسُ فَانْطَلَقَ عَلَى وَجْهِهِ . قَالَ أُسَيْرٌ وَكَسَوْتُهُ بُرْدَةً فَكَانَ كُلَّمَا رَآهُ إِنْسَانٌ قَالَ مِنْ أَيْنَ لأُوَيْسٍ هَذِهِ الْبُرْدَةُ"
  },
  "2543": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2543b\nIn-book reference  : Book 44, Hadith 323\nUSC-MSA web (English) reference  : Book 31, Hadith 6174\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، سَمِعْتُ حَرْمَلَةَ الْمِصْرِيَّ، يُحَدِّثُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، عَنْ أَبِي بَصْرَةَ، عَنْ أَبِي، ذَرٍّ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّكُمْ سَتَفْتَحُونَ مِصْرَ وَهِيَ أَرْضٌ يُسَمَّى فِيهَا الْقِيرَاطُ فَإِذَا فَتَحْتُمُوهَا فَأَحْسِنُوا إِلَى أَهْلِهَا فَإِنَّ لَهُمْ ذِمَّةً وَرَحِمًا \" . أَوْ قَالَ \" ذِمَّةً وَصِهْرًا فَإِذَا رَأَيْتَ رَجُلَيْنِ يَخْتَصِمَانِ فِيهَا فِي مَوْضِعِ لَبِنَةٍ فَاخْرُجْ مِنْهَا \" . قَالَ فَرَأَيْتُ عَبْدَ الرَّحْمَنِ بْنَ شُرَحْبِيلَ بْنِ حَسَنَةَ وَأَخَاهُ رَبِيعَةَ يَخْتَصِمَانِ فِي مَوْضِعِ لَبِنَةٍ فَخَرَجْتُ مِنْهَا ."
  },
  "2544": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2544\nIn-book reference  : Book 44, Hadith 324\nUSC-MSA web (English) reference  : Book 31, Hadith 6175\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، عَنْ أَبِي الْوَازِعِ، جَابِرِ بْنِ عَمْرٍو الرَّاسِبِيِّ سَمِعْتُ أَبَا بَرْزَةَ، يَقُولُ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم رَجُلاً إِلَى حَىٍّ مِنْ أَحْيَاءِ الْعَرَبِ فَسَبُّوهُ وَضَرَبُوهُ فَجَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَخْبَرَهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَوْ أَنَّ أَهْلَ عُمَانَ أَتَيْتَ مَا سَبُّوكَ وَلاَ ضَرَبُوكَ \" ."
  },
  "2545": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2545\nIn-book reference  : Book 44, Hadith 325\nUSC-MSA web (English) reference  : Book 31, Hadith 6176\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ إِسْحَاقَ الْحَضْرَمِيَّ - أَخْبَرَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلٍ، رَأَيْتُ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ عَلَى عَقَبَةِ الْمَدِينَةِ - قَالَ - فَجَعَلَتْ قُرَيْشٌ تَمُرُّ عَلَيْهِ وَالنَّاسُ حَتَّى مَرَّ عَلَيْهِ عَبْدُ اللَّهِ بْنُ عُمَرَ فَوَقَفَ عَلَيْهِ فَقَالَ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ السَّلاَمُ عَلَيْكَ أَبَا خُبَيْبٍ أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ لَقَدْ كُنْتُ أَنْهَاكَ عَنْ هَذَا أَمَا وَاللَّهِ إِنْ كُنْتَ مَا عَلِمْتُ صَوَّامًا قَوَّامًا وَصُولاً لِلرَّحِمِ أَمَا وَاللَّهِ لأُمَّةٌ أَنْتَ أَشَرُّهَا لأُمَّةٌ خَيْرٌ . ثُمَّ نَفَذَ عَبْدُ اللَّهِ بْنُ عُمَرَ فَبَلَغَ الْحَجَّاجَ مَوْقِفُ عَبْدِ اللَّهِ وَقَوْلُهُ فَأَرْسَلَ إِلَيْهِ فَأُنْزِلَ عَنْ جِذْعِهِ فَأُلْقِيَ فِي قُبُورِ الْيَهُودِ ثُمَّ أَرْسَلَ إِلَى أُمِّهِ أَسْمَاءَ بِنْتِ أَبِي بَكْرٍ فَأَبَتْ أَنْ تَأْتِيَهُ فَأَعَادَ عَلَيْهَا الرَّسُولَ لَتَأْتِيَنِّي أَوْ لأَبْعَثَنَّ إِلَيْكِ مِنْ يَسْحَبُكِ بِقُرُونِكِ - قَالَ - فَأَبَتْ وَقَالَتْ وَاللَّهِ لاَ آتِيكَ حَتَّى تَبْعَثَ إِلَىَّ مَنْ يَسْحَبُنِي بِقُرُونِي - قَالَ - فَقَالَ أَرُونِي سِبْتَىَّ . فَأَخَذَ نَعْلَيْهِ ثُمَّ انْطَلَقَ يَتَوَذَّفُ حَتَّى دَخَلَ عَلَيْهَا فَقَالَ كَيْفَ رَأَيْتِنِي صَنَعْتُ بِعَدُوِّ اللَّهِ قَالَتْ رَأَيْتُكَ أَفْسَدْتَ عَلَيْهِ دُنْيَاهُ وَأَفْسَدَ عَلَيْكَ آخِرَتَكَ بَلَغَنِي أَنَّكَ تَقُولُ لَهُ يَا ابْنَ ذَاتِ النِّطَاقَيْنِ أَنَا وَاللَّهِ ذَاتُ النِّطَاقَيْنِ أَمَّا أَحَدُهُمَا فَكُنْتُ أَرْفَعُ بِهِ طَعَامَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَطَعَامَ أَبِي بَكْرٍ مِنَ الدَّوَابِّ وَأَمَّا الآخَرُ فَنِطَاقُ الْمَرْأَةِ الَّتِي لاَ تَسْتَغْنِي عَنْهُ أَمَا إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم حَدَّثَنَا \" أَنَّ فِي ثَقِيفٍ كَذَّابًا وَمُبِيرًا \" . فَأَمَّا الْكَذَّابُ فَرَأَيْنَاهُ وَأَمَّا الْمُبِيرُ فَلاَ إِخَالُكَ إِلاَّ إِيَّاهُ - قَالَ - فَقَامَ عَنْهَا وَلَمْ يُرَاجِعْهَا ."
  },
  "2546": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2546b\nIn-book reference  : Book 44, Hadith 327\nUSC-MSA web (English) reference  : Book 31, Hadith 6178\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ نَزَلَتْ عَلَيْهِ سُورَةُ الْجُمُعَةِ فَلَمَّا قَرَأَ { وَآخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُوا بِهِمْ} قَالَ رَجُلٌ مَنْ هَؤُلاَءِ يَا رَسُولَ اللَّهِ فَلَمْ يُرَاجِعْهُ النَّبِيُّ صلى الله عليه وسلم حَتَّى سَأَلَهُ مَرَّةً أَوْ مَرَّتَيْنِ أَوْ ثَلاَثًا - قَالَ - وَفِينَا سَلْمَانُ الْفَارِسِيُّ - قَالَ - فَوَضَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ عَلَى سَلْمَانَ ثُمَّ قَالَ \" لَوْ كَانَ الإِيمَانُ عِنْدَ الثُّرَيَّا لَنَالَهُ رِجَالٌ مِنْ هَؤُلاَءِ \" ."
  },
  "2547": {
    "collection": "Sahih Muslim",
    "book": "The Book of the Merits of the Companions",
    "book_num": "44",
    "reference": "Reference  : Sahih Muslim 2547\nIn-book reference  : Book 44, Hadith 328\nUSC-MSA web (English) reference  : Book 31, Hadith 6179\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/44",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَاللَّفْظُ لِمُحَمَّدٍ - قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ، ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَجِدُونَ النَّاسَ كَإِبِلٍ مِائَةٍ لاَ يَجِدُ الرَّجُلُ فِيهَا رَاحِلَةً \" ."
  }
}