{
  "2276": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2276\nIn-book reference  : Book 43, Hadith 1\nUSC-MSA web (English) reference  : Book 30, Hadith 5653\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ مِهْرَانَ الرَّازِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ، جَمِيعًا عَنِ الْوَلِيدِ، - قَالَ ابْنُ مِهْرَانَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، - حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ أَبِي عَمَّارٍ، شَدَّادٍ أَنَّهُ سَمِعَ وَاثِلَةَ بْنَ الأَسْقَعِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّ اللَّهَ اصْطَفَى كِنَانَةَ مِنْ وَلَدِ إِسْمَاعِيلَ وَاصْطَفَى قُرَيْشًا مِنْ كِنَانَةَ وَاصْطَفَى مِنْ قُرَيْشٍ بَنِي هَاشِمٍ وَاصْطَفَانِي مِنْ بَنِي هَاشِمٍ \" ."
  },
  "2277": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2277\nIn-book reference  : Book 43, Hadith 2\nUSC-MSA web (English) reference  : Book 30, Hadith 5654\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، عَنْ إِبْرَاهِيمَ بْنِ طَهْمَانَ، حَدَّثَنِي سِمَاكُ بْنُ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي لأَعْرِفُ حَجَرًا بِمَكَّةَ كَانَ يُسَلِّمُ عَلَىَّ قَبْلَ أَنْ أُبْعَثَ إِنِّي لأَعْرِفُهُ الآنَ \" ."
  },
  "2278": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2278\nIn-book reference  : Book 43, Hadith 3\nUSC-MSA web (English) reference  : Book 30, Hadith 5655\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي الْحَكَمُ بْنُ مُوسَى أَبُو صَالِحٍ، حَدَّثَنَا هِقْلٌ، - يَعْنِي ابْنَ زِيَادٍ - عَنِ الأَوْزَاعِيِّ، حَدَّثَنِي أَبُو عَمَّارٍ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ فَرُّوخَ، حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَنَا سَيِّدُ وَلَدِ آدَمَ يَوْمَ الْقِيَامَةِ وَأَوَّلُ مَنْ يَنْشَقُّ عَنْهُ الْقَبْرُ وَأَوَّلُ شَافِعٍ وَأَوَّلُ مُشَفَّعٍ \" ."
  },
  "2279": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2279d\nIn-book reference  : Book 43, Hadith 7\nUSC-MSA web (English) reference  : Book 30, Hadith 5659\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ بِالزَّوْرَاءِ فَأُتِيَ بِإِنَاءِ مَاءٍ لاَ يَغْمُرُ أَصَابِعَهُ أَوْ قَدْرَ مَا يُوَارِي أَصَابِعَهُ . ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ هِشَامٍ ."
  },
  "2280": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2280\nIn-book reference  : Book 43, Hadith 8\nUSC-MSA web (English) reference  : Book 30, Hadith 5660\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ أُمَّ مَالِكٍ، كَانَتْ تُهْدِي لِلنَّبِيِّ صلى الله عليه وسلم فِي عُكَّةٍ لَهَا سَمْنًا فَيَأْتِيهَا بَنُوهَا فَيَسْأَلُونَ الأُدْمَ وَلَيْسَ عِنْدَهُمْ شَىْءٌ فَتَعْمِدُ إِلَى الَّذِي كَانَتْ تُهْدِي فِيهِ لِلنَّبِيِّ صلى الله عليه وسلم فَتَجِدُ فِيهِ سَمْنًا فَمَا زَالَ يُقِيمُ لَهَا أُدْمَ بَيْتِهَا حَتَّى عَصَرَتْهُ فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" عَصَرْتِيهَا \" . قَالَتْ نَعَمْ . قَالَ \" لَوْ تَرَكْتِيهَا مَا زَالَ قَائِمًا \" ."
  },
  "2281": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2281\nIn-book reference  : Book 43, Hadith 9\nUSC-MSA web (English) reference  : Book 30, Hadith 5661\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم يَسْتَطْعِمُهُ فَأَطْعَمَهُ شَطْرَ وَسْقِ شَعِيرٍ فَمَا زَالَ الرَّجُلُ يَأْكُلُ مِنْهُ وَامْرَأَتُهُ وَضَيْفُهُمَا حَتَّى كَالَهُ فَأَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" لَوْ لَمْ تَكِلْهُ لأَكَلْتُمْ مِنْهُ وَلَقَامَ لَكُمْ \" ."
  },
  "706": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 706c\nIn-book reference  : Book 43, Hadith 10\nUSC-MSA web (English) reference  : Book 30, Hadith 5662\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا أَبُو عَلِيٍّ الْحَنَفِيُّ، حَدَّثَنَا مَالِكٌ، - وَهُوَ ابْنُ أَنَسٍ - عَنْ أَبِي الزُّبَيْرِ الْمَكِّيِّ، أَنَّ أَبَا الطُّفَيْلِ، عَامِرَ بْنَ وَاثِلَةَ أَخْبَرَهُ أَنَّ مُعَاذَ بْنَ جَبَلٍ أَخْبَرَهُ قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَامَ غَزْوَةِ تَبُوكَ فَكَانَ يَجْمَعُ الصَّلاَةَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا وَالْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا حَتَّى إِذَا كَانَ يَوْمًا أَخَّرَ الصَّلاَةَ ثُمَّ خَرَجَ فَصَلَّى الظُّهْرَ وَالْعَصْرَ جَمِيعًا ثُمَّ دَخَلَ ثُمَّ خَرَجَ بَعْدَ ذَلِكَ فَصَلَّى الْمَغْرِبَ وَالْعِشَاءَ جَمِيعًا ثُمَّ قَالَ \" إِنَّكُمْ سَتَأْتُونَ غَدًا إِنْ شَاءَ اللَّهُ عَيْنَ تَبُوكَ وَإِنَّكُمْ لَنْ تَأْتُوهَا حَتَّى يُضْحِيَ النَّهَارُ فَمَنْ جَاءَهَا مِنْكُمْ فَلاَ يَمَسَّ مِنْ مَائِهَا شَيْئًا حَتَّى آتِيَ \" . فَجِئْنَاهَا وَقَدْ سَبَقَنَا إِلَيْهَا رَجُلاَنِ وَالْعَيْنُ مِثْلُ الشِّرَاكِ تَبِضُّ بِشَىْءٍ مِنْ مَاءٍ - قَالَ - فَسَأَلَهُمَا رَسُولُ اللَّهِ صلى الله عليه وسلم \" هَلْ مَسَسْتُمَا مِنْ مَائِهَا شَيْئًا \" . قَالاَ نَعَمْ . فَسَبَّهُمَا النَّبِيُّ صلى الله عليه وسلم وَقَالَ لَهُمَا مَا شَاءَ اللَّهُ أَنْ يَقُولَ - قَالَ - ثُمَّ غَرَفُوا بِأَيْدِيهِمْ مِنَ الْعَيْنِ قَلِيلاً قَلِيلاً حَتَّى اجْتَمَعَ فِي شَىْءٍ - قَالَ - وَغَسَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِيهِ يَدَيْهِ وَوَجْهَهُ ثُمَّ أَعَادَهُ فِيهَا فَجَرَتِ الْعَيْنُ بِمَاءٍ مُنْهَمِرٍ أَوْ قَالَ غَزِيرٍ - شَكَّ أَبُو عَلِيٍّ أَيُّهُمَا قَالَ - حَتَّى اسْتَقَى النَّاسُ ثُمَّ قَالَ \" يُوشِكُ يَا مُعَاذُ إِنْ طَالَتْ بِكَ حَيَاةٌ أَنْ تَرَى مَا هَا هُنَا قَدْ مُلِئَ جِنَانًا \" ."
  },
  "1392": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 1392c\nIn-book reference  : Book 43, Hadith 12\nUSC-MSA web (English) reference  : Book 30, Hadith 5664\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمُغِيرَةُ بْنُ سَلَمَةَ الْمَخْزُومِيُّ، قَالاَ حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ يَحْيَى، بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ \" وَفِي كُلِّ دُورِ الأَنْصَارِ خَيْرٌ \" . وَلَمْ يَذْكُرْ مَا بَعْدَهُ مِنْ قِصَّةِ سَعْدِ بْنِ عُبَادَةَ وَزَادَ فِي حَدِيثِ وُهَيْبٍ فَكَتَبَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِبَحْرِهِمْ . وَلَمْ يَذْكُرْ فِي حَدِيثِ وُهَيْبٍ فَكَتَبَ إِلَيْهِ رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "843": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 843e\nIn-book reference  : Book 43, Hadith 15\nUSC-MSA web (English) reference  : Book 30, Hadith 5667\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا أَبَانُ بْنُ يَزِيدَ، حَدَّثَنَا يَحْيَى، بْنُ أَبِي كَثِيرٍ عَنْ أَبِي سَلَمَةَ، عَنْ جَابِرٍ، قَالَ أَقْبَلْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَتَّى إِذَا كُنَّا بِذَاتِ الرِّقَاعِ . بِمَعْنَى حَدِيثِ الزُّهْرِيِّ وَلَمْ يَذْكُرْ ثُمَّ لَمْ يَعْرِضْ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "2282": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2282\nIn-book reference  : Book 43, Hadith 16\nUSC-MSA web (English) reference  : Book 30, Hadith 5668\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو عَامِرٍ الأَشْعَرِيُّ وَمُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لأَبِي عَامِرٍ - قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ مَثَلَ مَا بَعَثَنِي اللَّهُ بِهِ عَزَّ وَجَلَّ مِنَ الْهُدَى وَالْعِلْمِ كَمَثَلِ غَيْثٍ أَصَابَ أَرْضًا فَكَانَتْ مِنْهَا طَائِفَةٌ طَيِّبَةٌ قَبِلَتِ الْمَاءَ فَأَنْبَتَتِ الْكَلأَ وَالْعُشْبَ الْكَثِيرَ وَكَانَ مِنْهَا أَجَادِبُ أَمْسَكَتِ الْمَاءَ فَنَفَعَ اللَّهُ بِهَا النَّاسَ فَشَرِبُوا مِنْهَا وَسَقَوْا وَرَعَوْا وَأَصَابَ طَائِفَةً مِنْهَا أُخْرَى إِنَّمَا هِيَ قِيعَانٌ لاَ تُمْسِكُ مَاءً وَلاَ تُنْبِتُ كَلأً فَذَلِكَ مَثَلُ مَنْ فَقُهَ فِي دِينِ اللَّهِ وَنَفَعَهُ بِمَا بَعَثَنِي اللَّهُ بِهِ فَعَلِمَ وَعَلَّمَ وَمَثَلُ مَنْ لَمْ يَرْفَعْ بِذَلِكَ رَأْسًا وَلَمْ يَقْبَلْ هُدَى اللَّهِ الَّذِي أُرْسِلْتُ بِهِ \" ."
  },
  "2283": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2283\nIn-book reference  : Book 43, Hadith 17\nUSC-MSA web (English) reference  : Book 30, Hadith 5669\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ مَثَلِي وَمَثَلَ مَا بَعَثَنِيَ اللَّهُ بِهِ كَمَثَلِ رَجُلٍ أَتَى قَوْمَهُ فَقَالَ يَا قَوْمِ إِنِّي رَأَيْتُ الْجَيْشَ بِعَيْنَىَّ وَإِنِّي أَنَا النَّذِيرُ الْعُرْيَانُ فَالنَّجَاءَ . فَأَطَاعَهُ طَائِفَةٌ مِنْ قَوْمِهِ فَأَدْلَجُوا فَانْطَلَقُوا عَلَى مُهْلَتِهِمْ وَكَذَّبَتْ طَائِفَةٌ مِنْهُمْ فَأَصْبَحُوا مَكَانَهُمْ فَصَبَّحَهُمُ الْجَيْشُ فَأَهْلَكَهُمْ وَاجْتَاحَهُمْ فَذَلِكَ مَثَلُ مَنْ أَطَاعَنِي وَاتَّبَعَ مَا جِئْتُ بِهِ وَمَثَلُ مَنْ عَصَانِي وَكَذَّبَ مَا جِئْتُ بِهِ مِنَ الْحَقِّ \" ."
  },
  "2284": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2284c\nIn-book reference  : Book 43, Hadith 20\nUSC-MSA web (English) reference  : Book 30, Hadith 5671\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلِي كَمَثَلِ رَجُلٍ اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهَا جَعَلَ الْفَرَاشُ وَهَذِهِ الدَّوَابُّ الَّتِي فِي النَّارِ يَقَعْنَ فِيهَا وَجَعَلَ يَحْجُزُهُنَّ وَيَغْلِبْنَهُ فَيَتَقَحَّمْنَ فِيهَا قَالَ فَذَلِكُمْ مَثَلِي وَمَثَلُكُمْ أَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ هَلُمَّ عَنِ النَّارِ هَلُمَّ عَنِ النَّارِ فَتَغْلِبُونِي تَقَحَّمُونَ فِيهَا \" ."
  },
  "2285": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2285\nIn-book reference  : Book 43, Hadith 21\nUSC-MSA web (English) reference  : Book 30, Hadith 5672\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمٌ، عَنْ سَعِيدِ بْنِ مِينَاءَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلِي وَمَثَلُكُمْ كَمَثَلِ رَجُلٍ أَوْقَدَ نَارًا فَجَعَلَ الْجَنَادِبُ وَالْفَرَاشُ يَقَعْنَ فِيهَا وَهُوَ يَذُبُّهُنَّ عَنْهَا وَأَنَا آخِذٌ بِحُجَزِكُمْ عَنِ النَّارِ وَأَنْتُمْ تَفَلَّتُونَ مِنْ يَدِي \" ."
  },
  "2286": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2286d\nIn-book reference  : Book 43, Hadith 25\nUSC-MSA web (English) reference  : Book 30, Hadith 5676\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلِي وَمَثَلُ النَّبِيِّينَ \" . فَذَكَرَ نَحْوَهُ ."
  },
  "2287": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2287b\nIn-book reference  : Book 43, Hadith 27\nUSC-MSA web (English) reference  : Book 30, Hadith 5678\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا سَلِيمٌ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالَ بَدَلَ أَتَمَّهَا أَحْسَنَهَا ."
  },
  "2288": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2288\nIn-book reference  : Book 43, Hadith 28\nUSC-MSA web (English) reference  : Book 30, Hadith 5679\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "قَالَ مُسْلِمٌ وَحُدِّثْتُ عَنْ أَبِي أُسَامَةَ، وَمِمَّنْ، رَوَى ذَلِكَ، عَنْهُ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ اللَّهَ عَزَّ وَجَلَّ إِذَا أَرَادَ رَحْمَةَ أُمَّةٍ مِنْ عِبَادِهِ قَبَضَ نَبِيَّهَا قَبْلَهَا فَجَعَلَهُ لَهَا فَرَطًا وَسَلَفًا بَيْنَ يَدَيْهَا وَإِذَا أَرَادَ هَلَكَةَ أُمَّةٍ عَذَّبَهَا وَنَبِيُّهَا حَىٌّ فَأَهْلَكَهَا وَهُوَ يَنْظُرُ فَأَقَرَّ عَيْنَهُ بِهَلَكَتِهَا حِينَ كَذَّبُوهُ وَعَصَوْا أَمْرَهُ \" ."
  },
  "2289": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2289b\nIn-book reference  : Book 43, Hadith 30\nUSC-MSA web (English) reference  : Book 30, Hadith 5681\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، جَمِيعًا عَنْ مِسْعَرٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ جُنْدَبٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2290": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2290, 2291a\nIn-book reference  : Book 43, Hadith 31\nUSC-MSA web (English) reference  : Book 30, Hadith 5682\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ أَبِي حَازِمٍ، قَالَ سَمِعْتُ سَهْلاً، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" أَنَا فَرَطُكُمْ، عَلَى الْحَوْضِ مَنْ وَرَدَ شَرِبَ وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا وَلَيَرِدَنَّ عَلَىَّ أَقْوَامٌ أَعْرِفُهُمْ وَيَعْرِفُونِي ثُمَّ يُحَالُ بَيْنِي وَبَيْنَهُمْ \" . قَالَ أَبُو حَازِمٍ فَسَمِعَ النُّعْمَانُ بْنُ أَبِي عَيَّاشٍ وَأَنَا أُحَدِّثُهُمْ هَذَا الْحَدِيثَ فَقَالَ هَكَذَا سَمِعْتَ سَهْلاً يَقُولُ قَالَ فَقُلْتُ نَعَمْ .\nقَالَ وَأَنَا أَشْهَدُ، عَلَى أَبِي سَعِيدٍ الْخُدْرِيِّ لَسَمِعْتُهُ يَزِيدُ فَيَقُولُ \" إِنَّهُمْ مِنِّي . فَيُقَالُ إِنَّكَ لاَ تَدْرِي مَا عَمِلُوا بَعْدَكَ . فَأَقُولُ سُحْقًا سُحْقًا لِمَنْ بَدَّلَ بَعْدِي \" ."
  },
  "2291": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2291b\nIn-book reference  : Book 43, Hadith 32\nUSC-MSA web (English) reference  : Book 30, Hadith 5683\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَعَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ، الْخُدْرِيِّ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ يَعْقُوبَ ."
  },
  "2292": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2292, 2293\nIn-book reference  : Book 43, Hadith 33\nUSC-MSA web (English) reference  : Book 30, Hadith 5684\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا دَاوُدُ بْنُ عَمْرٍو الضَّبِّيُّ، حَدَّثَنَا نَافِعُ بْنُ عُمَرَ الْجُمَحِيُّ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" حَوْضِي مَسِيرَةُ شَهْرٍ وَزَوَايَاهُ سَوَاءٌ وَمَاؤُهُ أَبْيَضُ مِنَ الْوَرِقِ وَرِيحُهُ أَطْيَبُ مِنَ الْمِسْكِ وَكِيزَانُهُ كَنُجُومِ السَّمَاءِ فَمَنْ شَرِبَ مِنْهُ فَلاَ يَظْمَأُ بَعْدَهُ أَبَدًا \" .\nقَالَ وَقَالَتْ أَسْمَاءُ بِنْتُ أَبِي بَكْرٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي عَلَى الْحَوْضِ حَتَّى أَنْظُرَ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ وَسَيُؤْخَذُ أُنَاسٌ دُونِي فَأَقُولُ يَا رَبِّ مِنِّي وَمِنْ أُمَّتِي . فَيُقَالُ أَمَا شَعَرْتَ مَا عَمِلُوا بَعْدَكَ وَاللَّهِ مَا بَرِحُوا بَعْدَكَ يَرْجِعُونَ عَلَى أَعْقَابِهِمْ \" . قَالَ فَكَانَ ابْنُ أَبِي مُلَيْكَةَ يَقُولُ اللَّهُمَّ إِنَّا نَعُوذُ بِكَ أَنْ نَرْجِعَ عَلَى أَعْقَابِنَا أَوْ أَنْ نُفْتَنَ عَنْ دِينِنَا"
  },
  "2294": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2294\nIn-book reference  : Book 43, Hadith 34\nUSC-MSA web (English) reference  : Book 30, Hadith 5685\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنِ ابْنِ خُثَيْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُبَيْدِ، اللَّهِ بْنِ أَبِي مُلَيْكَةَ أَنَّهُ سَمِعَ عَائِشَةَ، تَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ وَهُوَ بَيْنَ ظَهْرَانَىْ أَصْحَابِهِ \" إِنِّي عَلَى الْحَوْضِ أَنْتَظِرُ مَنْ يَرِدُ عَلَىَّ مِنْكُمْ فَوَاللَّهِ لَيُقْتَطَعَنَّ دُونِي رِجَالٌ فَلأَقُولَنَّ أَىْ رَبِّ مِنِّي وَمِنْ أُمَّتِي . فَيَقُولُ إِنَّكَ لاَ تَدْرِي مَا عَمِلُوا بَعْدَكَ مَا زَالُوا يَرْجِعُونَ عَلَى أَعْقَابِهِمْ \" ."
  },
  "2295": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2295b\nIn-book reference  : Book 43, Hadith 36\nUSC-MSA web (English) reference  : Book 30, Hadith 5687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي أَبُو مَعْنٍ الرَّقَاشِيُّ، وَأَبُو بَكْرِ بْنُ نَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ قَالُوا حَدَّثَنَا أَبُو عَامِرٍ - وَهُوَ عَبْدُ الْمَلِكِ بْنُ عَمْرٍو - حَدَّثَنَا أَفْلَحُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ رَافِعٍ، قَالَ كَانَتْ أُمُّ سَلَمَةَ تُحَدِّثُ أَنَّهَا سَمِعَتِ النَّبِيَّ صلى الله عليه وسلم يَقُولُ عَلَى الْمِنْبَرِ وَهِيَ تَمْتَشِطُ \" أَيُّهَا النَّاسُ \" . فَقَالَتْ لِمَاشِطَتِهَا كُفِّي رَأْسِي . بِنَحْوِ حَدِيثِ بُكَيْرٍ عَنِ الْقَاسِمِ بْنِ عَبَّاسٍ ."
  },
  "2296": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2296b\nIn-book reference  : Book 43, Hadith 38\nUSC-MSA web (English) reference  : Book 30, Hadith 5689\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا وَهْبٌ، - يَعْنِي ابْنَ جَرِيرٍ - حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ يَحْيَى بْنَ أَيُّوبَ، يُحَدِّثُ عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدٍ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ صَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى قَتْلَى أُحُدٍ ثُمَّ صَعِدَ الْمِنْبَرَ كَالْمُوَدِّعِ لِلأَحْيَاءِ وَالأَمْوَاتِ فَقَالَ \" إِنِّي فَرَطُكُمْ عَلَى الْحَوْضِ وَإِنَّ عَرْضَهُ كَمَا بَيْنَ أَيْلَةَ إِلَى الْجُحْفَةِ إِنِّي لَسْتُ أَخْشَى عَلَيْكُمْ أَنْ تُشْرِكُوا بَعْدِي وَلَكِنِّي أَخْشَى عَلَيْكُمُ الدُّنْيَا أَنْ تَنَافَسُوا فِيهَا وَتَقْتَتِلُوا فَتَهْلِكُوا كَمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ \" . قَالَ عُقْبَةُ فَكَانَتْ آخِرَ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى الْمِنْبَرِ ."
  },
  "2297": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2297d\nIn-book reference  : Book 43, Hadith 42\nUSC-MSA web (English) reference  : Book 30, Hadith 5693\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، أَخْبَرَنَا عَبْثَرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي، شَيْبَةَ حَدَّثَنَا ابْنُ فُضَيْلٍ، كِلاَهُمَا عَنْ حُصَيْنٍ، عَنْ أَبِي وَائِلٍ، عَنْ حُذَيْفَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ الأَعْمَشِ وَمُغِيرَةَ ."
  },
  "2298": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2298b\nIn-book reference  : Book 43, Hadith 44\nUSC-MSA web (English) reference  : Book 30, Hadith 5695\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُحَمَّدِ بْنِ عَرْعَرَةَ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ، حَدَّثَنَا شُعْبَةُ، عَنْ مَعْبَدِ بْنِ خَالِدٍ، أَنَّهُ سَمِعَ حَارِثَةَ بْنَ وَهْبٍ الْخُزَاعِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ . وَذَكَرَ الْحَوْضَ بِمِثْلِهِ وَلَمْ يَذْكُرْ قَوْلَ الْمُسْتَوْرِدِ وَقَوْلَهُ ."
  },
  "2299": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2299e\nIn-book reference  : Book 43, Hadith 49\nUSC-MSA web (English) reference  : Book 30, Hadith 5700\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنْ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ أَمَامَكُمْ حَوْضًا كَمَا بَيْنَ جَرْبَا وَأَذْرُحَ فِيهِ أَبَارِيقُ كَنُجُومِ السَّمَاءِ مَنْ وَرَدَهُ فَشَرِبَ مِنْهُ لَمْ يَظْمَأْ بَعْدَهَا أَبَدًا \" ."
  },
  "2300": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2300\nIn-book reference  : Book 43, Hadith 50\nUSC-MSA web (English) reference  : Book 30, Hadith 5701\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ الْمَكِّيُّ، - وَاللَّفْظُ لاِبْنِ أَبِي شَيْبَةَ - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عَبْدِ، الصَّمَدِ الْعَمِّيُّ عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ الصَّامِتِ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مَا آنِيَةُ الْحَوْضِ قَالَ \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لآنِيَتُهُ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ وَكَوَاكِبِهَا أَلاَ فِي اللَّيْلَةِ الْمُظْلِمَةِ الْمُصْحِيَةِ آنِيَةُ الْجَنَّةِ مَنْ شَرِبَ مِنْهَا لَمْ يَظْمَأْ آخِرَ مَا عَلَيْهِ يَشْخُبُ فِيهِ مِيزَابَانِ مِنَ الْجَنَّةِ مَنْ شَرِبَ مِنْهُ لَمْ يَظْمَأْ عَرْضُهُ مِثْلُ طُولِهِ مَا بَيْنَ عَمَّانَ إِلَى أَيْلَةَ مَاؤُهُ أَشَدُّ بَيَاضًا مِنَ اللَّبَنِ وَأَحْلَى مِنَ الْعَسَلِ \" ."
  },
  "2301": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2301c\nIn-book reference  : Book 43, Hadith 52\nUSC-MSA web (English) reference  : Book 30, Hadith 5703\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَالِمِ، بْنِ أَبِي الْجَعْدِ عَنْ مَعْدَانَ، عَنْ ثَوْبَانَ، عَنِ النَّبِيِّ صلى الله عليه وسلم حَدِيثَ الْحَوْضِ فَقُلْتُ لِيَحْيَى بْنِ حَمَّادٍ هَذَا حَدِيثٌ سَمِعْتَهُ مِنْ أَبِي عَوَانَةَ فَقَالَ وَسَمِعْتُهُ أَيْضًا مِنْ شُعْبَةَ فَقُلْتُ انْظُرْ لِي فِيهِ فَنَظَرَ لِي فِيهِ فَحَدَّثَنِي بِهِ ."
  },
  "2302": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2302b\nIn-book reference  : Book 43, Hadith 54\nUSC-MSA web (English) reference  : Book 30, Hadith 5704\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2303": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2303d, e\nIn-book reference  : Book 43, Hadith 60\nUSC-MSA web (English) reference  : Book 30, Hadith 5710\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ الرُّزِّيُّ، قَالاَ حَدَّثَنَا خَالِدُ، بْنُ الْحَارِثِ عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، قَالَ قَالَ أَنَسٌ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم \" تُرَى فِيهِ أَبَارِيقُ الذَّهَبِ وَالْفِضَّةِ كَعَدَدِ نُجُومِ السَّمَاءِ \" .\nوَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا شَيْبَانُ، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ مِثْلَهُ وَزَادَ \" أَوْ أَكْثَرُ مِنْ عَدَدِ نُجُومِ السَّمَاءِ \" ."
  },
  "2304": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2304b\nIn-book reference  : Book 43, Hadith 57\nUSC-MSA web (English) reference  : Book 30, Hadith 5707\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ حُجْرٍ، قَالاَ حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ فُضَيْلٍ، جَمِيعًا عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْمَعْنَى وَزَادَ \" آنِيَتُهُ عَدَدُ النُّجُومِ \" ."
  },
  "2305": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2305b\nIn-book reference  : Book 43, Hadith 62\nUSC-MSA web (English) reference  : Book 30, Hadith 5712\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ قَالاَ حَدَّثَنَا حَاتِمُ بْنُ إِسْمَاعِيلَ، عَنِ الْمُهَاجِرِ بْنِ مِسْمَارٍ، عَنْ عَامِرِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ كَتَبْتُ إِلَى جَابِرِ بْنِ سَمُرَةَ مَعَ غُلاَمِي نَافِعٍ أَخْبِرْنِي بِشَىْءٍ، سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - فَكَتَبَ إِلَىَّ إِنِّي سَمِعْتُهُ يَقُولُ \" أَنَا الْفَرَطُ عَلَى الْحَوْضِ \" ."
  },
  "2306": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2306b\nIn-book reference  : Book 43, Hadith 64\nUSC-MSA web (English) reference  : Book 30, Hadith 5714\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا إِبْرَاهِيمُ، بْنُ سَعْدٍ حَدَّثَنَا سَعْدٌ، عَنْ أَبِيهِ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ لَقَدْ رَأَيْتُ يَوْمَ أُحُدٍ عَنْ يَمِينِ، رَسُولِ اللَّهِ صلى الله عليه وسلم وَعَنْ يَسَارِهِ رَجُلَيْنِ عَلَيْهِمَا ثِيَابٌ بِيضٌ يُقَاتِلاَنِ عَنْهُ كَأَشَدِّ الْقِتَالِ مَا رَأَيْتُهُمَا قَبْلُ وَلاَ بَعْدُ ."
  },
  "2307": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2307c\nIn-book reference  : Book 43, Hadith 67\nUSC-MSA web (English) reference  : Book 30, Hadith 5717\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنِيهِ يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - قَالاَ حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ ابْنِ جَعْفَرٍ قَالَ فَرَسًا لَنَا . وَلَمْ يَقُلْ لأَبِي طَلْحَةَ . وَفِي حَدِيثِ خَالِدٍ عَنْ قَتَادَةَ سَمِعْتُ أَنَسًا ."
  },
  "2308": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2308b\nIn-book reference  : Book 43, Hadith 69\nUSC-MSA web (English) reference  : Book 30, Hadith 5719\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ مُبَارَكٍ، عَنْ يُونُسَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2309": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2309d\nIn-book reference  : Book 43, Hadith 73\nUSC-MSA web (English) reference  : Book 30, Hadith 5723\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا زَكَرِيَّاءُ، حَدَّثَنِي سَعِيدٌ، - وَهُوَ ابْنُ أَبِي بُرْدَةَ - عَنْ أَنَسٍ، قَالَ خَدَمْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم تِسْعَ سِنِينَ فَمَا أَعْلَمُهُ قَالَ لِي قَطُّ لِمَ فَعَلْتَ كَذَا وَكَذَا وَلاَ عَابَ عَلَىَّ شَيْئًا قَطُّ ."
  },
  "2310": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2310b\nIn-book reference  : Book 43, Hadith 75\nUSC-MSA web (English) reference  : Book 30, Hadith 5725\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، وَأَبُو الرَّبِيعِ، قَالاَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ خُلُقًا ."
  },
  "2311": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2311b\nIn-book reference  : Book 43, Hadith 77\nUSC-MSA web (English) reference  : Book 30, Hadith 5727\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا الأَشْجَعِيُّ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - كِلاَهُمَا عَنْ سُفْيَانَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ، اللَّهِ يَقُولُ مِثْلَهُ سَوَاءً ."
  },
  "2312": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2312b\nIn-book reference  : Book 43, Hadith 79\nUSC-MSA web (English) reference  : Book 30, Hadith 5729\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، سَأَلَ النَّبِيَّ صلى الله عليه وسلم غَنَمًا بَيْنَ جَبَلَيْنِ فَأَعْطَاهُ إِيَّاهُ فَأَتَى قَوْمَهُ فَقَالَ أَىْ قَوْمِ أَسْلِمُوا فَوَاللَّهِ إِنَّ مُحَمَّدًا لَيُعْطِي عَطَاءً مَا يَخَافُ الْفَقْرَ . فَقَالَ أَنَسٌ إِنْ كَانَ الرَّجُلُ لَيُسْلِمُ مَا يُرِيدُ إِلاَّ الدُّنْيَا فَمَا يُسْلِمُ حَتَّى يَكُونَ الإِسْلاَمُ أَحَبَّ إِلَيْهِ مِنَ الدُّنْيَا وَمَا عَلَيْهَا ."
  },
  "2313": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2313\nIn-book reference  : Book 43, Hadith 80\nUSC-MSA web (English) reference  : Book 30, Hadith 5730\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ سَرْحٍ أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ غَزَا رَسُولُ اللَّهِ صلى الله عليه وسلم غَزْوَةَ الْفَتْحِ فَتْحِ مَكَّةَ ثُمَّ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَنْ مَعَهُ مِنَ الْمُسْلِمِينَ فَاقْتَتَلُوا بِحُنَيْنٍ فَنَصَرَ اللَّهُ دِينَهُ وَالْمُسْلِمِينَ وَأَعْطَى رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَئِذٍ صَفْوَانَ بْنَ أُمَيَّةَ مِائَةً مِنَ النَّعَمِ ثُمَّ مِائَةً ثُمَّ مِائَةً . قَالَ ابْنُ شِهَابٍ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ أَنَّ صَفْوَانَ قَالَ وَاللَّهِ لَقَدْ أَعْطَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم مَا أَعْطَانِي وَإِنَّهُ لأَبْغَضُ النَّاسِ إِلَىَّ فَمَا بَرِحَ يُعْطِينِي حَتَّى إِنَّهُ لأَحَبُّ النَّاسِ إِلَىَّ ."
  },
  "2314": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2314b\nIn-book reference  : Book 43, Hadith 82\nUSC-MSA web (English) reference  : Book 30, Hadith 5732\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَمْرُو بْنُ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ عَلِيٍّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ وَأَخْبَرَنِي مُحَمَّدُ بْنُ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ لَمَّا مَاتَ النَّبِيُّ صلى الله عليه وسلم جَاءَ أَبَا بَكْرٍ مَالٌ مِنْ قِبَلِ الْعَلاَءِ بْنِ الْحَضْرَمِيِّ فَقَالَ أَبُو بَكْرٍ مَنْ كَانَ لَهُ عَلَى النَّبِيِّ صلى الله عليه وسلم دَيْنٌ أَوْ كَانَتْ لَهُ قِبَلَهُ عِدَةٌ فَلْيَأْتِنَا . بِنَحْوِ حَدِيثِ ابْنِ عُيَيْنَةَ ."
  },
  "2315": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2315\nIn-book reference  : Book 43, Hadith 83\nUSC-MSA web (English) reference  : Book 30, Hadith 5733\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، وَشَيْبَانُ بْنُ فَرُّوخَ، كِلاَهُمَا عَنْ سُلَيْمَانَ، - وَاللَّفْظُ لِشَيْبَانَ - حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، حَدَّثَنَا ثَابِتٌ الْبُنَانِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وُلِدَ لِيَ اللَّيْلَةَ غُلاَمٌ فَسَمَّيْتُهُ بِاسْمِ أَبِي إِبْرَاهِيمَ \" . ثُمَّ دَفَعَهُ إِلَى أُمِّ سَيْفٍ امْرَأَةِ قَيْنٍ يُقَالُ لَهُ أَبُو سَيْفٍ فَانْطَلَقَ يَأْتِيهِ وَاتَّبَعْتُهُ فَانْتَهَيْنَا إِلَى أَبِي سَيْفٍ وَهُوَ يَنْفُخُ بِكِيرِهِ قَدِ امْتَلأَ الْبَيْتُ دُخَانًا فَأَسْرَعْتُ الْمَشْىَ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا أَبَا سَيْفٍ أَمْسِكْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم . فَأَمْسَكَ فَدَعَا النَّبِيُّ صلى الله عليه وسلم بِالصَّبِيِّ فَضَمَّهُ إِلَيْهِ وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ . فَقَالَ أَنَسٌ لَقَدْ رَأَيْتُهُ وَهُوَ يَكِيدُ بِنَفْسِهِ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَمَعَتْ عَيْنَا رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" تَدْمَعُ الْعَيْنُ وَيَحْزَنُ الْقَلْبُ وَلاَ نَقُولُ إِلاَّ مَا يَرْضَى رَبُّنَا وَاللَّهِ يَا إِبْرَاهِيمُ إِنَّا بِكَ لَمَحْزُونُونَ \" ."
  },
  "2316": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2316\nIn-book reference  : Book 43, Hadith 84\nUSC-MSA web (English) reference  : Book 30, Hadith 5734\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لِزُهَيْرٍ - قَالاَ حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ عُلَيَّةَ - عَنْ أَيُّوبَ، عَنْ عَمْرِو بْنِ سَعِيدٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ مَا رَأَيْتُ أَحَدًا كَانَ أَرْحَمَ بِالْعِيَالِ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - كَانَ إِبْرَاهِيمُ مُسْتَرْضِعًا لَهُ فِي عَوَالِي الْمَدِينَةِ فَكَانَ يَنْطَلِقُ وَنَحْنُ مَعَهُ فَيَدْخُلُ الْبَيْتَ وَإِنَّهُ لَيُدَّخَنُ وَكَانَ ظِئْرُهُ قَيْنًا فَيَأْخُذُهُ فَيُقَبِّلُهُ ثُمَّ يَرْجِعُ . قَالَ عَمْرٌو فَلَمَّا تُوُفِّيَ إِبْرَاهِيمُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ إِبْرَاهِيمَ ابْنِي وَإِنَّهُ مَاتَ فِي الثَّدْىِ وَإِنَّ لَهُ لَظِئْرَيْنِ تُكَمِّلاَنِ رَضَاعَهُ فِي الْجَنَّةِ \" ."
  },
  "2317": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2317\nIn-book reference  : Book 43, Hadith 85\nUSC-MSA web (English) reference  : Book 30, Hadith 5735\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ نَاسٌ مِنَ الأَعْرَابِ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالُوا أَتُقَبِّلُونَ صِبْيَانَكُمْ فَقَالُوا نَعَمْ . فَقَالُوا لَكِنَّا وَاللَّهِ مَا نُقَبِّلُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَأَمْلِكُ إِنْ كَانَ اللَّهُ نَزَعَ مِنْكُمُ الرَّحْمَةَ \" . وَقَالَ ابْنُ نُمَيْرٍ \" مِنْ قَلْبِكَ الرَّحْمَةَ \" ."
  },
  "2318": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2318b\nIn-book reference  : Book 43, Hadith 87\nUSC-MSA web (English) reference  : Book 30, Hadith 5736\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، حَدَّثَنِي أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2319": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2319b\nIn-book reference  : Book 43, Hadith 89\nUSC-MSA web (English) reference  : Book 30, Hadith 5738\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ جَرِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ أَبِي عُمَرَ، وَأَحْمَدُ بْنُ عَبْدَةَ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ نَافِعِ بْنِ جُبَيْرٍ، عَنْ جَرِيرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ الأَعْمَشِ ."
  },
  "2320": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2320\nIn-book reference  : Book 43, Hadith 90\nUSC-MSA web (English) reference  : Book 30, Hadith 5739\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، سَمِعَ عَبْدَ اللَّهِ، بْنَ أَبِي عُتْبَةَ يُحَدِّثُ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، ح\nوَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَأَحْمَدُ بْنُ سِنَانٍ، قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ أَبِي عُتْبَةَ، يَقُولُ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَشَدَّ حَيَاءً مِنَ الْعَذْرَاءِ فِي خِدْرِهَا وَكَانَ إِذَا كَرِهَ شَيْئًا عَرَفْنَاهُ فِي وَجْهِهِ ."
  },
  "2321": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2321b\nIn-book reference  : Book 43, Hadith 92\nUSC-MSA web (English) reference  : Book 30, Hadith 5741\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا أَبُو خَالِدٍ، - يَعْنِي الأَحْمَرَ - كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2322": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2322\nIn-book reference  : Book 43, Hadith 93\nUSC-MSA web (English) reference  : Book 30, Hadith 5742\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ قُلْتُ لِجَابِرِ بْنِ سَمُرَةَ أَكُنْتَ تُجَالِسُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ نَعَمْ كَثِيرًا كَانَ لاَ يَقُومُ مِنْ مُصَلاَّهُ الَّذِي يُصَلِّي فِيهِ الصُّبْحَ حَتَّى تَطْلُعَ الشَّمْسُ فَإِذَا طَلَعَتْ قَامَ وَكَانُوا يَتَحَدَّثُونَ فَيَأْخُذُونَ فِي أَمْرِ الْجَاهِلِيَّةِ فَيَضْحَكُونَ وَيَتَبَسَّمُ صلى الله عليه وسلم ."
  },
  "2323": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2323f\nIn-book reference  : Book 43, Hadith 99\nUSC-MSA web (English) reference  : Book 30, Hadith 5748\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ ابْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَمْ يَذْكُرْ حَادٍ حَسَنُ الصَّوْتِ ."
  },
  "2324": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2324\nIn-book reference  : Book 43, Hadith 100\nUSC-MSA web (English) reference  : Book 30, Hadith 5749\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، وَأَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ وَهَارُونُ بْنُ عَبْدِ اللَّهِ جَمِيعًا عَنْ أَبِي النَّضْرِ، قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَبُو النَّضْرِ، - يَعْنِي هَاشِمَ بْنَ الْقَاسِمِ - حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا صَلَّى الْغَدَاةَ جَاءَ خَدَمُ الْمَدِينَةِ بِآنِيَتِهِمْ فِيهَا الْمَاءُ فَمَا يُؤْتَى بِإِنَاءٍ إِلاَّ غَمَسَ يَدَهُ فِيهَا فَرُبَّمَا جَاءُوهُ فِي الْغَدَاةِ الْبَارِدَةِ فَيَغْمِسُ يَدَهُ فِيهَا ."
  },
  "2325": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2325\nIn-book reference  : Book 43, Hadith 101\nUSC-MSA web (English) reference  : Book 30, Hadith 5750\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالْحَلاَّقُ يَحْلِقُهُ وَأَطَافَ بِهِ أَصْحَابُهُ فَمَا يُرِيدُونَ أَنْ تَقَعَ شَعْرَةٌ إِلاَّ فِي يَدِ رَجُلٍ ."
  },
  "2326": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2326\nIn-book reference  : Book 43, Hadith 102\nUSC-MSA web (English) reference  : Book 30, Hadith 5751\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ امْرَأَةً، كَانَ فِي عَقْلِهَا شَىْءٌ فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ لِي إِلَيْكَ حَاجَةً فَقَالَ \" يَا أُمَّ فُلاَنٍ انْظُرِي أَىَّ السِّكَكِ شِئْتِ حَتَّى أَقْضِيَ لَكِ حَاجَتَكِ \" . فَخَلاَ مَعَهَا فِي بَعْضِ الطُّرُقِ حَتَّى فَرَغَتْ مِنْ حَاجَتِهَا ."
  },
  "2327": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2327e\nIn-book reference  : Book 43, Hadith 107\nUSC-MSA web (English) reference  : Book 30, Hadith 5755\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، وَابْنُ، نُمَيْرٍ جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ إِلَى قَوْلِهِ أَيْسَرَهُمَا . وَلَمْ يَذْكُرَا مَا بَعْدَهُ ."
  },
  "2328": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2328b\nIn-book reference  : Book 43, Hadith 109\nUSC-MSA web (English) reference  : Book 30, Hadith 5757\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا عَبْدَةُ، وَوَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ ."
  },
  "2329": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2329\nIn-book reference  : Book 43, Hadith 110\nUSC-MSA web (English) reference  : Book 30, Hadith 5758\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَمْرُو بْنُ حَمَّادِ بْنِ طَلْحَةَ الْقَنَّادُ، حَدَّثَنَا أَسْبَاطٌ، - وَهُوَ ابْنُ نَصْرٍ الْهَمْدَانِيُّ - عَنْ سِمَاكٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ صَلَّيْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم صَلاَةَ الأُولَى ثُمَّ خَرَجَ إِلَى أَهْلِهِ وَخَرَجْتُ مَعَهُ فَاسْتَقْبَلَهُ وِلْدَانٌ فَجَعَلَ يَمْسَحُ خَدَّىْ أَحَدِهِمْ وَاحِدًا وَاحِدًا - قَالَ - وَأَمَّا أَنَا فَمَسَحَ خَدِّي - قَالَ - فَوَجَدْتُ لِيَدِهِ بَرْدًا أَوْ رِيحًا كَأَنَّمَا أَخْرَجَهَا مِنْ جُؤْنَةِ عَطَّارٍ ."
  },
  "2330": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2330b\nIn-book reference  : Book 43, Hadith 112\nUSC-MSA web (English) reference  : Book 30, Hadith 5760\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ سَعِيدِ بْنِ صَخْرٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانٌ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَزْهَرَ اللَّوْنِ كَأَنَّ عَرَقَهُ اللُّؤْلُؤُ إِذَا مَشَى تَكَفَّأَ وَلاَ مَسِسْتُ دِيبَاجَةً وَلاَ حَرِيرَةً أَلْيَنَ مِنْ كَفِّ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ شَمَمْتُ مِسْكَةً وَلاَ عَنْبَرَةً أَطْيَبَ مِنْ رَائِحَةِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "2331": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2331b\nIn-book reference  : Book 43, Hadith 114\nUSC-MSA web (English) reference  : Book 30, Hadith 5762\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ أَبِي سَلَمَةَ - عَنْ إِسْحَاقَ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم يَدْخُلُ بَيْتَ أُمِّ سُلَيْمٍ فَيَنَامُ عَلَى فِرَاشِهَا وَلَيْسَتْ فِيهِ - قَالَ - فَجَاءَ ذَاتَ يَوْمٍ فَنَامَ عَلَى فِرَاشِهَا فَأُتِيَتْ فَقِيلَ لَهَا هَذَا النَّبِيُّ صلى الله عليه وسلم نَامَ فِي بَيْتِكِ عَلَى فِرَاشِكِ - قَالَ - فَجَاءَتْ وَقَدْ عَرِقَ وَاسْتَنْقَعَ عَرَقُهُ عَلَى قِطْعَةِ أَدِيمٍ عَلَى الْفِرَاشِ فَفَتَحَتْ عَتِيدَتَهَا فَجَعَلَتْ تُنَشِّفُ ذَلِكَ الْعَرَقَ فَتَعْصِرُهُ فِي قَوَارِيرِهَا فَفَزِعَ النَّبِيُّ صلى الله عليه وسلم فَقَالَ \" مَا تَصْنَعِينَ يَا أُمَّ سُلَيْمٍ \" . فَقَالَتْ يَا رَسُولَ اللَّهِ نَرْجُو بَرَكَتَهُ لِصِبْيَانِنَا قَالَ \" أَصَبْتِ \" ."
  },
  "2332": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2332\nIn-book reference  : Book 43, Hadith 115\nUSC-MSA web (English) reference  : Book 30, Hadith 5763\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا أَيُّوبُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنْ أُمِّ سُلَيْمٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْتِيهَا فَيَقِيلُ عِنْدَهَا فَتَبْسُطُ لَهُ نَطْعًا فَيَقِيلُ عَلَيْهِ وَكَانَ كَثِيرَ الْعَرَقِ فَكَانَتْ تَجْمَعُ عَرَقَهُ فَتَجْعَلُهُ فِي الطِّيبِ وَالْقَوَارِيرِ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" يَا أُمَّ سُلَيْمٍ مَا هَذَا \" . قَالَتْ عَرَقُكَ أَدُوفُ بِهِ طِيبِي ."
  },
  "2333": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2333b\nIn-book reference  : Book 43, Hadith 117\nUSC-MSA web (English) reference  : Book 30, Hadith 5765\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، بِشْرٍ جَمِيعًا عَنْ هِشَامٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ الْحَارِثَ بْنَ هِشَامٍ، سَأَلَ النَّبِيَّ صلى الله عليه وسلم كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ \" أَحْيَانًا يَأْتِينِي فِي مِثْلِ صَلْصَلَةِ الْجَرَسِ وَهُوَ أَشَدُّهُ عَلَىَّ ثُمَّ يَفْصِمُ عَنِّي وَقَدْ وَعَيْتُهُ وَأَحْيَانًا مَلَكٌ فِي مِثْلِ صُورَةِ الرَّجُلِ فَأَعِي مَا يَقُولُ \" ."
  },
  "2334": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2334\nIn-book reference  : Book 43, Hadith 118\nUSC-MSA web (English) reference  : Book 30, Hadith 5766\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الأَعْلَى، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ نَبِيُّ اللَّهِ صلى الله عليه وسلم إِذَا أُنْزِلَ عَلَيْهِ الْوَحْىُ كُرِبَ لِذَلِكَ وَتَرَبَّدَ وَجْهُهُ ."
  },
  "2335": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2335\nIn-book reference  : Book 43, Hadith 119\nUSC-MSA web (English) reference  : Book 30, Hadith 5767\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي، عَنْ قَتَادَةَ، عَنِ الْحَسَنِ، عَنْ حِطَّانَ بْنِ عَبْدِ اللَّهِ الرَّقَاشِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا أُنْزِلَ عَلَيْهِ الْوَحْىُ نَكَسَ رَأْسَهُ وَنَكَسَ أَصْحَابُهُ رُءُوسَهُمْ فَلَمَّا أُتْلِيَ عَنْهُ رَفَعَ رَأْسَهُ ."
  },
  "2336": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2336b\nIn-book reference  : Book 43, Hadith 121\nUSC-MSA web (English) reference  : Book 30, Hadith 5769\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "2337": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2337c\nIn-book reference  : Book 43, Hadith 124\nUSC-MSA web (English) reference  : Book 30, Hadith 5772\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ بْنِ، يُوسُفَ عَنْ أَبِيهِ، عَنْ أَبِي إِسْحَاقَ، قَالَ سَمِعْتُ الْبَرَاءَ، يَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْسَنَ النَّاسِ وَجْهًا وَأَحْسَنَهُمْ خَلْقًا لَيْسَ بِالطَّوِيلِ الذَّاهِبِ وَلاَ بِالْقَصِيرِ ."
  },
  "2338": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2338c\nIn-book reference  : Book 43, Hadith 127\nUSC-MSA web (English) reference  : Book 30, Hadith 5775\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ كَانَ شَعَرُ رَسُولِ اللَّهِ صلى الله عليه وسلم إِلَى أَنْصَافِ أُذُنَيْهِ ."
  },
  "2339": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2339\nIn-book reference  : Book 43, Hadith 128\nUSC-MSA web (English) reference  : Book 30, Hadith 5776\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ سَمِعْتُ جَابِرَ بْنَ سَمُرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم ضَلِيعَ الْفَمِ أَشْكَلَ الْعَيْنِ مَنْهُوسَ الْعَقِبَيْنِ . قَالَ قُلْتُ لِسِمَاكٍ مَا ضَلِيعُ الْفَمِ قَالَ عَظِيمُ الْفَمِ . قَالَ قُلْتُ مَا أَشْكَلُ الْعَيْنِ قَالَ طَوِيلُ شَقِّ الْعَيْنِ . قَالَ قُلْتُ مَا مَنْهُوسُ الْعَقِبِ قَالَ قَلِيلُ لَحْمِ الْعَقِبِ ."
  },
  "2340": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2340b\nIn-book reference  : Book 43, Hadith 130\nUSC-MSA web (English) reference  : Book 30, Hadith 5778\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا عَبْدُ الأَعْلَى بْنُ عَبْدِ الأَعْلَى، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي الطُّفَيْلِ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَمَا عَلَى وَجْهِ الأَرْضِ رَجُلٌ رَآهُ غَيْرِي . قَالَ فَقُلْتُ لَهُ فَكَيْفَ رَأَيْتَهُ قَالَ كَانَ أَبْيَضَ مَلِيحًا مُقَصَّدًا ."
  },
  "2341": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2341g\nIn-book reference  : Book 43, Hadith 137\nUSC-MSA web (English) reference  : Book 30, Hadith 5784\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ وَأَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ وَهَارُونُ بْنُ عَبْدِ اللَّهِ جَمِيعًا عَنْ أَبِي دَاوُدَ، قَالَ ابْنُ الْمُثَنَّى حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ خُلَيْدِ بْنِ جَعْفَرٍ، سَمِعَ أَبَا إِيَاسٍ، عَنْ أَنَسٍ، أَنَّهُ سُئِلَ عَنْ شَيْبِ النَّبِيِّ، صلى الله عليه وسلم فَقَالَ مَا شَانَهُ اللَّهُ بِبَيْضَاءَ ."
  },
  "2342": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2342\nIn-book reference  : Book 43, Hadith 138\nUSC-MSA web (English) reference  : Book 30, Hadith 5785\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ يُونُسَ، حَدَّثَنَا زُهَيْرٌ، حَدَّثَنَا أَبُو إِسْحَاقَ، ح وَحَدَّثَنَا يَحْيَى بْنُ، يَحْيَى أَخْبَرَنَا أَبُو خَيْثَمَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي جُحَيْفَةَ، قَالَ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم هَذِهِ مِنْهُ بَيْضَاءَ وَوَضَعَ زُهَيْرٌ بَعْضَ أَصَابِعِهِ عَلَى عَنْفَقَتِهِ قِيلَ لَهُ مِثْلُ مَنْ أَنْتَ يَوْمَئِذٍ قَالَ أَبْرِي النَّبْلَ وَأَرِيشُهَا ."
  },
  "2343": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2343b\nIn-book reference  : Book 43, Hadith 140\nUSC-MSA web (English) reference  : Book 30, Hadith 5787\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، وَخَالِدُ بْنُ عَبْدِ اللَّهِ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ، عَنْ أَبِي جُحَيْفَةَ، بِهَذَا وَلَمْ يَقُولُوا أَبْيَضَ قَدْ شَابَ ."
  },
  "2344": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2344d\nIn-book reference  : Book 43, Hadith 144\nUSC-MSA web (English) reference  : Book 30, Hadith 5791\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَخْبَرَنَا حَسَنُ بْنُ صَالِحٍ، عَنْ سِمَاكٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "2345": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2345\nIn-book reference  : Book 43, Hadith 145\nUSC-MSA web (English) reference  : Book 30, Hadith 5792\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ عَبَّادٍ، قَالاَ حَدَّثَنَا حَاتِمٌ، - وَهُوَ ابْنُ إِسْمَاعِيلَ - عَنِ الْجَعْدِ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ سَمِعْتُ السَّائِبَ بْنَ يَزِيدَ، يَقُولُ ذَهَبَتْ بِي خَالَتِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ إِنَّ ابْنَ أُخْتِي وَجِعٌ . فَمَسَحَ رَأْسِي وَدَعَا لِي بِالْبَرَكَةِ ثُمَّ تَوَضَّأَ فَشَرِبْتُ مِنْ وَضُوئِهِ ثُمَّ قُمْتُ خَلْفَ ظَهْرِهِ فَنَظَرْتُ إِلَى خَاتِمِهِ بَيْنَ كَتِفَيْهِ مِثْلَ زِرِّ الْحَجَلَةِ ."
  },
  "2346": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2346\nIn-book reference  : Book 43, Hadith 146\nUSC-MSA web (English) reference  : Book 30, Hadith 5793\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو كَامِلٍ، حَدَّثَنَا حَمَّادٌ يَعْنِي ابْنَ زَيْدٍ، ح وَحَدَّثَنِي سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، كِلاَهُمَا عَنْ عَاصِمٍ الأَحْوَلِ، ح وَحَدَّثَنِي حَامِدُ بْنُ عُمَرَ الْبَكْرَاوِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الْوَاحِدِ، - يَعْنِي ابْنَ زِيَادٍ - حَدَّثَنَا عَاصِمٌ، عَنْ عَبْدِ اللَّهِ بْنِ سَرْجِسَ، قَالَ رَأَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَكَلْتُ مَعَهُ خُبْزًا وَلَحْمًا - أَوْ قَالَ ثَرِيدًا - قَالَ فَقُلْتُ لَهُ أَسْتَغْفَرَ لَكَ النَّبِيُّ صلى الله عليه وسلم قَالَ نَعَمْ وَلَكَ ثُمَّ تَلاَ هَذِهِ الآيَةَ { وَاسْتَغْفِرْ لِذَنْبِكَ وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ} قَالَ ثُمَّ دُرْتُ خَلْفَهُ فَنَظَرْتُ إِلَى خَاتَمِ النُّبُوَّةِ بَيْنَ كَتِفَيْهِ عِنْدَ نَاغِضِ كَتِفِهِ الْيُسْرَى جُمْعًا عَلَيْهِ خِيلاَنٌ كَأَمْثَالِ الثَّآلِيلِ ."
  },
  "2347": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2347b\nIn-book reference  : Book 43, Hadith 148\nUSC-MSA web (English) reference  : Book 30, Hadith 5795\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، يَعْنُونَ ابْنَ جَعْفَرٍ ح وَحَدَّثَنِي الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنِي سُلَيْمَانُ بْنُ، بِلاَلٍ كِلاَهُمَا عَنْ رَبِيعَةَ، - يَعْنِي ابْنَ أَبِي عَبْدِ الرَّحْمَنِ - عَنْ أَنَسِ بْنِ مَالِكٍ، . بِمِثْلِ حَدِيثِ مَالِكِ بْنِ أَنَسٍ وَزَادَ فِي حَدِيثِهِمَا كَانَ أَزْهَرَ ."
  },
  "2348": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2348\nIn-book reference  : Book 43, Hadith 149\nUSC-MSA web (English) reference  : Book 30, Hadith 5796\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي أَبُو غَسَّانَ الرَّازِيُّ، مُحَمَّدُ بْنُ عَمْرٍو حَدَّثَنَا حَكَّامُ بْنُ سَلْمٍ، حَدَّثَنَا عُثْمَانُ، بْنُ زَائِدَةَ عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قُبِضَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَأَبُو بَكْرٍ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَعُمَرُ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ ."
  },
  "2349": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2349b\nIn-book reference  : Book 43, Hadith 151\nUSC-MSA web (English) reference  : Book 30, Hadith 5798\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَعَبَّادُ بْنُ مُوسَى، قَالاَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ يُونُسَ بْنِ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، بِالإِسْنَادَيْنِ جَمِيعًا مِثْلَ حَدِيثِ عُقَيْلٍ ."
  },
  "2350": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2350b\nIn-book reference  : Book 43, Hadith 153\nUSC-MSA web (English) reference  : Book 30, Hadith 5800\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، قَالَ قُلْتُ لِعُرْوَةَ كَمْ لَبِثَ النَّبِيُّ صلى الله عليه وسلم بِمَكَّةَ قَالَ عَشْرًا . قُلْتُ فَإِنَّ ابْنَ عَبَّاسٍ يَقُولُ بِضْعَ عَشْرَةَ . قَالَ فَغَفَّرَهُ وَقَالَ إِنَّمَا أَخَذَهُ مِنْ قَوْلِ الشَّاعِرِ ."
  },
  "2351": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2351b\nIn-book reference  : Book 43, Hadith 155\nUSC-MSA web (English) reference  : Book 30, Hadith 5802\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا بِشْرُ بْنُ السَّرِيِّ، حَدَّثَنَا حَمَّادٌ، عَنْ أَبِي جَمْرَةَ الضُّبَعِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ ثَلاَثَ عَشْرَةَ سَنَةً يُوحَى إِلَيْهِ وَبِالْمَدِينَةِ عَشْرًا وَمَاتَ وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ سَنَةً ."
  },
  "2352": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2352b\nIn-book reference  : Book 43, Hadith 157\nUSC-MSA web (English) reference  : Book 30, Hadith 5804\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ، جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، سَمِعْتُ أَبَا إِسْحَاقَ، يُحَدِّثُ عَنْ عَامِرِ بْنِ سَعْدٍ الْبَجَلِيِّ، عَنْ جَرِيرٍ، أَنَّهُ سَمِعَ مُعَاوِيَةَ، يَخْطُبُ فَقَالَ مَاتَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَهُوَ ابْنُ ثَلاَثٍ وَسِتِّينَ وَأَبُو بَكْرٍ وَعُمَرُ وَأَنَا ابْنُ ثَلاَثٍ وَسِتِّينَ ."
  },
  "2353": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2353e\nIn-book reference  : Book 43, Hadith 162\nUSC-MSA web (English) reference  : Book 30, Hadith 5809\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا رَوْحٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَمَّارِ بْنِ أَبِي عَمَّارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَكَّةَ خَمْسَ عَشْرَةَ سَنَةً يَسْمَعُ الصَّوْتَ وَيَرَى الضَّوْءَ سَبْعَ سِنِينَ وَلاَ يَرَى شَيْئًا وَثَمَانَ سِنِينَ يُوحَى إِلَيْهِ وَأَقَامَ بِالْمَدِينَةِ عَشْرًا ."
  },
  "2354": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2354c\nIn-book reference  : Book 43, Hadith 165\nUSC-MSA web (English) reference  : Book 30, Hadith 5812\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلٌ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ، الرَّحْمَنِ الدَّارِمِيُّ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . وَفِي حَدِيثِ شُعَيْبٍ وَمَعْمَرٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم . وَفِي حَدِيثِ عُقَيْلٍ قَالَ قُلْتُ لِلزُّهْرِيِّ وَمَا الْعَاقِبُ قَالَ الَّذِي لَيْسَ بَعْدَهُ نَبِيٌّ . وَفِي حَدِيثِ مَعْمَرٍ وَعُقَيْلٍ الْكَفَرَةَ . وَفِي حَدِيثِ شُعَيْبٍ الْكُفْرَ ."
  },
  "2355": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2355\nIn-book reference  : Book 43, Hadith 166\nUSC-MSA web (English) reference  : Book 30, Hadith 5813\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو، بْنِ مُرَّةَ عَنْ أَبِي عُبَيْدَةَ، عَنْ أَبِي مُوسَى الأَشْعَرِيِّ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُسَمِّي لَنَا نَفْسَهُ أَسْمَاءً فَقَالَ \" أَنَا مُحَمَّدٌ وَأَحْمَدُ وَالْمُقَفِّي وَالْحَاشِرُ وَنَبِيُّ التَّوْبَةِ وَنَبِيُّ الرَّحْمَةِ \" ."
  },
  "2356": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2356c\nIn-book reference  : Book 43, Hadith 169\nUSC-MSA web (English) reference  : Book 30, Hadith 5816\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي أَمْرٍ فَتَنَزَّهَ عَنْهُ نَاسٌ مِنَ النَّاسِ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَغَضِبَ حَتَّى بَانَ الْغَضَبُ فِي وَجْهِهِ ثُمَّ قَالَ \" مَا بَالُ أَقْوَامٍ يَرْغَبُونَ عَمَّا رُخِّصَ لِي فِيهِ فَوَاللَّهِ لأَنَا أَعْلَمُهُمْ بِاللَّهِ وَأَشَدُّهُمْ لَهُ خَشْيَةً \" ."
  },
  "2357": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2357\nIn-book reference  : Book 43, Hadith 170\nUSC-MSA web (English) reference  : Book 30, Hadith 5817\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ عَبْدَ اللَّهِ بْنَ الزُّبَيْرِ، حَدَّثَهُ أَنَّ رَجُلاً مِنَ الأَنْصَارِ خَاصَمَ الزُّبَيْرَ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي شِرَاجِ الْحَرَّةِ الَّتِي يَسْقُونَ بِهَا النَّخْلَ فَقَالَ الأَنْصَارِيُّ سَرِّحِ الْمَاءَ . يَمُرُّ فَأَبَى عَلَيْهِمْ فَاخْتَصَمُوا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلزُّبَيْرِ \" اسْقِ يَا زُبَيْرُ ثُمَّ أَرْسِلِ الْمَاءَ إِلَى جَارِكَ \" . فَغَضِبَ الأَنْصَارِيُّ فَقَالَ يَا رَسُولَ اللَّهِ أَنْ كَانَ ابْنَ عَمَّتِكَ فَتَلَوَّنَ وَجْهُ نَبِيِّ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ \" يَا زُبَيْرُ اسْقِ ثُمَّ احْبِسِ الْمَاءَ حَتَّى يَرْجِعَ إِلَى الْجَدْرِ \" . فَقَالَ الزُّبَيْرُ وَاللَّهِ إِنِّي لأَحْسِبُ هَذِهِ الآيَةَ نَزَلَتْ فِي ذَلِكَ { فَلاَ وَرَبِّكَ لاَ يُؤْمِنُونَ حَتَّى يُحَكِّمُوكَ فِيمَا شَجَرَ بَيْنَهُمْ ثُمَّ لاَ يَجِدُوا فِي أَنْفُسِهِمْ حَرَجًا}"
  },
  "1337": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 1337d\nIn-book reference  : Book 43, Hadith 173\nUSC-MSA web (English) reference  : Book 30, Hadith 5820\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ حَدَّثَنَا أَبِي كِلاَهُمَا، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ يَعْنِي الْحِزَامِيَّ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، ح\nوَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، سَمِعَ أَبَا هُرَيْرَةَ، ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، كُلُّهُمْ قَالَ عَنِ النَّبِيِّ صلى الله عليه وسلم \" ذَرُونِي مَا تَرَكْتُكُمْ \" . وَفِي حَدِيثِ هَمَّامٍ \" مَا تُرِكْتُمْ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ \" . ثُمَّ ذَكَرُوا نَحْوَ حَدِيثِ الزُّهْرِيِّ عَنْ سَعِيدٍ وَأَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ."
  },
  "2358": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2358c\nIn-book reference  : Book 43, Hadith 176\nUSC-MSA web (English) reference  : Book 30, Hadith 5822\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِيهِ حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا عَبْدُ بْنُ، حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . وَزَادَ فِي حَدِيثِ مَعْمَرٍ \" رَجُلٌ سَأَلَ عَنْ شَىْءٍ وَنَقَّرَ عَنْهُ \" . وَقَالَ فِي حَدِيثِ يُونُسَ عَامِرِ بْنِ سَعْدٍ أَنَّهُ سَمِعَ سَعْدًا ."
  },
  "2359": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2359f\nIn-book reference  : Book 43, Hadith 182\nUSC-MSA web (English) reference  : Book 30, Hadith 5828\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنَا مُحَمَّدُ، بْنُ بَشَّارٍ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، كِلاَهُمَا عَنْ هِشَامٍ، ح وَحَدَّثَنَا عَاصِمُ بْنُ النَّضْرِ التَّيْمِيُّ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي قَالاَ، جَمِيعًا حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، بِهَذِهِ الْقِصَّةِ ."
  },
  "2360": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2360\nIn-book reference  : Book 43, Hadith 183\nUSC-MSA web (English) reference  : Book 30, Hadith 5829\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَمُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنْ أَشْيَاءَ كَرِهَهَا فَلَمَّا أُكْثِرَ عَلَيْهِ غَضِبَ ثُمَّ قَالَ لِلنَّاسِ \" سَلُونِي عَمَّ شِئْتُمْ \" . فَقَالَ رَجُلٌ مَنْ أَبِي قَالَ \" أَبُوكَ حُذَافَةُ \" . فَقَامَ آخَرُ فَقَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ قَالَ \" أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ \" . فَلَمَّا رَأَى عُمَرُ مَا فِي وَجْهِ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْغَضَبِ قَالَ يَا رَسُولَ اللَّهِ إِنَّا نَتُوبُ إِلَى اللَّهِ . وَفِي رِوَايَةِ أَبِي كُرَيْبٍ قَالَ مَنْ أَبِي يَا رَسُولَ اللَّهِ قَالَ \" أَبُوكَ سَالِمٌ مَوْلَى شَيْبَةَ \" ."
  },
  "2361": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2361\nIn-book reference  : Book 43, Hadith 184\nUSC-MSA web (English) reference  : Book 30, Hadith 5830\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، وَأَبُو كَامِلٍ الْجَحْدَرِيُّ - وَتَقَارَبَا فِي اللَّفْظِ وَهَذَا حَدِيثُ قُتَيْبَةَ - قَالاَ حَدَّثَنَا أَبُو عَوَانَةَ عَنْ سِمَاكٍ عَنْ مُوسَى بْنِ طَلْحَةَ عَنْ أَبِيهِ قَالَ مَرَرْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بِقَوْمٍ عَلَى رُءُوسِ النَّخْلِ فَقَالَ \" مَا يَصْنَعُ هَؤُلاَءِ \" . فَقَالُوا يُلَقِّحُونَهُ يَجْعَلُونَ الذَّكَرَ فِي الأُنْثَى فَيَلْقَحُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا أَظُنُّ يُغْنِي ذَلِكَ شَيْئًا \" . قَالَ فَأُخْبِرُوا بِذَلِكَ فَتَرَكُوهُ فَأُخْبِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِذَلِكَ فَقَالَ \" إِنْ كَانَ يَنْفَعُهُمْ ذَلِكَ فَلْيَصْنَعُوهُ فَإِنِّي إِنَّمَا ظَنَنْتُ ظَنًّا فَلاَ تُؤَاخِذُونِي بِالظَّنِّ وَلَكِنْ إِذَا حَدَّثْتُكُمْ عَنِ اللَّهِ شَيْئًا فَخُذُوا بِهِ فَإِنِّي لَنْ أَكْذِبَ عَلَى اللَّهِ عَزَّ وَجَلَّ \" ."
  },
  "2362": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2362\nIn-book reference  : Book 43, Hadith 185\nUSC-MSA web (English) reference  : Book 30, Hadith 5831\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الرُّومِيِّ الْيَمَامِيُّ، وَعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، وَأَحْمَدُ بْنُ، جَعْفَرٍ الْمَعْقِرِيُّ قَالُوا حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا أَبُو النَّجَاشِيِّ، حَدَّثَنِي رَافِعُ بْنُ خَدِيجٍ، قَالَ قَدِمَ نَبِيُّ اللَّهِ صلى الله عليه وسلم الْمَدِينَةَ وَهُمْ يَأْبُرُونَ النَّخْلَ يَقُولُونَ يُلَقِّحُونَ النَّخْلَ فَقَالَ \" مَا تَصْنَعُونَ \" . قَالُوا كُنَّا نَصْنَعُهُ قَالَ \" لَعَلَّكُمْ لَوْ لَمْ تَفْعَلُوا كَانَ خَيْرًا \" . فَتَرَكُوهُ فَنَفَضَتْ أَوْ فَنَقَصَتْ - قَالَ - فَذَكَرُوا ذَلِكَ لَهُ فَقَالَ \" إِنَّمَا أَنَا بَشَرٌ إِذَا أَمَرْتُكُمْ بِشَىْءٍ مِنْ دِينِكُمْ فَخُذُوا بِهِ وَإِذَا أَمَرْتُكُمْ بِشَىْءٍ مِنْ رَأْىٍ فَإِنَّمَا أَنَا بَشَرٌ \" . قَالَ عِكْرِمَةُ أَوْ نَحْوَ هَذَا . قَالَ الْمَعْقِرِيُّ فَنَفَضَتْ . وَلَمْ يَشُكَّ ."
  },
  "2363": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2363\nIn-book reference  : Book 43, Hadith 186\nUSC-MSA web (English) reference  : Book 30, Hadith 5832\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو النَّاقِدُ، كِلاَهُمَا عَنِ الأَسْوَدِ بْنِ عَامِرٍ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، - حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، وَعَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم مَرَّ بِقَوْمٍ يُلَقِّحُونَ فَقَالَ \" لَوْ لَمْ تَفْعَلُوا لَصَلُحَ \" . قَالَ فَخَرَجَ شِيصًا فَمَرَّ بِهِمْ فَقَالَ \" مَا لِنَخْلِكُمْ \" . قَالُوا قُلْتَ كَذَا وَكَذَا قَالَ \" أَنْتُمْ أَعْلَمُ بِأَمْرِ دُنْيَاكُمْ \" ."
  },
  "2364": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2364\nIn-book reference  : Book 43, Hadith 187\nUSC-MSA web (English) reference  : Book 30, Hadith 5833\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَالَّذِي نَفْسُ مُحَمَّدٍ فِي يَدِهِ لَيَأْتِيَنَّ عَلَى أَحَدِكُمْ يَوْمٌ وَلاَ يَرَانِي ثُمَّ لأَنْ يَرَانِي أَحَبُّ إِلَيْهِ مِنْ أَهْلِهِ وَمَالِهِ مَعَهُمْ \" . قَالَ أَبُو إِسْحَاقَ الْمَعْنَى فِيهِ عِنْدِي لأَنْ يَرَانِي مَعَهُمْ أَحَبُّ إِلَيْهِ مِنْ أَهْلِهِ وَمَالِهِ وَهُوَ عِنْدِي مُقَدَّمٌ وَمُؤَخَّرٌ ."
  },
  "2365": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2365c\nIn-book reference  : Book 43, Hadith 190\nUSC-MSA web (English) reference  : Book 30, Hadith 5836\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَنَا أَوْلَى النَّاسِ بِعِيسَى ابْنِ مَرْيَمَ فِي الأُولَى وَالآخِرَةِ \" . قَالُوا كَيْفَ يَا رَسُولَ اللَّهِ قَالَ \" الأَنْبِيَاءُ إِخْوَةٌ مِنْ عَلاَّتٍ وَأُمَّهَاتُهُمْ شَتَّى وَدِينُهُمْ وَاحِدٌ فَلَيْسَ بَيْنَنَا نَبِيٌّ \" ."
  },
  "2366": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2366c\nIn-book reference  : Book 43, Hadith 193\nUSC-MSA web (English) reference  : Book 30, Hadith 5838\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا يُونُسَ، سُلَيْمًا مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" كُلُّ بَنِي آدَمَ يَمَسُّهُ الشَّيْطَانُ يَوْمَ وَلَدَتْهُ أُمُّهُ إِلاَّ مَرْيَمَ وَابْنَهَا \" ."
  },
  "2367": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2367\nIn-book reference  : Book 43, Hadith 194\nUSC-MSA web (English) reference  : Book 30, Hadith 5839\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، أَخْبَرَنَا أَبُو عَوَانَةَ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صِيَاحُ الْمَوْلُودِ حِينَ يَقَعُ نَزْغَةٌ مِنَ الشَّيْطَانِ \" ."
  },
  "2368": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2368\nIn-book reference  : Book 43, Hadith 195\nUSC-MSA web (English) reference  : Book 30, Hadith 5840\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" رَأَى عِيسَى ابْنُ مَرْيَمَ رَجُلاً يَسْرِقُ فَقَالَ لَهُ عِيسَى سَرَقْتَ قَالَ كَلاَّ وَالَّذِي لاَ إِلَهَ إِلاَّ هُوَ . فَقَالَ عِيسَى آمَنْتُ بِاللَّهِ وَكَذَّبْتُ نَفْسِي \" ."
  },
  "2369": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2369c\nIn-book reference  : Book 43, Hadith 198\nUSC-MSA web (English) reference  : Book 30, Hadith 5843\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ الْمُخْتَارِ، قَالَ سَمِعْتُ أَنَسًا، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "2370": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2370\nIn-book reference  : Book 43, Hadith 199\nUSC-MSA web (English) reference  : Book 30, Hadith 5844\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُغِيرَةُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْحِزَامِيَّ - عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اخْتَتَنَ إِبْرَاهِيمُ النَّبِيُّ عَلَيْهِ السَّلاَمُ وَهُوَ ابْنُ ثَمَانِينَ سَنَةً بِالْقَدُومِ \" ."
  },
  "151": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 151e\nIn-book reference  : Book 43, Hadith 202\nUSC-MSA web (English) reference  : Book 30, Hadith 5847\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" يَغْفِرُ اللَّهُ لِلُوطٍ إِنَّهُ أَوَى إِلَى رُكْنٍ شَدِيدٍ \" ."
  },
  "2371": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2371\nIn-book reference  : Book 43, Hadith 203\nUSC-MSA web (English) reference  : Book 30, Hadith 5848\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَمْ يَكْذِبْ إِبْرَاهِيمُ النَّبِيُّ عَلَيْهِ السَّلاَمُ قَطُّ إِلاَّ ثَلاَثَ كَذَبَاتٍ ثِنْتَيْنِ فِي ذَاتِ اللَّهِ قَوْلُهُ { إِنِّي سَقِيمٌ} . وَقَوْلُهُ { بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا} وَوَاحِدَةً فِي شَأْنِ سَارَةَ فَإِنَّهُ قَدِمَ أَرْضَ جَبَّارٍ وَمَعَهُ سَارَةُ وَكَانَتْ أَحْسَنَ النَّاسِ فَقَالَ لَهَا إِنَّ هَذَا الْجَبَّارَ إِنْ يَعْلَمْ أَنَّكِ امْرَأَتِي يَغْلِبْنِي عَلَيْكِ فَإِنْ سَأَلَكِ فَأَخْبِرِيهِ أَنَّكِ أُخْتِي فَإِنَّكِ أُخْتِي فِي الإِسْلاَمِ فَإِنِّي لاَ أَعْلَمُ فِي الأَرْضِ مُسْلِمًا غَيْرِي وَغَيْرَكِ فَلَمَّا دَخَلَ أَرْضَهُ رَآهَا بَعْضُ أَهْلِ الْجَبَّارِ أَتَاهُ فَقَالَ لَهُ لَقَدْ قَدِمَ أَرْضَكَ امْرَأَةٌ لاَ يَنْبَغِي لَهَا أَنْ تَكُونَ إِلاَّ لَكَ . فَأَرْسَلَ إِلَيْهَا فَأُتِيَ بِهَا فَقَامَ إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ إِلَى الصَّلاَةِ فَلَمَّا دَخَلَتْ عَلَيْهِ لَمْ يَتَمَالَكْ أَنْ بَسَطَ يَدَهُ إِلَيْهَا فَقُبِضَتْ يَدُهُ قَبْضَةً شَدِيدَةً فَقَالَ لَهَا ادْعِي اللَّهَ أَنْ يُطْلِقَ يَدِي وَلاَ أَضُرُّكِ . فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَةِ الأُولَى فَقَالَ لَهَا مِثْلَ ذَلِكَ فَفَعَلَتْ فَعَادَ فَقُبِضَتْ أَشَدَّ مِنَ الْقَبْضَتَيْنِ الأُولَيَيْنِ فَقَالَ ادْعِي اللَّهَ أَنْ يُطْلِقَ يَدِي فَلَكِ اللَّهَ أَنْ لاَ أَضُرَّكِ . فَفَعَلَتْ وَأُطْلِقَتْ يَدُهُ وَدَعَا الَّذِي جَاءَ بِهَا فَقَالَ لَهُ إِنَّكَ إِنَّمَا أَتَيْتَنِي بِشَيْطَانٍ وَلَمْ تَأْتِنِي بِإِنْسَانٍ فَأَخْرِجْهَا مِنْ أَرْضِي وَأَعْطِهَا هَاجَرَ . قَالَ فَأَقْبَلَتْ تَمْشِي فَلَمَّا رَآهَا إِبْرَاهِيمُ عَلَيْهِ السَّلاَمُ انْصَرَفَ فَقَالَ لَهَا مَهْيَمْ قَالَتْ خَيْرًا كَفَّ اللَّهُ يَدَ الْفَاجِرِ وَأَخْدَمَ خَادِمًا . قَالَ أَبُو هُرَيْرَةَ فَتِلْكَ أُمُّكُمْ يَا بَنِي مَاءِ السَّمَاءِ ."
  },
  "339": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 339c\nIn-book reference  : Book 43, Hadith 205\nUSC-MSA web (English) reference  : Book 30, Hadith 5850\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ أَنْبَأَنَا أَبُو هُرَيْرَةَ، قَالَ كَانَ مُوسَى عَلَيْهِ السَّلاَمُ رَجُلاً حَيِيًّا - قَالَ - فَكَانَ لاَ يُرَى مُتَجَرِّدًا - قَالَ - فَقَالَ بَنُو إِسْرَائِيلَ إِنَّهُ آدَرُ - قَالَ - فَاغْتَسَلَ عِنْدَ مُوَيْهٍ فَوَضَعَ ثَوْبَهُ عَلَى حَجَرٍ فَانْطَلَقَ الْحَجَرُ يَسْعَى وَاتَّبَعَهُ بِعَصَاهُ يَضْرِبُهُ ثَوْبِي حَجَرُ ثَوْبِي حَجَرُ . حَتَّى وَقَفَ عَلَى مَلإٍ مِنْ بَنِي إِسْرَائِيلَ وَنَزَلَتْ { يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَكُونُوا كَالَّذِينَ آذَوْا مُوسَى فَبَرَّأَهُ اللَّهُ مِمَّا قَالُوا وَكَانَ عِنْدَ اللَّهِ وَجِيهًا}"
  },
  "2372": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2372c\nIn-book reference  : Book 43, Hadith 208\nUSC-MSA web (English) reference  : Book 30, Hadith 5852\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "قَالَ أَبُو إِسْحَاقَ حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، بِمِثْلِ هَذَا الْحَدِيثِ ."
  },
  "2373": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2373d\nIn-book reference  : Book 43, Hadith 212\nUSC-MSA web (English) reference  : Book 30, Hadith 5855\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ أَخْبَرَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَسَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ اسْتَبَّ رَجُلٌ مِنَ الْمُسْلِمِينَ وَرَجُلٌ مِنَ الْيَهُودِ . بِمِثْلِ حَدِيثِ إِبْرَاهِيمَ بْنِ سَعْدٍ عَنِ ابْنِ شِهَابٍ ."
  },
  "2374": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2374b\nIn-book reference  : Book 43, Hadith 214\nUSC-MSA web (English) reference  : Book 30, Hadith 5857\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ يَحْيَى، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تُخَيِّرُوا بَيْنَ الأَنْبِيَاءِ \" . وَفِي حَدِيثِ ابْنِ نُمَيْرٍ عَمْرِو بْنِ يَحْيَى حَدَّثَنِي أَبِي ."
  },
  "2375": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2375b\nIn-book reference  : Book 43, Hadith 216\nUSC-MSA web (English) reference  : Book 30, Hadith 5859\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "وَحَدَّثَنَا عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا عِيسَى يَعْنِي ابْنَ يُونُسَ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا جَرِيرٌ، كِلاَهُمَا عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسٍ، ح\nوَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ سُفْيَانَ، عَنْ سُلَيْمَانَ، التَّيْمِيِّ سَمِعْتُ أَنَسًا، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَرَرْتُ عَلَى مُوسَى وَهُوَ يُصَلِّي فِي قَبْرِهِ \" . وَزَادَ فِي حَدِيثِ عِيسَى \" مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي \" ."
  },
  "2376": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2376\nIn-book reference  : Book 43, Hadith 217\nUSC-MSA web (English) reference  : Book 30, Hadith 5860\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، - حَدَّثَنَا شُعْبَةُ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ \" قَالَ - يَعْنِي اللَّهَ تَبَارَكَ وَتَعَالَى - لاَ يَنْبَغِي لِعَبْدٍ لِي - وَقَالَ ابْنُ الْمُثَنَّى لِعَبْدِي - أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى عَلَيْهِ السَّلاَمُ \" . قَالَ ابْنُ أَبِي شَيْبَةَ مُحَمَّدُ بْنُ جَعْفَرٍ عَنْ شُعْبَةَ ."
  },
  "2377": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2377\nIn-book reference  : Book 43, Hadith 218\nUSC-MSA web (English) reference  : Book 30, Hadith 5861\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَبَا الْعَالِيَةِ، يَقُولُ حَدَّثَنِي ابْنُ عَمِّ، نَبِيِّكُمْ صلى الله عليه وسلم - يَعْنِي ابْنَ عَبَّاسٍ - عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَا يَنْبَغِي لِعَبْدٍ أَنْ يَقُولَ أَنَا خَيْرٌ مِنْ يُونُسَ بْنِ مَتَّى \" . وَنَسَبَهُ إِلَى أَبِيهِ ."
  },
  "2378": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2378\nIn-book reference  : Book 43, Hadith 219\nUSC-MSA web (English) reference  : Book 30, Hadith 5862\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى، بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ مَنْ أَكْرَمُ النَّاسِ قَالَ \" أَتْقَاهُمْ \" . قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ . قَالَ \" فَيُوسُفُ نَبِيُّ اللَّهِ ابْنُ نَبِيِّ اللَّهِ ابْنِ نَبِيِّ اللَّهِ ابْنِ خَلِيلِ اللَّهِ \" . قَالُوا لَيْسَ عَنْ هَذَا نَسْأَلُكَ . قَالَ \" فَعَنْ مَعَادِنِ الْعَرَبِ تَسْأَلُونِي خِيَارُهُمْ فِي الْجَاهِلِيَّةِ خِيَارُهُمْ فِي الإِسْلاَمِ إِذَا فَقِهُوا \" ."
  },
  "2379": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2379\nIn-book reference  : Book 43, Hadith 220\nUSC-MSA web (English) reference  : Book 30, Hadith 5863\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي رَافِعٍ، عَنْ أَبِي، هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" كَانَ زَكَرِيَّاءُ نَجَّارًا \" ."
  },
  "2380": {
    "collection": "Sahih Muslim",
    "book": "The Book of Virtues",
    "book_num": "43",
    "reference": "Reference  : Sahih Muslim 2380f\nIn-book reference  : Book 43, Hadith 226\nUSC-MSA web (English) reference  : Book 30, Hadith 5867\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/43",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ تَمَارَى هُوَ وَالْحُرُّ بْنُ قَيْسِ بْنِ حِصْنٍ الْفَزَارِيُّ فِي صَاحِبِ مُوسَى عَلَيْهِ السَّلاَمُ فَقَالَ ابْنُ عَبَّاسٍ هُوَ الْخَضِرُ . فَمَرَّ بِهِمَا أُبَىُّ بْنُ كَعْبٍ الأَنْصَارِيُّ فَدَعَاهُ ابْنُ عَبَّاسٍ فَقَالَ يَا أَبَا الطُّفَيْلِ هَلُمَّ إِلَيْنَا فَإِنِّي قَدْ تَمَارَيْتُ أَنَا وَصَاحِبِي هَذَا فِي صَاحِبِ مُوسَى الَّذِي سَأَلَ السَّبِيلَ إِلَى لُقِيِّهِ فَهَلْ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَذْكُرُ شَأْنَهُ فَقَالَ أُبَىٌّ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" بَيْنَمَا مُوسَى فِي مَلإٍ مِنْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُ رَجُلٌ فَقَالَ لَهُ هَلْ تَعْلَمُ أَحَدًا أَعْلَمُ مِنْكَ قَالَ مُوسَى لاَ . فَأَوْحَى اللَّهُ إِلَى مُوسَى بَلْ عَبْدُنَا الْخَضِرُ - قَالَ - فَسَأَلَ مُوسَى السَّبِيلَ إِلَى لُقِيِّهِ فَجَعَلَ اللَّهُ لَهُ الْحُوتَ آيَةً وَقِيلَ لَهُ إِذَا افْتَقَدْتَ الْحُوتَ فَارْجِعْ فَإِنَّكَ سَتَلْقَاهُ فَسَارَ مُوسَى مَا شَاءَ اللَّهُ أَنْ يَسِيرَ ثُمَّ قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا . فَقَالَ فَتَى مُوسَى حِينَ سَأَلَهُ الْغَدَاءَ أَرَأَيْتَ إِذْ أَوَيْنَا إِلَى الصَّخْرَةِ فَإِنِّي نَسِيتُ الْحُوتَ وَمَا أَنْسَانِيهُ إِلاَّ الشَّيْطَانُ أَنْ أَذْكُرَهُ . فَقَالَ مُوسَى لِفَتَاهُ ذَلِكَ مَا كُنَّا نَبْغِي . فَارْتَدَّا عَلَى آثَارِهِمَا قَصَصًا فَوَجَدَا خَضِرًا . فَكَانَ مِنْ شَأْنِهِمَا مَا قَصَّ اللَّهُ فِي كِتَابِهِ \" . إِلاَّ أَنَّ يُونُسَ قَالَ فَكَانَ يَتَّبِعُ أَثَرَ الْحُوتِ فِي الْبَحْرِ ."
  }
}