{
  "8": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 8e\nIn-book reference  : Book 1, Hadith 5\nUSC-MSA web (English) reference  : Book 1, Hadith 4\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنِ ابْنِ عُلَيَّةَ، قَالَ زُهَيْرٌ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي حَيَّانَ، عَنْ أَبِي زُرْعَةَ بْنِ عَمْرِو بْنِ جَرِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا بَارِزًا لِلنَّاسِ فَأَتَاهُ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا الإِيمَانُ قَالَ \" أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَكِتَابِهِ وَلِقَائِهِ وَرُسُلِهِ وَتُؤْمِنَ بِالْبَعْثِ الآخِرِ \" . قَالَ يَا رَسُولَ اللَّهِ مَا الإِسْلاَمُ قَالَ \" الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ شَيْئًا وَتُقِيمَ الصَّلاَةَ الْمَكْتُوبَةَ وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ وَتَصُومَ رَمَضَانَ \" . قَالَ يَا رَسُولَ اللَّهِ مَا الإِحْسَانُ قَالَ \" أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنَّكَ إِنْ لاَ تَرَاهُ فَإِنَّهُ يَرَاكَ \" . قَالَ يَا رَسُولَ اللَّهِ مَتَى السَّاعَةُ قَالَ \" مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ وَلَكِنْ سَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الأَمَةُ رَبَّهَا فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا كَانَتِ الْعُرَاةُ الْحُفَاةُ رُءُوسَ النَّاسِ فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا تَطَاوَلَ رِعَاءُ الْبَهْمِ فِي الْبُنْيَانِ فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ \" . ثُمَّ تَلاَ صلى الله عليه وسلم { إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ} \" . قَالَ ثُمَّ أَدْبَرَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" رُدُّوا عَلَىَّ الرَّجُلَ \" . فَأَخَذُوا لِيَرُدُّوهُ فَلَمْ يَرَوْا شَيْئًا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" هَذَا جِبْرِيلُ جَاءَ لِيُعَلِّمَ النَّاسَ دِينَهُمْ \" ."
  },
  "9": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 9\nIn-book reference  : Book 1, Hadith 6\nUSC-MSA web (English) reference  : Book 1, Hadith 5\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا أَبُو حَيَّانَ التَّيْمِيُّ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ فِي رِوَايَتِهِ \" إِذَا وَلَدَتِ الأَمَةُ بَعْلَهَا \" يَعْنِي السَّرَارِيَّ ."
  },
  "10": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 10\nIn-book reference  : Book 1, Hadith 7\nUSC-MSA web (English) reference  : Book 1, Hadith 6\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ، - وَهُوَ ابْنُ الْقَعْقَاعِ - عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" سَلُونِي \" فَهَابُوهُ أَنْ يَسْأَلُوهُ . فَجَاءَ رَجُلٌ فَجَلَسَ عِنْدَ رُكْبَتَيْهِ . فَقَالَ يَا رَسُولَ اللَّهِ مَا الإِسْلاَمُ قَالَ \" لاَ تُشْرِكُ بِاللَّهِ شَيْئًا وَتُقِيمُ الصَّلاَةَ وَتُؤْتِي الزَّكَاةَ وَتَصُومُ رَمَضَانَ \" . قَالَ صَدَقْتَ . قَالَ يَا رَسُولَ اللَّهِ مَا الإِيمَانُ قَالَ \" أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَكِتَابِهِ وَلِقَائِهِ وَرُسُلِهِ وَتُؤْمِنَ بِالْبَعْثِ وَتُؤْمِنَ بِالْقَدَرِ كُلِّهِ \" . قَالَ صَدَقْتَ . قَالَ يَا رَسُولَ اللَّهِ مَا الإِحْسَانُ قَالَ \" أَنْ تَخْشَى اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنَّكَ إِنْ لاَ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ \" . قَالَ صَدَقْتَ . قَالَ يَا رَسُولَ اللَّهِ مَتَى تَقُومُ السَّاعَةُ قَالَ \" مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ وَسَأُحَدِّثُكَ عَنْ أَشْرَاطِهَا إِذَا رَأَيْتَ الْمَرْأَةَ تَلِدُ رَبَّهَا فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا رَأَيْتَ الْحُفَاةَ الْعُرَاةَ الصُّمَّ الْبُكْمَ مُلُوكَ الأَرْضِ فَذَاكَ مِنْ أَشْرَاطِهَا وَإِذَا رَأَيْتَ رِعَاءَ الْبَهْمِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ فَذَاكَ مِنْ أَشْرَاطِهَا فِي خَمْسٍ مِنَ الْغَيْبِ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ \" . ثُمَّ قَرَأَ { إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ وَيُنَزِّلُ الْغَيْثَ وَيَعْلَمُ مَا فِي الأَرْحَامِ وَمَا تَدْرِي نَفْسٌ مَاذَا تَكْسِبُ غَدًا وَمَا تَدْرِي نَفْسٌ بِأَىِّ أَرْضٍ تَمُوتُ إِنَّ اللَّهَ عَلِيمٌ خَبِيرٌ} قَالَ ثُمَّ قَامَ الرَّجُلُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" رُدُّوهُ عَلَىَّ \" فَالْتُمِسَ فَلَمْ يَجِدُوهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" هَذَا جِبْرِيلُ أَرَادَ أَنْ تَعَلَّمُوا إِذْ لَمْ تَسْأَلُوا \" ."
  },
  "11": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 11b\nIn-book reference  : Book 1, Hadith 9\nUSC-MSA web (English) reference  : Book 1, Hadith 8\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، عَنْ أَبِي سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ طَلْحَةَ بْنِ عُبَيْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ نَحْوَ حَدِيثِ مَالِكٍ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَفْلَحَ وَأَبِيهِ إِنْ صَدَقَ \" . أَوْ \" دَخَلَ الْجَنَّةَ وَأَبِيهِ إِنْ صَدَقَ \" ."
  },
  "12": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 12b\nIn-book reference  : Book 1, Hadith 11\nUSC-MSA web (English) reference  : Book 1, Hadith 10\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ هَاشِمٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، قَالَ قَالَ أَنَسٌ كُنَّا نُهِينَا فِي الْقُرْآنِ أَنْ نَسْأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ شَىْءٍ . وَسَاقَ الْحَدِيثَ بِمِثْلِهِ ."
  },
  "13": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 13b\nIn-book reference  : Book 1, Hadith 13\nUSC-MSA web (English) reference  : Book 1, Hadith 12\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، وَعَبْدُ الرَّحْمَنِ بْنُ بِشْرٍ، قَالاَ حَدَّثَنَا بَهْزٌ، حَدَّثَنَا شُعْبَةُ، حَدَّثَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ مَوْهَبٍ، وَأَبُوهُ، عُثْمَانُ أَنَّهُمَا سَمِعَا مُوسَى بْنَ طَلْحَةَ، يُحَدِّثُ عَنْ أَبِي أَيُّوبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ هَذَا الْحَدِيثِ ."
  },
  "14": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 14b\nIn-book reference  : Book 1, Hadith 15\nUSC-MSA web (English) reference  : Book 1, Hadith 14\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ إِسْحَاقَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ أَعْرَابِيًّا، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ إِذَا عَمِلْتُهُ دَخَلْتُ الْجَنَّةَ . قَالَ \" تَعْبُدُ اللَّهَ لاَ تُشْرِكُ بِهِ شَيْئًا وَتُقِيمُ الصَّلاَةَ الْمَكْتُوبَةَ وَتُؤَدِّي الزَّكَاةَ الْمَفْرُوضَةَ وَتَصُومُ رَمَضَانَ \" . قَالَ وَالَّذِي نَفْسِي بِيَدِهِ لاَ أَزِيدُ عَلَى هَذَا شَيْئًا أَبَدًا وَلاَ أَنْقُصُ مِنْهُ . فَلَمَّا وَلَّى قَالَ النَّبِيُّ صلى الله عليه وسلم \" مَنْ سَرَّهُ أَنْ يَنْظُرَ إِلَى رَجُلٍ مِنْ أَهْلِ الْجَنَّةِ فَلْيَنْظُرْ إِلَى هَذَا \" ."
  },
  "15": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 15c\nIn-book reference  : Book 1, Hadith 18\nUSC-MSA web (English) reference  : Book 1, Hadith 17\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، - وَهُوَ ابْنُ عُبَيْدِ اللَّهِ - عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ أَرَأَيْتَ إِذَا صَلَّيْتُ الصَّلَوَاتِ الْمَكْتُوبَاتِ وَصُمْتُ رَمَضَانَ وَأَحْلَلْتُ الْحَلاَلَ وَحَرَّمْتُ الْحَرَامَ وَلَمْ أَزِدْ عَلَى ذَلِكَ شَيْئًا أَأَدْخُلُ الْجَنَّةَ قَالَ \" نَعَمْ \" . قَالَ وَاللَّهِ لاَ أَزِيدُ عَلَى ذَلِكَ شَيْئًا ."
  },
  "16": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 16d\nIn-book reference  : Book 1, Hadith 22\nUSC-MSA web (English) reference  : Book 1, Hadith 21\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا حَنْظَلَةُ، قَالَ سَمِعْتُ عِكْرِمَةَ بْنَ خَالِدٍ، يُحَدِّثُ طَاوُسًا أَنَّ رَجُلاً، قَالَ لِعَبْدِ اللَّهِ بْنِ عُمَرَ أَلاَ تَغْزُو فَقَالَ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّ الإِسْلاَمَ بُنِيَ عَلَى خَمْسٍ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَإِقَامِ الصَّلاَةِ وَإِيتَاءِ الزَّكَاةِ وَصِيَامِ رَمَضَانَ وَحَجِّ الْبَيْتِ \" ."
  },
  "17": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 17c\nIn-book reference  : Book 1, Hadith 25\nUSC-MSA web (English) reference  : Book 1, Hadith 24\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، قَالَ أَخْبَرَنِي أَبِي قَالاَ، جَمِيعًا حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، عَنْ أَبِي جَمْرَةَ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ نَحْوَ حَدِيثِ شُعْبَةَ . وَقَالَ \" أَنْهَاكُمْ عَمَّا يُنْبَذُ فِي الدُّبَّاءِ وَالنَّقِيرِ وَالْحَنْتَمِ وَالْمُزَفَّتِ \" . وَزَادَ ابْنُ مُعَاذٍ فِي حَدِيثِهِ عَنْ أَبِيهِ قَالَ وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِلأَشَجِّ أَشَجِّ عَبْدِ الْقَيْسِ \" إِنَّ فِيكَ خَصْلَتَيْنِ يُحِبُّهُمَا اللَّهُ الْحِلْمُ وَالأَنَاةُ \" ."
  },
  "18": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 18c\nIn-book reference  : Book 1, Hadith 28\nUSC-MSA web (English) reference  : Book 1, Hadith 26\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ بَكَّارٍ الْبَصْرِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو قَزَعَةَ، أَنَّ أَبَا نَضْرَةَ، أَخْبَرَهُ وَحَسَنًا، أَخْبَرَهُمَا أَنَّ أَبَا سَعِيدٍ الْخُدْرِيَّ أَخْبَرَهُ أَنَّ وَفْدَ عَبْدِ الْقَيْسِ لَمَّا أَتَوْا نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالُوا يَا نَبِيَّ اللَّهِ جَعَلَنَا اللَّهُ فِدَاءَكَ مَاذَا يَصْلُحُ لَنَا مِنَ الأَشْرِبَةِ فَقَالَ \" لاَ تَشْرَبُوا فِي النَّقِيرِ \" . قَالُوا يَا نَبِيَّ اللَّهِ جَعَلَنَا اللَّهُ فِدَاءَكَ أَوَتَدْرِي مَا النَّقِيرُ قَالَ \" نَعَمِ الْجِذْعُ يُنْقَرُ وَسَطُهُ وَلاَ فِي الدُّبَّاءِ وَلاَ فِي الْحَنْتَمَةِ وَعَلَيْكُمْ بِالْمُوكَى \" ."
  },
  "19": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 19c\nIn-book reference  : Book 1, Hadith 31\nUSC-MSA web (English) reference  : Book 1, Hadith 28\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، - وَهُوَ ابْنُ الْقَاسِمِ - عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، عَنْ أَبِي مَعْبَدٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمَّا بَعَثَ مُعَاذًا إِلَى الْيَمَنِ قَالَ \" إِنَّكَ تَقْدَمُ عَلَى قَوْمٍ أَهْلِ كِتَابٍ فَلْيَكُنْ أَوَّلَ مَا تَدْعُوهُمْ إِلَيْهِ عِبَادَةُ اللَّهِ عَزَّ وَجَلَّ فَإِذَا عَرَفُوا اللَّهَ فَأَخْبِرْهُمْ أَنَّ اللَّهَ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي يَوْمِهِمْ وَلَيْلَتِهِمْ فَإِذَا فَعَلُوا فَأَخْبِرْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ زَكَاةً تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ عَلَى فُقَرَائِهِمْ فَإِذَا أَطَاعُوا بِهَا فَخُذْ مِنْهُمْ وَتَوَقَّ كَرَائِمَ أَمْوَالِهِمْ \" ."
  },
  "20": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 20\nIn-book reference  : Book 1, Hadith 32\nUSC-MSA web (English) reference  : Book 1, Hadith 29\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثُ بْنُ سَعْدٍ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ قَالَ عُمَرُ بْنُ الْخَطَّابِ لأَبِي بَكْرٍ كَيْفَ تُقَاتِلُ النَّاسَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ فَقَدْ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلاَّ بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ \" . فَقَالَ أَبُو بَكْرٍ وَاللَّهِ لأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلاَةِ وَالزَّكَاةِ فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ وَاللَّهِ لَوْ مَنَعُونِي عِقَالاً كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ . فَقَالَ عُمَرُ بْنُ الْخَطَّابِ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ رَأَيْتُ اللَّهَ عَزَّ وَجَلَّ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ فَعَرَفْتُ أَنَّهُ الْحَقُّ ."
  },
  "21": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 21c\nIn-book reference  : Book 1, Hadith 35\nUSC-MSA web (English) reference  : Book 1, Hadith 32\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، وَعَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ \" . بِمِثْلِ حَدِيثِ ابْنِ الْمُسَيَّبِ عَنْ أَبِي هُرَيْرَةَ ح وَحَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، - يَعْنِي ابْنَ مَهْدِيٍّ - قَالاَ جَمِيعًا حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لاَ إِلَهَ إِلاَّ اللَّهُ فَإِذَا قَالُوا لاَ إِلَهَ إِلاَّ اللَّهُ عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ \" . ثُمَّ قَرَأَ { إِنَّمَا أَنْتَ مُذَكِّرٌ * لَسْتَ عَلَيْهِمْ بِمُسَيْطِرٍ}"
  },
  "22": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 22\nIn-book reference  : Book 1, Hadith 36\nUSC-MSA web (English) reference  : Book 1, Hadith 33\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، مَالِكُ بْنُ عَبْدِ الْوَاحِدِ حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ الصَّبَّاحِ، عَنْ شُعْبَةَ، عَنْ وَاقِدِ بْنِ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَشْهَدُوا أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَيُقِيمُوا الصَّلاَةَ وَيُؤْتُوا الزَّكَاةَ فَإِذَا فَعَلُوا عَصَمُوا مِنِّي دِمَاءَهُمْ وَأَمْوَالَهُمْ إِلاَّ بِحَقِّهَا وَحِسَابُهُمْ عَلَى اللَّهِ \" ."
  },
  "23": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 23b\nIn-book reference  : Book 1, Hadith 38\nUSC-MSA web (English) reference  : Book 1, Hadith 35\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلاَهُمَا عَنْ أَبِي مَالِكٍ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" مَنْ وَحَّدَ اللَّهَ \" ثُمَّ ذَكَرَ بِمِثْلِهِ ."
  },
  "24": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 24b\nIn-book reference  : Book 1, Hadith 40\nUSC-MSA web (English) reference  : Book 1, Hadith 36\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، ح وَحَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالاَ حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ إِبْرَاهِيمَ بْنِ سَعْدٍ - قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّ حَدِيثَ صَالِحٍ انْتَهَى عِنْدَ قَوْلِهِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ فِيهِ . وَلَمْ يَذْكُرِ الآيَتَيْنِ . وَقَالَ فِي حَدِيثِهِ وَيَعُودَانِ فِي تِلْكَ الْمَقَالَةِ . وَفِي حَدِيثِ مَعْمَرٍ مَكَانَ هَذِهِ الْكَلِمَةِ فَلَمْ يَزَالاَ بِهِ ."
  },
  "25": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 25b\nIn-book reference  : Book 1, Hadith 42\nUSC-MSA web (English) reference  : Book 1, Hadith 38\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ الأَشْجَعِيِّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِعَمِّهِ \" قُلْ لاَ إِلَهَ إِلاَّ اللَّهُ أَشْهَدُ لَكَ بِهَا يَوْمَ الْقِيَامَةِ \" . قَالَ لَوْلاَ أَنْ تُعَيِّرَنِي قُرَيْشٌ يَقُولُونَ إِنَّمَا حَمَلَهُ عَلَى ذَلِكَ الْجَزَعُ لأَقْرَرْتُ بِهَا عَيْنَكَ فَأَنْزَلَ اللَّهُ { إِنَّكَ لاَ تَهْدِي مَنْ أَحْبَبْتَ وَلَكِنَّ اللَّهَ يَهْدِي مَنْ يَشَاءُ}"
  },
  "26": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 26b\nIn-book reference  : Book 1, Hadith 44\nUSC-MSA web (English) reference  : Book 1, Hadith 40\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنِ الْوَلِيدِ أَبِي بِشْرٍ، قَالَ سَمِعْتُ حُمْرَانَ، يَقُولُ سَمِعْتُ عُثْمَانَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ مِثْلَهُ سَوَاءً ."
  },
  "27": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 27b\nIn-book reference  : Book 1, Hadith 46\nUSC-MSA web (English) reference  : Book 1, Hadith 42\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا سَهْلُ بْنُ عُثْمَانَ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ جَمِيعًا عَنْ أَبِي مُعَاوِيَةَ، - قَالَ أَبُو كُرَيْبٍ حَدَّثَنَا أَبُو مُعَاوِيَةَ، - عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَوْ عَنْ أَبِي سَعِيدٍ، - شَكَّ الأَعْمَشُ - قَالَ لَمَّا كَانَ غَزْوَةُ تَبُوكَ أَصَابَ النَّاسَ مَجَاعَةٌ . قَالُوا يَا رَسُولَ اللَّهِ لَوْ أَذِنْتَ لَنَا فَنَحَرْنَا نَوَاضِحَنَا فَأَكَلْنَا وَادَّهَنَّا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" افْعَلُوا \" . قَالَ فَجَاءَ عُمَرُ فَقَالَ يَا رَسُولَ اللَّهِ إِنْ فَعَلْتَ قَلَّ الظَّهْرُ وَلَكِنِ ادْعُهُمْ بِفَضْلِ أَزْوَادِهِمْ ثُمَّ ادْعُ اللَّهَ لَهُمْ عَلَيْهَا بِالْبَرَكَةِ لَعَلَّ اللَّهَ أَنْ يَجْعَلَ فِي ذَلِكَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" نَعَمْ \" . قَالَ فَدَعَا بِنِطَعٍ فَبَسَطَهُ ثُمَّ دَعَا بِفَضْلِ أَزْوَادِهِمْ - قَالَ - فَجَعَلَ الرَّجُلُ يَجِيءُ بِكَفِّ ذُرَةٍ - قَالَ - وَيَجِيءُ الآخَرُ بَكَفِّ تَمْرٍ - قَالَ - وَيَجِيءُ الآخَرُ بِكِسْرَةٍ حَتَّى اجْتَمَعَ عَلَى النِّطَعِ مِنْ ذَلِكَ شَىْءٌ يَسِيرٌ - قَالَ - فَدَعَا رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَيْهِ بِالْبَرَكَةِ ثُمَّ قَالَ \" خُذُوا فِي أَوْعِيَتِكُمْ \" . قَالَ فَأَخَذُوا فِي أَوْعِيَتِهِمْ حَتَّى مَا تَرَكُوا فِي الْعَسْكَرِ وِعَاءً إِلاَّ مَلأُوهُ - قَالَ - فَأَكَلُوا حَتَّى شَبِعُوا وَفَضِلَتْ فَضْلَةٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ لاَ يَلْقَى اللَّهَ بِهِمَا عَبْدٌ غَيْرَ شَاكٍّ فَيُحْجَبَ عَنِ الْجَنَّةِ \" ."
  },
  "28": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 28b\nIn-book reference  : Book 1, Hadith 48\nUSC-MSA web (English) reference  : Book 1, Hadith 44\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا مُبَشِّرُ بْنُ إِسْمَاعِيلَ، عَنِ الأَوْزَاعِيِّ، عَنْ عُمَيْرِ بْنِ هَانِئٍ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ \" أَدْخَلَهُ اللَّهُ الْجَنَّةَ عَلَى مَا كَانَ مِنْ عَمَلٍ \" . وَلَمْ يَذْكُرْ \" مِنْ أَىِّ أَبْوَابِ الْجَنَّةِ الثَّمَانِيَةِ شَاءَ \" ."
  },
  "29": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 29\nIn-book reference  : Book 1, Hadith 49\nUSC-MSA web (English) reference  : Book 1, Hadith 45\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ عَجْلاَنَ، عَنْ مُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنِ الصُّنَابِحِيِّ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، أَنَّهُ قَالَ دَخَلْتُ عَلَيْهِ وَهُوَ فِي الْمَوْتِ فَبَكَيْتُ فَقَالَ مَهْلاً لِمَ تَبْكِي فَوَاللَّهِ لَئِنِ اسْتُشْهِدْتُ لأَشْهَدَنَّ لَكَ وَلَئِنْ شُفِّعْتُ لأَشْفَعَنَّ لَكَ وَلَئِنِ اسْتَطَعْتُ لأَنْفَعَنَّكَ ثُمَّ قَالَ وَاللَّهِ مَا مِنْ حَدِيثٍ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَكُمْ فِيهِ خَيْرٌ إِلاَّ حَدَّثْتُكُمُوهُ إِلاَّ حَدِيثًا وَاحِدًا وَسَوْفَ أُحَدِّثُكُمُوهُ الْيَوْمَ وَقَدْ أُحِيطَ بِنَفْسِي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ شَهِدَ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ حَرَّمَ اللَّهُ عَلَيْهِ النَّارَ \" ."
  },
  "30": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 30d\nIn-book reference  : Book 1, Hadith 53\nUSC-MSA web (English) reference  : Book 1, Hadith 49\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا الْقَاسِمُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ أَبِي حَصِينٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، قَالَ سَمِعْتُ مُعَاذًا، يَقُولُ دَعَانِي رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَجَبْتُهُ فَقَالَ \" هَلْ تَدْرِي مَا حَقُّ اللَّهِ عَلَى النَّاسِ \" . نَحْوَ حَدِيثِهِمْ ."
  },
  "31": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 31\nIn-book reference  : Book 1, Hadith 54\nUSC-MSA web (English) reference  : Book 1, Hadith 50\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عُمَرُ بْنُ يُونُسَ الْحَنَفِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنِي أَبُو كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، قَالَ كُنَّا قُعُودًا حَوْلَ رَسُولِ اللَّهِ صلى الله عليه وسلم مَعَنَا أَبُو بَكْرٍ وَعُمَرُ فِي نَفَرٍ فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ بَيْنِ أَظْهُرِنَا فَأَبْطَأَ عَلَيْنَا وَخَشِينَا أَنْ يُقْتَطَعَ دُونَنَا وَفَزِعْنَا فَقُمْنَا فَكُنْتُ أَوَّلَ مَنْ فَزِعَ فَخَرَجْتُ أَبْتَغِي رَسُولَ اللَّهِ صلى الله عليه وسلم حَتَّى أَتَيْتُ حَائِطًا لِلأَنْصَارِ لِبَنِي النَّجَّارِ فَدُرْتُ بِهِ هَلْ أَجِدُ لَهُ بَابًا فَلَمْ أَجِدْ فَإِذَا رَبِيعٌ يَدْخُلُ فِي جَوْفِ حَائِطٍ مِنْ بِئْرٍ خَارِجَةٍ - وَالرَّبِيعُ الْجَدْوَلُ - فَاحْتَفَزْتُ كَمَا يَحْتَفِزُ الثَّعْلَبُ فَدَخَلْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" أَبُو هُرَيْرَةَ \" . فَقُلْتُ نَعَمْ يَا رَسُولَ اللَّهِ . قَالَ \" مَا شَأْنُكَ \" . قُلْتُ كُنْتَ بَيْنَ أَظْهُرِنَا فَقُمْتَ فَأَبْطَأْتَ عَلَيْنَا فَخَشِينَا أَنْ تُقْتَطَعَ دُونَنَا فَفَزِعْنَا فَكُنْتُ أَوَّلَ مَنْ فَزِعَ فَأَتَيْتُ هَذَا الْحَائِطَ فَاحْتَفَزْتُ كَمَا يَحْتَفِزُ الثَّعْلَبُ وَهَؤُلاَءِ النَّاسُ وَرَائِي فَقَالَ \" يَا أَبَا هُرَيْرَةَ \" . وَأَعْطَانِي نَعْلَيْهِ قَالَ \" اذْهَبْ بِنَعْلَىَّ هَاتَيْنِ فَمَنْ لَقِيتَ مِنْ وَرَاءِ هَذَا الْحَائِطِ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ فَبَشِّرْهُ بِالْجَنَّةِ \" فَكَانَ أَوَّلَ مَنْ لَقِيتُ عُمَرُ فَقَالَ مَا هَاتَانِ النَّعْلاَنِ يَا أَبَا هُرَيْرَةَ . فَقُلْتُ هَاتَانِ نَعْلاَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَعَثَنِي بِهِمَا مَنْ لَقِيتُ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ بَشَّرْتُهُ بِالْجَنَّةِ . فَضَرَبَ عُمَرُ بِيَدِهِ بَيْنَ ثَدْيَىَّ فَخَرَرْتُ لاِسْتِي فَقَالَ ارْجِعْ يَا أَبَا هُرَيْرَةَ فَرَجَعْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَجْهَشْتُ بُكَاءً وَرَكِبَنِي عُمَرُ فَإِذَا هُوَ عَلَى أَثَرِي فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا لَكَ يَا أَبَا هُرَيْرَةَ \" . قُلْتُ لَقِيتُ عُمَرَ فَأَخْبَرْتُهُ بِالَّذِي بَعَثْتَنِي بِهِ فَضَرَبَ بَيْنَ ثَدْيَىَّ ضَرْبَةً خَرَرْتُ لاِسْتِي قَالَ ارْجِعْ . فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا عُمَرُ مَا حَمَلَكَ عَلَى مَا فَعَلْتَ \" . قَالَ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي أَبَعَثْتَ أَبَا هُرَيْرَةَ بِنَعْلَيْكَ مَنْ لَقِيَ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ مُسْتَيْقِنًا بِهَا قَلْبُهُ بَشَّرَهُ بِالْجَنَّةِ . قَالَ \" نَعَمْ \" . قَالَ فَلاَ تَفْعَلْ فَإِنِّي أَخْشَى أَنْ يَتَّكِلَ النَّاسُ عَلَيْهَا فَخَلِّهِمْ يَعْمَلُونَ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" فَخَلِّهِمْ \" ."
  },
  "32": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 32\nIn-book reference  : Book 1, Hadith 55\nUSC-MSA web (English) reference  : Book 1, Hadith 51\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، قَالَ حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم وَمُعَاذُ بْنُ جَبَلٍ رَدِيفُهُ عَلَى الرَّحْلِ قَالَ \" يَا مُعَاذُ \" . قَالَ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ . قَالَ \" يَا مُعَاذُ \" . قَالَ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ . قَالَ \" يَا مُعَاذُ \" . قَالَ لَبَّيْكَ رَسُولَ اللَّهِ وَسَعْدَيْكَ . قَالَ \" مَا مِنْ عَبْدٍ يَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ إِلاَّ حَرَّمَهُ اللَّهُ عَلَى النَّارِ \" . قَالَ يَا رَسُولَ اللَّهِ أَفَلاَ أُخْبِرُ بِهَا النَّاسَ فَيَسْتَبْشِرُوا قَالَ \" إِذًا يَتَّكِلُوا \" فَأَخْبَرَ بِهَا مُعَاذٌ عِنْدَ مَوْتِهِ تَأَثُّمًا ."
  },
  "33": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 33b\nIn-book reference  : Book 1, Hadith 57\nUSC-MSA web (English) reference  : Book 1, Hadith 53\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، قَالَ حَدَّثَنِي عِتْبَانُ بْنُ مَالِكٍ، أَنَّهُ عَمِيَ فَأَرْسَلَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ تَعَالَ فَخُطَّ لِي مَسْجِدًا . فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَجَاءَ قَوْمُهُ وَنُعِتَ رَجُلٌ مِنْهُمْ يُقَالُ لَهُ مَالِكُ بْنُ الدُّخْشُمِ . ثُمَّ ذَكَرَ نَحْوَ حَدِيثِ سُلَيْمَانَ بْنِ الْمُغِيرَةِ ."
  },
  "34": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 34\nIn-book reference  : Book 1, Hadith 58\nUSC-MSA web (English) reference  : Book 1, Hadith 54\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَبِي عُمَرَ الْمَكِّيُّ، وَبِشْرُ بْنُ الْحَكَمِ، قَالاَ حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ مُحَمَّدٍ - الدَّرَاوَرْدِيُّ عَنْ يَزِيدَ بْنِ الْهَادِ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ عَامِرِ بْنِ سَعْدٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" ذَاقَ طَعْمَ الإِيمَانِ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ رَسُولاً \""
  },
  "35": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 35b\nIn-book reference  : Book 1, Hadith 60\nUSC-MSA web (English) reference  : Book 1, Hadith 56\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الإِيمَانُ بِضْعٌ وَسَبْعُونَ أَوْ بِضْعٌ وَسِتُّونَ شُعْبَةً فَأَفْضَلُهَا قَوْلُ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَدْنَاهَا إِمَاطَةُ الأَذَى عَنِ الطَّرِيقِ وَالْحَيَاءُ شُعْبَةٌ مِنَ الإِيمَانِ \" ."
  },
  "36": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 36b\nIn-book reference  : Book 1, Hadith 62\nUSC-MSA web (English) reference  : Book 1, Hadith 58\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ وَقَالَ مَرَّ بِرَجُلٍ مِنَ الأَنْصَارِ يَعِظُ أَخَاهُ ."
  },
  "37": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 37c\nIn-book reference  : Book 1, Hadith 65\nUSC-MSA web (English) reference  : Book 1, Hadith 61\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ، حَدَّثَنَا أَبُو نَعَامَةَ الْعَدَوِيُّ، قَالَ سَمِعْتُ حُجَيْرَ بْنَ الرَّبِيعِ الْعَدَوِيَّ، يَقُولُ عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ حَدِيثِ حَمَّادِ بْنِ زَيْدٍ ."
  },
  "38": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 38\nIn-book reference  : Book 1, Hadith 66\nUSC-MSA web (English) reference  : Book 1, Hadith 62\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا ابْنُ نُمَيْرٍ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو أُسَامَةَ، كُلُّهُمْ عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ سُفْيَانَ بْنِ عَبْدِ اللَّهِ الثَّقَفِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ قُلْ لِي فِي الإِسْلاَمِ قَوْلاً لاَ أَسْأَلُ عَنْهُ أَحَدًا بَعْدَكَ - وَفِي حَدِيثِ أَبِي أُسَامَةَ غَيْرَكَ - قَالَ \" قُلْ آمَنْتُ بِاللَّهِ فَاسْتَقِمْ \" ."
  },
  "39": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 39\nIn-book reference  : Book 1, Hadith 67\nUSC-MSA web (English) reference  : Book 1, Hadith 63\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الإِسْلاَمِ خَيْرٌ قَالَ \" تُطْعِمُ الطَّعَامَ وَتَقْرَأُ السَّلاَمَ عَلَى مَنْ عَرَفْتَ وَمَنْ لَمْ تَعْرِفْ \" ."
  },
  "40": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 40\nIn-book reference  : Book 1, Hadith 68\nUSC-MSA web (English) reference  : Book 1, Hadith 64\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو الطَّاهِرِ، أَحْمَدُ بْنُ عَمْرِو بْنِ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ سَرْحٍ الْمِصْرِيُّ أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ إِنَّ رَجُلاً سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الْمُسْلِمِينَ خَيْرٌ قَالَ \" مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ \" ."
  },
  "41": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 41\nIn-book reference  : Book 1, Hadith 69\nUSC-MSA web (English) reference  : Book 1, Hadith 65\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا حَسَنٌ الْحُلْوَانِيُّ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ أَبِي عَاصِمٍ، - قَالَ عَبْدٌ أَنْبَأَنَا أَبُو عَاصِمٍ، - عَنِ ابْنِ جُرَيْجٍ، أَنَّهُ سَمِعَ أَبَا الزُّبَيْرِ، يَقُولُ سَمِعْتُ جَابِرًا، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" الْمُسْلِمُ مَنْ سَلِمَ الْمُسْلِمُونَ مِنْ لِسَانِهِ وَيَدِهِ \" ."
  },
  "42": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 42b\nIn-book reference  : Book 1, Hadith 71\nUSC-MSA web (English) reference  : Book 1, Hadith 66\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنِي بُرَيْدُ بْنُ عَبْدِ اللَّهِ، بِهَذَا الإِسْنَادِ قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ الْمُسْلِمِينَ أَفْضَلُ فَذَكَرَ مِثْلَهُ ."
  },
  "43": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 43c\nIn-book reference  : Book 1, Hadith 74\nUSC-MSA web (English) reference  : Book 1, Hadith 69\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، أَنْبَأَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ غَيْرَ أَنَّهُ قَالَ \" مِنْ أَنْ يَرْجِعَ يَهُودِيًّا أَوْ نَصْرَانِيًّا \" ."
  },
  "44": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 44b\nIn-book reference  : Book 1, Hadith 76\nUSC-MSA web (English) reference  : Book 1, Hadith 71\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ سَمِعْتُ قَتَادَةَ، يُحَدِّثُ عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يُؤْمِنُ أَحَدُكُمْ حَتَّى أَكُونَ أَحَبَّ إِلَيْهِ مِنْ وَلَدِهِ وَوَالِدِهِ وَالنَّاسِ أَجْمَعِينَ \" ."
  },
  "45": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 45b\nIn-book reference  : Book 1, Hadith 78\nUSC-MSA web (English) reference  : Book 1, Hadith 73\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ حُسَيْنٍ الْمُعَلِّمِ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" وَالَّذِي نَفْسِي بِيَدِهِ لاَ يُؤْمِنُ عَبْدٌ حَتَّى يُحِبَّ لِجَارِهِ - أَوْ قَالَ لأَخِيهِ - مَا يُحِبُّ لِنَفْسِهِ \" ."
  },
  "46": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 46\nIn-book reference  : Book 1, Hadith 79\nUSC-MSA web (English) reference  : Book 1, Hadith 74\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - قَالَ أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يَدْخُلُ الْجَنَّةَ مَنْ لاَ يَأْمَنُ جَارُهُ بَوَائِقَهُ \" ."
  },
  "47": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 47c\nIn-book reference  : Book 1, Hadith 82\nUSC-MSA web (English) reference  : Book 1, Hadith 77\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ أَبِي حَصِينٍ غَيْرَ أَنَّهُ قَالَ \" فَلْيُحْسِنْ إِلَى جَارِهِ \" ."
  },
  "48": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 48\nIn-book reference  : Book 1, Hadith 83\nUSC-MSA web (English) reference  : Book 1, Hadith 78\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، جَمِيعًا عَنِ ابْنِ عُيَيْنَةَ، - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا سُفْيَانُ، - عَنْ عَمْرٍو، أَنَّهُ سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ \" ."
  },
  "49": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 49b\nIn-book reference  : Book 1, Hadith 85\nUSC-MSA web (English) reference  : Book 1, Hadith 80\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِسْمَاعِيلَ بْنِ رَجَاءٍ، عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، وَعَنْ قَيْسِ بْنِ مُسْلِمٍ، عَنْ طَارِقِ بْنِ شِهَابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، فِي قِصَّةِ مَرْوَانَ وَحَدِيثِ أَبِي سَعِيدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ شُعْبَةَ وَسُفْيَانَ ."
  },
  "50": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 50b\nIn-book reference  : Book 1, Hadith 87\nUSC-MSA web (English) reference  : Book 1, Hadith 82\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ أَبُو بَكْرِ بْنُ إِسْحَاقَ بْنِ مُحَمَّدٍ، أَخْبَرَنَا ابْنُ أَبِي مَرْيَمَ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنِي الْحَارِثُ بْنُ الْفُضَيْلِ الْخَطْمِيُّ، عَنْ جَعْفَرِ بْنِ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْمِسْوَرِ بْنِ مَخْرَمَةَ، عَنْ أَبِي رَافِعٍ، مَوْلَى النَّبِيِّ صلى الله عليه وسلم عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَا كَانَ مِنْ نَبِيٍّ إِلاَّ وَقَدْ كَانَ لَهُ حَوَارِيُّونَ يَهْتَدُونَ بِهَدْيِهِ وَيَسْتَنُّونَ بِسُنَّتِهِ \" . مِثْلَ حَدِيثِ صَالِحٍ وَلَمْ يَذْكُرْ قُدُومَ ابْنِ مَسْعُودٍ وَاجْتِمَاعَ ابْنِ عُمَرَ مَعَهُ ."
  },
  "51": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 51\nIn-book reference  : Book 1, Hadith 88\nUSC-MSA web (English) reference  : Book 1, Hadith 83\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ إِدْرِيسَ، كُلُّهُمْ عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، ح وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا مُعْتَمِرٌ، عَنْ إِسْمَاعِيلَ، قَالَ سَمِعْتُ قَيْسًا، يَرْوِي عَنْ أَبِي مَسْعُودٍ، قَالَ أَشَارَ النَّبِيُّ صلى الله عليه وسلم بِيَدِهِ نَحْوَ الْيَمَنِ فَقَالَ \" أَلاَ إِنَّ الإِيمَانَ هَا هُنَا وَإِنَّ الْقَسْوَةَ وَغِلَظَ الْقُلُوبِ فِي الْفَدَّادِينَ عِنْدَ أُصُولِ أَذْنَابِ الإِبِلِ حَيْثُ يَطْلُعُ قَرْنَا الشَّيْطَانِ فِي رَبِيعَةَ وَمُضَرَ \" ."
  },
  "52": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 52k\nIn-book reference  : Book 1, Hadith 99\nUSC-MSA web (English) reference  : Book 1, Hadith 94\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - قَالاَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ . مِثْلَ حَدِيثِ جَرِيرٍ وَزَادَ \" وَالْفَخْرُ وَالْخُيَلاَءُ فِي أَصْحَابِ الإِبِلِ وَالسَّكِينَةُ وَالْوَقَارُ فِي أَصْحَابِ الشَّاءِ \" ."
  },
  "53": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 53\nIn-book reference  : Book 1, Hadith 100\nUSC-MSA web (English) reference  : Book 1, Hadith 95\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ الْمَخْزُومِيُّ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" غِلَظُ الْقُلُوبِ وَالْجَفَاءُ فِي الْمَشْرِقِ وَالإِيمَانُ فِي أَهْلِ الْحِجَازِ \" ."
  },
  "54": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 54b\nIn-book reference  : Book 1, Hadith 102\nUSC-MSA web (English) reference  : Book 1, Hadith 97\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، أَنْبَأَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَدْخُلُونَ الْجَنَّةَ حَتَّى تُؤْمِنُوا \" . بِمِثْلِ حَدِيثِ أَبِي مُعَاوِيَةَ وَوَكِيعٍ ."
  },
  "55": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 55c\nIn-book reference  : Book 1, Hadith 105\nUSC-MSA web (English) reference  : Book 1, Hadith 100\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي أُمَيَّةُ بْنُ بِسْطَامَ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا رَوْحٌ، - وَهُوَ ابْنُ الْقَاسِمِ - حَدَّثَنَا سُهَيْلٌ، عَنْ عَطَاءِ بْنِ يَزِيدَ، سَمِعَهُ وَهُوَ، يُحَدِّثُ أَبَا صَالِحٍ عَنْ تَمِيمٍ الدَّارِيِّ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "56": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 56c\nIn-book reference  : Book 1, Hadith 108\nUSC-MSA web (English) reference  : Book 1, Hadith 103\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا سُرَيْجُ بْنُ يُونُسَ، وَيَعْقُوبُ الدَّوْرَقِيُّ، قَالاَ حَدَّثَنَا هُشَيْمٌ، عَنْ سَيَّارٍ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ بَايَعْتُ النَّبِيَّ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ فَلَقَّنَنِي \" فِيمَا اسْتَطَعْتَ \" . وَالنُّصْحِ لِكُلِّ مُسْلِمٍ . قَالَ يَعْقُوبُ فِي رِوَايَتِهِ قَالَ حَدَّثَنَا سَيَّارٌ ."
  },
  "57": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 57g\nIn-book reference  : Book 1, Hadith 115\nUSC-MSA web (English) reference  : Book 1, Hadith 110\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ ذَكْوَانَ، عَنْ أَبِي هُرَيْرَةَ، رَفَعَهُ قَالَ \" لاَ يَزْنِي الزَّانِي \" . ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ شُعْبَةَ ."
  },
  "58": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 58\nIn-book reference  : Book 1, Hadith 116\nUSC-MSA web (English) reference  : Book 1, Hadith 111\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا الأَعْمَشُ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَرْبَعٌ مَنْ كُنَّ فِيهِ كَانَ مُنَافِقًا خَالِصًا وَمَنْ كَانَتْ فِيهِ خَلَّةٌ مِنْهُنَّ كَانَتْ فِيهِ خَلَّةٌ مِنْ نِفَاقٍ حَتَّى يَدَعَهَا إِذَا حَدَّثَ كَذَبَ وَإِذَا عَاهَدَ غَدَرَ وَإِذَا وَعَدَ أَخْلَفَ وَإِذَا خَاصَمَ فَجَرَ \" . غَيْرَ أَنَّ فِي حَدِيثِ سُفْيَانَ \" وَإِنْ كَانَتْ فِيهِ خَصْلَةٌ مِنْهُنَّ كَانَتْ فِيهِ خَصْلَةٌ مِنَ النِّفَاقِ \" ."
  },
  "59": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 59d\nIn-book reference  : Book 1, Hadith 120\nUSC-MSA web (English) reference  : Book 1, Hadith 115\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي أَبُو نَصْرٍ التَّمَّارُ، وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ يَحْيَى بْنِ مُحَمَّدٍ عَنِ الْعَلاَءِ ذَكَرَ فِيهِ \" وَإِنْ صَامَ وَصَلَّى وَزَعَمَ أَنَّهُ مُسْلِمٌ \" ."
  },
  "60": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 60b\nIn-book reference  : Book 1, Hadith 122\nUSC-MSA web (English) reference  : Book 1, Hadith 117\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَيَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، وَعَلِيُّ بْنُ حُجْرٍ، جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، قَالَ يَحْيَى بْنُ يَحْيَى أَخْبَرَنَا إِسْمَاعِيلُ بْنُ جَعْفَرٍ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَيُّمَا امْرِئٍ قَالَ لأَخِيهِ يَا كَافِرُ . فَقَدْ بَاءَ بِهَا أَحَدُهُمَا إِنْ كَانَ كَمَا قَالَ وَإِلاَّ رَجَعَتْ عَلَيْهِ \" ."
  },
  "61": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 61\nIn-book reference  : Book 1, Hadith 123\nUSC-MSA web (English) reference  : Book 1, Hadith 118\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبِي، حَدَّثَنَا حُسَيْنٌ الْمُعَلِّمُ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، أَنَّ أَبَا الأَسْوَدِ، حَدَّثَهُ عَنْ أَبِي ذَرٍّ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لَيْسَ مِنْ رَجُلٍ ادَّعَى لِغَيْرِ أَبِيهِ وَهُوَ يَعْلَمُهُ إِلاَّ كَفَرَ وَمَنِ ادَّعَى مَا لَيْسَ لَهُ فَلَيْسَ مِنَّا وَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ وَمَنْ دَعَا رَجُلاً بِالْكُفْرِ أَوْ قَالَ عَدُوَّ اللَّهِ . وَلَيْسَ كَذَلِكَ إِلاَّ حَارَ عَلَيْهِ \" ."
  },
  "62": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 62\nIn-book reference  : Book 1, Hadith 124\nUSC-MSA web (English) reference  : Book 1, Hadith 119\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، عَنْ جَعْفَرِ بْنِ رَبِيعَةَ، عَنْ عِرَاكِ بْنِ مَالِكٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ تَرْغَبُوا عَنْ آبَائِكُمْ فَمَنْ رَغِبَ عَنْ أَبِيهِ فَهُوَ كُفْرٌ \" ."
  },
  "63": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 63b\nIn-book reference  : Book 1, Hadith 126\nUSC-MSA web (English) reference  : Book 1, Hadith 121\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّاءَ بْنِ أَبِي زَائِدَةَ، وَأَبُو مُعَاوِيَةَ عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدٍ، وَأَبِي، بَكْرَةَ كِلاَهُمَا يَقُولُ سَمِعَتْهُ أُذُنَاىَ، وَوَعَاهُ، قَلْبِي مُحَمَّدًا صلى الله عليه وسلم يَقُولُ \" مَنِ ادَّعَى إِلَى غَيْرِ أَبِيهِ وَهُوَ يَعْلَمُ أَنَّهُ غَيْرُ أَبِيهِ فَالْجَنَّةُ عَلَيْهِ حَرَامٌ \" ."
  },
  "64": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 64b\nIn-book reference  : Book 1, Hadith 128\nUSC-MSA web (English) reference  : Book 1, Hadith 123\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ الْمُثَنَّى، عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، كِلاَهُمَا عَنْ أَبِي وَائِلٍ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "65": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 65\nIn-book reference  : Book 1, Hadith 129\nUSC-MSA web (English) reference  : Book 1, Hadith 124\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَلِيِّ بْنِ مُدْرِكٍ، سَمِعَ أَبَا زُرْعَةَ، يُحَدِّثُ عَنْ جَدِّهِ، جَرِيرٍ قَالَ قَالَ لِيَ النَّبِيُّ صلى الله عليه وسلم فِي حَجَّةِ الْوَدَاعِ \" اسْتَنْصِتِ النَّاسَ \" . ثُمَّ قَالَ \" لاَ تَرْجِعُوا بَعْدِي كُفَّارًا يَضْرِبُ بَعْضُكُمْ رِقَابَ بَعْضٍ \" ."
  },
  "66": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 66c\nIn-book reference  : Book 1, Hadith 132\nUSC-MSA web (English) reference  : Book 1, Hadith 127\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، أَنَّ أَبَاهُ، حَدَّثَهُ عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ شُعْبَةَ عَنْ وَاقِدٍ ."
  },
  "67": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 67\nIn-book reference  : Book 1, Hadith 133\nUSC-MSA web (English) reference  : Book 1, Hadith 128\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي وَمُحَمَّدُ بْنُ عُبَيْدٍ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اثْنَتَانِ فِي النَّاسِ هُمَا بِهِمْ كُفْرٌ الطَّعْنُ فِي النَّسَبِ وَالنِّيَاحَةُ عَلَى الْمَيِّتِ \" ."
  },
  "68": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 68\nIn-book reference  : Book 1, Hadith 134\nUSC-MSA web (English) reference  : Book 1, Hadith 129\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عَلِيُّ بْنُ حُجْرٍ السَّعْدِيُّ، حَدَّثَنَا إِسْمَاعِيلُ، - يَعْنِي ابْنَ عُلَيَّةَ - عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، أَنَّهُ سَمِعَهُ يَقُولُ \" أَيُّمَا عَبْدٍ أَبَقَ مِنْ مَوَالِيهِ فَقَدْ كَفَرَ حَتَّى يَرْجِعَ إِلَيْهِمْ \" . قَالَ مَنْصُورٌ قَدْ وَاللَّهِ رُوِيَ عَنِ النَّبِيِّ صلى الله عليه وسلم وَلَكِنِّي أَكْرَهُ أَنْ يُرْوَى عَنِّي هَا هُنَا بِالْبَصْرَةِ ."
  },
  "69": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 69\nIn-book reference  : Book 1, Hadith 135\nUSC-MSA web (English) reference  : Book 1, Hadith 130\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ جَرِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَيُّمَا عَبْدٍ أَبَقَ فَقَدْ بَرِئَتْ مِنْهُ الذِّمَّةُ \" ."
  },
  "70": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 70\nIn-book reference  : Book 1, Hadith 136\nUSC-MSA web (English) reference  : Book 1, Hadith 131\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا جَرِيرٌ، عَنْ مُغِيرَةَ، عَنِ الشَّعْبِيِّ، قَالَ كَانَ جَرِيرُ بْنُ عَبْدِ اللَّهِ يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِذَا أَبَقَ الْعَبْدُ لَمْ تُقْبَلْ لَهُ صَلاَةٌ \" ."
  },
  "71": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 71\nIn-book reference  : Book 1, Hadith 137\nUSC-MSA web (English) reference  : Book 1, Hadith 132\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ صَلَّى بِنَا رَسُولُ اللَّهِ صلى الله عليه وسلم صَلاَةَ الصُّبْحِ بِالْحُدَيْبِيَةِ فِي إِثْرِ السَّمَاءِ كَانَتْ مِنَ اللَّيْلِ فَلَمَّا انْصَرَفَ أَقْبَلَ عَلَى النَّاسِ فَقَالَ \" هَلْ تَدْرُونَ مَاذَا قَالَ رَبُّكُمْ \" . قَالُوا اللَّهُ وَرَسُولُهُ أَعْلَمُ . قَالَ \" قَالَ أَصْبَحَ مِنْ عِبَادِي مُؤْمِنٌ بِي وَكَافِرٌ فَأَمَّا مَنْ قَالَ مُطِرْنَا بِفَضْلِ اللَّهِ وَرَحْمَتِهِ . فَذَلِكَ مُؤْمِنٌ بِي وَكَافِرٌ بِالْكَوْكَبِ وَأَمَّا مَنْ قَالَ مُطِرْنَا بِنَوْءِ كَذَا وَكَذَا . فَذَلِكَ كَافِرٌ بِي مُؤْمِنٌ بِالْكَوْكَبِ \" ."
  },
  "72": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 72b\nIn-book reference  : Book 1, Hadith 139\nUSC-MSA web (English) reference  : Book 1, Hadith 134\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَلَمَةَ الْمُرَادِيُّ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنْ عَمْرِو بْنِ الْحَارِثِ، ح وَحَدَّثَنِي عَمْرُو بْنُ سَوَّادٍ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنَا عَمْرُو بْنُ الْحَارِثِ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَا أَنْزَلَ اللَّهُ مِنَ السَّمَاءِ مِنْ بَرَكَةٍ إِلاَّ أَصْبَحَ فَرِيقٌ مِنَ النَّاسِ بِهَا كَافِرِينَ يُنْزِلُ اللَّهُ الْغَيْثَ فَيَقُولُونَ الْكَوْكَبُ كَذَا وَكَذَا \" وَفِي حَدِيثِ الْمُرَادِيِّ \" بِكَوْكَبِ كَذَا وَكَذَا \" ."
  },
  "73": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 73\nIn-book reference  : Book 1, Hadith 140\nUSC-MSA web (English) reference  : Book 1, Hadith 135\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، حَدَّثَنَا النَّضْرُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عِكْرِمَةُ، - وَهُوَ ابْنُ عَمَّارٍ - حَدَّثَنَا أَبُو زُمَيْلٍ، قَالَ حَدَّثَنِي ابْنُ عَبَّاسٍ، قَالَ مُطِرَ النَّاسُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" أَصْبَحَ مِنَ النَّاسِ شَاكِرٌ وَمِنْهُمْ كَافِرٌ قَالُوا هَذِهِ رَحْمَةُ اللَّهِ . وَقَالَ بَعْضُهُمْ لَقَدْ صَدَقَ نَوْءُ كَذَا وَكَذَا \" . قَالَ فَنَزَلَتْ هَذِهِ الآيَةُ { فَلاَ أُقْسِمُ بِمَوَاقِعِ النُّجُومِ} حَتَّى بَلَغَ { وَتَجْعَلُونَ رِزْقَكُمْ أَنَّكُمْ تُكَذِّبُونَ{"
  },
  "74": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 74b\nIn-book reference  : Book 1, Hadith 142\nUSC-MSA web (English) reference  : Book 1, Hadith 137\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ \" حُبُّ الأَنْصَارِ آيَةُ الإِيمَانِ وَبُغْضُهُمْ آيَةُ النِّفَاقِ \" ."
  },
  "75": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 75\nIn-book reference  : Book 1, Hadith 143\nUSC-MSA web (English) reference  : Book 1, Hadith 138\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، قَالَ حَدَّثَنِي مُعَاذُ بْنُ مُعَاذٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، قَالَ سَمِعْتُ الْبَرَاءَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ فِي الأَنْصَارِ \" لاَ يُحِبُّهُمْ إِلاَّ مُؤْمِنٌ وَلاَ يُبْغِضُهُمْ إِلاَّ مُنَافِقٌ مَنْ أَحَبَّهُمْ أَحَبَّهُ اللَّهُ وَمَنْ أَبْغَضَهُمْ أَبْغَضَهُ اللَّهُ \" . قَالَ شُعْبَةُ قُلْتُ لِعَدِيٍّ سَمِعْتَهُ مِنَ الْبَرَاءِ قَالَ إِيَّاىَ حَدَّثَ ."
  },
  "76": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 76\nIn-book reference  : Book 1, Hadith 144\nUSC-MSA web (English) reference  : Book 1, Hadith 139\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ الْقَارِيَّ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يُبْغِضُ الأَنْصَارَ رَجُلٌ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ \" ."
  },
  "77": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 77\nIn-book reference  : Book 1, Hadith 145\nUSC-MSA web (English) reference  : Book 1, Hadith 140\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ مُحَمَّدِ بْنِ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يُبْغِضُ الأَنْصَارَ رَجُلٌ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ \" ."
  },
  "78": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 78\nIn-book reference  : Book 1, Hadith 146\nUSC-MSA web (English) reference  : Book 1, Hadith 141\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عَدِيِّ بْنِ ثَابِتٍ، عَنْ زِرٍّ، قَالَ قَالَ عَلِيٌّ وَالَّذِي فَلَقَ الْحَبَّةَ وَبَرَأَ النَّسَمَةَ إِنَّهُ لَعَهْدُ النَّبِيِّ الأُمِّيِّ صلى الله عليه وسلم إِلَىَّ أَنْ لاَ يُحِبَّنِي إِلاَّ مُؤْمِنٌ وَلاَ يُبْغِضَنِي إِلاَّ مُنَافِقٌ ."
  },
  "79": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 79b\nIn-book reference  : Book 1, Hadith 148\nUSC-MSA web (English) reference  : Book 1, Hadith 142\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنِ ابْنِ الْهَادِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "80": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 80b\nIn-book reference  : Book 1, Hadith 150\nUSC-MSA web (English) reference  : Book 1, Hadith 143\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عَمْرِو بْنِ أَبِي عَمْرٍو، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ مَعْنَى حَدِيثِ ابْنِ عُمَرَ عَنِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "81": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 81b\nIn-book reference  : Book 1, Hadith 152\nUSC-MSA web (English) reference  : Book 1, Hadith 145\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، بِهَذَا الإِسْنَادِ مِثْلَهُ غَيْرَ أَنَّهُ قَالَ \" فَعَصَيْتُ فَلِيَ النَّارُ \" ."
  },
  "82": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 82b\nIn-book reference  : Book 1, Hadith 154\nUSC-MSA web (English) reference  : Book 1, Hadith 147\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا الضَّحَّاكُ بْنُ مَخْلَدٍ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" بَيْنَ الرَّجُلِ وَبَيْنَ الشِّرْكِ وَالْكُفْرِ تَرْكُ الصَّلاَةِ \" ."
  },
  "83": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 83\nIn-book reference  : Book 1, Hadith 155\nUSC-MSA web (English) reference  : Book 1, Hadith 148\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مَنْصُورُ بْنُ أَبِي مُزَاحِمٍ، حَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعْدٍ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ جَعْفَرِ بْنِ زِيَادٍ، أَخْبَرَنَا إِبْرَاهِيمُ، - يَعْنِي ابْنَ سَعْدٍ - عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَىُّ الأَعْمَالِ أَفْضَلُ قَالَ \" إِيمَانٌ بِاللَّهِ \" . قَالَ ثُمَّ مَاذَا قَالَ \" الْجِهَادُ فِي سَبِيلِ اللَّهِ \" . قَالَ ثُمَّ مَاذَا قَالَ \" حَجٌّ مَبْرُورٌ \" . وَفِي رِوَايَةِ مُحَمَّدِ بْنِ جَعْفَرٍ قَالَ \" إِيمَانٌ بِاللَّهِ وَرَسُولِهِ \" . وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "84": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 84b\nIn-book reference  : Book 1, Hadith 157\nUSC-MSA web (English) reference  : Book 1, Hadith 150\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، قَالَ عَبْدٌ أَخْبَرَنَا وَقَالَ ابْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حَبِيبٍ، مَوْلَى عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، عَنْ أَبِي مُرَاوِحٍ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ غَيْرَ أَنَّهُ قَالَ \" فَتُعِينُ الصَّانِعَ أَوْ تَصْنَعُ لأَخْرَقَ \" ."
  },
  "85": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 85e\nIn-book reference  : Book 1, Hadith 162\nUSC-MSA web (English) reference  : Book 1, Hadith 155\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" أَفْضَلُ الأَعْمَالِ - أَوِ الْعَمَلِ - الصَّلاَةُ لِوَقْتِهَا وَبِرُّ الْوَالِدَيْنِ \" ."
  },
  "86": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 86b\nIn-book reference  : Book 1, Hadith 164\nUSC-MSA web (English) reference  : Book 1, Hadith 157\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ جَرِيرٍ، قَالَ عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي وَائِلٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَجُلٌ يَا رَسُولَ اللَّهِ أَىُّ الذَّنْبِ أَكْبَرُ عِنْدَ اللَّهِ قَالَ \" أَنْ تَدْعُوَ لِلَّهِ نِدًّا وَهُوَ خَلَقَكَ \" . قَالَ ثُمَّ أَىٌّ قَالَ \" أَنْ تَقْتُلَ وَلَدَكَ مَخَافَةَ أَنْ يَطْعَمَ مَعَكَ \" . قَالَ ثُمَّ أَىٌّ قَالَ \" أَنْ تُزَانِيَ حَلِيلَةَ جَارِكَ \" فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ تَصْدِيقَهَا { وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ يَزْنُونَ وَمَنْ يَفْعَلْ ذَلِكَ يَلْقَ أَثَامًا}"
  },
  "87": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 87\nIn-book reference  : Book 1, Hadith 165\nUSC-MSA web (English) reference  : Book 1, Hadith 158\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي عَمْرُو بْنُ مُحَمَّدِ بْنِ بُكَيْرِ بْنِ مُحَمَّدٍ النَّاقِدُ، حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ كُنَّا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" أَلاَ أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ - ثَلاَثًا - الإِشْرَاكُ بِاللَّهِ وَعُقُوقُ الْوَالِدَيْنِ وَشَهَادَةُ الزُّورِ أَوْ قَوْلُ الزُّورِ \" . وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم مُتَّكِئًا فَجَلَسَ فَمَازَالَ يُكَرِّرُهَا حَتَّى قُلْنَا لَيْتَهُ سَكَتَ ."
  },
  "88": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 88b\nIn-book reference  : Book 1, Hadith 167\nUSC-MSA web (English) reference  : Book 1, Hadith 160\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْوَلِيدِ بْنِ عَبْدِ الْحَمِيدِ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْكَبَائِرَ - أَوْ سُئِلَ عَنِ الْكَبَائِرِ - فَقَالَ \" الشِّرْكُ بِاللَّهِ وَقَتْلُ النَّفْسِ وَعُقُوقُ الْوَالِدَيْنِ \" . وَقَالَ \" أَلاَ أُنَبِّئُكُمْ بِأَكْبَرِ الْكَبَائِرِ \" . قَالَ \" قَوْلُ الزُّورِ \" . أَوْ قَالَ \" شَهَادَةُ الزُّورِ \" . قَالَ شُعْبَةُ وَأَكْبَرُ ظَنِّي أَنَّهُ شَهَادَةُ الزُّورِ ."
  },
  "89": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 89\nIn-book reference  : Book 1, Hadith 168\nUSC-MSA web (English) reference  : Book 1, Hadith 161\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنِي سُلَيْمَانُ بْنُ بِلاَلٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" اجْتَنِبُوا السَّبْعَ الْمُوبِقَاتِ \" . قِيلَ يَا رَسُولَ اللَّهِ وَمَا هُنَّ قَالَ \" الشِّرْكُ بِاللَّهِ وَالسِّحْرُ وَقَتْلُ النَّفْسِ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَأَكْلُ مَالِ الْيَتِيمِ وَأَكْلُ الرِّبَا وَالتَّوَلِّي يَوْمَ الزَّحْفِ وَقَذْفُ الْمُحْصَنَاتِ الْغَافِلاَتِ الْمُؤْمِنَاتِ \" ."
  },
  "90": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 90b\nIn-book reference  : Book 1, Hadith 170\nUSC-MSA web (English) reference  : Book 1, Hadith 163\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ جَمِيعًا عَنْ مُحَمَّدِ بْنِ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، حَدَّثَنَا سُفْيَانُ، كِلاَهُمَا عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "91": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 91c\nIn-book reference  : Book 1, Hadith 173\nUSC-MSA web (English) reference  : Book 1, Hadith 166\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبَانَ بْنِ تَغْلِبَ، عَنْ فُضَيْلٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ يَدْخُلُ الْجَنَّةَ مَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ ذَرَّةٍ مِنْ كِبْرٍ \" ."
  },
  "92": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 92\nIn-book reference  : Book 1, Hadith 174\nUSC-MSA web (English) reference  : Book 1, Hadith 167\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ وَكِيعٌ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ ابْنُ نُمَيْرٍ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ مَاتَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ النَّارَ \" . وَقُلْتُ أَنَا وَمَنْ مَاتَ لاَ يُشْرِكُ بِاللَّهِ شَيْئًا دَخَلَ الْجَنَّةَ ."
  },
  "93": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 93c\nIn-book reference  : Book 1, Hadith 177\nUSC-MSA web (English) reference  : Book 1, Hadith 170\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا مُعَاذٌ، - وَهُوَ ابْنُ هِشَامٍ - قَالَ حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ بِمِثْلِهِ ."
  },
  "94": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 94b\nIn-book reference  : Book 1, Hadith 179\nUSC-MSA web (English) reference  : Book 1, Hadith 172\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَأَحْمَدُ بْنُ خِرَاشٍ، قَالاَ حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا أَبِي قَالَ، حَدَّثَنِي حُسَيْنٌ الْمُعَلِّمُ، عَنِ ابْنِ بُرَيْدَةَ، أَنَّ يَحْيَى بْنَ يَعْمَرَ، حَدَّثَهُ أَنَّ أَبَا الأَسْوَدِ الدِّيلِيَّ حَدَّثَهُ أَنَّ أَبَا ذَرٍّ حَدَّثَهُ قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ نَائِمٌ عَلَيْهِ ثَوْبٌ أَبْيَضُ ثُمَّ أَتَيْتُهُ فَإِذَا هُوَ نَائِمٌ ثُمَّ أَتَيْتُهُ وَقَدِ اسْتَيْقَظَ فَجَلَسْتُ إِلَيْهِ فَقَالَ \" مَا مِنْ عَبْدٍ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ ثُمَّ مَاتَ عَلَى ذَلِكَ إِلاَّ دَخَلَ الْجَنَّةَ \" . قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ \" وَإِنْ زَنَى وَإِنْ سَرَقَ \" . قُلْتُ وَإِنْ زَنَى وَإِنْ سَرَقَ قَالَ \" وَإِنْ زَنَى وَإِنْ سَرَقَ \" . ثَلاَثًا ثُمَّ قَالَ فِي الرَّابِعَةِ \" عَلَى رَغْمِ أَنْفِ أَبِي ذَرٍّ \" قَالَ فَخَرَجَ أَبُو ذَرٍّ وَهُوَ يَقُولُ وَإِنْ رَغِمَ أَنْفُ أَبِي ذَرٍّ ."
  },
  "95": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 95c\nIn-book reference  : Book 1, Hadith 182\nUSC-MSA web (English) reference  : Book 1, Hadith 175\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي عَطَاءُ بْنُ يَزِيدَ اللَّيْثِيُّ، ثُمَّ الْجُنْدَعِيُّ أَنَّ عُبَيْدَ، اللَّهِ بْنَ عَدِيِّ بْنِ الْخِيَارِ أَخْبَرَهُ أَنَّ الْمِقْدَادَ بْنَ عَمْرِو بْنِ الأَسْوَدِ الْكِنْدِيَّ - وَكَانَ حَلِيفًا لِبَنِي زُهْرَةَ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم - أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ لَقِيتُ رَجُلاً مِنَ الْكُفَّارِ ثُمَّ ذَكَرَ بِمِثْلِ حَدِيثِ اللَّيْثِ ."
  },
  "96": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 96b\nIn-book reference  : Book 1, Hadith 184\nUSC-MSA web (English) reference  : Book 1, Hadith 177\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَعْقُوبُ الدَّوْرَقِيُّ، حَدَّثَنَا هُشَيْمٌ، أَخْبَرَنَا حُصَيْنٌ، حَدَّثَنَا أَبُو ظِبْيَانَ، قَالَ سَمِعْتُ أُسَامَةَ بْنَ زَيْدِ بْنِ حَارِثَةَ، يُحَدِّثُ قَالَ بَعَثَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى الْحُرَقَةِ مِنْ جُهَيْنَةَ فَصَبَّحْنَا الْقَوْمَ فَهَزَمْنَاهُمْ وَلَحِقْتُ أَنَا وَرَجُلٌ مِنَ الأَنْصَارِ رَجُلاً مِنْهُمْ فَلَمَّا غَشَيْنَاهُ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . فَكَفَّ عَنْهُ الأَنْصَارِيُّ وَطَعَنْتُهُ بِرُمْحِي حَتَّى قَتَلْتُهُ . قَالَ فَلَمَّا قَدِمْنَا بَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ لِي \" يَا أُسَامَةُ أَقَتَلْتَهُ بَعْدَ مَا قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ \" . قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّمَا كَانَ مُتَعَوِّذًا . قَالَ فَقَالَ \" أَقَتَلْتَهُ بَعْدَ مَا قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ \" . قَالَ فَمَازَالَ يُكَرِّرُهَا عَلَىَّ حَتَّى تَمَنَّيْتُ أَنِّي لَمْ أَكُنْ أَسْلَمْتُ قَبْلَ ذَلِكَ الْيَوْمِ ."
  },
  "97": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 97\nIn-book reference  : Book 1, Hadith 185\nUSC-MSA web (English) reference  : Book 1, Hadith 178\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا عَمْرُو بْنُ عَاصِمٍ، حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، أَنَّ خَالِدًا الأَثْبَجَ ابْنَ أَخِي، صَفْوَانَ بْنِ مُحْرِزٍ حَدَّثَ عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، أَنَّهُ حَدَّثَ أَنَّ جُنْدَبَ بْنَ عَبْدِ اللَّهِ الْبَجَلِيَّ بَعَثَ إِلَى عَسْعَسِ بْنِ سَلاَمَةَ زَمَنَ فِتْنَةِ ابْنِ الزُّبَيْرِ فَقَالَ اجْمَعْ لِي نَفَرًا مِنْ إِخْوَانِكَ حَتَّى أُحَدِّثَهُمْ . فَبَعَثَ رَسُولاً إِلَيْهِمْ فَلَمَّا اجْتَمَعُوا جَاءَ جُنْدَبٌ وَعَلَيْهِ بُرْنُسٌ أَصْفَرُ فَقَالَ تَحَدَّثُوا بِمَا كُنْتُمْ تَحَدَّثُونَ بِهِ . حَتَّى دَارَ الْحَدِيثُ فَلَمَّا دَارَ الْحَدِيثُ إِلَيْهِ حَسَرَ الْبُرْنُسَ عَنْ رَأْسِهِ فَقَالَ إِنِّي أَتَيْتُكُمْ وَلاَ أُرِيدُ أَنْ أُخْبِرَكُمْ عَنْ نَبِيِّكُمْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ بَعْثًا مِنَ الْمُسْلِمِينَ إِلَى قَوْمٍ مِنَ الْمُشْرِكِينَ وَإِنَّهُمُ الْتَقَوْا فَكَانَ رَجُلٌ مِنَ الْمُشْرِكِينَ إِذَا شَاءَ أَنْ يَقْصِدَ إِلَى رَجُلٍ مِنَ الْمُسْلِمِينَ قَصَدَ لَهُ فَقَتَلَهُ وَإِنَّ رَجُلاً مِنَ الْمُسْلِمِينَ قَصَدَ غَفْلَتَهُ قَالَ وَكُنَّا نُحَدَّثُ أَنَّهُ أُسَامَةُ بْنُ زَيْدٍ فَلَمَّا رَفَعَ عَلَيْهِ السَّيْفَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . فَقَتَلَهُ فَجَاءَ الْبَشِيرُ إِلَى النَّبِيِّ صلى الله عليه وسلم فَسَأَلَهُ فَأَخْبَرَهُ حَتَّى أَخْبَرَهُ خَبَرَ الرَّجُلِ كَيْفَ صَنَعَ فَدَعَاهُ فَسَأَلَهُ فَقَالَ \" لِمَ قَتَلْتَهُ \" . قَالَ يَا رَسُولَ اللَّهَ أَوْجَعَ فِي الْمُسْلِمِينَ وَقَتَلَ فُلاَنًا وَفُلاَنًا - وَسَمَّى لَهُ نَفَرًا - وَإِنِّي حَمَلْتُ عَلَيْهِ فَلَمَّا رَأَى السَّيْفَ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَقَتَلْتَهُ \" . قَالَ نَعَمْ . قَالَ \" فَكَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ \" . قَالَ يَا رَسُولَ اللَّهِ اسْتَغْفِرْ لِي . قَالَ \" وَكَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ \" . قَالَ فَجَعَلَ لاَ يَزِيدُهُ عَلَى أَنْ يَقُولَ \" كَيْفَ تَصْنَعُ بِلاَ إِلَهَ إِلاَّ اللَّهُ إِذَا جَاءَتْ يَوْمَ الْقِيَامَةِ \" ."
  },
  "98": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 98\nIn-book reference  : Book 1, Hadith 186\nUSC-MSA web (English) reference  : Book 1, Hadith 179\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، وَابْنُ، نُمَيْرٍ كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، - وَاللَّفْظُ لَهُ - قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ نَافِعٍ عَنِ ابْنِ عُمَرَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا \" ."
  },
  "99": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 99\nIn-book reference  : Book 1, Hadith 187\nUSC-MSA web (English) reference  : Book 1, Hadith 180\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا مُصْعَبٌ، - وَهُوَ ابْنُ الْمِقْدَامِ - حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ سَلَّ عَلَيْنَا السَّيْفَ فَلَيْسَ مِنَّا \" ."
  },
  "100": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 100\nIn-book reference  : Book 1, Hadith 188\nUSC-MSA web (English) reference  : Book 1, Hadith 181\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا \" ."
  },
  "101": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 101\nIn-book reference  : Book 1, Hadith 189\nUSC-MSA web (English) reference  : Book 1, Hadith 182\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ ح وَحَدَّثَنَا أَبُو الأَحْوَصِ، مُحَمَّدُ بْنُ حَيَّانَ حَدَّثَنَا ابْنُ أَبِي حَازِمٍ، كِلاَهُمَا عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ حَمَلَ عَلَيْنَا السِّلاَحَ فَلَيْسَ مِنَّا وَمَنْ غَشَّنَا فَلَيْسَ مِنَّا \" ."
  },
  "102": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 102\nIn-book reference  : Book 1, Hadith 190\nUSC-MSA web (English) reference  : Book 1, Hadith 183\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - قَالَ أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، . أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ عَلَى صُبْرَةِ طَعَامٍ فَأَدْخَلَ يَدَهُ فِيهَا فَنَالَتْ أَصَابِعُهُ بَلَلاً فَقَالَ \" مَا هَذَا يَا صَاحِبَ الطَّعَامِ \" . قَالَ أَصَابَتْهُ السَّمَاءُ يَا رَسُولَ اللَّهِ . قَالَ \" أَفَلاَ جَعَلْتَهُ فَوْقَ الطَّعَامِ كَىْ يَرَاهُ النَّاسُ مَنْ غَشَّ فَلَيْسَ مِنِّي \" ."
  },
  "103": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 103b\nIn-book reference  : Book 1, Hadith 192\nUSC-MSA web (English) reference  : Book 1, Hadith 185\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ حَدَّثَنَا عِيسَى بْنُ يُونُسَ، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ وَقَالاَ \" وَشَقَّ وَدَعَا \" ."
  },
  "104": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 104c\nIn-book reference  : Book 1, Hadith 195\nUSC-MSA web (English) reference  : Book 1, Hadith 188\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُطِيعٍ، حَدَّثَنَا هُشَيْمٌ، عَنْ حُصَيْنٍ، عَنْ عِيَاضٍ الأَشْعَرِيِّ، عَنِ امْرَأَةِ أَبِي مُوسَى، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنِيهِ حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنِي أَبِي، حَدَّثَنَا دَاوُدُ، - يَعْنِي ابْنَ أَبِي هِنْدٍ - حَدَّثَنَا عَاصِمٌ، عَنْ صَفْوَانَ بْنِ مُحْرِزٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنِي الْحَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، أَخْبَرَنَا شُعْبَةُ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ . غَيْرَ أَنَّ فِي حَدِيثِ عِيَاضٍ الأَشْعَرِيِّ قَالَ \" لَيْسَ مِنَّا \" . وَلَمْ يَقُلْ \" بَرِيءٌ \" ."
  },
  "105": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 105c\nIn-book reference  : Book 1, Hadith 198\nUSC-MSA web (English) reference  : Book 1, Hadith 191\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا ابْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ هَمَّامِ بْنِ الْحَارِثِ، قَالَ كُنَّا جُلُوسًا مَعَ حُذَيْفَةَ فِي الْمَسْجِدِ فَجَاءَ رَجُلٌ حَتَّى جَلَسَ إِلَيْنَا فَقِيلَ لِحُذَيْفَةَ إِنَّ هَذَا يَرْفَعُ إِلَى السُّلْطَانِ أَشْيَاءَ . فَقَالَ حُذَيْفَةُ - إِرَادَةَ أَنْ يُسْمِعَهُ - سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لاَ يَدْخُلُ الْجَنَّةَ قَتَّاتٌ \" ."
  },
  "106": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 106c\nIn-book reference  : Book 1, Hadith 201\nUSC-MSA web (English) reference  : Book 1, Hadith 194\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ بِشْرُ بْنُ خَالِدٍ، حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - عَنْ شُعْبَةَ، قَالَ سَمِعْتُ سُلَيْمَانَ، بِهَذَا الإِسْنَادِ وَقَالَ \" ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ \" ."
  },
  "107": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 107\nIn-book reference  : Book 1, Hadith 202\nUSC-MSA web (English) reference  : Book 1, Hadith 195\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يُزَكِّيهِمْ - قَالَ أَبُو مُعَاوِيَةَ وَلاَ يَنْظُرُ إِلَيْهِمْ - وَلَهُمْ عَذَابٌ أَلِيمٌ شَيْخٌ زَانٍ وَمَلِكٌ كَذَّابٌ وَعَائِلٌ مُسْتَكْبِرٌ \" ."
  },
  "108": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 108c\nIn-book reference  : Book 1, Hadith 205\nUSC-MSA web (English) reference  : Book 1, Hadith 198\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرٍو، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، - قَالَ أُرَاهُ مَرْفُوعًا - قَالَ \" ثَلاَثَةٌ لاَ يُكَلِّمُهُمُ اللَّهُ وَلاَ يَنْظُرُ إِلَيْهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ رَجُلٌ حَلَفَ عَلَى يَمِينٍ بَعْدَ صَلاَةِ الْعَصْرِ عَلَى مَالِ مُسْلِمٍ فَاقْتَطَعَهُ \" . وَبَاقِي حَدِيثِهِ نَحْوُ حَدِيثِ الأَعْمَشِ ."
  },
  "109": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 109b\nIn-book reference  : Book 1, Hadith 207\nUSC-MSA web (English) reference  : Book 1, Hadith 200\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، حَدَّثَنَا عَبْثَرٌ، ح وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ بِهَذَا الإِسْنَادِ مِثْلَهُ . وَفِي رِوَايَةِ شُعْبَةَ عَنْ سُلَيْمَانَ قَالَ سَمِعْتُ ذَكْوَانَ ."
  },
  "110": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 110d\nIn-book reference  : Book 1, Hadith 211\nUSC-MSA web (English) reference  : Book 1, Hadith 204\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، عَنِ الثَّوْرِيِّ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ ثَابِتِ بْنِ الضَّحَّاكِ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم \" مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا مُتَعَمِّدًا فَهُوَ كَمَا قَالَ وَمَنْ قَتَلَ نَفْسَهُ بِشَىْءٍ عَذَّبَهُ اللَّهُ بِهِ فِي نَارِ جَهَنَّمَ \" . هَذَا حَدِيثُ سُفْيَانَ . وَأَمَّا شُعْبَةُ فَحَدِيثُهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ حَلَفَ بِمِلَّةٍ سِوَى الإِسْلاَمِ كَاذِبًا فَهُوَ كَمَا قَالَ وَمَنْ ذَبَحَ نَفْسَهُ بِشَىْءٍ ذُبِحَ بِهِ يَوْمَ الْقِيَامَةِ \" ."
  },
  "111": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 111\nIn-book reference  : Book 1, Hadith 212\nUSC-MSA web (English) reference  : Book 1, Hadith 205\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، - قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ شَهِدْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حُنَيْنًا فَقَالَ لِرَجُلٍ مِمَّنْ يُدْعَى بِالإِسْلاَمِ \" هَذَا مِنْ أَهْلِ النَّارِ \" فَلَمَّا حَضَرْنَا الْقِتَالَ قَاتَلَ الرَّجُلُ قِتَالاً شَدِيدًا فَأَصَابَتْهُ جِرَاحَةٌ فَقِيلَ يَا رَسُولَ اللَّهِ الرَّجُلُ الَّذِي قُلْتَ لَهُ آنِفًا \" إِنَّهُ مِنْ أَهْلِ النَّارِ \" فَإِنَّهُ قَاتَلَ الْيَوْمَ قِتَالاً شَدِيدًا وَقَدْ مَاتَ . فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" إِلَى النَّارِ \" فَكَادَ بَعْضُ الْمُسْلِمِينَ أَنْ يَرْتَابَ فَبَيْنَمَا هُمْ عَلَى ذَلِكَ إِذْ قِيلَ إِنَّهُ لَمْ يَمُتْ وَلَكِنَّ بِهِ جِرَاحًا شَدِيدًا فَلَمَّا كَانَ مِنَ اللَّيْلِ لَمْ يَصْبِرْ عَلَى الْجِرَاحِ فَقَتَلَ نَفْسَهُ فَأُخْبِرَ النَّبِيُّ صلى الله عليه وسلم بِذَلِكَ فَقَالَ \" اللَّهُ أَكْبَرُ أَشْهَدُ أَنِّي عَبْدُ اللَّهِ وَرَسُولُهُ \" . ثُمَّ أَمَرَ بِلاَلاً فَنَادَى فِي النَّاسِ \" إِنَّهُ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ نَفْسٌ مُسْلِمَةٌ وَإِنَّ اللَّهَ يُؤَيِّدُ هَذَا الدِّينَ بِالرَّجُلِ الْفَاجِرِ \" ."
  },
  "112": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 112\nIn-book reference  : Book 1, Hadith 213\nUSC-MSA web (English) reference  : Book 1, Hadith 206\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا يَعْقُوبُ، - وَهُوَ ابْنُ عَبْدِ الرَّحْمَنِ الْقَارِيُّ - حَىٌّ مِنَ الْعَرَبِ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم الْتَقَى هُوَ وَالْمُشْرِكُونَ فَاقْتَتَلُوا . فَلَمَّا مَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى عَسْكَرِهِ وَمَالَ الآخَرُونَ إِلَى عَسْكَرِهِمْ وَفِي أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم رَجُلٌ لاَ يَدَعُ لَهُمْ شَاذَّةً إِلاَّ اتَّبَعَهَا يَضْرِبُهَا بِسَيْفِهِ فَقَالُوا مَا أَجْزَأَ مِنَّا الْيَوْمَ أَحَدٌ كَمَا أَجْزَأَ فُلاَنٌ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَمَا إِنَّهُ مِنْ أَهْلِ النَّارِ \" . فَقَالَ رَجُلٌ مِنَ الْقَوْمِ أَنَا صَاحِبُهُ أَبَدًا . قَالَ فَخَرَجَ مَعَهُ كُلَّمَا وَقَفَ وَقَفَ مَعَهُ وَإِذَا أَسْرَعَ أَسْرَعَ مَعَهُ - قَالَ - فَجُرِحَ الرَّجُلُ جُرْحًا شَدِيدًا فَاسْتَعْجَلَ الْمَوْتَ فَوَضَعَ نَصْلَ سَيْفِهِ بِالأَرْضِ وَذُبَابَهُ بَيْنَ ثَدْيَيْهِ ثُمَّ تَحَامَلَ عَلَى سَيْفِهِ فَقَتَلَ نَفْسَهُ فَخَرَجَ الرَّجُلُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ أَشْهَدُ أَنَّكَ رَسُولُ اللَّهِ . قَالَ \" وَمَا ذَاكَ \" . قَالَ الرَّجُلُ الَّذِي ذَكَرْتَ آنِفًا أَنَّهُ مِنْ أَهْلِ النَّارِ فَأَعْظَمَ النَّاسُ ذَلِكَ فَقُلْتُ أَنَا لَكُمْ بِهِ فَخَرَجْتُ فِي طَلَبِهِ حَتَّى جُرِحَ جُرْحًا شَدِيدًا فَاسْتَعْجَلَ الْمَوْتَ فَوَضَعَ نَصْلَ سَيْفِهِ بِالأَرْضِ وَذُبَابَهُ بَيْنَ ثَدْيَيْهِ ثُمَّ تَحَامَلَ عَلَيْهِ فَقَتَلَ نَفْسَهُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عِنْدَ ذَلِكَ \" إِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ الْجَنَّةِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ النَّارِ وَإِنَّ الرَّجُلَ لَيَعْمَلُ عَمَلَ أَهْلِ النَّارِ فِيمَا يَبْدُو لِلنَّاسِ وَهُوَ مِنْ أَهْلِ الْجَنَّةِ \" ."
  },
  "113": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 113b\nIn-book reference  : Book 1, Hadith 215\nUSC-MSA web (English) reference  : Book 1, Hadith 208\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ الْحَسَنَ، يَقُولُ حَدَّثَنَا جُنْدَبُ بْنُ عَبْدِ اللَّهِ الْبَجَلِيُّ، فِي هَذَا الْمَسْجِدِ فَمَا نَسِينَا وَمَا نَخْشَى أَنْ يَكُونَ جُنْدَبٌ كَذَبَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" خَرَجَ بِرَجُلٍ فِيمَنْ كَانَ قَبْلَكُمْ خُرَاجٌ \" . فَذَكَرَ نَحْوَهُ ."
  },
  "114": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 114\nIn-book reference  : Book 1, Hadith 216\nUSC-MSA web (English) reference  : Book 1, Hadith 209\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، قَالَ حَدَّثَنِي سِمَاكٌ الْحَنَفِيُّ أَبُو زُمَيْلٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ، قَالَ حَدَّثَنِي عُمَرُ بْنُ الْخَطَّابِ، قَالَ لَمَّا كَانَ يَوْمُ خَيْبَرَ أَقْبَلَ نَفَرٌ مِنْ صَحَابَةِ النَّبِيِّ صلى الله عليه وسلم فَقَالُوا فُلاَنٌ شَهِيدٌ فُلاَنٌ شَهِيدٌ حَتَّى مَرُّوا عَلَى رَجُلٍ فَقَالُوا فُلاَنٌ شَهِيدٌ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كَلاَّ إِنِّي رَأَيْتُهُ فِي النَّارِ فِي بُرْدَةٍ غَلَّهَا أَوْ عَبَاءَةٍ \" . ثُمَّ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا ابْنَ الْخَطَّابِ اذْهَبْ فَنَادِ فِي النَّاسِ إِنَّهُ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ الْمُؤْمِنُونَ \" . قَالَ فَخَرَجْتُ فَنَادَيْتُ \" أَلاَ إِنَّهُ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ الْمُؤْمِنُونَ \" ."
  },
  "115": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 115\nIn-book reference  : Book 1, Hadith 217\nUSC-MSA web (English) reference  : Book 1, Hadith 210\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، قَالَ أَخْبَرَنِي ابْنُ وَهْبٍ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ ثَوْرِ بْنِ زَيْدٍ الدُّؤَلِيِّ، عَنْ سَالِمٍ أَبِي الْغَيْثِ، مَوْلَى ابْنِ مُطِيعٍ عَنْ أَبِي هُرَيْرَةَ، ح وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، - وَهَذَا حَدِيثُهُ - حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ ثَوْرٍ، عَنْ أَبِي الْغَيْثِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ خَرَجْنَا مَعَ النَّبِيِّ صلى الله عليه وسلم إِلَى خَيْبَرَ فَفَتَحَ اللَّهُ عَلَيْنَا فَلَمْ نَغْنَمْ ذَهَبًا وَلاَ وَرِقًا غَنِمْنَا الْمَتَاعَ وَالطَّعَامَ وَالثِّيَابَ ثُمَّ انْطَلَقْنَا إِلَى الْوَادِي وَمَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَبْدٌ لَهُ وَهَبَهُ لَهُ رَجُلٌ مِنْ جُذَامٍ يُدْعَى رِفَاعَةَ بْنَ زَيْدٍ مِنْ بَنِي الضُّبَيْبِ فَلَمَّا نَزَلْنَا الْوَادِيَ قَامَ عَبْدُ رَسُولِ اللَّهِ صلى الله عليه وسلم يَحُلُّ رَحْلَهُ فَرُمِيَ بِسَهْمٍ فَكَانَ فِيهِ حَتْفُهُ فَقُلْنَا هَنِيئًا لَهُ الشَّهَادَةُ يَا رَسُولَ اللَّهِ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كَلاَّ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّ الشَّمْلَةَ لَتَلْتَهِبُ عَلَيْهِ نَارًا أَخَذَهَا مِنَ الْغَنَائِمِ يَوْمَ خَيْبَرَ لَمْ تُصِبْهَا الْمَقَاسِمُ \" . قَالَ فَفَزِعَ النَّاسُ . فَجَاءَ رَجُلٌ بِشِرَاكٍ أَوْ شِرَاكَيْنِ . فَقَالَ يَا رَسُولَ اللَّهِ أَصَبْتُ يَوْمَ خَيْبَرَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" شِرَاكٌ مِنْ نَارٍ أَوْ شِرَاكَانِ مِنْ نَارٍ \" ."
  },
  "116": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 116\nIn-book reference  : Book 1, Hadith 218\nUSC-MSA web (English) reference  : Book 1, Hadith 211\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ سُلَيْمَانَ، - قَالَ أَبُو بَكْرٍ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، - حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ حَجَّاجٍ الصَّوَّافِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ الطُّفَيْلَ بْنَ عَمْرٍو الدَّوْسِيَّ، أَتَى النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ هَلْ لَكَ فِي حِصْنٍ حَصِينٍ وَمَنَعَةٍ - قَالَ حِصْنٌ كَانَ لِدَوْسٍ فِي الْجَاهِلِيَّةِ - فَأَبَى ذَلِكَ النَّبِيُّ صلى الله عليه وسلم لِلَّذِي ذَخَرَ اللَّهُ لِلأَنْصَارِ فَلَمَّا هَاجَرَ النَّبِيُّ صلى الله عليه وسلم إِلَى الْمَدِينَةِ هَاجَرَ إِلَيْهِ الطُّفَيْلُ بْنُ عَمْرٍو وَهَاجَرَ مَعَهُ رَجُلٌ مِنْ قَوْمِهِ فَاجْتَوَوُا الْمَدِينَةَ فَمَرِضَ فَجَزِعَ فَأَخَذَ مَشَاقِصَ لَهُ فَقَطَعَ بِهَا بَرَاجِمَهُ فَشَخَبَتْ يَدَاهُ حَتَّى مَاتَ فَرَآهُ الطُّفَيْلُ بْنُ عَمْرٍو فِي مَنَامِهِ فَرَآهُ وَهَيْئَتُهُ حَسَنَةٌ وَرَآهُ مُغَطِّيًا يَدَيْهِ فَقَالَ لَهُ مَا صَنَعَ بِكَ رَبُّكَ فَقَالَ غَفَرَ لِي بِهِجْرَتِي إِلَى نَبِيِّهِ صلى الله عليه وسلم فَقَالَ مَا لِي أَرَاكَ مُغَطِّيًا يَدَيْكَ قَالَ قِيلَ لِي لَنْ نُصْلِحَ مِنْكَ مَا أَفْسَدْتَ . فَقَصَّهَا الطُّفَيْلُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ وَلِيَدَيْهِ فَاغْفِرْ \""
  },
  "117": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 117\nIn-book reference  : Book 1, Hadith 219\nUSC-MSA web (English) reference  : Book 1, Hadith 212\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ الضَّبِّيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، وَأَبُو عَلْقَمَةَ الْفَرْوِيُّ قَالاَ حَدَّثَنَا صَفْوَانُ بْنُ سُلَيْمٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَلْمَانَ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ اللَّهَ يَبْعَثُ رِيحًا مِنَ الْيَمَنِ أَلْيَنَ مِنَ الْحَرِيرِ فَلاَ تَدَعُ أَحَدًا فِي قَلْبِهِ - قَالَ أَبُو عَلْقَمَةَ مِثْقَالُ حَبَّةٍ وَقَالَ عَبْدُ الْعَزِيزِ مِثْقَالُ ذَرَّةٍ - مِنْ إِيمَانٍ إِلاَّ قَبَضَتْهُ \" ."
  },
  "118": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 118\nIn-book reference  : Book 1, Hadith 220\nUSC-MSA web (English) reference  : Book 1, Hadith 213\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ جَمِيعًا عَنْ إِسْمَاعِيلَ بْنِ جَعْفَرٍ، - قَالَ ابْنُ أَيُّوبَ حَدَّثَنَا إِسْمَاعِيلُ، - قَالَ أَخْبَرَنِي الْعَلاَءُ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" بَادِرُوا بِالأَعْمَالِ فِتَنًا كَقِطَعِ اللَّيْلِ الْمُظْلِمِ يُصْبِحُ الرَّجُلُ مُؤْمِنًا وَيُمْسِي كَافِرًا أَوْ يُمْسِي مُؤْمِنًا وَيُصْبِحُ كَافِرًا يَبِيعُ دِينَهُ بِعَرَضٍ مِنَ الدُّنْيَا \" ."
  },
  "119": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 119d\nIn-book reference  : Book 1, Hadith 224\nUSC-MSA web (English) reference  : Book 1, Hadith 216\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا هُرَيْمُ بْنُ عَبْدِ الأَعْلَى الأَسَدِيُّ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، قَالَ سَمِعْتُ أَبِي يَذْكُرُ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ . وَاقْتَصَّ الْحَدِيثَ . وَلَمْ يَذْكُرْ سَعْدَ بْنَ مُعَاذٍ وَزَادَ فَكُنَّا نَرَاهُ يَمْشِي بَيْنَ أَظْهُرِنَا رَجُلٌ مِنْ أَهْلِ الْجَنَّةِ ."
  },
  "120": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 120c\nIn-book reference  : Book 1, Hadith 227\nUSC-MSA web (English) reference  : Book 1, Hadith 219\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "121": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 121\nIn-book reference  : Book 1, Hadith 228\nUSC-MSA web (English) reference  : Book 1, Hadith 220\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى الْعَنَزِيُّ، وَأَبُو مَعْنٍ الرَّقَاشِيُّ وَإِسْحَاقُ بْنُ مَنْصُورٍ كُلُّهُمْ عَنْ أَبِي عَاصِمٍ، - وَاللَّفْظُ لاِبْنِ الْمُثَنَّى - حَدَّثَنَا الضَّحَّاكُ، - يَعْنِي أَبَا عَاصِمٍ - قَالَ أَخْبَرَنَا حَيْوَةُ بْنُ شُرَيْحٍ، قَالَ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنِ ابْنِ شَمَاسَةَ الْمَهْرِيِّ، قَالَ حَضَرْنَا عَمْرَو بْنَ الْعَاصِ وَهُوَ فِي سِيَاقَةِ الْمَوْتِ . فَبَكَى طَوِيلاً وَحَوَّلَ وَجْهَهُ إِلَى الْجِدَارِ فَجَعَلَ ابْنُهُ يَقُولُ يَا أَبَتَاهُ أَمَا بَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِكَذَا أَمَا بَشَّرَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِكَذَا قَالَ فَأَقْبَلَ بِوَجْهِهِ . فَقَالَ إِنَّ أَفْضَلَ مَا نُعِدُّ شَهَادَةُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ إِنِّي قَدْ كُنْتُ عَلَى أَطْبَاقٍ ثَلاَثٍ لَقَدْ رَأَيْتُنِي وَمَا أَحَدٌ أَشَدَّ بُغْضًا لِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنِّي وَلاَ أَحَبَّ إِلَىَّ أَنْ أَكُونَ قَدِ اسْتَمْكَنْتُ مِنْهُ فَقَتَلْتُهُ فَلَوْ مُتُّ عَلَى تِلْكَ الْحَالِ لَكُنْتُ مِنْ أَهْلِ النَّارِ فَلَمَّا جَعَلَ اللَّهُ الإِسْلاَمَ فِي قَلْبِي أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم فَقُلْتُ ابْسُطْ يَمِينَكَ فَلأُبَايِعْكَ . فَبَسَطَ يَمِينَهُ - قَالَ - فَقَبَضْتُ يَدِي . قَالَ \" مَا لَكَ يَا عَمْرُو \" . قَالَ قُلْتُ أَرَدْتُ أَنْ أَشْتَرِطَ . قَالَ \" تَشْتَرِطُ بِمَاذَا \" . قُلْتُ أَنْ يُغْفَرَ لِي . قَالَ \" أَمَا عَلِمْتَ أَنَّ الإِسْلاَمَ يَهْدِمُ مَا كَانَ قَبْلَهُ وَأَنَّ الْهِجْرَةَ تَهْدِمُ مَا كَانَ قَبْلَهَا وَأَنَّ الْحَجَّ يَهْدِمُ مَا كَانَ قَبْلَهُ \" . وَمَا كَانَ أَحَدٌ أَحَبَّ إِلَىَّ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم وَلاَ أَجَلَّ فِي عَيْنِي مِنْهُ وَمَا كُنْتُ أُطِيقُ أَنْ أَمْلأَ عَيْنَىَّ مِنْهُ إِجْلاَلاً لَهُ وَلَوْ سُئِلْتُ أَنْ أَصِفَهُ مَا أَطَقْتُ لأَنِّي لَمْ أَكُنْ أَمْلأُ عَيْنَىَّ مِنْهُ وَلَوْ مُتُّ عَلَى تِلْكَ الْحَالِ لَرَجَوْتُ أَنْ أَكُونَ مِنْ أَهْلِ الْجَنَّةِ ثُمَّ وَلِينَا أَشْيَاءَ مَا أَدْرِي مَا حَالِي فِيهَا فَإِذَا أَنَا مُتُّ فَلاَ تَصْحَبْنِي نَائِحَةٌ وَلاَ نَارٌ فَإِذَا دَفَنْتُمُونِي فَشُنُّوا عَلَىَّ التُّرَابَ شَنًّا ثُمَّ أَقِيمُوا حَوْلَ قَبْرِي قَدْرَ مَا تُنْحَرُ جَزُورٌ وَيُقْسَمُ لَحْمُهَا حَتَّى أَسْتَأْنِسَ بِكُمْ وَأَنْظُرَ مَاذَا أُرَاجِعُ بِهِ رُسُلَ رَبِّي ."
  },
  "122": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 122\nIn-book reference  : Book 1, Hadith 229\nUSC-MSA web (English) reference  : Book 1, Hadith 221\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، وَإِبْرَاهِيمُ بْنُ دِينَارٍ، - وَاللَّفْظُ لإِبْرَاهِيمَ - قَالاَ حَدَّثَنَا حَجَّاجٌ، - وَهُوَ ابْنُ مُحَمَّدٍ - عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَعْلَى بْنُ مُسْلِمٍ، أَنَّهُ سَمِعَ سَعِيدَ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، أَنَّ نَاسًا، مِنْ أَهْلِ الشِّرْكِ قَتَلُوا فَأَكْثَرُوا وَزَنَوْا فَأَكْثَرُوا ثُمَّ أَتَوْا مُحَمَّدًا صلى الله عليه وسلم فَقَالُوا إِنَّ الَّذِي تَقُولُ وَتَدْعُو لَحَسَنٌ وَلَوْ تُخْبِرُنَا أَنَّ لِمَا عَمِلْنَا كَفَّارَةً فَنَزَلَ { وَالَّذِينَ لاَ يَدْعُونَ مَعَ اللَّهِ إِلَهًا آخَرَ وَلاَ يَقْتُلُونَ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَلاَ يَزْنُونَ وَمَنْ يَفْعَلْ ذَلِكَ يَلْقَ أَثَامًا} وَنَزَلَ { يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَى أَنْفُسِهِمْ لاَ تَقْنَطُوا مِنْ رَحْمَةِ اللَّهِ{ ."
  },
  "123": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 123d\nIn-book reference  : Book 1, Hadith 233\nUSC-MSA web (English) reference  : Book 1, Hadith 225\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، أَنَّ حَكِيمَ بْنَ حِزَامٍ، أَعْتَقَ فِي الْجَاهِلِيَّةِ مِائَةَ رَقَبَةٍ وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ ثُمَّ أَعْتَقَ فِي الإِسْلاَمِ مِائَةَ رَقَبَةٍ وَحَمَلَ عَلَى مِائَةِ بَعِيرٍ ثُمَّ أَتَى النَّبِيَّ صلى الله عليه وسلم فَذَكَرَ نَحْوَ حَدِيثِهِمْ ."
  },
  "124": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 124b\nIn-book reference  : Book 1, Hadith 235\nUSC-MSA web (English) reference  : Book 1, Hadith 227\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى، - وَهُوَ ابْنُ يُونُسَ ح وَحَدَّثَنَا مِنْجَابُ بْنُ الْحَارِثِ التَّمِيمِيُّ، أَخْبَرَنَا ابْنُ مُسْهِرٍ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، أَخْبَرَنَا ابْنُ إِدْرِيسَ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ قَالَ أَبُو كُرَيْبٍ قَالَ ابْنُ إِدْرِيسَ حَدَّثَنِيهِ أَوَّلاً أَبِي، عَنْ أَبَانِ بْنِ تَغْلِبَ، عَنِ الأَعْمَشِ، ثُمَّ سَمِعْتُهُ مِنْهُ، ."
  },
  "125": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 125\nIn-book reference  : Book 1, Hadith 236\nUSC-MSA web (English) reference  : Book 1, Hadith 228\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ مِنْهَالٍ الضَّرِيرُ، وَأُمَيَّةُ بْنُ بِسْطَامَ الْعَيْشِيُّ، - وَاللَّفْظُ لأُمَيَّةَ - قَالاَ حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا رَوْحٌ، - وَهُوَ ابْنُ الْقَاسِمِ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ لَمَّا نَزَلَتْ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم { لِلَّهِ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ فَيَغْفِرُ لِمَنْ يَشَاءُ وَيُعَذِّبُ مَنْ يَشَاءُ وَاللَّهُ عَلَى كُلِّ شَىْءٍ قَدِيرٌ} قَالَ فَاشْتَدَّ ذَلِكَ عَلَى أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَوْا رَسُولَ اللَّهِ صلى الله عليه وسلم ثُمَّ بَرَكُوا عَلَى الرُّكَبِ فَقَالُوا أَىْ رَسُولَ اللَّهِ كُلِّفْنَا مِنَ الأَعْمَالِ مَا نُطِيقُ الصَّلاَةُ وَالصِّيَامُ وَالْجِهَادُ وَالصَّدَقَةُ وَقَدْ أُنْزِلَتْ عَلَيْكَ هَذِهِ الآيَةُ وَلاَ نُطِيقُهَا . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَتُرِيدُونَ أَنْ تَقُولُوا كَمَا قَالَ أَهْلُ الْكِتَابَيْنِ مِنْ قَبْلِكُمْ سَمِعْنَا وَعَصَيْنَا بَلْ قُولُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ \" . قَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ . فَلَمَّا اقْتَرَأَهَا الْقَوْمُ ذَلَّتْ بِهَا أَلْسِنَتُهُمْ فَأَنْزَلَ اللَّهُ فِي إِثْرِهَا { آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ وَقَالُوا سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ} فَلَمَّا فَعَلُوا ذَلِكَ نَسَخَهَا اللَّهُ تَعَالَى فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { لاَ يُكَلِّفُ اللَّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا} قَالَ نَعَمْ { رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا} قَالَ نَعَمْ { رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ} قَالَ نَعَمْ { وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلاَنَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ} قَالَ نَعَمْ ."
  },
  "126": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 126\nIn-book reference  : Book 1, Hadith 237\nUSC-MSA web (English) reference  : Book 1, Hadith 229\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ - وَاللَّفْظُ لأَبِي بَكْرٍ قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا - وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ آدَمَ بْنِ سُلَيْمَانَ، مَوْلَى خَالِدٍ قَالَ سَمِعْتُ سَعِيدَ بْنَ جُبَيْرٍ، يُحَدِّثُ عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ { وَإِنْ تُبْدُوا مَا فِي أَنْفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُمْ بِهِ اللَّهُ} قَالَ دَخَلَ قُلُوبَهُمْ مِنْهَا شَىْءٌ لَمْ يَدْخُلْ قُلُوبَهُمْ مِنْ شَىْءٍ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" قُولُوا سَمِعْنَا وَأَطَعْنَا وَسَلَّمْنَا \" . قَالَ فَأَلْقَى اللَّهُ الإِيمَانَ فِي قُلُوبِهِمْ فَأَنْزَلَ اللَّهُ تَعَالَى { لاَ يُكَلِّفُ اللَّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا} قَالَ قَدْ فَعَلْتُ { رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا} - قَالَ قَدْ فَعَلْتُ { وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلاَنَا} قَالَ قَدْ فَعَلْتُ ."
  },
  "127": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 127c\nIn-book reference  : Book 1, Hadith 240\nUSC-MSA web (English) reference  : Book 1, Hadith 232\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا مِسْعَرٌ، وَهِشَامٌ، ح وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ شَيْبَانَ، جَمِيعًا عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "128": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 128b\nIn-book reference  : Book 1, Hadith 242\nUSC-MSA web (English) reference  : Book 1, Hadith 234\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنِ الْعَلاَءِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" قَالَ اللَّهُ عَزَّ وَجَلَّ إِذَا هَمَّ عَبْدِي بِحَسَنَةٍ وَلَمْ يَعْمَلْهَا كَتَبْتُهَا لَهُ حَسَنَةً فَإِنْ عَمِلَهَا كَتَبْتُهَا عَشْرَ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ وَإِذَا هَمَّ بِسَيِّئَةٍ وَلَمْ يَعْمَلْهَا لَمْ أَكْتُبْهَا عَلَيْهِ فَإِنْ عَمِلَهَا كَتَبْتُهَا سَيِّئَةً وَاحِدَةً \" ."
  },
  "129": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 129\nIn-book reference  : Book 1, Hadith 243\nUSC-MSA web (English) reference  : Book 1, Hadith 235\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ مُحَمَّدٍ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قَالَ اللَّهُ عَزَّ وَجَلَّ إِذَا تَحَدَّثَ عَبْدِي بِأَنْ يَعْمَلَ حَسَنَةً فَأَنَا أَكْتُبُهَا لَهُ حَسَنَةً مَا لَمْ يَعْمَلْ فَإِذَا عَمِلَهَا فَأَنَا أَكْتُبُهَا بِعَشْرِ أَمْثَالِهَا وَإِذَا تَحَدَّثَ بِأَنْ يَعْمَلَ سَيِّئَةً فَأَنَا أَغْفِرُهَا لَهُ مَا لَمْ يَعْمَلْهَا فَإِذَا عَمِلَهَا فَأَنَا أَكْتُبُهَا لَهُ بِمِثْلِهَا \" . وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قَالَتِ الْمَلاَئِكَةُ رَبِّ ذَاكَ عَبْدُكَ يُرِيدُ أَنْ يَعْمَلَ سَيِّئَةً - وَهُوَ أَبْصَرُ بِهِ - فَقَالَ ارْقُبُوهُ فَإِنْ عَمِلَهَا فَاكْتُبُوهَا لَهُ بِمِثْلِهَا . وَإِنْ تَرَكَهَا فَاكْتُبُوهَا لَهُ حَسَنَةً - إِنَّمَا تَرَكَهَا مِنْ جَرَّاىَ \" . وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا أَحْسَنَ أَحَدُكُمْ إِسْلاَمَهُ فَكُلُّ حَسَنَةٍ يَعْمَلُهَا تُكْتَبُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ وَكُلُّ سَيِّئَةٍ يَعْمَلُهَا تُكْتَبُ بِمِثْلِهَا حَتَّى يَلْقَى اللَّهَ \" ."
  },
  "130": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 130\nIn-book reference  : Book 1, Hadith 244\nUSC-MSA web (English) reference  : Book 1, Hadith 236\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ هَمَّ بِحَسَنَةٍ فَلَمْ يَعْمَلْهَا كُتِبَتْ لَهُ حَسَنَةً وَمَنْ هَمَّ بِحَسَنَةٍ فَعَمِلَهَا كُتِبَتْ لَهُ عَشْرًا إِلَى سَبْعِمِائَةِ ضِعْفٍ وَمَنْ هَمَّ بِسَيِّئَةٍ فَلَمْ يَعْمَلْهَا لَمْ تُكْتَبْ وَإِنْ عَمِلَهَا كُتِبَتْ \" ."
  },
  "131": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 131b\nIn-book reference  : Book 1, Hadith 246\nUSC-MSA web (English) reference  : Book 1, Hadith 238\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنِ الْجَعْدِ أَبِي عُثْمَانَ، فِي هَذَا الإِسْنَادِ بِمَعْنَى حَدِيثِ عَبْدِ الْوَارِثِ . وَزَادَ \" وَمَحَاهَا اللَّهُ وَلاَ يَهْلِكُ عَلَى اللَّهِ إِلاَّ هَالِكٌ \" ."
  },
  "132": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 132b\nIn-book reference  : Book 1, Hadith 248\nUSC-MSA web (English) reference  : Book 1, Hadith 240\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ بْنِ أَبِي رَوَّادٍ، وَأَبُو بَكْرِ بْنُ إِسْحَاقَ قَالاَ حَدَّثَنَا أَبُو الْجَوَّابِ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، كِلاَهُمَا عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ ."
  },
  "133": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 133\nIn-book reference  : Book 1, Hadith 249\nUSC-MSA web (English) reference  : Book 1, Hadith 241\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يُوسُفُ بْنُ يَعْقُوبَ الصَّفَّارُ، حَدَّثَنِي عَلِيُّ بْنُ عَثَّامٍ، عَنْ سُعَيْرِ بْنِ الْخِمْسِ، عَنْ مُغِيرَةَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ سُئِلَ النَّبِيُّ صلى الله عليه وسلم عَنِ الْوَسْوَسَةِ قَالَ \" تِلْكَ مَحْضُ الإِيمَانِ \" ."
  },
  "134": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 134d\nIn-book reference  : Book 1, Hadith 253\nUSC-MSA web (English) reference  : Book 1, Hadith 245\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ قَالَ ابْنُ شِهَابٍ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَأْتِي الْعَبْدَ الشَّيْطَانُ فَيَقُولُ مَنْ خَلَقَ كَذَا وَكَذَا \" مِثْلَ حَدِيثِ ابْنِ أَخِي ابْنِ شِهَابٍ ."
  },
  "135": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 135d\nIn-book reference  : Book 1, Hadith 257\nUSC-MSA web (English) reference  : Book 1, Hadith 249\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرُ بْنُ بُرْقَانَ، حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيَسْأَلَنَّكُمُ النَّاسُ عَنْ كُلِّ شَىْءٍ حَتَّى يَقُولُوا اللَّهُ خَلَقَ كُلَّ شَىْءٍ فَمَنْ خَلَقَهُ \" ."
  },
  "136": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 136b\nIn-book reference  : Book 1, Hadith 259\nUSC-MSA web (English) reference  : Book 1, Hadith 251\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كِلاَهُمَا عَنِ الْمُخْتَارِ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْحَدِيثِ غَيْرَ أَنَّ إِسْحَاقَ لَمْ يَذْكُرْ قَالَ \" قَالَ اللَّهُ إِنَّ أُمَّتَكَ \" ."
  },
  "137": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 137b\nIn-book reference  : Book 1, Hadith 261\nUSC-MSA web (English) reference  : Book 1, Hadith 253\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، جَمِيعًا عَنْ أَبِي أُسَامَةَ، عَنِ الْوَلِيدِ بْنِ كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ كَعْبٍ، أَنَّهُ سَمِعَ أَخَاهُ عَبْدَ اللَّهِ بْنَ كَعْبٍ، يُحَدِّثُ أَنَّ أَبَا أُمَامَةَ الْحَارِثِيَّ، حَدَّثَهُ أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "138": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 138c\nIn-book reference  : Book 1, Hadith 264\nUSC-MSA web (English) reference  : Book 1, Hadith 256\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ الْمَكِّيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ جَامِعِ بْنِ أَبِي رَاشِدٍ، وَعَبْدِ الْمَلِكِ بْنِ أَعْيَنَ، سَمِعَا شَقِيقَ بْنَ سَلَمَةَ، يَقُولُ سَمِعْتُ ابْنَ مَسْعُودٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ حَلَفَ عَلَى مَالِ امْرِئٍ مُسْلِمٍ بِغَيْرِ حَقِّهِ لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ \" قَالَ عَبْدُ اللَّهِ ثُمَّ قَرَأَ عَلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم مِصْدَاقَهُ مِنْ كِتَابِ اللَّهِ { إِنَّ الَّذِينَ يَشْتَرُونَ بِعَهْدِ اللَّهِ وَأَيْمَانِهِمْ ثَمَنًا قَلِيلاً} إِلَى آخِرِ الآيَةِ ."
  },
  "139": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 139b\nIn-book reference  : Book 1, Hadith 266\nUSC-MSA web (English) reference  : Book 1, Hadith 258\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، جَمِيعًا عَنْ أَبِي الْوَلِيدِ، قَالَ زُهَيْرٌ حَدَّثَنَا هِشَامُ بْنُ عَبْدِ الْمَلِكِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ عَلْقَمَةَ بْنِ وَائِلٍ، عَنْ وَائِلِ بْنِ حُجْرٍ، قَالَ كُنْتُ عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَأَتَاهُ رَجُلاَنِ يَخْتَصِمَانِ فِي أَرْضٍ فَقَالَ أَحَدُهُمَا إِنَّ هَذَا انْتَزَى عَلَى أَرْضِي يَا رَسُولَ اللَّهِ فِي الْجَاهِلِيَّةِ - وَهُوَ امْرُؤُ الْقَيْسِ بْنُ عَابِسٍ الْكِنْدِيُّ وَخَصْمُهُ رَبِيعَةُ بْنُ عِبْدَانَ - قَالَ \" بَيِّنَتُكَ \" . قَالَ لَيْسَ لِي بَيِّنَةٌ . قَالَ \" يَمِينُهُ \" . قَالَ إِذًا يَذْهَبُ بِهَا . قَالَ \" لَيْسَ لَكَ إِلاَّ ذَاكَ \" . قَالَ فَلَمَّا قَامَ لِيَحْلِفَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنِ اقْتَطَعَ أَرْضًا ظَالِمًا لَقِيَ اللَّهَ وَهُوَ عَلَيْهِ غَضْبَانُ \" . قَالَ إِسْحَاقُ فِي رِوَايَتِهِ رَبِيعَةُ بْنُ عَيْدَانَ ."
  },
  "140": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 140\nIn-book reference  : Book 1, Hadith 267\nUSC-MSA web (English) reference  : Book 1, Hadith 259\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ مَخْلَدٍ - حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَرَأَيْتَ إِنْ جَاءَ رَجُلٌ يُرِيدُ أَخْذَ مَالِي قَالَ \" فَلاَ تُعْطِهِ مَالَكَ \" . قَالَ أَرَأَيْتَ إِنْ قَاتَلَنِي قَالَ \" قَاتِلْهُ \" . قَالَ أَرَأَيْتَ إِنْ قَتَلَنِي قَالَ \" فَأَنْتَ شَهِيدٌ \" . قَالَ أَرَأَيْتَ إِنْ قَتَلْتُهُ قَالَ \" هُوَ فِي النَّارِ \" ."
  },
  "141": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 141b\nIn-book reference  : Book 1, Hadith 269\nUSC-MSA web (English) reference  : Book 1, Hadith 260\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، كِلاَهُمَا عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "142": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 142d\nIn-book reference  : Book 1, Hadith 273\nUSC-MSA web (English) reference  : Book 1, Hadith 264\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو غَسَّانَ الْمِسْمَعِيُّ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، عَنْ أَبِي الْمَلِيحِ، أَنَّ عُبَيْدَ اللَّهِ بْنَ زِيَادٍ، عَادَ مَعْقِلَ بْنَ يَسَارٍ فِي مَرَضِهِ فَقَالَ لَهُ مَعْقِلٌ إِنِّي مُحَدِّثُكَ بِحَدِيثٍ لَوْلاَ أَنِّي فِي الْمَوْتِ لَمْ أُحَدِّثْكَ بِهِ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَا مِنْ أَمِيرٍ يَلِي أَمْرَ الْمُسْلِمِينَ ثُمَّ لاَ يَجْهَدُ لَهُمْ وَيَنْصَحُ إِلاَّ لَمْ يَدْخُلْ مَعَهُمُ الْجَنَّةَ \" ."
  },
  "143": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 143b\nIn-book reference  : Book 1, Hadith 275\nUSC-MSA web (English) reference  : Book 1, Hadith 266\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي وَوَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، جَمِيعًا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "144": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 144c\nIn-book reference  : Book 1, Hadith 278\nUSC-MSA web (English) reference  : Book 1, Hadith 269\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، وَعَمْرُو بْنُ عَلِيٍّ، وَعُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، قَالُوا حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي عَدِيٍّ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ نُعَيْمِ بْنِ أَبِي هِنْدٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ، أَنَّ عُمَرَ، قَالَ مَنْ يُحَدِّثُنَا أَوْ قَالَ أَيُّكُمْ يُحَدِّثُنَا - وَفِيهِمْ حُذَيْفَةُ - مَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الْفِتْنَةِ قَالَ حُذَيْفَةُ أَنَا . وَسَاقَ الْحَدِيثَ كَنَحْوِ حَدِيثِ أَبِي مَالِكٍ عَنْ رِبْعِيٍّ وَقَالَ فِي الْحَدِيثِ قَالَ حُذَيْفَةُ حَدَّثْتُهُ حَدِيثًا لَيْسَ بِالأَغَالِيطِ وَقَالَ يَعْنِي أَنَّهُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "145": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 145\nIn-book reference  : Book 1, Hadith 279\nUSC-MSA web (English) reference  : Book 1, Hadith 270\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبَّادٍ، وَابْنُ أَبِي عُمَرَ، جَمِيعًا عَنْ مَرْوَانَ الْفَزَارِيِّ، قَالَ ابْنُ عَبَّادٍ حَدَّثَنَا مَرْوَانُ، عَنْ يَزِيدَ، - يَعْنِي ابْنَ كَيْسَانَ - عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" بَدَأَ الإِسْلاَمُ غَرِيبًا وَسَيَعُودُ كَمَا بَدَأَ غَرِيبًا فَطُوبَى لِلْغُرَبَاءِ \" ."
  },
  "146": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 146\nIn-book reference  : Book 1, Hadith 280\nUSC-MSA web (English) reference  : Book 1, Hadith 271\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَالْفَضْلُ بْنُ سَهْلٍ الأَعْرَجُ، قَالاَ حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا عَاصِمٌ، - وَهُوَ ابْنُ مُحَمَّدٍ الْعُمَرِيُّ - عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ الإِسْلاَمَ بَدَأَ غَرِيبًا وَسَيَعُودُ غَرِيبًا كَمَا بَدَأَ وَهُوَ يَأْرِزُ بَيْنَ الْمَسْجِدَيْنِ كَمَا تَأْرِزُ الْحَيَّةُ فِي جُحْرِهَا \" ."
  },
  "147": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 147\nIn-book reference  : Book 1, Hadith 281\nUSC-MSA web (English) reference  : Book 1, Hadith 272\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الإِيمَانَ لَيَأْرِزُ إِلَى الْمَدِينَةِ كَمَا تَأْرِزُ الْحَيَّةُ إِلَى جُحْرِهَا \" ."
  },
  "148": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 148b\nIn-book reference  : Book 1, Hadith 283\nUSC-MSA web (English) reference  : Book 1, Hadith 274\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَقُومُ السَّاعَةُ عَلَى أَحَدٍ يَقُولُ اللَّهُ اللَّهُ \" ."
  },
  "149": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 149\nIn-book reference  : Book 1, Hadith 284\nUSC-MSA web (English) reference  : Book 1, Hadith 275\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالُوا حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ حُذَيْفَةَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ \" أَحْصُوا لِي كَمْ يَلْفِظُ الإِسْلاَمَ \" . قَالَ فَقُلْنَا يَا رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَخَافُ عَلَيْنَا وَنَحْنُ مَا بَيْنَ السِّتِّمِائَةِ إِلَى السَّبْعِمِائَةِ قَالَ \" إِنَّكُمْ لاَ تَدْرُونَ لَعَلَّكُمْ أَنْ تُبْتَلَوْا \" . قَالَ فَابْتُلِينَا حَتَّى جَعَلَ الرَّجُلُ مِنَّا لاَ يُصَلِّي إِلاَّ سِرًّا ."
  },
  "150": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 150d\nIn-book reference  : Book 1, Hadith 288\nUSC-MSA web (English) reference  : Book 1, Hadith 279\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا الْحَسَنُ الْحُلْوَانِيُّ، حَدَّثَنَا يَعْقُوبُ، حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنْ إِسْمَاعِيلَ بْنِ مُحَمَّدٍ، قَالَ سَمِعْتُ مُحَمَّدَ بْنَ سَعْدٍ، يُحَدِّثُ هَذَا فَقَالَ فِي حَدِيثِهِ فَضَرَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ بَيْنَ عُنُقِي وَكَتِفِي ثُمَّ قَالَ \" أَقِتَالاً أَىْ سَعْدُ إِنِّي لأُعْطِي الرَّجُلَ \" ."
  },
  "151": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 151b\nIn-book reference  : Book 1, Hadith 290\nUSC-MSA web (English) reference  : Book 1, Hadith 281\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي بِهِ، إِنْ شَاءَ اللَّهُ عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ الضُّبَعِيُّ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، عَنِ الزُّهْرِيِّ، أَنَّ سَعِيدَ بْنَ الْمُسَيَّبِ، وَأَبَا، عُبَيْدٍ أَخْبَرَاهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ يُونُسَ عَنِ الزُّهْرِيِّ وَفِي حَدِيثِ مَالِكٍ \" وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي \" . قَالَ ثُمَّ قَرَأَ هَذِهِ الآيَةَ حَتَّى جَازَهَا .\nحَدَّثَنَاهُ عَبْدُ بْنُ حُمَيْدٍ، قَالَ حَدَّثَنِي يَعْقُوبُ، - يَعْنِي ابْنَ إِبْرَاهِيمَ بْنِ سَعْدٍ - حَدَّثَنَا أَبُو أُوَيْسٍ، عَنِ الزُّهْرِيِّ، كَرِوَايَةِ مَالِكٍ بِإِسْنَادِهِ وَقَالَ ثُمَّ قَرَأَ هَذِهِ الآيَةَ حَتَّى أَنْجَزَهَا ."
  },
  "152": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 152\nIn-book reference  : Book 1, Hadith 291\nUSC-MSA web (English) reference  : Book 1, Hadith 283\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَا مِنَ الأَنْبِيَاءِ مِنْ نَبِيٍّ إِلاَّ قَدْ أُعْطِيَ مِنَ الآيَاتِ مَا مِثْلُهُ آمَنَ عَلَيْهِ الْبَشَرُ وَإِنَّمَا كَانَ الَّذِي أُوتِيتُ وَحْيًا أَوْحَى اللَّهُ إِلَىَّ فَأَرْجُو أَنْ أَكُونَ أَكْثَرَهُمْ تَابِعًا يَوْمَ الْقِيَامَةِ \" ."
  },
  "153": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 153\nIn-book reference  : Book 1, Hadith 292\nUSC-MSA web (English) reference  : Book 1, Hadith 284\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ وَأَخْبَرَنِي عَمْرٌو، أَنَّ أَبَا يُونُسَ، حَدَّثَهُ عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لاَ يَسْمَعُ بِي أَحَدٌ مِنْ هَذِهِ الأُمَّةِ يَهُودِيٌّ وَلاَ نَصْرَانِيٌّ ثُمَّ يَمُوتُ وَلَمْ يُؤْمِنْ بِالَّذِي أُرْسِلْتُ بِهِ إِلاَّ كَانَ مِنْ أَصْحَابِ النَّارِ \" ."
  },
  "154": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 154a\nIn-book reference  : Book 1, Hadith 293\nUSC-MSA web (English) reference  : Book 1, Hadith 285\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ صَالِحِ بْنِ صَالِحٍ الْهَمْدَانِيِّ، عَنِ الشَّعْبِيِّ، قَالَ رَأَيْتُ رَجُلاً مِنْ أَهْلِ خُرَاسَانَ سَأَلَ الشَّعْبِيَّ فَقَالَ يَا أَبَا عَمْرٍو إِنَّ مَنْ قِبَلَنَا مِنْ أَهْلِ خُرَاسَانَ يَقُولُونَ فِي الرَّجُلِ إِذَا أَعْتَقَ أَمَتَهُ ثُمَّ تَزَوَّجَهَا فَهُوَ كَالرَّاكِبِ بَدَنَتَهُ . فَقَالَ الشَّعْبِيُّ حَدَّثَنِي أَبُو بُرْدَةَ بْنُ أَبِي مُوسَى عَنْ أَبِيهِ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" ثَلاَثَةٌ يُؤْتَوْنَ أَجْرَهُمْ مَرَّتَيْنِ رَجُلٌ مِنْ أَهْلِ الْكِتَابِ آمَنَ بِنَبِيِّهِ وَأَدْرَكَ النَّبِيَّ صلى الله عليه وسلم فَآمَنَ بِهِ وَاتَّبَعَهُ وَصَدَّقَهُ فَلَهُ أَجْرَانِ وَعَبْدٌ مَمْلُوكٌ أَدَّى حَقَّ اللَّهِ تَعَالَى وَحَقَّ سَيِّدِهِ فَلَهُ أَجْرَانِ وَرَجُلٌ كَانَتْ لَهُ أَمَةٌ فَغَذَاهَا فَأَحْسَنَ غِذَاءَهَا ثُمَّ أَدَّبَهَا فَأَحْسَنَ أَدَبَهَا ثُمَّ أَعْتَقَهَا وَتَزَوَّجَهَا فَلَهُ أَجْرَانِ \" . ثُمَّ قَالَ الشَّعْبِيُّ لِلْخُرَاسَانِيِّ خُذْ هَذَا الْحَدِيثَ بِغَيْرِ شَىْءٍ . فَقَدْ كَانَ الرَّجُلُ يَرْحَلُ فِيمَا دُونَ هَذَا إِلَى الْمَدِينَةِ .\nوَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، كُلُّهُمْ عَنْ صَالِحِ بْنِ صَالِحٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "155": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 155f\nIn-book reference  : Book 1, Hadith 299\nUSC-MSA web (English) reference  : Book 1, Hadith 292\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنِي الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ ابْنِ شِهَابٍ، عَنْ نَافِعٍ، مَوْلَى أَبِي قَتَادَةَ عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" كَيْفَ أَنْتُمْ إِذَا نَزَلَ فِيكُمُ ابْنُ مَرْيَمَ فَأَمَّكُمْ مِنْكُمْ \" . فَقُلْتُ لاِبْنِ أَبِي ذِئْبٍ إِنَّ الأَوْزَاعِيَّ حَدَّثَنَا عَنِ الزُّهْرِيِّ عَنْ نَافِعٍ عَنْ أَبِي هُرَيْرَةَ \" وَإِمَامُكُمْ مِنْكُمْ \" . قَالَ ابْنُ أَبِي ذِئْبٍ تَدْرِي مَا أَمَّكُمْ مِنْكُمْ قُلْتُ تُخْبِرُنِي . قَالَ فَأَمَّكُمْ بِكِتَابِ رَبِّكُمْ تَبَارَكَ وَتَعَالَى وَسُنَّةِ نَبِيِّكُمْ صلى الله عليه وسلم ."
  },
  "156": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 156\nIn-book reference  : Book 1, Hadith 300\nUSC-MSA web (English) reference  : Book 1, Hadith 293\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا الْوَلِيدُ بْنُ شُجَاعٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالُوا حَدَّثَنَا حَجَّاجٌ، - وَهُوَ ابْنُ مُحَمَّدٍ - عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَةِ - قَالَ - فَيَنْزِلُ عِيسَى ابْنُ مَرْيَمَ صلى الله عليه وسلم فَيَقُولُ أَمِيرُهُمْ تَعَالَ صَلِّ لَنَا . فَيَقُولُ لاَ . إِنَّ بَعْضَكُمْ عَلَى بَعْضٍ أُمَرَاءُ . تَكْرِمَةَ اللَّهِ هَذِهِ الأُمَّةَ \" ."
  },
  "157": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 157b\nIn-book reference  : Book 1, Hadith 302\nUSC-MSA web (English) reference  : Book 1, Hadith 295\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَابْنُ، نُمَيْرٍ وَأَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا ابْنُ فُضَيْلٍ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، كِلاَهُمَا عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنْ عَبْدِ اللَّهِ بْنِ ذَكْوَانَ، عَنْ عَبْدِ الرَّحْمَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ الْعَلاَءِ عَنْ أَبِيهِ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "158": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 158\nIn-book reference  : Book 1, Hadith 303\nUSC-MSA web (English) reference  : Book 1, Hadith 296\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ الأَزْرَقُ، جَمِيعًا عَنْ فُضَيْلِ بْنِ غَزْوَانَ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ - وَاللَّفْظُ لَهُ - حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ثَلاَثٌ إِذَا خَرَجْنَ لاَ يَنْفَعُ نَفْسًا إِيمَانُهَا لَمْ تَكُنْ آمَنَتْ مِنْ قَبْلُ أَوْ كَسَبَتْ فِي إِيمَانِهَا خَيْرًا طُلُوعُ الشَّمْسِ مِنْ مَغْرِبِهَا وَالدَّجَّالُ وَدَابَّةُ الأَرْضِ \" ."
  },
  "159": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 159d\nIn-book reference  : Book 1, Hadith 307\nUSC-MSA web (English) reference  : Book 1, Hadith 300\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو سَعِيدٍ الأَشَجُّ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ الأَشَجُّ، حَدَّثَنَا - وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ قَوْلِ اللَّهِ تَعَالَى { وَالشَّمْسُ تَجْرِي لِمُسْتَقَرٍّ لَهَا} قَالَ \" مُسْتَقَرُّهَا تَحْتَ الْعَرْشِ \" ."
  },
  "160": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 160c\nIn-book reference  : Book 1, Hadith 310\nUSC-MSA web (English) reference  : Book 1, Hadith 303\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي عُقَيْلُ بْنُ خَالِدٍ، قَالَ ابْنُ شِهَابٍ سَمِعْتُ عُرْوَةَ بْنَ الزُّبَيْرِ، يَقُولُ قَالَتْ عَائِشَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم فَرَجَعَ إِلَى خَدِيجَةَ يَرْجُفُ فُؤَادُهُ وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ يُونُسَ وَمَعْمَرٍ وَلَمْ يَذْكُرْ أَوَّلَ حَدِيثِهِمَا مِنْ قَوْلِهِ أَوَّلُ مَا بُدِئَ بِهِ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْوَحْىِ الرُّؤْيَا الصَّادِقَةُ . وَتَابَعَ يُونُسَ عَلَى قَوْلِهِ فَوَاللَّهِ لاَ يُخْزِيكَ اللَّهُ أَبَدًا . وَذَكَرَ قَوْلَ خَدِيجَةَ أَىِ ابْنَ عَمِّ اسْمَعْ مِنِ ابْنِ أَخِيكَ ."
  },
  "161": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 161e\nIn-book reference  : Book 1, Hadith 315\nUSC-MSA web (English) reference  : Book 1, Hadith 308\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، أَخْبَرَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، بِهَذَا الإِسْنَادِ وَقَالَ \" فَإِذَا هُوَ جَالِسٌ عَلَى عَرْشٍ بَيْنَ السَّمَاءِ وَالأَرْضِ \" ."
  },
  "162": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 162\nIn-book reference  : Book 1, Hadith 319\nUSC-MSA web (English) reference  : Book 1, Hadith 312\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي سُلَيْمَانُ، - وَهُوَ ابْنُ بِلاَلٍ - قَالَ حَدَّثَنِي شَرِيكُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي نَمِرٍ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُنَا عَنْ لَيْلَةَ، أُسْرِيَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ مَسْجِدِ الْكَعْبَةِ أَنَّهُ جَاءَهُ ثَلاَثَةُ نَفَرٍ قَبْلَ أَنْ يُوحَى إِلَيْهِ وَهُوَ نَائِمٌ فِي الْمَسْجِدِ الْحَرَامِ وَسَاقَ الْحَدِيثَ بِقِصَّتِهِ نَحْوَ حَدِيثِ ثَابِتٍ الْبُنَانِيِّ وَقَدَّمَ فِيهِ شَيْئًا وَأَخَّرَ وَزَادَ وَنَقَصَ ."
  },
  "163": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 163\nIn-book reference  : Book 1, Hadith 320\nUSC-MSA web (English) reference  : Book 1, Hadith 313\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ أَبُو ذَرٍّ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" فُرِجَ سَقْفُ بَيْتِي وَأَنَا بِمَكَّةَ فَنَزَلَ جِبْرِيلُ صلى الله عليه وسلم فَفَرَجَ صَدْرِي ثُمَّ غَسَلَهُ مِنْ مَاءِ زَمْزَمَ ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا فَأَفْرَغَهَا فِي صَدْرِي ثُمَّ أَطْبَقَهُ ثُمَّ أَخَذَ بِيَدِي فَعَرَجَ بِي إِلَى السَّمَاءِ فَلَمَّا جِئْنَا السَّمَاءَ الدُّنْيَا قَالَ جِبْرِيلُ - عَلَيْهِ السَّلاَمُ - لِخَازِنِ السَّمَاءِ الدُّنْيَا افْتَحْ . قَالَ مَنْ هَذَا قَالَ هَذَا جِبْرِيلُ . قَالَ هَلْ مَعَكَ أَحَدٌ قَالَ نَعَمْ مَعِيَ مُحَمَّدٌ صلى الله عليه وسلم . قَالَ فَأُرْسِلَ إِلَيْهِ قَالَ نَعَمْ فَفَتَحَ - قَالَ - فَلَمَّا عَلَوْنَا السَّمَاءَ الدُّنْيَا فَإِذَا رَجُلٌ عَنْ يَمِينِهِ أَسْوِدَةٌ وَعَنْ يَسَارِهِ أَسْوِدَةٌ - قَالَ - فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى - قَالَ - فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ - قَالَ - قُلْتُ يَا جِبْرِيلُ مَنْ هَذَا قَالَ هَذَا آدَمُ صلى الله عليه وسلم وَهَذِهِ الأَسْوِدَةُ عَنْ يَمِينِهِ وَعَنْ شِمَالِهِ نَسَمُ بَنِيهِ فَأَهْلُ الْيَمِينِ أَهْلُ الْجَنَّةِ وَالأَسْوِدَةُ الَّتِي عَنْ شِمَالِهِ أَهْلُ النَّارِ فَإِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى - قَالَ - ثُمَّ عَرَجَ بِي جِبْرِيلُ حَتَّى أَتَى السَّمَاءَ الثَّانِيَةَ . فَقَالَ لِخَازِنِهَا افْتَحْ - قَالَ - فَقَالَ لَهُ خَازِنُهَا مِثْلَ مَا قَالَ خَازِنُ السَّمَاءِ الدُّنْيَا فَفَتَحَ \" . فَقَالَ أَنَسُ بْنُ مَالِكٍ فَذَكَرَ أَنَّهُ وَجَدَ فِي السَّمَوَاتِ آدَمَ وَإِدْرِيسَ وَعِيسَى وَمُوسَى وَإِبْرَاهِيمَ - صَلَوَاتُ اللَّهِ عَلَيْهِمْ أَجْمَعِينَ - وَلَمْ يُثْبِتْ كَيْفَ مَنَازِلُهُمْ غَيْرَ أَنَّهُ ذَكَرَ أَنَّهُ قَدْ وَجَدَ آدَمَ - عَلَيْهِ السَّلاَمُ - فِي السَّمَاءِ الدُّنْيَا وَإِبْرَاهِيمَ فِي السَّمَاءِ السَّادِسَةِ . قَالَ \" فَلَمَّا مَرَّ جِبْرِيلُ وَرَسُولُ اللَّهِ صلى الله عليه وسلم بِإِدْرِيسَ - صَلَوَاتُ اللَّهِ عَلَيْهِ - قَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ - قَالَ - ثُمَّ مَرَّ فَقُلْتُ مَنْ هَذَا فَقَالَ هَذَا إِدْرِيسُ - قَالَ - ثُمَّ مَرَرْتُ بِمُوسَى - عَلَيْهِ السَّلاَمُ - فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ - قَالَ - قُلْتُ مَنْ هَذَا قَالَ هَذَا مُوسَى - قَالَ - ثُمَّ مَرَرْتُ بِعِيسَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ . قُلْتُ مَنْ هَذَا قَالَ عِيسَى ابْنُ مَرْيَمَ - قَالَ - ثُمَّ مَرَرْتُ بِإِبْرَاهِيمَ - عَلَيْهِ السَّلاَمُ - فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ - قَالَ - قُلْتُ مَنْ هَذَا قَالَ هَذَا إِبْرَاهِيمُ \" . قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي ابْنُ حَزْمٍ أَنَّ ابْنَ عَبَّاسٍ وَأَبَا حَبَّةَ الأَنْصَارِيَّ كَانَا يَقُولاَنِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ثُمَّ عَرَجَ بِي حَتَّى ظَهَرْتُ لِمُسْتَوًى أَسْمَعُ فِيهِ صَرِيفَ الأَقْلاَمِ \" . قَالَ ابْنُ حَزْمٍ وَ أَنَسُ بْنُ مَالِكٍ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" فَفَرَضَ اللَّهُ عَلَى أُمَّتِي خَمْسِينَ صَلاَةً - قَالَ - فَرَجَعْتُ بِذَلِكَ حَتَّى أَمُرَّ بِمُوسَى فَقَالَ مُوسَى عَلَيْهِ السَّلاَمُ مَاذَا فَرَضَ رَبُّكَ عَلَى أُمَّتِكَ - قَالَ - قُلْتُ فَرَضَ عَلَيْهِمْ خَمْسِينَ صَلاَةً . قَالَ لِي مُوسَى عَلَيْهِ السَّلاَمُ فَرَاجِعْ رَبَّكَ فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ - قَالَ - فَرَاجَعْتُ رَبِّي فَوَضَعَ شَطْرَهَا - قَالَ - فَرَجَعْتُ إِلَى مُوسَى - عَلَيْهِ السَّلاَمُ - فَأَخْبَرْتُهُ قَالَ رَاجِعْ رَبَّكَ فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ - قَالَ - فَرَاجَعْتُ رَبِّي فَقَالَ هِيَ خَمْسٌ وَهْىَ خَمْسُونَ لاَ يُبَدَّلُ الْقَوْلُ لَدَىَّ - قَالَ - فَرَجَعْتُ إِلَى مُوسَى فَقَالَ رَاجِعْ رَبَّكَ . فَقُلْتُ قَدِ اسْتَحْيَيْتُ مِنْ رَبِّي - قَالَ - ثُمَّ انْطَلَقَ بِي جِبْرِيلُ حَتَّى نَأْتِيَ سِدْرَةَ الْمُنْتَهَى فَغَشِيَهَا أَلْوَانٌ لاَ أَدْرِي مَا هِيَ - قَالَ - ثُمَّ أُدْخِلْتُ الْجَنَّةَ فَإِذَا فِيهَا جَنَابِذُ اللُّؤْلُؤِ وَإِذَا تُرَابُهَا الْمِسْكُ \" ."
  },
  "164": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 164b\nIn-book reference  : Book 1, Hadith 322\nUSC-MSA web (English) reference  : Book 1, Hadith 315\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ قَتَادَةَ، حَدَّثَنَا أَنَسُ بْنُ مَالِكٍ، عَنْ مَالِكِ بْنِ صَعْصَعَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فَذَكَرَ نَحْوَهُ وَزَادَ فِيهِ \" فَأُتِيتُ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا فَشُقَّ مِنَ النَّحْرِ إِلَى مَرَاقِّ الْبَطْنِ فَغُسِلَ بِمَاءِ زَمْزَمَ ثُمَّ مُلِئَ حِكْمَةً وَإِيمَانًا \" ."
  },
  "165": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 165b\nIn-book reference  : Book 1, Hadith 324\nUSC-MSA web (English) reference  : Book 1, Hadith 317\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ قَتَادَةَ، عَنْ أَبِي الْعَالِيَةِ، حَدَّثَنَا ابْنُ عَمِّ، نَبِيِّكُمْ صلى الله عليه وسلم ابْنُ عَبَّاسٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَرَرْتُ لَيْلَةَ أُسْرِيَ بِي عَلَى مُوسَى بْنِ عِمْرَانَ - عَلَيْهِ السَّلاَمُ - رَجُلٌ آدَمُ طُوَالٌ جَعْدٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ وَرَأَيْتُ عِيسَى ابْنَ مَرْيَمَ مَرْبُوعَ الْخَلْقِ إِلَى الْحُمْرَةِ وَالْبَيَاضِ سَبِطَ الرَّأْسِ \" . وَأُرِيَ مَالِكًا خَازِنَ النَّارِ وَالدَّجَّالَ . فِي آيَاتٍ أَرَاهُنَّ اللَّهُ إِيَّاهُ فَلاَ تَكُنْ فِي مِرْيَةٍ مِنْ لِقَائِهِ . قَالَ كَانَ قَتَادَةُ يُفَسِّرُهَا أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَدْ لَقِيَ مُوسَى عَلَيْهِ السَّلاَمُ ."
  },
  "166": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 166c\nIn-book reference  : Book 1, Hadith 327\nUSC-MSA web (English) reference  : Book 1, Hadith 320\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ عَوْنٍ، عَنْ مُجَاهِدٍ، قَالَ كُنَّا عِنْدَ ابْنِ عَبَّاسٍ فَذَكَرُوا الدَّجَّالَ فَقَالَ إِنَّهُ مَكْتُوبٌ بَيْنَ عَيْنَيْهِ كَافِرٌ . قَالَ فَقَالَ ابْنُ عَبَّاسٍ لَمْ أَسْمَعْهُ . قَالَ ذَاكَ وَلَكِنَّهُ قَالَ \" أَمَّا إِبْرَاهِيمُ فَانْظُرُوا إِلَى صَاحِبِكُمْ وَأَمَّا مُوسَى فَرَجُلٌ آدَمُ جَعْدٌ عَلَى جَمَلٍ أَحْمَرَ مَخْطُومٍ بِخُلْبَةٍ كَأَنِّي أَنْظُرُ إِلَيْهِ إِذَا انْحَدَرَ فِي الْوَادِي يُلَبِّي \" ."
  },
  "167": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 167\nIn-book reference  : Book 1, Hadith 328\nUSC-MSA web (English) reference  : Book 1, Hadith 321\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" عُرِضَ عَلَىَّ الأَنْبِيَاءُ فَإِذَا مُوسَى ضَرْبٌ مِنَ الرِّجَالِ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ وَرَأَيْتُ عِيسَى ابْنَ مَرْيَمَ - عَلَيْهِ السَّلاَمُ - فَإِذَا أَقْرَبُ مَنْ رَأَيْتُ بِهِ شَبَهًا عُرْوَةُ بْنُ مَسْعُودٍ وَرَأَيْتُ إِبْرَاهِيمَ صَلَوَاتُ اللَّهِ عَلَيْهِ فَإِذَا أَقْرَبُ مَنْ رَأَيْتُ بِهِ شَبَهًا صَاحِبُكُمْ - يَعْنِي نَفْسَهُ - وَرَأَيْتُ جِبْرِيلَ - عَلَيْهِ السَّلاَمُ - فَإِذَا أَقْرَبُ مَنْ رَأَيْتُ بِهِ شَبَهًا دِحْيَةُ \" . وَفِي رِوَايَةِ ابْنِ رُمْحٍ \" دِحْيَةُ بْنُ خَلِيفَةَ \" ."
  },
  "168": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 168\nIn-book reference  : Book 1, Hadith 329\nUSC-MSA web (English) reference  : Book 1, Hadith 322\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، - وَتَقَارَبَا فِي اللَّفْظِ - قَالَ ابْنُ رَافِعٍ حَدَّثَنَا وَقَالَ عَبْدٌ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم \" حِينَ أُسْرِيَ بِي لَقِيتُ مُوسَى - عَلَيْهِ السَّلاَمُ - \" . فَنَعَتَهُ النَّبِيُّ صلى الله عليه وسلم \" فَإِذَا رَجُلٌ - حَسِبْتُهُ قَالَ - مُضْطَرِبٌ رَجِلُ الرَّأْسِ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ - قَالَ - وَلَقِيتُ عِيسَى \" . فَنَعَتَهُ النَّبِيُّ صلى الله عليه وسلم \" فَإِذَا رَبْعَةٌ أَحْمَرُ كَأَنَّمَا خَرَجَ مِنْ دِيمَاسٍ \" . - يَعْنِي حَمَّامًا - قَالَ \" وَرَأَيْتُ إِبْرَاهِيمَ - صَلَوَاتُ اللَّهِ عَلَيْهِ - وَأَنَا أَشْبَهُ وَلَدِهِ بِهِ - قَالَ - فَأُتِيتُ بِإِنَاءَيْنِ فِي أَحَدِهِمَا لَبَنٌ وَفِي الآخَرِ خَمْرٌ فَقِيلَ لِي خُذْ أَيَّهُمَا شِئْتَ . فَأَخَذْتُ اللَّبَنَ فَشَرِبْتُهُ . فَقَالَ هُدِيتَ الْفِطْرَةَ أَوْ أَصَبْتَ الْفِطْرَةَ أَمَا إِنَّكَ لَوْ أَخَذْتَ الْخَمْرَ غَوَتْ أُمَّتُكَ \" ."
  },
  "169": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 169c\nIn-book reference  : Book 1, Hadith 332\nUSC-MSA web (English) reference  : Book 1, Hadith 325\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا حَنْظَلَةُ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" رَأَيْتُ عِنْدَ الْكَعْبَةِ رَجُلاً آدَمَ سَبِطَ الرَّأْسِ وَاضِعًا يَدَيْهِ عَلَى رَجُلَيْنِ . يَسْكُبُ رَأْسُهُ - أَوْ يَقْطُرُ رَأْسُهُ - فَسَأَلْتُ مَنْ هَذَا فَقَالُوا عِيسَى ابْنُ مَرْيَمَ أَوِ الْمَسِيحُ ابْنُ مَرْيَمَ - لاَ نَدْرِي أَىَّ ذَلِكَ قَالَ - وَرَأَيْتُ وَرَاءَهُ رَجُلاً أَحْمَرَ جَعْدَ الرَّأْسِ أَعْوَرَ الْعَيْنِ الْيُمْنَى أَشْبَهُ مَنْ رَأَيْتُ بِهِ ابْنُ قَطَنٍ فَسَأَلْتُ مَنْ هَذَا فَقَالُوا الْمَسِيحُ الدَّجَّالُ \" ."
  },
  "170": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 170\nIn-book reference  : Book 1, Hadith 333\nUSC-MSA web (English) reference  : Book 1, Hadith 326\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَمَّا كَذَّبَتْنِي قُرَيْشٌ قُمْتُ فِي الْحِجْرِ فَجَلاَ اللَّهُ لِي بَيْتَ الْمَقْدِسِ فَطَفِقْتُ أُخْبِرُهُمْ عَنْ آيَاتِهِ وَأَنَا أَنْظُرُ إِلَيْهِ \" ."
  },
  "171": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 171\nIn-book reference  : Book 1, Hadith 334\nUSC-MSA web (English) reference  : Book 1, Hadith 327\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" بَيْنَمَا أَنَا نَائِمٌ رَأَيْتُنِي أَطُوفُ بِالْكَعْبَةِ فَإِذَا رَجُلٌ آدَمُ سَبِطُ الشَّعْرِ بَيْنَ رَجُلَيْنِ يَنْطِفُ رَأْسُهُ مَاءً - أَوْ يُهَرَاقُ رَأْسُهُ مَاءً - قُلْتُ مَنْ هَذَا قَالُوا هَذَا ابْنُ مَرْيَمَ . ثُمَّ ذَهَبْتُ أَلْتَفِتُ فَإِذَا رَجُلٌ أَحْمَرُ جَسِيمٌ جَعْدُ الرَّأْسِ أَعْوَرُ الْعَيْنِ كَأَنَّ عَيْنَهُ عِنَبَةٌ طَافِيَةٌ . قُلْتُ مَنْ هَذَا قَالُوا الدَّجَّالُ . أَقْرَبُ النَّاسِ بِهِ شَبَهًا ابْنُ قَطَنٍ \" ."
  },
  "172": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 172\nIn-book reference  : Book 1, Hadith 335\nUSC-MSA web (English) reference  : Book 1, Hadith 328\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ أَبِي سَلَمَةَ - عَنْ عَبْدِ اللَّهِ بْنِ الْفَضْلِ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَقَدْ رَأَيْتُنِي فِي الْحِجْرِ وَقُرَيْشٌ تَسْأَلُنِي عَنْ مَسْرَاىَ فَسَأَلَتْنِي عَنْ أَشْيَاءَ مِنْ بَيْتِ الْمَقْدِسِ لَمْ أُثْبِتْهَا . فَكُرِبْتُ كُرْبَةً مَا كُرِبْتُ مِثْلَهُ قَطُّ قَالَ فَرَفَعَهُ اللَّهُ لِي أَنْظُرُ إِلَيْهِ مَا يَسْأَلُونِي عَنْ شَىْءٍ إِلاَّ أَنْبَأْتُهُمْ بِهِ وَقَدْ رَأَيْتُنِي فِي جَمَاعَةٍ مِنَ الأَنْبِيَاءِ فَإِذَا مُوسَى قَائِمٌ يُصَلِّي فَإِذَا رَجُلٌ ضَرْبٌ جَعْدٌ كَأَنَّهُ مِنْ رِجَالِ شَنُوءَةَ وَإِذَا عِيسَى ابْنُ مَرْيَمَ - عَلَيْهِ السَّلاَمُ - قَائِمٌ يُصَلِّي أَقْرَبُ النَّاسِ بِهِ شَبَهًا عُرْوَةُ بْنُ مَسْعُودٍ الثَّقَفِيُّ وَإِذَا إِبْرَاهِيمُ - عَلَيْهِ السَّلاَمُ - قَائِمٌ يُصَلِّي أَشْبَهُ النَّاسِ بِهِ صَاحِبُكُمْ - يَعْنِي نَفْسَهُ - فَحَانَتِ الصَّلاَةُ فَأَمَمْتُهُمْ فَلَمَّا فَرَغْتُ مِنَ الصَّلاَةِ قَالَ قَائِلٌ يَا مُحَمَّدُ هَذَا مَالِكٌ صَاحِبُ النَّارِ فَسَلِّمْ عَلَيْهِ . فَالْتَفَتُّ إِلَيْهِ فَبَدَأَنِي بِالسَّلاَمِ \" ."
  },
  "173": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 173\nIn-book reference  : Book 1, Hadith 336\nUSC-MSA web (English) reference  : Book 1, Hadith 329\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، جَمِيعًا عَنْ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالَ ابْنُ نُمَيْرٍ حَدَّثَنَا أَبِي، حَدَّثَنَا مَالِكُ بْنُ مِغْوَلٍ، عَنِ الزُّبَيْرِ بْنِ عَدِيٍّ، عَنْ طَلْحَةَ، عَنْ مُرَّةَ، عَنْ عَبْدِ اللَّهِ، قَالَ لَمَّا أُسْرِيَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم انْتُهِيَ بِهِ إِلَى سِدْرَةِ الْمُنْتَهَى وَهِيَ فِي السَّمَاءِ السَّادِسَةِ إِلَيْهَا يَنْتَهِي مَا يُعْرَجُ بِهِ مِنَ الأَرْضِ فَيُقْبَضُ مِنْهَا وَإِلَيْهَا يَنْتَهِي مَا يُهْبَطُ بِهِ مِنْ فَوْقِهَا فَيُقْبَضُ مِنْهَا قَالَ { إِذْ يَغْشَى السِّدْرَةَ مَا يَغْشَى} قَالَ فَرَاشٌ مِنْ ذَهَبٍ . قَالَ فَأُعْطِيَ رَسُولُ اللَّهِ صلى الله عليه وسلم ثَلاَثًا أُعْطِيَ الصَّلَوَاتِ الْخَمْسَ وَأُعْطِيَ خَوَاتِيمَ سُورَةِ الْبَقَرَةِ وَغُفِرَ لِمَنْ لَمْ يُشْرِكْ بِاللَّهِ مِنْ أُمَّتِهِ شَيْئًا الْمُقْحِمَاتُ ."
  },
  "174": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 174c\nIn-book reference  : Book 1, Hadith 339\nUSC-MSA web (English) reference  : Book 1, Hadith 332\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ الشَّيْبَانِيِّ، سَمِعَ زِرَّ بْنَ حُبَيْشٍ، عَنْ عَبْدِ اللَّهِ، قَالَ { لَقَدْ رَأَى مِنْ آيَاتِ رَبِّهِ الْكُبْرَى} قَالَ رَأَى جِبْرِيلَ فِي صُورَتِهِ لَهُ سِتُّمِائَةِ جَنَاحٍ ."
  },
  "175": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 175\nIn-book reference  : Book 1, Hadith 340\nUSC-MSA web (English) reference  : Book 1, Hadith 333\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَبْدِ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، { وَلَقَدْ رَآهُ نَزْلَةً أُخْرَى} قَالَ رَأَى جِبْرِيلَ ."
  },
  "176": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 176c\nIn-book reference  : Book 1, Hadith 343\nUSC-MSA web (English) reference  : Book 1, Hadith 336\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنِ الأَعْمَشِ، حَدَّثَنَا أَبُو جَهْمَةَ، بِهَذَا الإِسْنَادِ ."
  },
  "177": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 177d\nIn-book reference  : Book 1, Hadith 347\nUSC-MSA web (English) reference  : Book 1, Hadith 340\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنَا زَكَرِيَّاءُ، عَنِ ابْنِ أَشْوَعَ، عَنْ عَامِرٍ، عَنْ مَسْرُوقٍ، قَالَ قُلْتُ لِعَائِشَةَ فَأَيْنَ قَوْلُهُ { ثُمَّ دَنَا فَتَدَلَّى * فَكَانَ قَابَ قَوْسَيْنِ أَوْ أَدْنَى * فَأَوْحَى إِلَى عَبْدِهِ مَا أَوْحَى} قَالَتْ إِنَّمَا ذَاكَ جِبْرِيلُ صلى الله عليه وسلم كَانَ يَأْتِيهِ فِي صُورَةِ الرِّجَالِ وَإِنَّهُ أَتَاهُ فِي هَذِهِ الْمَرَّةِ فِي صُورَتِهِ الَّتِي هِيَ صُورَتُهُ فَسَدَّ أُفُقَ السَّمَاءِ ."
  },
  "178": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 178b\nIn-book reference  : Book 1, Hadith 349\nUSC-MSA web (English) reference  : Book 1, Hadith 342\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُعَاذُ بْنُ هِشَامٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا هَمَّامٌ، كِلاَهُمَا عَنْ قَتَادَةَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ قُلْتُ لأَبِي ذَرٍّ لَوْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم لَسَأَلْتُهُ فَقَالَ عَنْ أَىِّ شَىْءٍ كُنْتَ تَسْأَلُهُ قَالَ كُنْتُ أَسْأَلُهُ هَلْ رَأَيْتَ رَبَّكَ قَالَ أَبُو ذَرٍّ قَدْ سَأَلْتُ فَقَالَ \" رَأَيْتُ نُورًا \" ."
  },
  "179": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 179c\nIn-book reference  : Book 1, Hadith 352\nUSC-MSA web (English) reference  : Book 1, Hadith 345\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالَ حَدَّثَنِي شُعْبَةُ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ أَبِي عُبَيْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَامَ فِينَا رَسُولُ اللَّهِ صلى الله عليه وسلم بِأَرْبَعٍ \" إِنَّ اللَّهَ لاَ يَنَامُ وَلاَ يَنْبَغِي لَهُ أَنْ يَنَامَ يَرْفَعُ الْقِسْطَ وَيَخْفِضُهُ وَيُرْفَعُ إِلَيْهِ عَمَلُ النَّهَارِ بِاللَّيْلِ وَعَمَلُ اللَّيْلِ بِالنَّهَارِ \" ."
  },
  "180": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 180\nIn-book reference  : Book 1, Hadith 353\nUSC-MSA web (English) reference  : Book 1, Hadith 346\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، وَأَبُو غَسَّانَ الْمِسْمَعِيُّ وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ جَمِيعًا عَنْ عَبْدِ الْعَزِيزِ بْنِ عَبْدِ الصَّمَدِ، - وَاللَّفْظُ لأَبِي غَسَّانَ قَالَ حَدَّثَنَا أَبُو عَبْدِ الصَّمَدِ، - حَدَّثَنَا أَبُو عِمْرَانَ الْجَوْنِيُّ، عَنْ أَبِي بَكْرِ بْنِ عَبْدِ اللَّهِ بْنِ قَيْسٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" جَنَّتَانِ مِنْ فِضَّةٍ آنِيَتُهُمَا وَمَا فِيهِمَا وَجَنَّتَانِ مِنْ ذَهَبٍ آنِيَتُهُمَا وَمَا فِيهِمَا وَمَا بَيْنَ الْقَوْمِ وَبَيْنَ أَنْ يَنْظُرُوا إِلَى رَبِّهِمْ إِلاَّ رِدَاءُ الْكِبْرِيَاءِ عَلَى وَجْهِهِ فِي جَنَّةِ عَدْنٍ \" ."
  },
  "181": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 181b\nIn-book reference  : Book 1, Hadith 355\nUSC-MSA web (English) reference  : Book 1, Hadith 348\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، بِهَذَا الإِسْنَادِ وَزَادَ ثُمَّ تَلاَ هَذِهِ الآيَةَ { لِلَّذِينَ أَحْسَنُوا الْحُسْنَى وَزِيَادَةٌ}"
  },
  "182": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 182c\nIn-book reference  : Book 1, Hadith 358\nUSC-MSA web (English) reference  : Book 1, Hadith 351\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَدْنَى مَقْعَدِ أَحَدِكُمْ مِنَ الْجَنَّةِ أَنْ يَقُولَ لَهُ تَمَنَّ . فَيَتَمَنَّى وَيَتَمَنَّى فَيَقُولُ لَهُ هَلْ تَمَنَّيْتَ فَيَقُولُ نَعَمْ . فَيَقُولُ لَهُ فَإِنَّ لَكَ مَا تَمَنَّيْتَ وَمِثْلَهُ مَعَهُ \" ."
  },
  "183": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 183c\nIn-book reference  : Book 1, Hadith 361\nUSC-MSA web (English) reference  : Book 1, Hadith 354\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَعْفَرُ بْنُ عَوْنٍ، حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، حَدَّثَنَا زَيْدُ بْنُ أَسْلَمَ، بِإِسْنَادِهِمَا نَحْوَ حَدِيثِ حَفْصِ بْنِ مَيْسَرَةَ إِلَى آخِرِهِ وَقَدْ زَادَ وَنَقَصَ شَيْئًا ."
  },
  "184": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 184b\nIn-book reference  : Book 1, Hadith 363\nUSC-MSA web (English) reference  : Book 1, Hadith 356\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، ح وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا عَمْرُو بْنُ عَوْنٍ، أَخْبَرَنَا خَالِدٌ، كِلاَهُمَا عَنْ عَمْرِو بْنِ يَحْيَى، بِهَذَا الإِسْنَادِ وَقَالاَ فَيُلْقَوْنَ فِي نَهْرٍ يُقَالُ لَهُ الْحَيَاةُ . وَلَمْ يَشُكَّا . وَفِي حَدِيثِ خَالِدٍ كَمَا تَنْبُتُ الْغُثَاءَةُ فِي جَانِبِ السَّيْلِ . وَفِي حَدِيثِ وُهَيْبٍ كَمَا تَنْبُتُ الْحِبَّةُ فِي حَمِئَةٍ أَوْ حَمِيلَةِ السَّيْلِ ."
  },
  "185": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 185b\nIn-book reference  : Book 1, Hadith 365\nUSC-MSA web (English) reference  : Book 1, Hadith 358\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي مَسْلَمَةَ، قَالَ سَمِعْتُ أَبَا نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ إِلَى قَوْلِهِ \" فِي حَمِيلِ السَّيْلِ \" . وَلَمْ يَذْكُرْ مَا بَعْدَهُ ."
  },
  "186": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 186b\nIn-book reference  : Book 1, Hadith 367\nUSC-MSA web (English) reference  : Book 1, Hadith 360\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ - وَاللَّفْظُ لأَبِي كُرَيْبٍ - قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَبِيدَةَ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي لأَعْرِفُ آخِرَ أَهْلِ النَّارِ خُرُوجًا مِنَ النَّارِ رَجُلٌ يَخْرُجُ مِنْهَا زَحْفًا فَيُقَالُ لَهُ انْطَلِقْ فَادْخُلِ الْجَنَّةَ - قَالَ - فَيَذْهَبُ فَيَدْخُلُ الْجَنَّةَ فَيَجِدُ النَّاسَ قَدْ أَخَذُوا الْمَنَازِلَ فَيُقَالُ لَهُ أَتَذْكُرُ الزَّمَانَ الَّذِي كُنْتَ فِيهِ فَيَقُولُ نَعَمْ . فَيُقَالُ لَهُ تَمَنَّ . فَيَتَمَنَّى فَيُقَالُ لَهُ لَكَ الَّذِي تَمَنَّيْتَ وَعَشَرَةُ أَضْعَافِ الدُّنْيَا - قَالَ - فَيَقُولُ أَتَسْخَرُ بِي وَأَنْتَ الْمَلِكُ \" قَالَ فَلَقَدْ رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَحِكَ حَتَّى بَدَتْ نَوَاجِذُهُ ."
  },
  "187": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 187\nIn-book reference  : Book 1, Hadith 368\nUSC-MSA web (English) reference  : Book 1, Hadith 361\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ بْنُ مُسْلِمٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسٍ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" آخِرُ مَنْ يَدْخُلُ الْجَنَّةَ رَجُلٌ فَهُوَ يَمْشِي مَرَّةً وَيَكْبُو مَرَّةً وَتَسْفَعُهُ النَّارُ مَرَّةً فَإِذَا مَا جَاوَزَهَا الْتَفَتَ إِلَيْهَا فَقَالَ تَبَارَكَ الَّذِي نَجَّانِي مِنْكِ لَقَدْ أَعْطَانِيَ اللَّهُ شَيْئًا مَا أَعْطَاهُ أَحَدًا مِنَ الأَوَّلِينَ وَالآخِرِينَ . فَتُرْفَعُ لَهُ شَجَرَةٌ فَيَقُولُ أَىْ رَبِّ أَدْنِنِي مِنْ هَذِهِ الشَّجَرَةِ فَلأَسْتَظِلَّ بِظِلِّهَا وَأَشْرَبَ مِنْ مَائِهَا . فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ يَا ابْنَ آدَمَ لَعَلِّي إِنْ أَعْطَيْتُكَهَا سَأَلْتَنِي غَيْرَهَا . فَيَقُولُ لاَ يَا رَبِّ . وَيُعَاهِدُهُ أَنْ لاَ يَسْأَلَهُ غَيْرَهَا وَرَبُّهُ يَعْذِرُهُ لأَنَّهُ يَرَى مَا لاَ صَبْرَ لَهُ عَلَيْهِ فَيُدْنِيهِ مِنْهَا فَيَسْتَظِلُّ بِظِلِّهَا وَيَشْرَبُ مِنْ مَائِهَا ثُمَّ تُرْفَعُ لَهُ شَجَرَةٌ هِيَ أَحْسَنُ مِنَ الأُولَى فَيَقُولُ أَىْ رَبِّ أَدْنِنِي مِنْ هَذِهِ لأَشْرَبَ مِنْ مَائِهَا وَأَسْتَظِلَّ بِظِلِّهَا لاَ أَسْأَلُكَ غَيْرَهَا . فَيَقُولُ يَا ابْنَ آدَمَ أَلَمْ تُعَاهِدْنِي أَنْ لاَ تَسْأَلَنِي غَيْرَهَا فَيَقُولُ لَعَلِّي إِنْ أَدْنَيْتُكَ مِنْهَا تَسْأَلُنِي غَيْرَهَا . فَيُعَاهِدُهُ أَنْ لاَ يَسْأَلَهُ غَيْرَهَا وَرَبُّهُ يَعْذِرُهُ لأَنَّهُ يَرَى مَا لاَ صَبْرَ لَهُ عَلَيْهِ فَيُدْنِيهِ مِنْهَا فَيَسْتَظِلُّ بِظِلِّهَا وَيَشْرَبُ مِنْ مَائِهَا . ثُمَّ تُرْفَعُ لَهُ شَجَرَةٌ عِنْدَ بَابِ الْجَنَّةِ هِيَ أَحْسَنُ مِنَ الأُولَيَيْنِ . فَيَقُولُ أَىْ رَبِّ أَدْنِنِي مِنْ هَذِهِ لأَسْتَظِلَّ بِظِلِّهَا وَأَشْرَبَ مِنْ مَائِهَا لاَ أَسْأَلُكَ غَيْرَهَا . فَيَقُولُ يَا ابْنَ آدَمَ أَلَمْ تُعَاهِدْنِي أَنْ لاَ تَسْأَلَنِي غَيْرَهَا قَالَ بَلَى يَا رَبِّ هَذِهِ لاَ أَسْأَلُكَ غَيْرَهَا . وَرَبُّهُ يَعْذِرُهُ لأَنَّهُ يَرَى مَا لاَ صَبْرَ لَهُ عَلَيْهَا فَيُدْنِيهِ مِنْهَا فَإِذَا أَدْنَاهُ مِنْهَا فَيَسْمَعُ أَصْوَاتَ أَهْلِ الْجَنَّةِ فَيَقُولُ أَىْ رَبِّ أَدْخِلْنِيهَا . فَيَقُولُ يَا ابْنَ آدَمَ مَا يَصْرِينِي مِنْكَ أَيُرْضِيكَ أَنْ أُعْطِيَكَ الدُّنْيَا وَمِثْلَهَا مَعَهَا قَالَ يَا رَبِّ أَتَسْتَهْزِئُ مِنِّي وَأَنْتَ رَبُّ الْعَالَمِينَ \" . فَضَحِكَ ابْنُ مَسْعُودٍ فَقَالَ أَلاَ تَسْأَلُونِّي مِمَّ أَضْحَكُ فَقَالُوا مِمَّ تَضْحَكُ قَالَ هَكَذَا ضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم . فَقَالُوا مِمَّ تَضْحَكُ يَا رَسُولَ اللَّهِ قَالَ \" مِنْ ضِحْكِ رَبِّ الْعَالَمِينَ حِينَ قَالَ أَتَسْتَهْزِئُ مِنِّي وَأَنْتَ رَبُّ الْعَالَمِينَ فَيَقُولُ إِنِّي لاَ أَسْتَهْزِئُ مِنْكَ وَلَكِنِّي عَلَى مَا أَشَاءُ قَادِرٌ \" ."
  },
  "188": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 188\nIn-book reference  : Book 1, Hadith 369\nUSC-MSA web (English) reference  : Book 1, Hadith 362\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ أَدْنَى أَهْلِ الْجَنَّةِ مَنْزِلَةً رَجُلٌ صَرَفَ اللَّهُ وَجْهَهُ عَنِ النَّارِ قِبَلَ الْجَنَّةِ وَمَثَّلَ لَهُ شَجَرَةً ذَاتَ ظِلٍّ فَقَالَ أَىْ رَبِّ قَدِّمْنِي إِلَى هَذِهِ الشَّجَرَةِ أَكُونُ فِي ظِلِّهَا \" . وَسَاقَ الْحَدِيثَ بِنَحْوِ حَدِيثِ ابْنِ مَسْعُودٍ وَلَمْ يُذْكُرْ \" فَيَقُولُ يَا ابْنَ آدَمَ مَا يَصْرِينِي مِنْكَ \" . إِلَى آخِرِ الْحَدِيثِ وَزَادَ فِيهِ \" وَيُذَكِّرُهُ اللَّهُ سَلْ كَذَا وَكَذَا فَإِذَا انْقَطَعَتْ بِهِ الأَمَانِيُّ قَالَ اللَّهُ هُوَ لَكَ وَعَشَرَةُ أَمْثَالِهِ - قَالَ - ثُمَّ يَدْخُلُ بَيْتَهُ فَتَدْخُلُ عَلَيْهِ زَوْجَتَاهُ مِنَ الْحُورِ الْعِينِ فَتَقُولاَنِ الْحَمْدُ لِلَّهِ الَّذِي أَحْيَاكَ لَنَا وَأَحْيَانَا لَكَ - قَالَ - فَيَقُولُ مَا أُعْطِيَ أَحَدٌ مِثْلَ مَا أُعْطِيتُ \" ."
  },
  "189": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 189c\nIn-book reference  : Book 1, Hadith 372\nUSC-MSA web (English) reference  : Book 1, Hadith 364\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ الأَشْجَعِيُّ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبْجَرَ، قَالَ سَمِعْتُ الشَّعْبِيَّ، يَقُولُ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ عَلَى الْمِنْبَرِ إِنَّ مُوسَى - عَلَيْهِ السَّلاَمُ - سَأَلَ اللَّهَ عَزَّ وَجَلَّ عَنْ أَخَسِّ أَهْلِ الْجَنَّةِ مِنْهَا حَظًّا . وَسَاقَ الْحَدِيثَ بِنَحْوِهِ ."
  },
  "190": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 190b\nIn-book reference  : Book 1, Hadith 374\nUSC-MSA web (English) reference  : Book 1, Hadith 366\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ."
  },
  "191": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 191e\nIn-book reference  : Book 1, Hadith 379\nUSC-MSA web (English) reference  : Book 1, Hadith 371\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، حَدَّثَنَا أَبُو عَاصِمٍ، - يَعْنِي مُحَمَّدَ بْنَ أَبِي أَيُّوبَ - قَالَ حَدَّثَنِي يَزِيدُ الْفَقِيرُ، قَالَ كُنْتُ قَدْ شَغَفَنِي رَأْىٌ مِنْ رَأْىِ الْخَوَارِجِ فَخَرَجْنَا فِي عِصَابَةٍ ذَوِي عَدَدٍ نُرِيدُ أَنْ نَحُجَّ ثُمَّ نَخْرُجَ عَلَى النَّاسِ - قَالَ - فَمَرَرْنَا عَلَى الْمَدِينَةِ فَإِذَا جَابِرُ بْنُ عَبْدِ اللَّهِ يُحَدِّثُ الْقَوْمَ - جَالِسٌ إِلَى سَارِيَةٍ - عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ فَإِذَا هُوَ قَدْ ذَكَرَ الْجَهَنَّمِيِّينَ - قَالَ - فَقُلْتُ لَهُ يَا صَاحِبَ رَسُولِ اللَّهِ مَا هَذَا الَّذِي تُحَدِّثُونَ وَاللَّهُ يَقُولُ { إِنَّكَ مَنْ تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ} وَ { كُلَّمَا أَرَادُوا أَنْ يَخْرُجُوا مِنْهَا أُعِيدُوا فِيهَا} فَمَا هَذَا الَّذِي تَقُولُونَ قَالَ فَقَالَ أَتَقْرَأُ الْقُرْآنَ قُلْتُ نَعَمْ . قَالَ فَهَلْ سَمِعْتَ بِمَقَامِ مُحَمَّدٍ - عَلَيْهِ السَّلاَمُ - يَعْنِي الَّذِي يَبْعَثُهُ اللَّهُ فِيهِ قُلْتُ نَعَمْ . قَالَ فَإِنَّهُ مَقَامُ مُحَمَّدٍ صلى الله عليه وسلم الْمَحْمُودُ الَّذِي يُخْرِجُ اللَّهُ بِهِ مَنْ يُخْرِجُ . - قَالَ - ثُمَّ نَعَتَ وَضْعَ الصِّرَاطِ وَمَرَّ النَّاسِ عَلَيْهِ - قَالَ - وَأَخَافُ أَنْ لاَ أَكُونَ أَحْفَظُ ذَاكَ - قَالَ - غَيْرَ أَنَّهُ قَدْ زَعَمَ أَنَّ قَوْمًا يَخْرُجُونَ مِنَ النَّارِ بَعْدَ أَنْ يَكُونُوا فِيهَا - قَالَ - يَعْنِي فَيَخْرُجُونَ كَأَنَّهُمْ عِيدَانُ السَّمَاسِمِ . قَالَ فَيَدْخُلُونَ نَهْرًا مِنْ أَنْهَارِ الْجَنَّةِ فَيَغْتَسِلُونَ فِيهِ فَيَخْرُجُونَ كَأَنَّهُمُ الْقَرَاطِيسُ . فَرَجَعْنَا قُلْنَا وَيْحَكُمْ أَتُرَوْنَ الشَّيْخَ يَكْذِبُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَرَجَعْنَا فَلاَ وَاللَّهِ مَا خَرَجَ مِنَّا غَيْرُ رَجُلٍ وَاحِدٍ أَوْ كَمَا قَالَ أَبُو نُعَيْمٍ ."
  },
  "192": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 192\nIn-book reference  : Book 1, Hadith 380\nUSC-MSA web (English) reference  : Book 1, Hadith 372\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا هَدَّابُ بْنُ خَالِدٍ الأَزْدِيُّ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي عِمْرَانَ، وَثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" يَخْرُجُ مِنَ النَّارِ أَرْبَعَةٌ فَيُعْرَضُونَ عَلَى اللَّهِ فَيَلْتَفِتُ أَحَدُهُمْ فَيَقُولُ أَىْ رَبِّ إِذْ أَخْرَجْتَنِي مِنْهَا فَلاَ تُعِدْنِي فِيهَا . فَيُنْجِيهِ اللَّهُ مِنْهَا \" ."
  },
  "193": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 193e\nIn-book reference  : Book 1, Hadith 385\nUSC-MSA web (English) reference  : Book 1, Hadith 377\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا مَعْبَدُ بْنُ هِلاَلٍ الْعَنَزِيُّ، ح وَحَدَّثَنَاهُ سَعِيدُ بْنُ مَنْصُورٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، حَدَّثَنَا مَعْبَدُ بْنُ هِلاَلٍ الْعَنَزِيُّ، قَالَ انْطَلَقْنَا إِلَى أَنَسِ بْنِ مَالِكٍ وَتَشَفَّعْنَا بِثَابِتٍ فَانْتَهَيْنَا إِلَيْهِ وَهُوَ يُصَلِّي الضُّحَى فَاسْتَأْذَنَ لَنَا ثَابِتٌ فَدَخَلْنَا عَلَيْهِ وَأَجْلَسَ ثَابِتًا مَعَهُ عَلَى سَرِيرِهِ فَقَالَ لَهُ يَا أَبَا حَمْزَةَ إِنَّ إِخْوَانَكَ مِنْ أَهْلِ الْبَصْرَةِ يَسْأَلُونَكَ أَنْ تُحَدِّثَهُمْ حَدِيثَ الشَّفَاعَةِ . قَالَ حَدَّثَنَا مُحَمَّدٌ صلى الله عليه وسلم قَالَ \" إِذَا كَانَ يَوْمُ الْقِيَامَةِ مَاجَ النَّاسُ بَعْضُهُمْ إِلَى بَعْضٍ فَيَأْتُونَ آدَمَ فَيَقُولُونَ لَهُ اشْفَعْ لِذُرِّيَّتِكَ . فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِإِبْرَاهِيمَ - عَلَيْهِ السَّلاَمُ - فَإِنَّهُ خَلِيلُ اللَّهِ . فَيَأْتُونَ إِبْرَاهِيمَ فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِمُوسَى - عَلَيْهِ السَّلاَمُ - فَإِنَّهُ كَلِيمُ اللَّهِ . فَيُؤْتَى مُوسَى فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِعِيسَى - عَلَيْهِ السَّلاَمُ - فَإِنَّهُ رُوحُ اللَّهِ وَكَلِمَتُهُ . فَيُؤْتَى عِيسَى فَيَقُولُ لَسْتُ لَهَا وَلَكِنْ عَلَيْكُمْ بِمُحَمَّدٍ صلى الله عليه وسلم فَأُوتَى فَأَقُولُ أَنَا لَهَا . فَأَنْطَلِقُ فَأَسْتَأْذِنُ عَلَى رَبِّي فَيُؤْذَنُ لِي فَأَقُومُ بَيْنَ يَدَيْهِ فَأَحْمَدُهُ بِمَحَامِدَ لاَ أَقْدِرُ عَلَيْهِ الآنَ يُلْهِمُنِيهِ اللَّهُ ثُمَّ أَخِرُّ لَهُ سَاجِدًا فَيُقَالُ لِي يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ لَكَ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَقُولُ رَبِّ أُمَّتِي أُمَّتِي . فَيُقَالُ انْطَلِقْ فَمَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ بُرَّةٍ أَوْ شَعِيرَةٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنْهَا . فَأَنْطَلِقُ فَأَفْعَلُ ثُمَّ أَرْجِعُ إِلَى رَبِّي فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ ثُمَّ أَخِرُّ لَهُ سَاجِدًا فَيُقَالُ لِي يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ لَكَ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ . فَأَقُولُ أُمَّتِي أُمَّتِي . فَيُقَالُ لِي انْطَلِقْ فَمَنْ كَانَ فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنْهَا . فَأَنْطَلِقُ فَأَفْعَلُ ثُمَّ أَعُودُ إِلَى رَبِّي فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ ثُمَّ أَخِرُّ لَهُ سَاجِدًا فَيُقَالُ لِي يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ لَكَ وَسَلْ تُعْطَهْ وَاشْفَعْ تُشَفَّعْ فَأَقُولُ يَا رَبِّ أُمَّتِي أُمَّتِي . فَيُقَالُ لِي انْطَلِقْ فَمَنْ كَانَ فِي قَلْبِهِ أَدْنَى أَدْنَى أَدْنَى مِنْ مِثْقَالِ حَبَّةٍ مِنْ خَرْدَلٍ مِنْ إِيمَانٍ فَأَخْرِجْهُ مِنَ النَّارِ فَأَنْطَلِقُ فَأَفْعَلُ \" . هَذَا حَدِيثُ أَنَسٍ الَّذِي أَنْبَأَنَا بِهِ فَخَرَجْنَا مِنْ عِنْدِهِ فَلَمَّا كُنَّا بِظَهْرِ الْجَبَّانِ قُلْنَا لَوْ مِلْنَا إِلَى الْحَسَنِ فَسَلَّمْنَا عَلَيْهِ وَهُوَ مُسْتَخْفٍ فِي دَارِ أَبِي خَلِيفَةَ - قَالَ - فَدَخَلْنَا عَلَيْهِ فَسَلَّمْنَا عَلَيْهِ فَقُلْنَا يَا أَبَا سَعِيدٍ جِئْنَا مِنْ عِنْدِ أَخِيكَ أَبِي حَمْزَةَ فَلَمْ نَسْمَعْ مِثْلَ حَدِيثٍ حَدَّثَنَاهُ فِي الشَّفَاعَةِ قَالَ هِيهِ . فَحَدَّثْنَاهُ الْحَدِيثَ . فَقَالَ هِيهِ . قُلْنَا مَا زَادَنَا . قَالَ قَدْ حَدَّثَنَا بِهِ مُنْذُ عِشْرِينَ سَنَةً وَهُوَ يَوْمَئِذٍ جَمِيعٌ وَلَقَدْ تَرَكَ شَيْئًا مَا أَدْرِي أَنَسِيَ الشَّيْخُ أَوْ كَرِهَ أَنْ يُحَدِّثَكُمْ فَتَتَّكِلُوا . قُلْنَا لَهُ حَدِّثْنَا . فَضَحِكَ وَقَالَ خُلِقَ الإِنْسَانُ مِنْ عَجَلٍ مَا ذَكَرْتُ لَكُمْ هَذَا إِلاَّ وَأَنَا أُرِيدُ أَنْ أُحَدِّثَكُمُوهُ \" ثُمَّ أَرْجِعُ إِلَى رَبِّي فِي الرَّابِعَةِ فَأَحْمَدُهُ بِتِلْكَ الْمَحَامِدِ ثُمَّ أَخِرُّ لَهُ سَاجِدًا فَيُقَالُ لِي يَا مُحَمَّدُ ارْفَعْ رَأْسَكَ وَقُلْ يُسْمَعْ لَكَ وَسَلْ تُعْطَ وَاشْفَعْ تُشَفَّعْ . فَأَقُولُ يَا رَبِّ ائْذَنْ لِي فِيمَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ . قَالَ لَيْسَ ذَاكَ لَكَ - أَوْ قَالَ لَيْسَ ذَاكَ إِلَيْكَ - وَلَكِنْ وَعِزَّتِي وَكِبْرِيَائِي وَعَظَمَتِي وَجِبْرِيَائِي لأُخْرِجَنَّ مَنْ قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ \" . قَالَ فَأَشْهَدُ عَلَى الْحَسَنِ أَنَّهُ حَدَّثَنَا بِهِ أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ أُرَاهُ قَالَ قَبْلَ عِشْرِينَ سَنَةً وَهُوَ يَوْمَئِذٍ جَمِيعٌ ."
  },
  "194": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 194b\nIn-book reference  : Book 1, Hadith 387\nUSC-MSA web (English) reference  : Book 1, Hadith 379\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ وُضِعَتْ بَيْنَ يَدَىْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَصْعَةٌ مِنْ ثَرِيدٍ وَلَحْمٍ فَتَنَاوَلَ الذِّرَاعَ وَكَانَتْ أَحَبَّ الشَّاةِ إِلَيْهِ فَنَهَسَ نَهْسَةً فَقَالَ \" أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ \" . ثُمَّ نَهَسَ أُخْرَى فَقَالَ \" أَنَا سَيِّدُ النَّاسِ يَوْمَ الْقِيَامَةِ \" . فَلَمَّا رَأَى أَصْحَابَهُ لاَ يَسْأَلُونَهُ قَالَ \" أَلاَ تَقُولُونَ كَيْفَهْ \" . قَالُوا كَيْفَهْ يَا رَسُولَ اللَّهِ قَالَ \" يَقُومُ النَّاسُ لِرَبِّ الْعَالَمِينَ \" . وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ أَبِي حَيَّانَ عَنْ أَبِي زُرْعَةَ وَزَادَ فِي قِصَّةِ إِبْرَاهِيمَ فَقَالَ وَذَكَرَ قَوْلَهُ فِي الْكَوْكَبِ هَذَا رَبِّي . وَقَوْلَهُ لآلِهَتِهِمْ بَلْ فَعَلَهُ كَبِيرُهُمْ هَذَا . وَقَوْلَهُ إِنِّي سَقِيمٌ . قَالَ \" وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ إِنَّ مَا بَيْنَ الْمِصْرَاعَيْنِ مِنْ مَصَارِيعِ الْجَنَّةِ إِلَى عِضَادَتَىِ الْبَابِ لَكَمَا بَيْنَ مَكَّةَ وَهَجَرٍ أَوْ هَجَرٍ وَمَكَّةَ \" . قَالَ لاَ أَدْرِي أَىَّ ذَلِكَ قَالَ ."
  },
  "195": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 195\nIn-book reference  : Book 1, Hadith 388\nUSC-MSA web (English) reference  : Book 1, Hadith 380\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ طَرِيفِ بْنِ خَلِيفَةَ الْبَجَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا أَبُو مَالِكٍ الأَشْجَعِيُّ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَبُو مَالِكٍ عَنْ رِبْعِيٍّ، عَنْ حُذَيْفَةَ، قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَجْمَعُ اللَّهُ تَبَارَكَ وَتَعَالَى النَّاسَ فَيَقُومُ الْمُؤْمِنُونَ حَتَّى تُزْلَفَ لَهُمُ الْجَنَّةُ فَيَأْتُونَ آدَمَ فَيَقُولُونَ يَا أَبَانَا اسْتَفْتِحْ لَنَا الْجَنَّةَ . فَيَقُولُ وَهَلْ أَخْرَجَكُمْ مِنَ الْجَنَّةِ إِلاَّ خَطِيئَةُ أَبِيكُمْ آدَمَ لَسْتُ بِصَاحِبِ ذَلِكَ اذْهَبُوا إِلَى ابْنِي إِبْرَاهِيمَ خَلِيلِ اللَّهِ - قَالَ - فَيَقُولُ إِبْرَاهِيمُ لَسْتُ بِصَاحِبِ ذَلِكَ إِنَّمَا كُنْتُ خَلِيلاً مِنْ وَرَاءَ وَرَاءَ اعْمِدُوا إِلَى مُوسَى صلى الله عليه وسلم الَّذِي كَلَّمَهُ اللَّهُ تَكْلِيمًا . فَيَأْتُونَ مُوسَى صلى الله عليه وسلم فَيَقُولُ لَسْتُ بِصَاحِبِ ذَلِكَ اذْهَبُوا إِلَى عِيسَى كَلِمَةِ اللَّهِ وَرُوحِهِ . فَيَقُولُ عِيسَى صلى الله عليه وسلم لَسْتُ بِصَاحِبِ ذَلِكَ . فَيَأْتُونَ مُحَمَّدًا صلى الله عليه وسلم فَيَقُومُ فَيُؤْذَنُ لَهُ وَتُرْسَلُ الأَمَانَةُ وَالرَّحِمُ فَتَقُومَانِ جَنَبَتَىِ الصِّرَاطِ يَمِينًا وَشِمَالاً فَيَمُرُّ أَوَّلُكُمْ كَالْبَرْقِ \" . قَالَ قُلْتُ بِأَبِي أَنْتَ وَأُمِّي أَىُّ شَىْءٍ كَمَرِّ الْبَرْقِ قَالَ \" أَلَمْ تَرَوْا إِلَى الْبَرْقِ كَيْفَ يَمُرُّ وَيَرْجِعُ فِي طَرْفَةِ يْنٍ ثُمَّ كَمَرِّ الرِّيحِ ثُمَّ كَمَرِّ الطَّيْرِ وَشَدِّ الرِّجَالِ تَجْرِي بِهِمْ أَعْمَالُهُمْ وَنَبِيُّكُمْ قَائِمٌ عَلَى الصِّرَاطِ يَقُولُ رَبِّ سَلِّمْ سَلِّمْ حَتَّى تَعْجِزَ أَعْمَالُ الْعِبَادِ حَتَّى يَجِيءَ الرَّجُلُ فَلاَ يَسْتَطِيعُ السَّيْرَ إِلاَّ زَحْفًا - قَالَ - وَفِي حَافَتَىِ الصِّرَاطِ كَلاَلِيبُ مُعَلَّقَةٌ مَأْمُورَةٌ بِأَخْذِ مَنْ أُمِرَتْ بِهِ فَمَخْدُوشٌ نَاجٍ وَمَكْدُوسٌ فِي النَّارِ \" . وَالَّذِي نَفْسُ أَبِي هُرَيْرَةَ بِيَدِهِ إِنَّ قَعْرَ جَهَنَّمَ لَسَبْعُونَ خَرِيفًا ."
  },
  "196": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 196c\nIn-book reference  : Book 1, Hadith 391\nUSC-MSA web (English) reference  : Book 1, Hadith 383\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، عَنِ الْمُخْتَارِ بْنِ فُلْفُلٍ، قَالَ قَالَ أَنَسُ بْنُ مَالِكٍ قَالَ النَّبِيُّ صلى الله عليه وسلم \" أَنَا أَوَّلُ شَفِيعٍ فِي الْجَنَّةِ لَمْ يُصَدَّقْ نَبِيٌّ مِنَ الأَنْبِيَاءِ مَا صُدِّقْتُ وَإِنَّ مِنَ الأَنْبِيَاءِ نَبِيًّا مَا يُصَدِّقُهُ مِنْ أُمَّتِهِ إِلاَّ رَجُلٌ وَاحِدٌ \" ."
  },
  "197": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 197\nIn-book reference  : Book 1, Hadith 392\nUSC-MSA web (English) reference  : Book 1, Hadith 384\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" آتِي بَابَ الْجَنَّةِ يَوْمَ الْقِيَامَةِ فَأَسْتَفْتِحُ فَيَقُولُ الْخَازِنُ مَنْ أَنْتَ فَأَقُولُ مُحَمَّدٌ . فَيَقُولُ بِكَ أُمِرْتُ لاَ أَفْتَحُ لأَحَدٍ قَبْلَكَ \" ."
  },
  "198": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 198d\nIn-book reference  : Book 1, Hadith 396\nUSC-MSA web (English) reference  : Book 1, Hadith 388\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، أَنَّ عَمْرَو بْنَ أَبِي سُفْيَانَ بْنِ أَسِيدِ بْنِ جَارِيَةَ الثَّقَفِيَّ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ لِكَعْبِ الأَحْبَارِ إِنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ \" لِكُلِّ نَبِيٍّ دَعْوَةٌ يَدْعُوهَا فَأَنَا أُرِيدُ إِنْ شَاءَ اللَّهُ أَنْ أَخْتَبِئَ دَعْوَتِي شَفَاعَةً لأُمَّتِي يَوْمَ الْقِيَامَةِ \" . فَقَالَ كَعْبٌ لأَبِي هُرَيْرَةَ أَنْتَ سَمِعْتَ هَذَا مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ أَبُو هُرَيْرَةَ نَعَمْ ."
  },
  "199": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 199c\nIn-book reference  : Book 1, Hadith 399\nUSC-MSA web (English) reference  : Book 1, Hadith 391\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدٍ، - وَهُوَ ابْنُ زِيَادٍ - قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لِكُلِّ نَبِيٍّ دَعْوَةٌ دَعَا بِهَا فِي أُمَّتِهِ فَاسْتُجِيبَ لَهُ وَإِنِّي أُرِيدُ إِنْ شَاءَ اللَّهُ أَنْ أُؤَخِّرَ دَعْوَتِي شَفَاعَةً لأُمَّتِي يَوْمَ الْقِيَامَةِ \" ."
  },
  "200": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 200d\nIn-book reference  : Book 1, Hadith 403\nUSC-MSA web (English) reference  : Book 1, Hadith 395\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، عَنْ أَنَسٍ، أَنَّ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَالَ فَذَكَرَ نَحْوَ حَدِيثِ قَتَادَةَ عَنْ أَنَسٍ ."
  },
  "201": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 201\nIn-book reference  : Book 1, Hadith 404\nUSC-MSA web (English) reference  : Book 1, Hadith 396\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي خَلَفٍ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ عَنِ النَّبِيِّ صلى الله عليه وسلم \" لِكُلِّ نَبِيٍّ دَعْوَةٌ قَدْ دَعَا بِهَا فِي أُمَّتِهِ وَخَبَأْتُ دَعْوَتِي شَفَاعَةً لأُمَّتِي يَوْمَ الْقِيَامَةِ \" ."
  },
  "202": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 202\nIn-book reference  : Book 1, Hadith 405\nUSC-MSA web (English) reference  : Book 1, Hadith 397\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي يُونُسُ بْنُ عَبْدِ الأَعْلَى الصَّدَفِيُّ، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ بَكْرَ بْنَ سَوَادَةَ، حَدَّثَهُ عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُبَيْرٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرِو بْنِ الْعَاصِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم تَلاَ قَوْلَ اللَّهِ عَزَّ وَجَلَّ فِي إِبْرَاهِيمَ { رَبِّ إِنَّهُنَّ أَضْلَلْنَ كَثِيرًا مِنَ النَّاسِ فَمَنْ تَبِعَنِي فَإِنَّهُ مِنِّي} الآيَةَ . وَقَالَ عِيسَى عَلَيْهِ السَّلاَمُ { إِنْ تُعَذِّبْهُمْ فَإِنَّهُمْ عِبَادُكَ وَإِنْ تَغْفِرْ لَهُمْ فَإِنَّكَ أَنْتَ الْعَزِيزُ الْحَكِيمُ} فَرَفَعَ يَدَيْهِ وَقَالَ \" اللَّهُمَّ أُمَّتِي أُمَّتِي \" . وَبَكَى فَقَالَ اللَّهُ عَزَّ وَجَلَّ يَا جِبْرِيلُ اذْهَبْ إِلَى مُحَمَّدٍ وَرَبُّكَ أَعْلَمُ فَسَلْهُ مَا يُبْكِيكَ فَأَتَاهُ جِبْرِيلُ - عَلَيْهِ الصَّلاَةُ وَالسَّلاَمُ - فَسَأَلَهُ فَأَخْبَرَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمَا قَالَ . وَهُوَ أَعْلَمُ . فَقَالَ اللَّهُ يَا جِبْرِيلُ اذْهَبْ إِلَى مُحَمَّدٍ فَقُلْ إِنَّا سَنُرْضِيكَ فِي أُمَّتِكَ وَلاَ نَسُوءُكَ ."
  },
  "203": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 203\nIn-book reference  : Book 1, Hadith 406\nUSC-MSA web (English) reference  : Book 1, Hadith 398\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ أَيْنَ أَبِي قَالَ \" فِي النَّارِ \" . فَلَمَّا قَفَّى دَعَاهُ فَقَالَ \" إِنَّ أَبِي وَأَبَاكَ فِي النَّارِ \" ."
  },
  "204": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 204b\nIn-book reference  : Book 1, Hadith 408\nUSC-MSA web (English) reference  : Book 1, Hadith 400\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ الْقَوَارِيرِيُّ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، بِهَذَا الإِسْنَادِ وَحَدِيثُ جَرِيرٍ أَتَمُّ وَأَشْبَعُ ."
  },
  "205": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 205\nIn-book reference  : Book 1, Hadith 409\nUSC-MSA web (English) reference  : Book 1, Hadith 401\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، وَيُونُسُ بْنُ بُكَيْرٍ، قَالاَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتْ { وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ} قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الصَّفَا فَقَالَ \" يَا فَاطِمَةَ بِنْتَ مُحَمَّدٍ يَا صَفِيَّةُ بِنْتَ عَبْدِ الْمُطَّلِبِ يَا بَنِي عَبْدِ الْمُطَّلِبِ لاَ أَمْلِكُ لَكُمْ مِنَ اللَّهِ شَيْئًا سَلُونِي مِنْ مَالِي مَا شِئْتُمْ \" ."
  },
  "206": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 206b\nIn-book reference  : Book 1, Hadith 411\nUSC-MSA web (English) reference  : Book 1, Hadith 403\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، حَدَّثَنَا مُعَاوِيَةُ بْنُ عَمْرٍو، حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ ذَكْوَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم نَحْوَ هَذَا ."
  },
  "207": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 207b\nIn-book reference  : Book 1, Hadith 413\nUSC-MSA web (English) reference  : Book 1, Hadith 405\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، حَدَّثَنَا أَبُو عُثْمَانَ، عَنْ زُهَيْرِ بْنِ عَمْرٍو، وَقَبِيصَةَ بْنِ مُخَارِقٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِهِ ."
  },
  "208": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 208b\nIn-book reference  : Book 1, Hadith 415\nUSC-MSA web (English) reference  : Book 1, Hadith 407\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ قَالَ صَعِدَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ الصَّفَا فَقَالَ \" يَا صَبَاحَاهْ \" . بِنَحْوِ حَدِيثِ أَبِي أُسَامَةَ وَلَمْ يَذْكُرْ نُزُولَ الآيَةِ { وَأَنْذِرْ عَشِيرَتَكَ الأَقْرَبِينَ}"
  },
  "209": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 209c\nIn-book reference  : Book 1, Hadith 418\nUSC-MSA web (English) reference  : Book 1, Hadith 410\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ سُفْيَانَ، قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ عُمَيْرٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ الْحَارِثِ، قَالَ أَخْبَرَنِي الْعَبَّاسُ بْنُ عَبْدِ الْمُطَّلِبِ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، بِهَذَا الإِسْنَادِ عَنِ النَّبِيِّ صلى الله عليه وسلم بِنَحْوِ حَدِيثِ أَبِي عَوَانَةَ ."
  },
  "210": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 210\nIn-book reference  : Book 1, Hadith 419\nUSC-MSA web (English) reference  : Book 1, Hadith 411\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، عَنِ ابْنِ الْهَادِ، عَنْ عَبْدِ اللَّهِ بْنِ خَبَّابٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذُكِرَ عِنْدَهُ عَمُّهُ أَبُو طَالِبٍ فَقَالَ \" لَعَلَّهُ تَنْفَعُهُ شَفَاعَتِي يَوْمَ الْقِيَامَةِ فَيُجْعَلُ فِي ضَحْضَاحٍ مِنْ نَارٍ يَبْلُغُ كَعْبَيْهِ يَغْلِي مِنْهُ دِمَاغُهُ \" ."
  },
  "211": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 211\nIn-book reference  : Book 1, Hadith 420\nUSC-MSA web (English) reference  : Book 1, Hadith 412\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ أَدْنَى أَهْلِ النَّارِ عَذَابًا يَنْتَعِلُ بِنَعْلَيْنِ مِنْ نَارٍ يَغْلِي دِمَاغُهُ مِنْ حَرَارَةِ نَعْلَيْهِ \" ."
  },
  "212": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 212\nIn-book reference  : Book 1, Hadith 421\nUSC-MSA web (English) reference  : Book 1, Hadith 413\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَبِي عُثْمَانَ النَّهْدِيِّ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَهْوَنُ أَهْلِ النَّارِ عَذَابًا أَبُو طَالِبٍ وَهُوَ مُنْتَعِلٌ بِنَعْلَيْنِ يَغْلِي مِنْهُمَا دِمَاغُهُ \" ."
  },
  "213": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 213b\nIn-book reference  : Book 1, Hadith 423\nUSC-MSA web (English) reference  : Book 1, Hadith 415\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي إِسْحَاقَ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَهْوَنَ أَهْلِ النَّارِ عَذَابًا مَنْ لَهُ نَعْلاَنِ وَشِرَاكَانِ مِنْ نَارٍ يَغْلِي مِنْهُمَا دِمَاغُهُ كَمَا يَغْلِي الْمِرْجَلُ مَا يَرَى أَنَّ أَحَدًا أَشَدُّ مِنْهُ عَذَابًا وَإِنَّهُ لأَهْوَنُهُمْ عَذَابًا \" ."
  },
  "214": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 214\nIn-book reference  : Book 1, Hadith 424\nUSC-MSA web (English) reference  : Book 1, Hadith 416\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ ابْنُ جُدْعَانَ كَانَ فِي الْجَاهِلِيَّةِ يَصِلُ الرَّحِمَ وَيُطْعِمُ الْمِسْكِينَ فَهَلْ ذَاكَ نَافِعُهُ قَالَ \" لاَ يَنْفَعُهُ إِنَّهُ لَمْ يَقُلْ يَوْمًا رَبِّ اغْفِرْ لِي خَطِيئَتِي يَوْمَ الدِّينِ \" ."
  },
  "215": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 215\nIn-book reference  : Book 1, Hadith 425\nUSC-MSA web (English) reference  : Book 1, Hadith 417\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ حَنْبَلٍ، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ قَيْسٍ، عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم جِهَارًا غَيْرَ سِرٍّ يَقُولُ \" أَلاَ إِنَّ آلَ أَبِي - يَعْنِي فُلاَنًا - لَيْسُوا لِي بِأَوْلِيَاءَ إِنَّمَا وَلِيِّيَ اللَّهُ وَصَالِحُ الْمُؤْمِنِينَ \" ."
  },
  "216": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 216c\nIn-book reference  : Book 1, Hadith 428\nUSC-MSA web (English) reference  : Book 1, Hadith 420\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، حَدَّثَهُ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" يَدْخُلُ مِنْ أُمَّتِي زُمْرَةٌ هُمْ سَبْعُونَ أَلْفًا تُضِيءُ وُجُوهُهُمْ إِضَاءَةَ الْقَمَرِ لَيْلَةَ الْبَدْرِ \" . قَالَ أَبُو هُرَيْرَةَ فَقَامَ عُكَّاشَةُ بْنُ مِحْصَنٍ الأَسَدِيُّ يَرْفَعُ نَمِرَةً عَلَيْهِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اللَّهُمَّ اجْعَلْهُ مِنْهُمْ \" ثُمَّ قَامَ رَجُلٌ مِنَ الأَنْصَارِ فَقَالَ يَا رَسُولَ اللَّهِ ادْعُ اللَّهَ أَنْ يَجْعَلَنِي مِنْهُمْ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" سَبَقَكَ بِهَا عُكَّاشَةُ \" ."
  },
  "217": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 217\nIn-book reference  : Book 1, Hadith 429\nUSC-MSA web (English) reference  : Book 1, Hadith 421\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي حَيْوَةُ، قَالَ حَدَّثَنِي أَبُو يُونُسَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا زُمْرَةٌ وَاحِدَةٌ مِنْهُمْ عَلَى صُورَةِ الْقَمَرِ \" ."
  },
  "218": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 218b\nIn-book reference  : Book 1, Hadith 431\nUSC-MSA web (English) reference  : Book 1, Hadith 423\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا حَاجِبُ بْنُ عُمَرَ أَبُو خُشَيْنَةَ الثَّقَفِيُّ، حَدَّثَنَا الْحَكَمُ بْنُ الأَعْرَجِ، عَنْ عِمْرَانَ بْنِ حُصَيْنٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" يَدْخُلُ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا بِغَيْرِ حِسَابٍ \" . قَالُوا مَنْ هُمْ يَا رَسُولَ اللَّهِ قَالَ \" هُمُ الَّذِينَ لاَ يَسْتَرْقُونَ وَلاَ يَتَطَيَّرُونَ وَلاَ يَكْتَوُونَ وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ \" ."
  },
  "219": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 219\nIn-book reference  : Book 1, Hadith 432\nUSC-MSA web (English) reference  : Book 1, Hadith 424\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ أَبِي حَازِمٍ - عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَيَدْخُلَنَّ الْجَنَّةَ مِنْ أُمَّتِي سَبْعُونَ أَلْفًا أَوْ سَبْعُمِائَةِ أَلْفٍ - لاَ يَدْرِي أَبُو حَازِمٍ أَيَّهُمَا قَالَ - مُتَمَاسِكُونَ آخِذٌ بَعْضُهُمْ بَعْضًا لاَ يَدْخُلُ أَوَّلُهُمْ حَتَّى يَدْخُلَ آخِرُهُمْ وُجُوهُهُمْ عَلَى صُورَةِ الْقَمَرِ لَيْلَةَ الْبَدْرِ \" ."
  },
  "220": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 220b\nIn-book reference  : Book 1, Hadith 434\nUSC-MSA web (English) reference  : Book 1, Hadith 426\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ حُصَيْنٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، حَدَّثَنَا ابْنُ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" عُرِضَتْ عَلَىَّ الأُمَمُ \" . ثُمَّ ذَكَرَ بَاقِيَ الْحَدِيثِ نَحْوَ حَدِيثِ هُشَيْمٍ وَلَمْ يَذْكُرْ أَوَّلَ حَدِيثِهِ ."
  },
  "221": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 221c\nIn-book reference  : Book 1, Hadith 437\nUSC-MSA web (English) reference  : Book 1, Hadith 429\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا مَالِكٌ، - وَهْوَ ابْنُ مِغْوَلٍ - عَنْ أَبِي إِسْحَاقَ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ عَبْدِ اللَّهِ، قَالَ خَطَبَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَسْنَدَ ظَهْرَهُ إِلَى قُبَّةِ أَدَمٍ فَقَالَ \" أَلاَ لاَ يَدْخُلُ الْجَنَّةَ إِلاَّ نَفْسٌ مُسْلِمَةٌ اللَّهُمَّ هَلْ بَلَّغْتُ اللَّهُمَّ اشْهَدْ . أَتُحِبُّونَ أَنَّكُمْ رُبُعُ أَهْلِ الْجَنَّةِ \" . فَقُلْنَا نَعَمْ يَا رَسُولَ اللَّهِ . فَقَالَ \" أَتُحِبُّونَ أَنْ تَكُونُوا ثُلُثَ أَهْلِ الْجَنَّةِ \" . قَالُوا نَعَمْ يَا رَسُولَ اللَّهِ . قَالَ \" إِنِّي لأَرْجُو أَنْ تَكُونُوا شَطْرَ أَهْلِ الْجَنَّةِ مَا أَنْتُمْ فِي سِوَاكُمْ مِنَ الأُمَمِ إِلاَّ كَالشَّعْرَةِ السَّوْدَاءِ فِي الثَّوْرِ الأَبْيَضِ أَوْ كَالشَّعْرَةِ الْبَيْضَاءِ فِي الثَّوْرِ الأَسْوَدِ \" ."
  },
  "222": {
    "collection": "Sahih Muslim",
    "book": "The Book of Faith",
    "book_num": "1",
    "reference": "Reference  : Sahih Muslim 222b\nIn-book reference  : Book 1, Hadith 439\nUSC-MSA web (English) reference  : Book 1, Hadith 431\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/1",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُمَا قَالاَ \" مَا أَنْتُمْ يَوْمَئِذٍ فِي النَّاسِ إِلاَّ كَالشَّعْرَةِ الْبَيْضَاءِ فِي الثَّوْرِ الأَسْوَدِ أَوْ كَالشَّعْرَةِ السَّوْدَاءِ فِي الثَّوْرِ الأَبْيَضِ \" . وَلَمْ يَذْكُرَا \" أَوْ كَالرَّقْمَةِ فِي ذِرَاعِ الْحِمَارِ \" ."
  }
}