{
  "1444": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1444c\nIn-book reference  : Book 17, Hadith 3\nUSC-MSA web (English) reference  : Book 8, Hadith 3396\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِيهِ إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ أَبِي بَكْرٍ، بِهَذَا الإِسْنَادِ . مِثْلَ حَدِيثِ هِشَامِ بْنِ عُرْوَةَ ."
  },
  "1445": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1445j\nIn-book reference  : Book 17, Hadith 13\nUSC-MSA web (English) reference  : Book 8, Hadith 3406\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ عِرَاكِ، بْنِ مَالِكٍ عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتِ اسْتَأْذَنَ عَلَىَّ أَفْلَحُ بْنُ قُعَيْسٍ فَأَبَيْتُ أَنْ آذَنَ، لَهُ فَأَرْسَلَ إِنِّي عَمُّكِ أَرْضَعَتْكِ امْرَأَةُ أَخِي . فَأَبَيْتُ أَنْ آذَنَ لَهُ فَجَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَذَكَرْتُ ذَلِكَ لَهُ فَقَالَ \" لِيَدْخُلْ عَلَيْكِ فَإِنَّهُ عَمُّكِ \" ."
  },
  "1446": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1446b\nIn-book reference  : Book 17, Hadith 15\nUSC-MSA web (English) reference  : Book 8, Hadith 3408\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنْ جَرِيرٍ، ح وَحَدَّثَنَا ابْنُ، نُمَيْرٍ حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا مُحَمَّدُ بْنُ أَبِي بَكْرٍ الْمُقَدَّمِيُّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1447": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1447b\nIn-book reference  : Book 17, Hadith 17\nUSC-MSA web (English) reference  : Book 8, Hadith 3410\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَاهُ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَحْيَى، وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ يَحْيَى، بْنِ مِهْرَانَ الْقُطَعِيُّ حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، جَمِيعًا عَنْ شُعْبَةَ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، كِلاَهُمَا عَنْ قَتَادَةَ، بِإِسْنَادِ هَمَّامٍ سَوَاءً غَيْرَ أَنَّ حَدِيثَ شُعْبَةَ انْتَهَى عِنْدَ قَوْلِهِ \" ابْنَةُ أَخِي مِنَ الرَّضَاعَةِ \" . وَفِي حَدِيثِ سَعِيدٍ \" وَإِنَّهُ يَحْرُمُ مِنَ الرَّضَاعَةِ مَا يَحْرُمُ مِنَ النَّسَبِ \" . وَفِي رِوَايَةِ بِشْرِ بْنِ عُمَرَ سَمِعْتُ جَابِرَ بْنَ زَيْدٍ ."
  },
  "1448": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1448\nIn-book reference  : Book 17, Hadith 18\nUSC-MSA web (English) reference  : Book 8, Hadith 3411\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَحْمَدُ بْنُ عِيسَى، قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ مُسْلِمٍ، يَقُولُ سَمِعْتُ مُحَمَّدَ بْنَ مُسْلِمٍ، يَقُولُ سَمِعْتُ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، يَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ قِيلَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَيْنَ أَنْتَ يَا رَسُولَ اللَّهِ عَنِ ابْنَةِ حَمْزَةَ . أَوْ قِيلَ أَلاَ تَخْطُبُ بِنْتَ حَمْزَةَ بْنِ عَبْدِ الْمُطَّلِبِ قَالَ \" إِنَّ حَمْزَةَ أَخِي مِنَ الرَّضَاعَةِ \" ."
  },
  "1449": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1449d\nIn-book reference  : Book 17, Hadith 22\nUSC-MSA web (English) reference  : Book 8, Hadith 3413\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِيهِ عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ، خَالِدٍ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنِي يَعْقُوبُ بْنُ إِبْرَاهِيمَ الزُّهْرِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ مُسْلِمٍ كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِإِسْنَادِ ابْنِ أَبِي حَبِيبٍ عَنْهُ نَحْوَ حَدِيثِهِ وَلَمْ يُسَمِّ أَحَدٌ مِنْهُمْ فِي حَدِيثِهِ عَزَّةَ غَيْرُ يَزِيدَ بْنِ أَبِي حَبِيبٍ ."
  },
  "1450": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1450\nIn-book reference  : Book 17, Hadith 23\nUSC-MSA web (English) reference  : Book 8, Hadith 3414\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا إِسْمَاعِيلُ، ح وَحَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا مُعْتَمِرُ بْنُ سُلَيْمَانَ، كِلاَهُمَا عَنْ أَيُّوبَ، عَنِ ابْنِ أَبِي مُلَيْكَةَ، عَنْ عَبْدِ اللَّهِ بْنِ الزُّبَيْرِ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ سُوَيْدٌ وَزُهَيْرٌ إِنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" لاَ تُحَرِّمُ الْمَصَّةُ وَالْمَصَّتَانِ \" ."
  },
  "1451": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1451f\nIn-book reference  : Book 17, Hadith 29\nUSC-MSA web (English) reference  : Book 8, Hadith 3420\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ سَعِيدٍ الدَّارِمِيُّ، حَدَّثَنَا حَبَّانُ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا قَتَادَةُ، عَنْ أَبِي، الْخَلِيلِ عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ أُمِّ الْفَضْلِ، سَأَلَ رَجُلٌ النَّبِيَّ صلى الله عليه وسلم أَتُحَرِّمُ الْمَصَّةُ فَقَالَ \" لاَ \" ."
  },
  "1452": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1452c\nIn-book reference  : Book 17, Hadith 32\nUSC-MSA web (English) reference  : Book 8, Hadith 3423\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَعِيدٍ، قَالَ أَخْبَرَتْنِي عَمْرَةُ، أَنَّهَا سَمِعَتْ عَائِشَةَ، تَقُولُ . بِمِثْلِهِ ."
  },
  "1453": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1453e\nIn-book reference  : Book 17, Hadith 37\nUSC-MSA web (English) reference  : Book 8, Hadith 3428\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَهَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، - وَاللَّفْظُ لِهَارُونَ - قَالاَ حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي مَخْرَمَةُ بْنُ بُكَيْرٍ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ حُمَيْدَ بْنَ نَافِعٍ، يَقُولُ سَمِعْتُ زَيْنَبَ، بِنْتَ أَبِي سَلَمَةَ تَقُولُ سَمِعْتُ أُمَّ سَلَمَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم تَقُولُ لِعَائِشَةَ وَاللَّهِ مَا تَطِيبُ نَفْسِي أَنْ يَرَانِي الْغُلاَمُ قَدِ اسْتَغْنَى عَنِ الرَّضَاعَةِ . فَقَالَتْ لِمَ قَدْ جَاءَتْ سَهْلَةُ بِنْتُ سُهَيْلٍ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ يَا رَسُولَ اللَّهِ وَاللَّهِ إِنِّي لأَرَى فِي وَجْهِ أَبِي حُذَيْفَةَ مِنْ دُخُولِ سَالِمٍ . قَالَتْ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَرْضِعِيهِ \" . فَقَالَتْ إِنَّهُ ذُو لِحْيَةٍ . فَقَالَ \" أَرْضِعِيهِ يَذْهَبْ مَا فِي وَجْهِ أَبِي حُذَيْفَةَ \" . فَقَالَتْ وَاللَّهِ مَا عَرَفْتُهُ فِي وَجْهِ أَبِي حُذَيْفَةَ ."
  },
  "1454": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1454\nIn-book reference  : Book 17, Hadith 38\nUSC-MSA web (English) reference  : Book 8, Hadith 3429\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي عُقَيْلُ بْنُ، خَالِدٍ عَنِ ابْنِ شِهَابٍ، أَنَّهُ قَالَ أَخْبَرَنِي أَبُو عُبَيْدَةَ بْنُ عَبْدِ اللَّهِ بْنِ زَمْعَةَ، أَنَّ أُمَّهُ، زَيْنَبَ بِنْتَ أَبِي سَلَمَةَ أَخْبَرَتْهُ أَنَّ أُمَّهَا أُمَّ سَلَمَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَانَتْ تَقُولُ أَبَى سَائِرُ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم أَنْ يُدْخِلْنَ عَلَيْهِنَّ أَحَدًا بِتِلْكَ الرَّضَاعَةِ وَقُلْنَ لِعَائِشَةَ وَاللَّهِ مَا نَرَى هَذَا إِلاَّ رُخْصَةً أَرْخَصَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم لِسَالِمٍ خَاصَّةً فَمَا هُوَ بِدَاخِلٍ عَلَيْنَا أَحَدٌ بِهَذِهِ الرَّضَاعَةِ وَلاَ رَائِينَا."
  },
  "1455": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1455b\nIn-book reference  : Book 17, Hadith 40\nUSC-MSA web (English) reference  : Book 8, Hadith 3431\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي قَالاَ، جَمِيعًا حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، جَمِيعًا عَنْ سُفْيَانَ، ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، حَدَّثَنَا حُسَيْنٌ الْجُعْفِيُّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَشْعَثَ بْنِ أَبِي الشَّعْثَاءِ، بِإِسْنَادِ أَبِي الأَحْوَصِ كَمَعْنَى حَدِيثِهِ غَيْرَ أَنَّهُمْ قَالُوا \" مِنَ الْمَجَاعَةِ \"."
  },
  "1456": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1456e\nIn-book reference  : Book 17, Hadith 45\nUSC-MSA web (English) reference  : Book 8, Hadith 3434\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "1457": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1457b\nIn-book reference  : Book 17, Hadith 47\nUSC-MSA web (English) reference  : Book 8, Hadith 3436\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ قَالُوا حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، كِلاَهُمَا عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ نَحْوَهُ . غَيْرَ أَنَّ مَعْمَرًا وَابْنَ عُيَيْنَةَ فِي حَدِيثِهِمَا \" الْوَلَدُ لِلْفِرَاشِ \" . وَلَمْ يَذْكُرَا \" وَلِلْعَاهِرِ الْحَجَرُ \" ."
  },
  "1458": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1458b\nIn-book reference  : Book 17, Hadith 49\nUSC-MSA web (English) reference  : Book 8, Hadith 3438\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَزُهَيْرُ بْنُ حَرْبٍ، وَعَبْدُ الأَعْلَى بْنُ حَمَّادٍ، وَعَمْرٌو النَّاقِدُ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، أَمَّا ابْنُ مَنْصُورٍ فَقَالَ عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَمَّا، عَبْدُ الأَعْلَى فَقَالَ عَنْ أَبِي سَلَمَةَ، أَوْ عَنْ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، وَقَالَ، زُهَيْرٌ عَنْ سَعِيدٍ، أَوْ عَنْ أَبِي سَلَمَةَ، أَحَدُهُمَا أَوْ كِلاَهُمَا عَنْ أَبِي هُرَيْرَةَ، وَقَالَ، عَمْرٌو حَدَّثَنَا سُفْيَانُ، مَرَّةً عَنِ الزُّهْرِيِّ، عَنْ سَعِيدٍ، وَأَبِي، سَلَمَةَ وَمَرَّةً عَنْ سَعِيدٍ، أَوْ أَبِي سَلَمَةَ وَمَرَّةً عَنْ سَعِيدٍ، عَنْ أَبِي، هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ مَعْمَرٍ ."
  },
  "1459": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1459d\nIn-book reference  : Book 17, Hadith 53\nUSC-MSA web (English) reference  : Book 8, Hadith 3442\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، ح وَحَدَّثَنَا عَبْدُ بْنُ، حُمَيْدٍ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، وَابْنُ، جُرَيْجٍ كُلُّهُمْ عَنِ الزُّهْرِيِّ، بِهَذَا الإِسْنَادِ . بِمَعْنَى حَدِيثِهِمْ . وَزَادَ فِي حَدِيثِ يُونُسَ وَكَانَ مُجَزِّزٌ قَائِفًا ."
  },
  "1460": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1460e\nIn-book reference  : Book 17, Hadith 58\nUSC-MSA web (English) reference  : Book 8, Hadith 3447\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنِي أَبُو كُرَيْبٍ، مُحَمَّدُ بْنُ الْعَلاَءِ حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - عَنْ عَبْدِ، الْوَاحِدِ بْنِ أَيْمَنَ عَنْ أَبِي بَكْرِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ هِشَامٍ، عَنْ أُمِّ سَلَمَةَ، ذَكَرَ أَنَّصلى الله عليه وسلم تَزَوَّجَهَا وَذَكَرَ أَشْيَاءَ هَذَا فِيهِ قَالَ \" إِنْ شِئْتِ أَنْ أُسَبِّعَ لَكِ وَأُسَبِّعَ لِنِسَائِي وَإِنْ سَبَّعْتُ لَكِ سَبَّعْتُ لِنِسَائِي \" ."
  },
  "1461": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1461b\nIn-book reference  : Book 17, Hadith 60\nUSC-MSA web (English) reference  : Book 8, Hadith 3449\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، عَنْ أَيُّوبَ، وَخَالِدٍ، الْحَذَّاءِ عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ مِنَ السُّنَّةِ أَنْ يُقِيمَ، عِنْدَ الْبِكْرِ سَبْعًا . قَالَ خَالِدٌ وَلَوْ شِئْتُ قُلْتُ رَفَعَهُ إِلَى النَّبِيِّ صلى الله عليه وسلم ."
  },
  "1462": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1462\nIn-book reference  : Book 17, Hadith 61\nUSC-MSA web (English) reference  : Book 8, Hadith 3450\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ بْنُ سَوَّارٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، قَالَ كَانَ لِلنَّبِيِّ صلى الله عليه وسلم تِسْعُ نِسْوَةٍ فَكَانَ إِذَا قَسَمَ بَيْنَهُنَّ لاَ يَنْتَهِي إِلَى الْمَرْأَةِ الأُولَى إِلاَّ فِي تِسْعٍ فَكُنَّ يَجْتَمِعْنَ كُلَّ لَيْلَةٍ فِي بَيْتِ الَّتِي يَأْتِيهَا فَكَانَ فِي بَيْتِ عَائِشَةَ فَجَاءَتْ زَيْنَبُ فَمَدَّ يَدَهُ إِلَيْهَا فَقَالَتْ هَذِهِ زَيْنَبُ . فَكَفَّ النَّبِيُّ صلى الله عليه وسلم يَدَهُ . فَتَقَاوَلَتَا حَتَّى اسْتَخَبَتَا وَأُقِيمَتِ الصَّلاَةُ فَمَرَّ أَبُو بَكْرٍ عَلَى ذَلِكَ فَسَمِعَ أَصْوَاتَهُمَا فَقَالَ اخْرُجْ يَا رَسُولَ اللَّهِ إِلَى الصَّلاَةِ وَاحْثُ فِي أَفْوَاهِهِنَّ التُّرَابَ . فَخَرَجَ النَّبِيُّ صلى الله عليه وسلم فَقَالَتْ عَائِشَةُ الآنَ يَقْضِي النَّبِيُّ صلى الله عليه وسلم صَلاَتَهُ فَيَجِيءُ أَبُو بَكْرٍ فَيَفْعَلُ بِي وَيَفْعَلُ . فَلَمَّا قَضَى النَّبِيُّ صلى الله عليه وسلم صَلاَتَهُ أَتَاهَا أَبُو بَكْرٍ فَقَالَ لَهَا قَوْلاً شَدِيدًا وَقَالَ أَتَصْنَعِينَ هَذَا."
  },
  "1463": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1463b\nIn-book reference  : Book 17, Hadith 63\nUSC-MSA web (English) reference  : Book 8, Hadith 3452\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُقْبَةُ بْنُ خَالِدٍ، ح وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، حَدَّثَنَا زُهَيْرٌ، ح وَحَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَرِيكٌ، كُلُّهُمْ عَنْ هِشَامٍ، بِهَذَا الإِسْنَادِ أَنَّ سَوْدَةَ، لَمَّا كَبِرَتْ . بِمَعْنَى حَدِيثِ جَرِيرٍ وَزَادَ فِي حَدِيثِ شَرِيكٍ قَالَتْ وَكَانَتْ أَوَّلَ امْرَأَةٍ تَزَوَّجَهَا بَعْدِي ."
  },
  "1464": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1464b\nIn-book reference  : Book 17, Hadith 65\nUSC-MSA web (English) reference  : Book 8, Hadith 3454\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّهَا كَانَتْ تَقُولُ أَمَا تَسْتَحْيِي امْرَأَةٌ تَهَبُ نَفْسَهَا لِرَجُلٍ حَتَّى أَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { تُرْجِي مَنْ تَشَاءُ مِنْهُنَّ وَتُؤْوِي إِلَيْكَ مَنْ تَشَاءُ} فَقُلْتُ إِنَّ رَبَّكَ لَيُسَارِعُ لَكَ فِي هَوَاكَ."
  },
  "1465": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1465b\nIn-book reference  : Book 17, Hadith 67\nUSC-MSA web (English) reference  : Book 8, Hadith 3456\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، بِهَذَا الإِسْنَادِ وَزَادَ قَالَ عَطَاءٌ كَانَتْ آخِرَهُنَّ مَوْتًا مَاتَتْ بِالْمَدِينَةِ ."
  },
  "1466": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1466\nIn-book reference  : Book 17, Hadith 68\nUSC-MSA web (English) reference  : Book 8, Hadith 3457\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا يَحْيَى، بْنُ سَعِيدٍ عَنْ عُبَيْدِ اللَّهِ، أَخْبَرَنِي سَعِيدُ بْنُ أَبِي سَعِيدٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" تُنْكَحُ الْمَرْأَةُ لأَرْبَعٍ لِمَالِهَا وَلِحَسَبِهَا وَلِجَمَالِهَا وَلِدِينِهَا فَاظْفَرْ بِذَاتِ الدِّينِ تَرِبَتْ يَدَاكَ \" ."
  },
  "715": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 715l\nIn-book reference  : Book 17, Hadith 77\nUSC-MSA web (English) reference  : Book 8, Hadith 3466\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي ابْنُ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ الْمَرْأَةَ كَالضِّلَعِ إِذَا ذَهَبْتَ تُقِيمُهَا كَسَرْتَهَا وَإِنْ تَرَكْتَهَا اسْتَمْتَعْتَ بِهَا وَفِيهَا عِوَجٌ \" ."
  },
  "1467": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1467b\nIn-book reference  : Book 17, Hadith 79\nUSC-MSA web (English) reference  : Book 8, Hadith 3467\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "حَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لاِبْنِ أَبِي عُمَرَ - قَالاَ حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ الْمَرْأَةَ خُلِقَتْ مِنْ ضِلَعٍ لَنْ تَسْتَقِيمَ لَكَ عَلَى طَرِيقَةٍ فَإِنِ اسْتَمْتَعْتَ بِهَا اسْتَمْتَعْتَ بِهَا وَبِهَا عِوَجٌ وَإِنْ ذَهَبْتَ تُقِيمُهَا كَسَرْتَهَا وَكَسْرُهَا طَلاَقُهَا \" ."
  },
  "1468": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1468b\nIn-book reference  : Book 17, Hadith 81\nUSC-MSA web (English) reference  : Book 8, Hadith 3469\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى الرَّازِيُّ، حَدَّثَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَفْرَكْ مُؤْمِنٌ مُؤْمِنَةً إِنْ كَرِهَ مِنْهَا خُلُقًا رَضِيَ مِنْهَا آخَرَ \" . أَوْ قَالَ \" غَيْرَهُ \" ."
  },
  "1469": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1469\nIn-book reference  : Book 17, Hadith 82\nUSC-MSA web (English) reference  : Book 8, Hadith 3470\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو عَاصِمٍ، حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، حَدَّثَنَا عِمْرَانُ بْنُ أَبِي أَنَسٍ، عَنْ عُمَرَ بْنِ الْحَكَمِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1470": {
    "collection": "Sahih Muslim",
    "book": "The Book of Suckling",
    "book_num": "17",
    "reference": "Reference  : Sahih Muslim 1470b\nIn-book reference  : Book 17, Hadith 84\nUSC-MSA web (English) reference  : Book 8, Hadith 3472\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/17",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَوْلاَ بَنُو إِسْرَائِيلَ لَمْ يَخْبُثِ الطَّعَامُ وَلَمْ يَخْنَزِ اللَّحْمُ وَلَوْلاَ حَوَّاءُ لَمْ تَخُنْ أُنْثَى زَوْجَهَا الدَّهْرَ \" ."
  }
}