{
  "1903850": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903850\nIn-book reference  : Book 54, Hadith 001\nEnglish translation  : Vol. 1, Book 54, Hadith 001",
    "url": "https://sunnah.com/shamail/54",
    "text": "Anas ibn Malik said: \"The last occasion when I caught sight of Allah’s Messenger (Allah bless him and give him peace) was the unveiling of the curtain on a Monday. I looked at his face as if it were a parchment of the Qur’an, as the people were performing the ritual prayer behind Abu Bakr. The people were about to get restless, so he gestured to them to keep calm, as Abu Bakr led them in prayer, and he cast the curtain aside. Allah’s Messenger (Allah bless him and give him peace) died at the end of that day.”"
  },
  "1903860": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903860\nIn-book reference  : Book 54, Hadith 002\nEnglish translation  : Vol. 1, Book 54, Hadith 002",
    "url": "https://sunnah.com/shamail/54",
    "text": "A’isha said: \"I was resting the Prophet (Allah bless him and give him peace) on my chest (or: on my lap), when he called for a basin in which to urinate. Then he urinated and died soon after.”"
  },
  "1903870": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903870\nIn-book reference  : Book 54, Hadith 003\nEnglish translation  : Vol. 1, Book 54, Hadith 003",
    "url": "https://sunnah.com/shamail/54",
    "text": "A’isha said: \"I saw Allah’s Messenger (Allah bless him and give him peace) when he was at the point of death, and beside him there was a vessel containing water. He would dip his hand into the vessel, then wipe his face with the water, saying: 'O Allah, help me against the atrocities of death (or: the agonies of death)!’”"
  },
  "1903880": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903880\nIn-book reference  : Book 54, Hadith 004\nEnglish translation  : Vol. 1, Book 54, Hadith 004",
    "url": "https://sunnah.com/shamail/54",
    "text": "'A’isha said: \"No more will I envy anyone for an easy death now that I have seen how the Messenger of Allah (Allah bless him and give him peace) suffered in his passing.”"
  },
  "1903890": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903890\nIn-book reference  : Book 54, Hadith 005\nEnglish translation  : Vol. 1, Book 54, Hadith 005",
    "url": "https://sunnah.com/shamail/54",
    "text": "A’isha said: \"When Allah’s Messenger died (Allah bless him and give him peace), they disagreed over where to bury him, so Abu Bakr said: “I heard Allah’s Messenger (Allah bless him and give him peace) say something I have never forgotten. He said: ‘Never has Allah taken a Prophet [from this world], but in the place where he would want to be buried.’ So bury him in the spot where his pallet is!'”"
  },
  "1903900": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903900\nIn-book reference  : Book 54, Hadith 006\nEnglish translation  : Vol. 1, Book 54, Hadith 006",
    "url": "https://sunnah.com/shamail/54",
    "text": "Ibn 'Abbas and ‘A’isha report: \"Abu Bakr kissed the Prophet (Allah bless him and give him peace) after he died.”"
  },
  "1903910": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903910\nIn-book reference  : Book 54, Hadith 007\nEnglish translation  : Vol. 1, Book 54, Hadith 007",
    "url": "https://sunnah.com/shamail/54",
    "text": "A’isha said: \"Abu Bakr entered the presence of the Prophet (Allah bless him and give him peace) after his demise, whereupon he placed his mouth between his eyes, and his hands on his forearms, exclaiming: 'O Prophet! O best friend! O bosom friend!'”"
  },
  "1903920": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903920\nIn-book reference  : Book 54, Hadith 008\nEnglish translation  : Vol. 1, Book 54, Hadith 008",
    "url": "https://sunnah.com/shamail/54",
    "text": "Anas said: \"On the day when Allah’s Messenger (Allah bless him and give him peace) entered Medina, every part of it shone bright, and on the day when he died, every part of it was gloomy. We did not shake the dust off our hands, and we were engaged in his burial until we no longer recognized our own hearts.”"
  },
  "1903930": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903930\nIn-book reference  : Book 54, Hadith 009\nEnglish translation  : Vol. 1, Book 54, Hadith 009",
    "url": "https://sunnah.com/shamail/54",
    "text": "A’isha said: \"Allah’s Messenger died (Allah bless him and give him peace) on a Monday.”"
  },
  "1903940": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903940\nIn-book reference  : Book 54, Hadith 010\nEnglish translation  : Vol. 1, Book 54, Hadith 010",
    "url": "https://sunnah.com/shamail/54",
    "text": "Ja'far ibn Muhammad reported that his father said: \"Allah’s Messenger (Allah bless him and give him peace) died on Monday, after which he remained that day and Tuesday night, and he was buried during the night.” According to Sufyan [ibn 'Uyaina], someone else said: “The sound of the iron shovels could be heard during the latter part of the night.”"
  },
  "1903950": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903950\nIn-book reference  : Book 54, Hadith 011\nEnglish translation  : Vol. 1, Book 54, Hadith 011",
    "url": "https://sunnah.com/shamail/54",
    "text": "Abu Salama ibn 'Abd ar-Rahman ibn 'Awf said: \"Allah’s Messenger (Allah bless him and give him peace) died on Monday and he was buried on Tuesday.”"
  },
  "1903960": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903960\nIn-book reference  : Book 54, Hadith 012\nEnglish translation  : Vol. 1, Book 54, Hadith 012",
    "url": "https://sunnah.com/shamail/54",
    "text": "Salim ibn 'Ubaida said: “Allah’s Messenger (Allah bless him and give him peace) lost consciousness in his illness, then he regained consciousness and said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ Then he lost consciousness, and when he recovered, he said: ‘Has the ritual prayer arrived?’ They said: ‘Yes,’ so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer.’ 'A'isha then said: ‘My father is a melancholy man. If he is given that responsibility, he will weep and lose command of himself. SO if only you would appoint someone else!' He [Salim] said: “Then he lost consciousness and recovered, so he said: ‘Command Bilal to give the call to prayer, and command Abu Bakr to lead the people in prayer, for you are the female companions of Yusuf!’ Bilal was therefore commanded, so he gave the call to prayer, and Abu Bakr was commanded, so he led the people in prayer. Then Allah’s Messenger (Allah bless him and give him peace) felt light in the head, so he said: ‘Find me someone I can lean on!’ Barira and another man therefore came to him, so he leaned on them. When Abu Bakr saw him, the man was about to withdraw, but he signaled for him to stay in his place until Abu Bakr completed his ritual prayer. Then Allah’s Messenger died (Allah bless him and give him peace), so 'Umar said: ‘If I hear anyone mention that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!”’ He [Salim] said: “The people were unlettered folk among whom there had never come a prophet before, so they held their tongues. But then they said: ‘O Salim, go to the Companion of Allah’s Messenger (Allah bless him and give him peace) and summon him.’ So I went to see Abu Bakr, in the mosque. I came to him weeping and perplexed, so when he saw me, he said: ‘Has Allah’s Messenger died (Allah bless him and give him peace)?’ I replied: 'Umar says: “If anyone mentions that Allah’s Messenger (Allah bless him and give him peace) has died, I will strike him with this sword of mine!” He then said to me: ‘Go outside,’ so I went outside with him. Then he came and found the people in the presence of Allah’s Messenger (Allah bless him and give him peace). “He therefore said: ‘O people, get out of my way,’ so they got out of his way. Then he leaned over him and touched him, saying: “You will surely die, and they will surely die.\" [inna-ka mayyitun wa inna-hum mayyitun].” (Al-Qur'an.39:3O). Then they said: ‘O Companion of Allah’s Messenger (Allah bless him and give him peace), should the funeral prayer be performed for Allah’s Messenger?’ When he said: ‘Yes,’ they asked: And how?’ He said: A group will enter, proclaim the Supreme Greatness of Allah, perform the ritual prayer and offer supplication. Then they will go out, so that other people may enter.’ They said: ‘O Companion of Allah’s Messenger (Allah bless him and give him peace), should Allah’s Messenger (Allah bless him and give him peace) be buried?’ When he said: ‘Yes,’ they asked: ‘Where?’ He said: ‘In the place in which Allah took his spirit, for Allah would not take his spirit in a place that was not good,’ and they knew that he had spoken the truth.’ Then he gave instructions for the sons of his father to bathe him, and the Emigrants [al-Muhajirun] assembled, consulting with one another. They said: ‘Take us to our brethren among the Helpers [al-Ansar], so that we may include them with us in this business.' The Helpers then said: ‘There should be a commander among us and a commander among you,’ so 'Umar ibn al-Khattab said: ‘Who has the like of these three [excellent merits of Abu Bakr]? [In the words of the Qur’an]: “The second of the two; when the two of them were in the cave, when he said to his companion: ‘Do not grieve. Allah is with us [thaniya’thnaini idh huma fi’l-ghari idh yaqulu li-sahibi-hi la tahzan inna’llaha ma'a-na].’” (Al-Qur'an.9:4O). Who are the two of them?’ Then he extended his hand, so they pledged allegiance to him, and the people paid him a beautiful homage.”"
  },
  "1903970": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903970\nIn-book reference  : Book 54, Hadith 013\nEnglish translation  : Vol. 1, Book 54, Hadith 013",
    "url": "https://sunnah.com/shamail/54",
    "text": "Anas ibn Malik said: \"When Allah’s Messenger (Allah bless him and give him peace) was enduring of the agony of death, Fatima (may Allah be well pleased with her) exclaimed: 'Alas for his agony!' to which the Prophet replied (Allah bless him and give him peace): 'Your father will suffer no agony from this day forth. Your father has met the fate from which no one is exempt, and which precedes ones appearance before Allah on the Day of Resurrection.'”"
  },
  "1903980": {
    "collection": "Shama'il Muhammadiyah",
    "book": "The Death Of Sayyidina Rasoolullah",
    "book_num": "54",
    "reference": "Reference  : Shama'il Muhammadiyah 1903980\nIn-book reference  : Book 54, Hadith 014\nEnglish translation  : Vol. 1, Book 54, Hadith 014",
    "url": "https://sunnah.com/shamail/54",
    "text": "Ibn 'Abbas (may Allah the Exalted be well pleased with him and his father) related that: he heard Allah’s Messenger say (Allah bless him and give him peace): 'If someone has two children from my Community who died an untimely death, Allah will cause him to enter the Garden of Paradise on their account,' so 'A'isha said (may Allah be well pleased with her): 'What about someone who has only one child from your Community who has died an untimely death?' He said: 'Also someone who has only one child who has died young, O favored one!' She said: 'So what about someone who does not have any child from your Community who has died as an infant?' He said: 'I am a child of my Community who died an untimely death. Never again will they be afflicted by the loss of the likes of me!'”"
  }
}