{
  "1902410": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902410\nIn-book reference  : Book 36, Hadith 001\nEnglish translation  : Vol. 1, Book 36, Hadith 001",
    "url": "https://sunnah.com/shamail/36",
    "text": "'A’isha (may Allah be well pleased with her) said that she was asked: \"Was Allah’s Messenger (Allah bless him and give him peace) used to imitating any form of poetry?\" She said: \"He used to imitate the poetry of Ibn Rawaha, and he would imitate his saying: “You will be brought the news by someone whom you have not furnished with travel provisions.”"
  },
  "1902420": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902420\nIn-book reference  : Book 36, Hadith 002\nEnglish translation  : Vol. 1, Book 36, Hadith 002",
    "url": "https://sunnah.com/shamail/36",
    "text": "Abu Huraira said (may Allah be well pleased with him): “Allah’s Messenger said (Allah bless him and give him peace): ‘The most truthful saying spoken by a poet is the saying of Labid: Everything but Allah is surely futile,’ and [the poet] Umayya ibn Abi’s-Salt almost embraced Islam.’”"
  },
  "1902430": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902430\nIn-book reference  : Book 36, Hadith 003\nEnglish translation  : Vol. 1, Book 36, Hadith 003",
    "url": "https://sunnah.com/shamail/36",
    "text": "Jundub ibn Sufyan al-Bajali said: “A stone hit the finger of Allah’s Messenger (Allah bless him and give him peace), causing it to bleed, so he said [in poetic verse]: 'Are you nothing but a finger that has bled without having suffered in Allah’s cause?'”"
  },
  "1902450": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902450\nIn-book reference  : Book 36, Hadith 004\nEnglish translation  : Vol. 1, Book 36, Hadith 004",
    "url": "https://sunnah.com/shamail/36",
    "text": "Al-Bara’ ibn 'Azib reported that: A man said to him: “Did you all flee from Allah’s Messenger (Allah bless him and give him peace), O Abu 'Umara?” He replied: “No, by Allah! Allah’s Messenger (Allah bless him and give him peace) did not retreat, but those who were hasty retreated, being assailed by the arrows of the Hawazin. Allah’s Messenger (Allah bless him and give him peace) was mounted on his female mule, while Abu Sufyan ibn al-Harith ibn 'Abd al-Muttalib was holding its bridle, and Allah’s Messenger (Allah bless him and give him peace) was saying [in poetic verse]: 'I am the Prophet, no lie! I am the son of 'Abd al-Muttalib!'”"
  },
  "1902460": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902460\nIn-book reference  : Book 36, Hadith 005\nEnglish translation  : Vol. 1, Book 36, Hadith 005",
    "url": "https://sunnah.com/shamail/36",
    "text": "Anas said: \"The Prophet (Allah bless him and give him peace) entered Mecca during the Visitation of Fulfillment ['Umrat al- Qada'], and Ibn Rawaha walked in front of him, saying [in poetic verse]: “Clear away from his path, O sons of the unbelievers! Today we shall prevent you from bringing it to a halt, with a blow that removes the owls from its way station, and distracts the bosom friend from his bosom friend!” 'Umar then said: “O Ibn Rawaha, you dare to utter poetry before Allah’s Messenger (Allah bless him and give him peace) and in Allah’s Sanctuary!” But he said (Allah bless him and give him peace): “Leave him alone, O 'Umar, for it will strike them down more quickly than a shower of arrows!’”"
  },
  "1902470": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902470\nIn-book reference  : Book 36, Hadith 006\nEnglish translation  : Vol. 1, Book 36, Hadith 006",
    "url": "https://sunnah.com/shamail/36",
    "text": "Jabir ibn Samura said: ‘I sat with the Prophet (Allah bless him and give him peace) more than one hundred times, and his Companions used to recite poetry to one another. They would also reminisce over things relating to the pagan era [al-jahiliyya], while he was silent and sometimes even smiled with them.’”"
  },
  "1902480": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902480\nIn-book reference  : Book 36, Hadith 007\nEnglish translation  : Vol. 1, Book 36, Hadith 007",
    "url": "https://sunnah.com/shamail/36",
    "text": "Abu Huraira said: “As the Prophet said (Allah bless him and give him peace):‘The most poetic saying spoken by the Arabs is the saying of Labid: “Everything but Allah is surely futile!'”"
  },
  "1902490": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902490\nIn-book reference  : Book 36, Hadith 008\nEnglish translation  : Vol. 1, Book 36, Hadith 008",
    "url": "https://sunnah.com/shamail/36",
    "text": "'Amr ibn ash-Sharid reported that his father said: \"As I rode behind the Prophet (Allah bless him and give him peace), I recited to him a hundred poetic verses, composed by Umayya ibn Abi’s-Salt. Whenever I recited a verse to him, the Prophet (Allah bless him and give him peace) said to me: “Recite more!” until I had recited a hundred, meaning verses,to him.”’ The Prophet (Allah bless him and give him peace) therefore said: 'He was surely near to embracing Islam!'\""
  },
  "1902500": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Description Of The Saying Of Rasoolullah On Poetry",
    "book_num": "36",
    "reference": "Reference  : Shama'il Muhammadiyah 1902500\nIn-book reference  : Book 36, Hadith 009\nEnglish translation  : Vol. 1, Book 36, Hadith 009",
    "url": "https://sunnah.com/shamail/36",
    "text": "'A’isha said: \"Allah’s Messenger (Allah bless him and give him peace) used to set up a pulpit in the mosque for Hassan ibn Thabit. He would stand upright upon it, paying tribute to Allah’s Messenger (Allah bless him and give him peace)’ or: ‘defending Allah’s Messenger (Allah bless him and give him peace).’ He would say (Allah bless him and give him peace): “Allah (Exalted is He) supports Hassan with the Spirit of Holiness, when he defends or pays tribute to Allah’s Messenger (Allah bless him and give him peace)!'”"
  }
}