{
  "1902610": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902610\nIn-book reference  : Book 40, Hadith 001\nEnglish translation  : Vol. 1, Book 40, Hadith 001",
    "url": "https://sunnah.com/shamail/40",
    "text": "Al-Mughira ibn Shu'ba said (may Allah be well pleased with him): \"Allah’s Messenger (Allah bless him and give him peace) performed the ritual prayer until his feet became swollen, so he was asked: 'Must you burden yourself with this, when Allah has already forgiven you your former and your latter sins?' He replied: 'Shall I not be a thankful servant?'”"
  },
  "1902620": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902620\nIn-book reference  : Book 40, Hadith 002\nEnglish translation  : Vol. 1, Book 40, Hadith 002",
    "url": "https://sunnah.com/shamail/40",
    "text": "Abu Huraira said (may Allah be well pleased with him): \"Allah’s Messenger (Allah bless him and give him peace) used to perform the ritual prayer until his feet had begun to swell, so he was asked: 'Must you do this, when it has come to you that Allah has already forgiven you your former and your latter sins?’ He replied: 'Shall I not be a thankful servant?'”"
  },
  "1902630": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902630\nIn-book reference  : Book 40, Hadith 003\nEnglish translation  : Vol. 1, Book 40, Hadith 003",
    "url": "https://sunnah.com/shamail/40",
    "text": "It is also reported from Abu Huraira, may Allah be well pleased with him that: Allah’s Messenger (Allah bless him and give him peace) used to stand performing the ritual prayer until his feet had begun to swell, so he would be asked: “O Messenger of Allah, must you do this, when Allah has already forgiven you your former and your latter sins?” He replied: “Shall I not be a thankful servant?”"
  },
  "1902640": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902640\nIn-book reference  : Book 40, Hadith 004\nEnglish translation  : Vol. 1, Book 40, Hadith 004",
    "url": "https://sunnah.com/shamail/40",
    "text": "Al-Aswad ibn Yazid said: “I asked 'A'sha (may Allah be well pleased with her) about the nighttime ritual prayer of Allah’s Messenger (Allah bless him and give him peace), so she said: ‘He used to sleep at the beginning of the night. Then he would get up, and when it was the time before daybreak, he performed a witr [a ritual prayer with an odd number of cycles]. Then he came to his mattress, and if he had a need, he had sexual intercourse with his wife. When he heard the call to prayer, he sprang up, and if he was in a state of major ritual impurity, he poured water over himself, and if not, he performed the minor ritual ablution and went out to the ritual prayer.”"
  },
  "1902650": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902650\nIn-book reference  : Book 40, Hadith 005\nEnglish translation  : Vol. 1, Book 40, Hadith 005",
    "url": "https://sunnah.com/shamail/40",
    "text": "Ibn 'Abbas informed him that he spent the night in the home of Maimuna, his maternal aunt and he said: \"I reclined across the cushion and Allah’s Messenger (Allah bless him and give him peace) reclined lengthwise, whereupon Allah’s Messenger (Allah bless him and give him peace) slept until the middle of the night, or a little while before or after it. Allah’s Messenger (Allah bless him and give him peace) then woke up, wiped the sleep off his face, and recited the final ten verses of the Sura of the Family of ‘Imran [Al 'Imran]. Then he approached a suspended waterskin, performed the minor ritual ablution and performed it well, after which he performed the ritual prayer.” Abdullah ibn 'Abbas said: “I got up and stood by his side, whereupon Allah’s Messenger (Allah bless him and give him peace) placed his right hand on my head, gripped my right ear and twisted it. After this he performed two cycles of ritual prayer, then two more cycles, then two more cycles, then two more cycles, then two more cycles, then two more cycles..” He (Ma'an) said: “... six times, after which he performed an odd-numbered cycle. Then he reclined until the muezzin came to him, whereupon he got up and performed two abbreviated cycles. Then he went out and performed the early-morning ritual prayer\"."
  },
  "1902660": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902660\nIn-book reference  : Book 40, Hadith 006\nEnglish translation  : Vol. 1, Book 40, Hadith 006",
    "url": "https://sunnah.com/shamail/40",
    "text": "Ibn 'Abbas said: \"The Prophet (Allah bless him and give him peace) used to perform thirteen cycles of ritual prayer during the night.”"
  },
  "1902670": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902670\nIn-book reference  : Book 40, Hadith 007\nEnglish translation  : Vol. 1, Book 40, Hadith 007",
    "url": "https://sunnah.com/shamail/40",
    "text": "A’isha said: \"If the Prophet (Allah bless him and give him peace) did not perform the ritual prayer during the night, because sleep had prevented him, or his eyes had been too weary, during the daytime, he would perform twelve cycles of ritual prayer during the daytime.”"
  },
  "1902680": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902680\nIn-book reference  : Book 40, Hadith 008\nEnglish translation  : Vol. 1, Book 40, Hadith 008",
    "url": "https://sunnah.com/shamail/40",
    "text": "Abu Huraira said: \"The Prophet said (Allah bless him and give him peace): 'If one of you gets up during the night, let him begin his ritual prayer with two abbreviated cycles.'”"
  },
  "1902690": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902690\nIn-book reference  : Book 40, Hadith 009\nEnglish translation  : Vol. 1, Book 40, Hadith 009",
    "url": "https://sunnah.com/shamail/40",
    "text": "Zaid ibn Khalid al-jahuhani said: “Determined to contemplate the ritual prayer of the Prophet (Allah bless him and give him peace) intently, for I laid my head on his doorstep or [the entrance to] his hair tent. Allah’s Messenger (Allah bless him and give him peace) then performed two brisk cycles of ritual prayer. After this he performed two long, long, long cycles. Then he performed two cycles that were shorter than the two before them. Then he performed two cycles that were shorter than the two that were before them. Then he performed two cycles that were shorter than the two that preceded them. Then he performed two cycles that were shorter than the two that were before them. Finally he performed a single-numbered cycle, which added up to a total of thirteen cycles.”"
  },
  "1902700": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902700\nIn-book reference  : Book 40, Hadith 010\nEnglish translation  : Vol. 1, Book 40, Hadith 010",
    "url": "https://sunnah.com/shamail/40",
    "text": "Abu Salama ibn 'Abd ar-Rahman asked 'A’isha (may Allah the Exalted be well pleased with her): “How was the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) during Ramadan?” so she said: “Neither in Ramadan nor in any other month would Allah’s Messenger (Allah bless him and give him peace) add to the total of eleven cycles of [nighttime] ritual prayer. He would perform four — do not ask about their excellence or their length — then he would perform four — do not ask about their excellence or their length — and then he would perform three.” ‘A'isha said (may Allah the Exalted be well pleased with her): “I said: ‘O Messenger of Allah, do you sleep before you perform the odd-numbered ritual prayer [witr]?' He said: ‘O 'A'isha, my eyes may sleep, but my heart does not sleep!’”"
  },
  "1902710": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902710\nIn-book reference  : Book 40, Hadith 011\nEnglish translation  : Vol. 1, Book 40, Hadith 011",
    "url": "https://sunnah.com/shamail/40",
    "text": "'A’isha said (may Allah be well pleased with her): “Allah’s Messenger (Allah bless him and give him peace) used to perform eleven cycles of ritual prayer during the night, making one of them odd-numbered [witr], and when he had finished, he would recline on his right side.”"
  },
  "1902720": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902720\nIn-book reference  : Book 40, Hadith 012\nEnglish translation  : Vol. 1, Book 40, Hadith 012",
    "url": "https://sunnah.com/shamail/40",
    "text": "Two other chains have narrations similar to the previous one."
  },
  "1902730": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902730\nIn-book reference  : Book 40, Hadith 013\nEnglish translation  : Vol. 1, Book 40, Hadith 013",
    "url": "https://sunnah.com/shamail/40",
    "text": "'A’isha said: \"Allah’s Messenger (Allah bless him and give him peace) used to perform nine cycles of ritual prayer during the night.”"
  },
  "1902750": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902750\nIn-book reference  : Book 40, Hadith 014\nEnglish translation  : Vol. 1, Book 40, Hadith 014",
    "url": "https://sunnah.com/shamail/40",
    "text": "Hudhaifa ibn al-Yaman (may Allah be well pleased with him) performed the ritual prayer with the Prophet (Allah bless him and give him peace) during the night, and he said: “When he entered into the ritual prayer, he said: ‘Allah is Supremely Great [Allahu Akbar], the Lord of power [jabarut], sovereignty [malakut], magnificence [kibriya’] and sublimity ['azama]! Then he recited the Sura of the Cow [al-Baqara]. Then he bowed down, and he bowed for approximately as long as he had stood erect, saying: ‘Glory be to my Lord, the Almighty! Glory be to my Lord, the Almighty!’ Then he raised his head, and he stood erect for approximately as long as he had bowed, saying: ‘To my Lord belongs the praise! To my Lord belongs the praise!’ Then he prostrated himself, and he prostrated for approximately as long as he had stood erect, saying: ‘Glory be to my Lord, the Most High! Glory be to my Lord, the Most High!’ Then he raised his head, and the pause between the two prostrations was approximately as long as the prostrations. During the pause he said: ‘My Lord, forgive me! My Lord, forgive me,’ until he recited the Suras of the Cow [al-Baqara], the Family of Imran [Al 'Imran], Women [an-Nisa’] and the Table Spread [al-Maida], or Cattle [al-An'am].” According to Abu 'Isa: “Shu'ba is the one who entertained doubts about [the Qur’anic Suras] al-Ma'ida and al- Anam.\""
  },
  "1902760": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902760\nIn-book reference  : Book 40, Hadith 015\nEnglish translation  : Vol. 1, Book 40, Hadith 015",
    "url": "https://sunnah.com/shamail/40",
    "text": "'A’isha said (may Allah be well pleased with her): \"Allah’s Messenger (Allah bless him and give him peace) spent one whole night reciting a verse from the Qur’an.” Commentary: The aayah is the last aayah of Surah Maa-idah:\n\nIn tu-adh-dhib-hum fa-innahum 'ibaaduk. Wa in tagh-fir lahum fa-innaka antal azizul hakim.\nTranslation: \"If Thou punish them, lo! they are Thy slaves, and if Thou forgive them, (lo! the are Thy slaves).Lo! Thou, only Thou, art Mighty, the wise\".Surah Maa-idah, 118.\n\nThe Being that possesses great power, if He wills, He may forgive the criminal. The One that is all Wise, there is Wisdom and benefit in every act of His. The reason for Sayyidina Rasulullah Sallallahu 'Alayhi Wasallam reciting this aayah while standing and also in the ruku and sajdah, and repeating it many times, is to bring to mind the two attributes of Allah, namely the attributes of justice and forgiveness. The whole scene on the day of qiyaamah will be of these two things. It is stated that Imaam Aa'zam Abu Hanifah RA. also recited the following aayah the whole night:\n\nWamtaazul yauma ayyuhal mujrimun.\nTranslation: \"But avaunt ye, O ye guilty, this day!\" Surah Yaseen, 58.\n\nIn this aayah too the scene of qiyaamah is portrayed. That today the sinners should separate and distinguish themselves. What a severe and nerve-chilling command this is. Today they are together with the pious and holy people and benefiting from the barakaat (blessings) they receive, but at this moment the sinners will be separated from them. May the Most Merciful Allah with His Grace keep those pious souls under His shadow, otherwise it is really a time for great trials."
  },
  "1902770": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902770\nIn-book reference  : Book 40, Hadith 016\nEnglish translation  : Vol. 1, Book 40, Hadith 016",
    "url": "https://sunnah.com/shamail/40",
    "text": "'Abdullah said: “I performed the ritual prayer one night with Allah’s Messenger (All^ bless him and give him peace), and he remained standing until I almost did something bad.” He was asked: “What did you almost do?” He replied: “I nearly sat down and left the Prophet (Allah bless him and give him peace) in the lurch!”"
  },
  "1902790": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902790\nIn-book reference  : Book 40, Hadith 017\nEnglish translation  : Vol. 1, Book 40, Hadith 017",
    "url": "https://sunnah.com/shamail/40",
    "text": "'A’isha said (may Allah be well pleased with her): “The Prophet (Allah bless him and give him peace) used to perform the ritual prayer sitting down, so he would also recite the Qur’an while he was seated. If the amount of his recitation remaining was thirty or forty verses, he would rise and recite standing up, and then he would bow and prostrate. Then he would do likewise in the second cycle.”"
  },
  "1902800": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902800\nIn-book reference  : Book 40, Hadith 018\nEnglish translation  : Vol. 1, Book 40, Hadith 018",
    "url": "https://sunnah.com/shamail/40",
    "text": "'Abdullah ibn Shaqiq said: “I asked 'A’isha (may Allah be well pleased with her) about the voluntary ritual prayers of Allah’s Messenger (Allah bless him and give him peace), and she said: ‘He used to spend a long night performing the ritual prayer while standing, and a long night while sitting, so if he recited the Qur’an while standing, he would bow and prostrate from a standing position, and if he recited while sitting, he would bow and prostrate from a sitting position.”"
  },
  "1902810": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902810\nIn-book reference  : Book 40, Hadith 019\nEnglish translation  : Vol. 1, Book 40, Hadith 019",
    "url": "https://sunnah.com/shamail/40",
    "text": "Hafsa, the wife of the Prophet (Allah bless him and give him peace), said: “Allah’s Messenger (Allah bless him and give him peace) used to perform voluntary ritual prayer sitting down , and he would recite the Sura and pronounce it slowly, so that it would seem to be longer than one that was actually longer than it.”"
  },
  "1902820": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902820\nIn-book reference  : Book 40, Hadith 020\nEnglish translation  : Vol. 1, Book 40, Hadith 020",
    "url": "https://sunnah.com/shamail/40",
    "text": "A’isha said (may Allah be well pleased with her): “By the time the Prophet (Allah bless him and give him peace) died, he was performing most of his ritual prayers from a sitting position.”"
  },
  "1902830": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902830\nIn-book reference  : Book 40, Hadith 021\nEnglish translation  : Vol. 1, Book 40, Hadith 021",
    "url": "https://sunnah.com/shamail/40",
    "text": "Ibn ‘'Umar said (may Allah be well pleased with him and his father): \"I performed two cycles of ritual prayer with Allah’s Messenger (Allah bless him and give him peace) before the noon prayer, and two cycles after it, and two cycles after the sunset prayer in his house, and two cycles after the evening prayer in his house.”"
  },
  "1902840": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902840\nIn-book reference  : Book 40, Hadith 022\nEnglish translation  : Vol. 1, Book 40, Hadith 022",
    "url": "https://sunnah.com/shamail/40",
    "text": "Ibn 'Umar said (may Allah be well pleased with him and his father): “Hafsa said: 'Allah’s Messenger (Allah bless him and give him peace) used to perform two cycles of ritual prayer when the dawn was rising, and the caller [to prayer] was calling'. And Ayyub said, “I think he described the two prayer cycles as abbreviated.”"
  },
  "1902850": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902850\nIn-book reference  : Book 40, Hadith 023\nEnglish translation  : Vol. 1, Book 40, Hadith 023",
    "url": "https://sunnah.com/shamail/40",
    "text": "Ibn 'Umar said (may Allah be well pleased with him and his father): \"I recall eight cycles performed by Allah’s Messenger (Allah bless him and give him peace): two cycles before the noon prayer and two cycles after it, two cycles after the sunset prayer, and two cycles after the evening prayer.” Ibn ‘Umar said: “Hafsa also told me about the two cycles of the early-morning prayer [al-ghad], but I did not see them performed by the Prophet (Allah bless him and give him peace).”"
  },
  "1902860": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902860\nIn-book reference  : Book 40, Hadith 024\nEnglish translation  : Vol. 1, Book 40, Hadith 024",
    "url": "https://sunnah.com/shamail/40",
    "text": "Abdullah ibn Shaqiq said: \"I asked 'A’isha (may Allah be well pleased with her) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace), and she said: 'He used to perform two cycles of ritual prayer before the noon prayer and two cycles after it, two cycles after the sunset prayer, two cycles after the evening prayer, and two before the dawn prayer.’”"
  },
  "1902870": {
    "collection": "Shama'il Muhammadiyah",
    "book": "Worship And Devotion Of Rasoolullah",
    "book_num": "40",
    "reference": "Reference  : Shama'il Muhammadiyah 1902870\nIn-book reference  : Book 40, Hadith 025\nEnglish translation  : Vol. 1, Book 40, Hadith 025",
    "url": "https://sunnah.com/shamail/40",
    "text": "'Asim ibn Damra said: “We asked 'Ali (may Allah ennoble his countenance) about the ritual prayer of Allah’s Messenger (Allah bless him and give him peace) in the daytime, and he said: ‘You would be incapable of that,’ so we said: Anyone of us who is capable of that will perform it!’ He therefore said: ‘When the sun was from over here [pointing eastward], like its appearance from over here [pointing westward], at the time of the afternoon prayer, he used to perform two cycles of ritual prayer, and when the sun was from over here, like its appearance from over here, at the time of the midday prayer, he would perform four. He would also perform four cycles before the midday prayer and two after it, and four before the afternoon prayer, separating each pair of cycles with the salutation of peace upon the angels drawn near, and upon the Prophets and the believers and Muslims who follow them'.”"
  }
}