{
  "901": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 901g\nIn-book reference  : Book 10, Hadith 8\nUSC-MSA web (English) reference  : Book 4, Hadith 1972\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "وحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ ، وَمُحَمَّدُ بْنُ الْمُثَنَّى ، قَالَا : حَدَّثَنَا مُعَاذٌ وَهُوَ ابْنُ هِشَامٍ ، حَدَّثَنِي أَبِي ، عَنْ قَتَادَةَ ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ عَنْ عُبَيْدِ بْنِ عُمَيْرٍ ، عَنْ عَائِشَةَ ، أَنَّ نَبِيَّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
    "narrators": [],
    "chain_length": 0,
    "chain_markers": [
      "حَدَّثَنَا",
      "عَنْ"
    ]
  },
  "903": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 903a\nIn-book reference  : Book 10, Hadith 9\nUSC-MSA web (English) reference  : Book 4, Hadith 1973\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ الْقَعْنَبِيُّ، حَدَّثَنَا سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ - عَنْ يَحْيَى، عَنْ عَمْرَةَ، أَنَّ يَهُودِيَّةً، أَتَتْ عَائِشَةَ تَسْأَلُهَا فَقَالَتْ أَعَاذَكِ اللَّهُ مِنْ عَذَابِ الْقَبْرِ . قَالَتْ عَائِشَةُ فَقُلْتُ يَا رَسُولَ اللَّهِ يُعَذَّبُ النَّاسُ فِي الْقُبُورِ قَالَتْ عَمْرَةُ فَقَالَتْ عَائِشَةُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَائِذًا بِاللَّهِ ثُمَّ رَكِبَ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ غَدَاةٍ مَرْكَبًا فَخَسَفَتِ الشَّمْسُ . قَالَتْ عَائِشَةُ فَخَرَجْتُ فِي نِسْوَةٍ بَيْنَ ظَهْرَىِ الْحُجَرِ فِي الْمَسْجِدِ فَأَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ مَرْكَبِهِ حَتَّى انْتَهَى إِلَى مُصَلاَّهُ الَّذِي كَانَ يُصَلِّي فِيهِ فَقَامَ وَقَامَ النَّاسُ وَرَاءَهُ - قَالَتْ عَائِشَةُ - فَقَامَ قِيَامًا طَوِيلاً ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً ثُمَّ رَفَعَ فَقَامَ قِيَامًا طَوِيلاً وَهُوَ دُونَ الْقِيَامِ الأَوَّلِ ثُمَّ رَكَعَ فَرَكَعَ رُكُوعًا طَوِيلاً وَهُوَ دُونَ ذَلِكَ الرُّكُوعِ ثُمَّ رَفَعَ وَقَدْ تَجَلَّتِ الشَّمْسُ فَقَالَ",
    "narrators": [
      {
        "position": 5,
        "arabic_name": "سُلَيْمَانُ، - يَعْنِي ابْنَ بِلاَلٍ -",
        "role": "narrator"
      }
    ],
    "chain_length": 1,
    "chain_markers": [
      "حَدَّثَنَا",
      "عَنْ"
    ]
  },
  "904": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 904c\nIn-book reference  : Book 10, Hadith 12\nUSC-MSA web (English) reference  : Book 4, Hadith 1976\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ - وَتَقَارَبَا فِي اللَّفْظِ - قَالَ حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ الْمَلِكِ، عَنْ عَطَاءٍ، عَنْ جَابِرٍ، قَالَ انْكَسَفَتِ الشَّمْسُ فِي عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ مَاتَ إِبْرَاهِيمُ ابْنُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ النَّاسُ إِنَّمَا انْكَسَفَتْ لِمَوْتِ إِبْرَاهِيمَ . فَقَامَ النَّبِيُّ صلى الله عليه وسلم فَصَلَّى بِالنَّاسِ سِتَّ رَكَعَاتٍ بِأَرْبَعِ سَجَدَاتٍ بَدَأَ فَكَبَّرَ ثُمَّ قَرَأَ فَأَطَالَ الْقِرَاءَةَ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ فَقَرَأَ قِرَاءَةً دُونَ الْقِرَاءَةِ الأُولَى ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ فَقَرَأَ قِرَاءَةً دُونَ الْقِرَاءَةِ الثَّانِيَةِ ثُمَّ رَكَعَ نَحْوًا مِمَّا قَامَ ثُمَّ رَفَعَ رَأْسَهُ مِنَ الرُّكُوعِ ثُمَّ انْحَدَرَ بِالسُّجُودِ فَسَجَدَ سَجْدَتَيْنِ ثُمَّ قَامَ فَرَكَعَ أَيْضًا ثَلاَثَ رَكَعَاتٍ لَيْسَ فِيهَا رَكْعَةٌ إِلاَّ الَّتِي قَبْلَهَا أَطْوَلُ مِنَ الَّتِي بَعْدَهَا وَرُكُوعُهُ نَحْوًا مِنْ سُجُودِهِ ثُمَّ تَأَخَّرَ وَتَأَخَّرَتِ الصُّفُوفُ خَلْفَهُ حَتَّى انْتَهَيْنَا - وَقَالَ أَبُو بَكْرٍ حَتَّى انْتَهَى إِلَى النِّسَاءِ - ثُمَّ تَقَدَّمَ وَتَقَدَّمَ النَّاسُ مَعَهُ حَتَّى قَامَ فِي مَقَامِهِ فَانْصَرَفَ حِينَ انْصَرَفَ وَقَدْ آضَتِ الشَّمْسُ فَقَالَ",
    "narrators": [],
    "chain_length": 0,
    "chain_markers": [
      "حَدَّثَنَا",
      "عَنْ"
    ]
  },
  "905": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 905a\nIn-book reference  : Book 10, Hadith 13\nUSC-MSA web (English) reference  : Book 4, Hadith 1977\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "حَدَّثَنَا مُحَمَّدُ بْنُ الْعَلاَءِ الْهَمْدَانِيُّ، حَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا هِشَامٌ، عَنْ فَاطِمَةَ، عَنْ أَسْمَاءَ، قَالَتْ خَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَدَخَلْتُ عَلَى عَائِشَةَ وَهِيَ تُصَلِّي فَقُلْتُ مَا شَأْنُ النَّاسِ يُصَلُّونَ فَأَشَارَتْ بِرَأْسِهَا إِلَى السَّمَاءِ فَقُلْتُ آيَةٌ قَالَتْ نَعَمْ . فَأَطَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْقِيَامَ جِدًّا حَتَّى تَجَلاَّنِي الْغَشْىُ فَأَخَذْتُ قِرْبَةً مِنْ مَاءٍ إِلَى جَنْبِي فَجَعَلْتُ أَصُبُّ عَلَى رَأْسِي أَوْ عَلَى وَجْهِي مِنَ الْمَاءِ - قَالَتْ - فَانْصَرَفَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَدْ تَجَلَّتِ الشَّمْسُ فَخَطَبَ رَسُولُ اللَّهِ صلى الله عليه وسلم النَّاسَ فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ ثُمَّ قَالَ",
    "narrators": [],
    "chain_length": 0,
    "chain_markers": [
      "حَدَّثَنَا",
      "عَنْ"
    ]
  },
  "911": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 911b\nIn-book reference  : Book 10, Hadith 24\nUSC-MSA web (English) reference  : Book 4, Hadith 1988\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ، وَيَحْيَى بْنُ حَبِيبٍ، قَالاَ حَدَّثَنَا مُعْتَمِرٌ، عَنْ إِسْمَاعِيلَ، عَنْ قَيْسٍ، عَنْ أَبِي مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ",
    "narrators": [],
    "chain_length": 0,
    "chain_markers": [
      "حَدَّثَنَا",
      "عَنْ"
    ]
  },
  "914": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 914\nIn-book reference  : Book 10, Hadith 30\nUSC-MSA web (English) reference  : Book 4, Hadith 1994\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ عَنْ أَبِيهِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ، عَنْ عَبْدِ، اللَّهِ بْنِ عُمَرَ أَنَّهُ كَانَ يُخْبِرُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ",
    "narrators": [
      {
        "position": 5,
        "arabic_name": "عَمْرُو بْنُ الْحَارِثِ، أَنَّ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، حَدَّثَهُ",
        "role": "narrator"
      }
    ],
    "chain_length": 1,
    "chain_markers": [
      "حَدَّثَنَا",
      "أَخْبَرَنِي",
      "عَنْ"
    ]
  },
  "915": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 915\nIn-book reference  : Book 10, Hadith 31\nUSC-MSA web (English) reference  : Book 4, Hadith 1995\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "sanad_full": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، قَالاَ حَدَّثَنَا مُصْعَبٌ، - وَهُوَ ابْنُ الْمِقْدَامِ - حَدَّثَنَا زَائِدَةُ، حَدَّثَنَا زِيَادُ بْنُ عِلاَقَةَ، - وَفِي رِوَايَةِ أَبِي بَكْرٍ قَالَ قَالَ زِيَادُ بْنُ عِلاَقَةَ - سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ مَاتَ إِبْرَاهِيمُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم",
    "narrators": [
      {
        "position": 13,
        "arabic_name": "زِيَادُ بْنُ عِلاَقَةَ - سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ انْكَسَفَتِ الشَّمْسُ عَلَى عَ",
        "role": "narrator"
      }
    ],
    "chain_length": 1,
    "chain_markers": [
      "حَدَّثَنَا"
    ]
  }
}