{
  "3689": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3689\nIn-book reference  : Book 32, Hadith 2\nEnglish translation  : Vol. 4, Book 32, Hadith 3719",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ عَامِرٍ الأَحْوَلِ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لا يَرْجِعُ أَحَدٌ فِي هِبَتِهِ إِلاَّ وَالِدٌ مِنْ وَلَدِهِ وَالْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ \" ."
  },
  "3690": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3690\nIn-book reference  : Book 32, Hadith 3\nEnglish translation  : Vol. 4, Book 32, Hadith 3720",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ حُسَيْنٍ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، قَالَ حَدَّثَنِي طَاوُسٌ، عَنِ ابْنِ عُمَرَ، وَابْنِ، عَبَّاسٍ يَرْفَعَانِ الْحَدِيثَ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ يَحِلُّ لِرَجُلٍ يُعْطِي عَطِيَّةً ثُمَّ يَرْجِعُ فِيهَا إِلاَّ الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي عَطِيَّةً ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ أَكَلَ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ \" ."
  },
  "3691": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3691\nIn-book reference  : Book 32, Hadith 4\nEnglish translation  : Vol. 4, Book 32, Hadith 3721",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ الْخَلَنْجِيُّ الْمَقْدِسِيُّ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ، - وَهُوَ مَوْلَى بَنِي هَاشِمٍ - عَنْ وُهَيْبٍ، قَالَ حَدَّثَنَا ابْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ \" ."
  },
  "3692": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3692\nIn-book reference  : Book 32, Hadith 5\nEnglish translation  : Vol. 4, Book 32, Hadith 3722",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ إِبْرَاهِيمَ بْنِ نَافِعٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَحِلُّ لأَحَدٍ أَنْ يَهَبَ هِبَةً ثُمَّ يَرْجِعَ فِيهَا إِلاَّ مِنْ وَلَدِهِ \" . قَالَ طَاوُسٌ كُنْتُ أَسْمَعُ وَأَنَا صَغِيرٌ عَائِدٌ فِي قَيْئِهِ فَلَمْ نَدْرِ أَنَّهُ ضَرَبَ لَهُ مَثَلاً قَالَ \" فَمَنْ فَعَلَ ذَلِكَ فَمَثَلُهُ كَمَثَلِ الْكَلْبِ يَأْكُلُ ثُمَّ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ \" ."
  },
  "3693": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3693\nIn-book reference  : Book 32, Hadith 6\nEnglish translation  : Vol. 4, Book 32, Hadith 3723",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا عُمَرُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ عَلِيِّ بْنِ حُسَيْنٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَثَلُ الَّذِي يَرْجِعُ فِي صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَرْجِعُ فِي قَيْئِهِ فَيَأْكُلُهُ \" ."
  },
  "3694": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3694\nIn-book reference  : Book 32, Hadith 7\nEnglish translation  : Vol. 4, Book 32, Hadith 3724",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَبْدُ الصَّمَدِ، قَالَ حَدَّثَنَا حَرْبٌ، - وَهُوَ ابْنُ شَدَّادٍ - قَالَ حَدَّثَنِي يَحْيَى، - هُوَ ابْنُ أَبِي كَثِيرٍ - قَالَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَمْرٍو، - وَهُوَ الأَوْزَاعِيُّ - أَنَّ مُحَمَّدَ بْنَ عَلِيِّ بْنِ حُسَيْنِ بْنِ فَاطِمَةَ بِنْتِ رَسُولِ اللَّهِ، صلى الله عليه وسلم حَدَّثَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَثَلُ الَّذِي يَتَصَدَّقُ بِالصَّدَقَةِ ثُمَّ يَرْجِعُ فِيهَا كَمَثَلِ الْكَلْبِ قَاءَ ثُمَّ عَادَ فِي قَيْئِهِ فَأَكَلَهُ \" ."
  },
  "3695": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3695\nIn-book reference  : Book 32, Hadith 8\nEnglish translation  : Vol. 4, Book 32, Hadith 3725",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا الْهَيْثَمُ بْنُ مَرْوَانَ بْنِ الْهَيْثَمِ بْنِ عِمْرَانَ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ بَكَّارِ بْنِ بِلاَلٍ - قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَوْزَاعِيِّ، أَنَّ مُحَمَّدَ بْنَ عَلِيِّ بْنِ الْحُسَيْنِ، حَدَّثَهُ عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَثَلُ الَّذِي يَرْجِعُ فِي صَدَقَتِهِ كَمَثَلِ الْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ \" . قَالَ الأَوْزَاعِيُّ سَمِعْتُهُ يُحَدِّثُ عَطَاءَ بْنَ أَبِي رَبَاحٍ بِهَذَا الْحَدِيثِ ."
  },
  "3696": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3696\nIn-book reference  : Book 32, Hadith 9\nEnglish translation  : Vol. 4, Book 32, Hadith 3726",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ \" ."
  },
  "3697": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3697\nIn-book reference  : Book 32, Hadith 10\nEnglish translation  : Vol. 4, Book 32, Hadith 3727",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ \" ."
  },
  "3698": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3698\nIn-book reference  : Book 32, Hadith 11\nEnglish translation  : Vol. 4, Book 32, Hadith 3728",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ، - وَهُوَ سُلَيْمَانُ بْنُ حَيَّانَ - عَنْ سَعِيدِ بْنِ أَبِي عَرُوبَةَ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ \" ."
  },
  "3699": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3699\nIn-book reference  : Book 32, Hadith 12\nEnglish translation  : Vol. 4, Book 32, Hadith 3729",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ لَنَا مَثَلُ السَّوْءِ الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَعُودُ فِي قَيْئِهِ \" ."
  },
  "3700": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3700\nIn-book reference  : Book 32, Hadith 13\nEnglish translation  : Vol. 4, Book 32, Hadith 3730",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ خَالِدٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ لَنَا مَثَلُ السَّوْءِ الرَّاجِعُ فِي هِبَتِهِ كَالْكَلْبِ فِي قَيْئِهِ \" ."
  },
  "3701": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3701\nIn-book reference  : Book 32, Hadith 14\nEnglish translation  : Vol. 4, Book 32, Hadith 3731",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ، قَالَ حَدَّثَنَا الْمَخْزُومِيُّ، قَالَ حَدَّثَنَا وُهَيْبٌ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ طَاوُسٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" الْعَائِدُ فِي هِبَتِهِ كَالْكَلْبِ يَقِيءُ ثُمَّ يَعُودُ فِي قَيْئِهِ \" ."
  },
  "3702": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3702\nIn-book reference  : Book 32, Hadith 15\nEnglish translation  : Vol. 4, Book 32, Hadith 3732",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ حَجَّاجٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الْعَائِدُ فِي هِبَتِهِ كَالْعَائِدِ فِي قَيْئِهِ \" ."
  },
  "3703": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3703\nIn-book reference  : Book 32, Hadith 16\nEnglish translation  : Vol. 4, Book 32, Hadith 3733",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا إِسْحَاقُ الأَزْرَقُ، قَالَ حَدَّثَنَا بِهِ، حُسَيْنٌ الْمُعَلِّمُ عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عُمَرَ، وَابْنِ، عَبَّاسٍ قَالاَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَحِلُّ لأَحَدٍ أَنْ يُعْطِيَ الْعَطِيَّةَ فَيَرْجِعَ فِيهَا إِلاَّ الْوَالِدَ فِيمَا يُعْطِي وَلَدَهُ وَمَثَلُ الَّذِي يُعْطِي الْعَطِيَّةَ فَيَرْجِعُ فِيهَا كَالْكَلْبِ يَأْكُلُ حَتَّى إِذَا شَبِعَ قَاءَ ثُمَّ عَادَ فَرَجَعَ فِي قَيْئِهِ \" ."
  },
  "3704": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3704\nIn-book reference  : Book 32, Hadith 17\nEnglish translation  : Vol. 4, Book 32, Hadith 3734",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا عَبْدُ الْحَمِيدِ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ مُسْلِمٍ، عَنْ طَاوُسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يَحِلُّ لأَحَدٍ يَهَبُ هِبَةً ثُمَّ يَعُودُ فِيهَا إِلاَّ الْوَالِدَ \" . قَالَ طَاوُسٌ كُنْتُ أَسْمَعُ الصِّبْيَانَ يَقُولُونَ يَا عَائِدًا فِي قَيْئِهِ وَلَمْ أَشْعُرْ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ضَرَبَ ذَلِكَ مَثَلاً حَتَّى بَلَغَنَا أَنَّهُ كَانَ يَقُولُ \" مَثَلُ الَّذِي يَهَبُ الْهِبَةَ ثُمَّ يَعُودُ فِيهَا \" . وَذَكَرَ كَلِمَةً مَعْنَاهَا \" كَمَثَلِ الْكَلْبِ يَأْكُلُ قَيْئَهُ \" ."
  },
  "3705": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Gifts",
    "book_num": "32",
    "reference": "Reference  : Sunan an-Nasa'i 3705\nIn-book reference  : Book 32, Hadith 18\nEnglish translation  : Vol. 4, Book 32, Hadith 3735",
    "url": "https://sunnah.com/nasai/32",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، قَالَ حَدَّثَنَا حِبَّانُ، أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ حَنْظَلَةَ، أَنَّهُ سَمِعَ طَاوُسًا، يَقُولُ أَخْبَرَنَا بَعْضُ، مَنْ أَدْرَكَ النَّبِيَّ صلى الله عليه وسلم أَنَّهُ قَالَ \" مَثَلُ الَّذِي يَهَبُ فَيَرْجِعُ فِي هِبَتِهِ كَمَثَلِ الْكَلْبِ يَأْكُلُ فَيَقِيءُ ثُمَّ يَأْكُلُ قَيْئَهُ \" ."
  }
}