{
  "4214": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4214\nIn-book reference  : Book 40, Hadith 3\nEnglish translation  : Vol. 5, Book 40, Hadith 4219",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا أَيُّوبُ، وَحَبِيبٌ، وَيُونُسُ، وَقَتَادَةُ، عَنْ مُحَمَّدِ بْنِ سِيرِينَ، عَنْ سَلْمَانَ بْنِ عَامِرٍ الضَّبِّيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" فِي الْغُلاَمِ عَقِيقَةٌ فَأَهْرِيقُوا عَنْهُ دَمًا وَأَمِيطُوا عَنْهُ الأَذَى \" ."
  },
  "4215": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4215\nIn-book reference  : Book 40, Hadith 4\nEnglish translation  : Vol. 5, Book 40, Hadith 4220",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عَفَّانُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ قَيْسِ بْنِ سَعْدٍ، عَنْ عَطَاءٍ، وَطَاوُسٍ، وَمُجَاهِدٍ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" فِي الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَفِي الْجَارِيَةِ شَاةٌ \" ."
  },
  "4216": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4216\nIn-book reference  : Book 40, Hadith 5\nEnglish translation  : Vol. 5, Book 40, Hadith 4221",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ قَالَ عَمْرٌو عَنْ عَطَاءٍ، عَنْ حَبِيبَةَ بِنْتِ مَيْسَرَةَ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" عَنِ الْغُلاَمِ شَاتَانِ مُكَافَأَتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ \" ."
  },
  "4217": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4217\nIn-book reference  : Book 40, Hadith 6\nEnglish translation  : Vol. 5, Book 40, Hadith 4222",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، - وَهُوَ ابْنُ أَبِي يَزِيدَ - عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، قَالَتْ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم بِالْحُدَيْبِيَةِ أَسْأَلُهُ عَنْ لُحُومِ الْهَدْىِ فَسَمِعْتُهُ يَقُولُ \" عَلَى الْغُلاَمِ شَاتَانِ وَعَلَى الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا \" ."
  },
  "4218": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4218\nIn-book reference  : Book 40, Hadith 7\nEnglish translation  : Vol. 5, Book 40, Hadith 4223",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ جُرَيْجٍ، قَالَ حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ أَبِي يَزِيدَ، عَنْ سِبَاعِ بْنِ ثَابِتٍ، عَنْ أُمِّ كُرْزٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" عَنِ الْغُلاَمِ شَاتَانِ وَعَنِ الْجَارِيَةِ شَاةٌ لاَ يَضُرُّكُمْ ذُكْرَانًا كُنَّ أَمْ إِنَاثًا \" ."
  },
  "4219": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4219\nIn-book reference  : Book 40, Hadith 8\nEnglish translation  : Vol. 5, Book 40, Hadith 4224",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَفْصِ بْنِ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي إِبْرَاهِيمُ، - هُوَ ابْنُ طَهْمَانَ - عَنِ الْحَجَّاجِ بْنِ الْحَجَّاجِ، عَنْ قَتَادَةَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ عَقَّ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْحَسَنِ وَالْحُسَيْنِ رضى الله عنهما بِكَبْشَيْنِ كَبْشَيْنِ ."
  },
  "4220": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4220\nIn-book reference  : Book 40, Hadith 9\nEnglish translation  : Vol. 5, Book 40, Hadith 4225",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، وَمُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالاَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - عَنْ سَعِيدٍ، أَنْبَأَنَا قَتَادَةُ، عَنِ الْحَسَنِ، عَنْ سَمُرَةَ بْنِ جُنْدُبٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" كُلُّ غُلاَمٍ رَهِينٌ بِعَقِيقَتِهِ تُذْبَحُ عَنْهُ يَوْمَ سَابِعِهِ وَيُحْلَقُ رَأْسُهُ وَيُسَمَّى \" ."
  },
  "4221": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of al-'Aqiqah",
    "book_num": "40",
    "reference": "Reference  : Sunan an-Nasa'i 4221\nIn-book reference  : Book 40, Hadith 10\nEnglish translation  : Vol. 5, Book 40, Hadith 4226",
    "url": "https://sunnah.com/nasai/40",
    "text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا قُرَيْشُ بْنُ أَنَسٍ، عَنْ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ لِي مُحَمَّدُ بْنُ سِيرِينَ سَلِ الْحَسَنَ مِمَّنْ سَمِعَ حَدِيثَهُ، فِي الْعَقِيقَةِ . فَسَأَلْتُهُ عَنْ ذَلِكَ، فَقَالَ سَمِعْتُهُ مِنْ، سَمُرَةَ ."
  }
}