{
  "2097": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2097\nIn-book reference  : Book 22, Hadith 8\nEnglish translation  : Vol. 3, Book 22, Hadith 2099",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتِ الشَّيَاطِينُ \" ."
  },
  "2098": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2098\nIn-book reference  : Book 22, Hadith 9\nEnglish translation  : Vol. 3, Book 22, Hadith 2100",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ الْجُوزَجَانِيُّ، قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ أَنْبَأَنَا نَافِعُ بْنُ يَزِيدَ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَصُفِّدَتِ الشَّيَاطِينُ \" ."
  },
  "2099": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2099\nIn-book reference  : Book 22, Hadith 10\nEnglish translation  : Vol. 3, Book 22, Hadith 2101",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي نَافِعُ بْنُ أَنَسٍ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ \" ."
  },
  "2100": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2100\nIn-book reference  : Book 22, Hadith 11\nEnglish translation  : Vol. 3, Book 22, Hadith 2102",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنِي ابْنُ أَبِي أَنَسٍ، مَوْلَى التَّيْمِيِّينَ أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا جَاءَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الرَّحْمَةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ \" ."
  },
  "2101": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2101\nIn-book reference  : Book 22, Hadith 12\nEnglish translation  : Vol. 3, Book 22, Hadith 2103",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، فِي حَدِيثِهِ عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ ابْنِ أَبِي أَنَسٍ، أَنَّ أَبَاهُ، حَدَّثَهُ أَنَّهُ، سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا كَانَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ \" . رَوَاهُ ابْنُ إِسْحَاقَ عَنِ الزُّهْرِيِّ ."
  },
  "2102": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2102\nIn-book reference  : Book 22, Hadith 13\nEnglish translation  : Vol. 3, Book 22, Hadith 2104",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنِ ابْنِ أَبِي أَنَسٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِذَا دَخَلَ شَهْرُ رَمَضَانَ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ النَّارِ وَسُلْسِلَتِ الشَّيَاطِينُ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا - يَعْنِي حَدِيثَ ابْنِ إِسْحَاقَ - خَطَأٌ وَلَمْ يَسْمَعْهُ ابْنُ إِسْحَاقَ مِنَ الزُّهْرِيِّ وَالصَّوَابُ مَا تَقَدَّمَ ذِكْرُنَا لَهُ ."
  },
  "2103": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2103\nIn-book reference  : Book 22, Hadith 14\nEnglish translation  : Vol. 3, Book 22, Hadith 2105",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ وَذَكَرَ مُحَمَّدُ بْنُ مُسْلِمٍ عَنْ أُوَيْسِ بْنِ أَبِي أُوَيْسٍ، عَدِيدِ بَنِي تَيْمٍ عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" هَذَا رَمَضَانُ قَدْ جَاءَكُمْ تُفَتَّحُ فِيهِ أَبْوَابُ الْجَنَّةِ وَتُغَلَّقُ فِيهِ أَبْوَابُ النَّارِ وَتُسَلْسَلُ فِيهِ الشَّيَاطِينُ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا الْحَدِيثُ خَطَأٌ ."
  },
  "2104": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2104\nIn-book reference  : Book 22, Hadith 15\nEnglish translation  : Vol. 3, Book 22, Hadith 2106",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ عَزِيمَةٍ وَقَالَ \" إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ الْجَحِيمِ وَسُلْسِلَتْ فِيهِ الشَّيَاطِينُ \" . أَرْسَلَهُ ابْنُ الْمُبَارَكِ ."
  },
  "2105": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2105\nIn-book reference  : Book 22, Hadith 16\nEnglish translation  : Vol. 3, Book 22, Hadith 2107",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى، - خُرَاسَانِيٌّ - قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِذَا دَخَلَ رَمَضَانُ فُتِّحَتْ أَبْوَابُ الرَّحْمَةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ \" ."
  },
  "2106": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2106\nIn-book reference  : Book 22, Hadith 17\nEnglish translation  : Vol. 3, Book 22, Hadith 2108",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا بِشْرُ بْنُ هِلاَلٍ، قَالَ حَدَّثَنَا عَبْدُ الْوَارِثِ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَتَاكُمْ رَمَضَانُ شَهْرٌ مُبَارَكٌ فَرَضَ اللَّهُ عَزَّ وَجَلَّ عَلَيْكُمْ صِيَامَهُ تُفْتَحُ فِيهِ أَبْوَابُ السَّمَاءِ وَتُغْلَقُ فِيهِ أَبْوَابُ الْجَحِيمِ وَتُغَلُّ فِيهِ مَرَدَةُ الشَّيَاطِينِ لِلَّهِ فِيهِ لَيْلَةٌ خَيْرٌ مِنْ أَلْفِ شَهْرٍ مَنْ حُرِمَ خَيْرَهَا فَقَدْ حُرِمَ \" ."
  },
  "2107": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2107\nIn-book reference  : Book 22, Hadith 18\nEnglish translation  : Vol. 3, Book 22, Hadith 2109",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَرْفَجَةَ، قَالَ عُدْنَا عُتْبَةَ بْنَ فَرْقَدٍ فَتَذَاكَرْنَا شَهْرَ رَمَضَانَ فَقَالَ مَا تَذْكُرُونَ قُلْنَا شَهْرَ رَمَضَانَ . قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" تُفْتَحُ فِيهِ أَبْوَابُ الْجَنَّةِ وَتُغْلَقُ فِيهِ أَبْوَابُ النَّارِ وَتُغَلُّ فِيهِ الشَّيَاطِينُ وَيُنَادِي مُنَادٍ كُلَّ لَيْلَةٍ يَا بَاغِيَ الْخَيْرِ هَلُمَّ وَيَا بَاغِيَ الشَّرِّ أَقْصِرْ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ ."
  },
  "2108": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2108\nIn-book reference  : Book 22, Hadith 19\nEnglish translation  : Vol. 3, Book 22, Hadith 2110",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ عَرْفَجَةَ، قَالَ كُنْتُ فِي بَيْتٍ فِيهِ عُتْبَةُ بْنُ فَرْقَدٍ فَأَرَدْتُ أَنْ أُحَدِّثَ بِحَدِيثٍ وَكَانَ رَجُلٌ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم كَأَنَّهُ أَوْلَى بِالْحَدِيثِ مِنِّي فَحَدَّثَ الرَّجُلُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" فِي رَمَضَانَ تُفْتَحُ فِيهِ أَبْوَابُ السَّمَاءِ وَتُغْلَقُ فِيهِ أَبْوَابُ النَّارِ وَيُصَفَّدُ فِيهِ كُلُّ شَيْطَانٍ مَرِيدٍ وَيُنَادِي مُنَادٍ كُلَّ لَيْلَةٍ يَا طَالِبَ الْخَيْرِ هَلُمَّ وَيَا طَالِبَ الشَّرِّ أَمْسِكْ \" ."
  },
  "2109": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2109\nIn-book reference  : Book 22, Hadith 20\nEnglish translation  : Vol. 3, Book 22, Hadith 2011",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ أَنْبَأَنَا الْمُهَلَّبُ بْنُ أَبِي حَبِيبَةَ، ح وَأَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الْمُهَلَّبِ بْنِ أَبِي حَبِيبَةَ، قَالَ أَخْبَرَنِي الْحَسَنُ، عَنْ أَبِي بَكْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ يَقُولَنَّ أَحَدُكُمْ صُمْتُ رَمَضَانَ وَلاَ قُمْتُهُ كُلَّهُ \" . وَلاَ أَدْرِي كَرِهَ التَّزْكِيَةَ أَوْ قَالَ لاَ بُدَّ مِنْ غَفْلَةٍ وَرَقْدَةٍ اللَّفْظُ لِعُبَيْدِ اللَّهِ ."
  },
  "2110": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2110\nIn-book reference  : Book 22, Hadith 21\nEnglish translation  : Vol. 3, Book 22, Hadith 2112",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ أَخْبَرَنِي ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي عَطَاءٌ، قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ، يُخْبِرُنَا قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاِمْرَأَةٍ مِنَ الأَنْصَارِ \" إِذَا كَانَ رَمَضَانُ فَاعْتَمِرِي فِيهِ فَإِنَّ عُمْرَةً فِيهِ تَعْدِلُ حَجَّةً \" ."
  },
  "2111": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2111\nIn-book reference  : Book 22, Hadith 22\nEnglish translation  : Vol. 3, Book 22, Hadith 2113",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ أَبِي حَرْمَلَةَ - قَالَ أَخْبَرَنِي كُرَيْبٌ، أَنَّ أُمَّ الْفَضْلِ، بَعَثَتْهُ إِلَى مُعَاوِيَةَ بِالشَّامِ - قَالَ - فَقَدِمْتُ الشَّامَ فَقَضَيْتُ حَاجَتَهَا وَاسْتَهَلَّ عَلَىَّ هِلاَلُ رَمَضَانَ وَأَنَا بِالشَّامِ فَرَأَيْتُ الْهِلاَلَ لَيْلَةَ الْجُمُعَةِ ثُمَّ قَدِمْتُ الْمَدِينَةَ فِي آخِرِ الشَّهْرِ فَسَأَلَنِي عَبْدُ اللَّهِ بْنُ عَبَّاسٍ ثُمَّ ذَكَرَ الْهِلاَلَ فَقَالَ مَتَى رَأَيْتُمْ فَقُلْتُ رَأَيْنَاهُ لَيْلَةَ الْجُمُعَةِ . قَالَ أَنْتَ رَأَيْتَهُ لَيْلَةَ الْجُمُعَةِ قُلْتُ نَعَمْ وَرَآهُ النَّاسُ فَصَامُوا وَصَامَ مُعَاوِيَةُ . قَالَ لَكِنْ رَأَيْنَاهُ لَيْلَةَ السَّبْتِ فَلاَ نَزَالُ نَصُومُ حَتَّى نُكْمِلَ ثَلاَثِينَ يَوْمًا أَوْ نَرَاهُ . فَقُلْتُ أَوَلاَ تَكْتَفِي بِرُؤْيَةِ مُعَاوِيَةَ وَأَصْحَابِهِ قَالَ لاَ هَكَذَا أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "2112": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2112\nIn-book reference  : Book 22, Hadith 23\nEnglish translation  : Vol. 3, Book 22, Hadith 2114",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ بْنِ أَبِي رِزْمَةَ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ رَأَيْتُ الْهِلاَلَ . فَقَالَ \" أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ \" . قَالَ نَعَمْ . فَنَادَى النَّبِيُّ صلى الله عليه وسلم \" أَنْ صُومُوا \" ."
  },
  "2113": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2113\nIn-book reference  : Book 22, Hadith 24\nEnglish translation  : Vol. 3, Book 22, Hadith 2115",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ أَبْصَرْتُ الْهِلاَلَ اللَّيْلَةَ . قَالَ \" أَتَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ \" . قَالَ نَعَمْ . قَالَ \" يَا بِلاَلُ أَذِّنْ فِي النَّاسِ فَلْيَصُومُوا غَدًا \" ."
  },
  "2114": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2114\nIn-book reference  : Book 22, Hadith 25\nEnglish translation  : Vol. 3, Book 22, Hadith 2116",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، عَنْ أَبِي دَاوُدَ، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، مُرْسَلٌ ."
  },
  "2115": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2115\nIn-book reference  : Book 22, Hadith 26\nEnglish translation  : Vol. 3, Book 22, Hadith 2117",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمِ بْنِ نُعَيْمٍ، - مِصِّيصِيٌّ - قَالَ أَنْبَأَنَا حِبَّانُ بْنُ مُوسَى الْمَرْوَزِيُّ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، مُرْسَلٌ ."
  },
  "2116": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2116\nIn-book reference  : Book 22, Hadith 27\nEnglish translation  : Vol. 3, Book 22, Hadith 2118",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ شَبِيبٍ أَبُو عُثْمَانَ، - وَكَانَ شَيْخًا صَالِحًا بِطَرَسُوسَ - قَالَ أَنْبَأَنَا ابْنُ أَبِي زَائِدَةَ، عَنْ حُسَيْنِ بْنِ الْحَارِثِ الْجَدَلِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ زَيْدِ بْنِ الْخَطَّابِ، أَنَّهُ خَطَبَ النَّاسَ فِي الْيَوْمِ الَّذِي يُشَكُّ فِيهِ فَقَالَ أَلاَّ إِنِّي جَالَسْتُ أَصْحَابَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَسَاءَلْتُهُمْ وَأَنَّهُمْ حَدَّثُونِي أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ وَانْسُكُوا لَهَا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا ثَلاَثِينَ فَإِنْ شَهِدَ شَاهِدَانِ فَصُومُوا وَأَفْطِرُوا \" ."
  },
  "2117": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2117\nIn-book reference  : Book 22, Hadith 28\nEnglish translation  : Vol. 3, Book 22, Hadith 2119",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُؤَمَّلُ بْنُ هِشَامٍ، عَنْ إِسْمَاعِيلَ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمُ الشَّهْرُ فَعُدُّوا ثَلاَثِينَ \" ."
  },
  "2118": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2118\nIn-book reference  : Book 22, Hadith 29\nEnglish translation  : Vol. 1, Book 22, Hadith 2120",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا وَرْقَاءُ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا ثَلاَثِينَ \" ."
  },
  "2119": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2119\nIn-book reference  : Book 22, Hadith 30\nEnglish translation  : Vol. 3, Book 22, Hadith 2121",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ عَبْدِ اللَّهِ النَّيْسَابُورِيُّ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ مُحَمَّدِ بْنِ مُسْلِمٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا رَأَيْتُمُ الْهِلاَلَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَصُومُوا ثَلاَثِينَ يَوْمًا \" ."
  },
  "2120": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2120\nIn-book reference  : Book 22, Hadith 31\nEnglish translation  : Vol. 3, Book 22, Hadith 2122",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَالِمُ بْنُ عَبْدِ اللَّهِ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِذَا رَأَيْتُمُ الْهِلاَلَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ \" ."
  },
  "2121": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2121\nIn-book reference  : Book 22, Hadith 32\nEnglish translation  : Vol. 3, Book 22, Hadith 2123",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، - وَاللَّفْظُ لَهُ - عَنِ ابْنِ الْقَاسِمِ، عَنْ مَالِكٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذَكَرَ رَمَضَانَ فَقَالَ \" لاَ تَصُومُوا حَتَّى تَرَوُا الْهِلاَلَ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ \" ."
  },
  "2122": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2122\nIn-book reference  : Book 22, Hadith 33\nEnglish translation  : Vol. 3, Book 22, Hadith 2124",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنِي نَافِعٌ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ تَصُومُوا حَتَّى تَرَوْهُ وَلاَ تُفْطِرُوا حَتَّى تَرَوْهُ فَإِنْ غُمَّ عَلَيْكُمْ فَاقْدُرُوا لَهُ \" ."
  },
  "2123": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2123\nIn-book reference  : Book 22, Hadith 34\nEnglish translation  : Vol. 3, Book 22, Hadith 2125",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، صَاحِبُ حِمْصَ قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ ذَكَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم الْهِلاَلَ فَقَالَ \" إِذَا رَأَيْتُمُوهُ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَعُدُّوا ثَلاَثِينَ \" ."
  },
  "2124": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2124\nIn-book reference  : Book 22, Hadith 35\nEnglish translation  : Vol. 3, Book 22, Hadith 2126",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ أَبُو الْجَوْزَاءِ، - وَهُوَ ثِقَةٌ بَصْرِيٌّ أَخُو أَبِي الْعَالِيَةِ - قَالَ أَنْبَأَنَا حَبَّانُ بْنُ هِلاَلٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلاَثِينَ \" ."
  },
  "2125": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2125\nIn-book reference  : Book 22, Hadith 36\nEnglish translation  : Vol. 3, Book 22, Hadith 2127",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ حُنَيْنٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ عَجِبْتُ مِمَّنْ يَتَقَدَّمُ الشَّهْرَ وَقَدْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا رَأَيْتُمُ الْهِلاَلَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ ثَلاَثِينَ \" ."
  },
  "2126": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2126\nIn-book reference  : Book 22, Hadith 37\nEnglish translation  : Vol. 3, Book 22, Hadith 2128",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيِّ بْنِ حِرَاشٍ، عَنْ حُذَيْفَةَ بْنِ الْيَمَانِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ تَقَدَّمُوا الشَّهْرَ حَتَّى تَرَوُا الْهِلاَلَ قَبْلَهُ أَوْ تُكْمِلُوا الْعِدَّةَ ثُمَّ صُومُوا حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ قَبْلَهُ \" ."
  },
  "2127": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2127\nIn-book reference  : Book 22, Hadith 38\nEnglish translation  : Vol. 3, Book 22, Hadith 2129",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، عَنْ بَعْضِ، أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَقَدَّمُوا الشَّهْرَ حَتَّى تُكْمِلُوا الْعِدَّةَ أَوْ تَرَوُا الْهِلاَلَ ثُمَّ صُومُوا وَلاَ تُفْطِرُوا حَتَّى تَرَوُا الْهِلاَلَ أَوْ تُكْمِلُوا الْعِدَّةَ ثَلاَثِينَ \" . أَرْسَلَهُ الْحَجَّاجُ بْنُ أَرْطَاةَ ."
  },
  "2128": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2128\nIn-book reference  : Book 22, Hadith 39\nEnglish translation  : Vol. 3, Book 22, Hadith 2130",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، عَنِ الْحَجَّاجِ بْنِ أَرْطَاةَ، عَنْ مَنْصُورٍ، عَنْ رِبْعِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا رَأَيْتُمُ الْهِلاَلَ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَتِمُّوا شَعْبَانَ ثَلاَثِينَ إِلاَّ أَنْ تَرَوُا الْهِلاَلَ قَبْلَ ذَلِكَ ثُمَّ صُومُوا رَمَضَانَ ثَلاَثِينَ إِلاَّ أَنْ تَرَوُا الْهِلاَلَ قَبْلَ ذَلِكَ \" ."
  },
  "2129": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2129\nIn-book reference  : Book 22, Hadith 40\nEnglish translation  : Vol. 3, Book 22, Hadith 2131",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا حَاتِمُ بْنُ أَبِي صَغِيرَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ عِكْرِمَةَ، قَالَ حَدَّثَنَا ابْنُ عَبَّاسٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ حَالَ بَيْنَكُمْ وَبَيْنَهُ سَحَابٌ فَأَكْمِلُوا الْعِدَّةَ وَلاَ تَسْتَقْبِلُوا الشَّهْرَ اسْتِقْبَالاً \" ."
  },
  "2130": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2130\nIn-book reference  : Book 22, Hadith 41\nEnglish translation  : Vol. 3, Book 22, Hadith 2132",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَصُومُوا قَبْلَ رَمَضَانَ صُومُوا لِلرُّؤْيَةِ وَأَفْطِرُوا لِلرُّؤْيَةِ فَإِنْ حَالَتْ دُونَهُ غَيَايَةٌ فَأَكْمِلُوا ثَلاَثِينَ \" ."
  },
  "2131": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2131\nIn-book reference  : Book 22, Hadith 42\nEnglish translation  : Vol. 3, Book 22, Hadith 2133",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، عَنْ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، قَالَتْ أَقْسَمَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ لاَ يَدْخُلَ عَلَى نِسَائِهِ شَهْرًا فَلَبِثَ تِسْعًا وَعِشْرِينَ فَقُلْتُ أَلَيْسَ قَدْ كُنْتَ آلَيْتَ شَهْرًا فَعَدَدْتُ الأَيَّامَ تِسْعًا وَعِشْرِينَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ تِسْعٌ وَعِشْرُونَ \" ."
  },
  "2132": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2132\nIn-book reference  : Book 22, Hadith 43\nEnglish translation  : Vol. 3, Book 22, Hadith 3134",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنِي أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ عُبَيْدَ اللَّهِ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، حَدَّثَهُ ح، وَأَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا الْحَكَمُ بْنُ نَافِعٍ، قَالَ أَنْبَأَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ أَزَلْ حَرِيصًا أَنْ أَسْأَلَ عُمَرَ بْنَ الْخَطَّابِ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ رَسُولِ اللَّهِ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ لَهُمَا { إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا } وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ فَاعْتَزَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم نِسَاءَهُ مِنْ أَجْلِ ذَلِكَ الْحَدِيثِ حِينَ أَفْشَتْهُ حَفْصَةُ إِلَى عَائِشَةَ تِسْعًا وَعِشْرِينَ لَيْلَةً . قَالَتْ عَائِشَةُ وَكَانَ قَالَ \" مَا أَنَا بِدَاخِلٍ عَلَيْهِنَّ شَهْرًا \" . مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ حِينَ حَدَّثَهُ اللَّهُ عَزَّ وَجَلَّ حَدِيثَهُنَّ فَلَمَّا مَضَتْ تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَى عَائِشَةَ فَبَدَأَ بِهَا فَقَالَتْ لَهُ عَائِشَةُ إِنَّكَ قَدْ كُنْتَ آلَيْتَ يَا رَسُولَ اللَّهِ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا وَإِنَّا أَصْبَحْنَا مِنْ تِسْعٍ وَعِشْرِينَ لَيْلَةً نَعُدُّهَا عَدَدًا فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ تِسْعٌ وَعِشْرُونَ لَيْلَةً \" ."
  },
  "2133": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2133\nIn-book reference  : Book 22, Hadith 44\nEnglish translation  : Vol. 3, Book 22, Hadith 2135",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، - هُوَ أَبُو بُرَيْدٍ الْجَرْمِيُّ بَصْرِيٌّ - عَنْ بَهْزٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، عَنْ أَبِي الْحَكَمِ، عَنِ ابْنِ عَبَّاسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" أَتَانِي جِبْرِيلُ عَلَيْهِ السَّلاَمُ فَقَالَ الشَّهْرُ تِسْعٌ وَعِشْرُونَ يَوْمًا \" ."
  },
  "2134": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2134\nIn-book reference  : Book 22, Hadith 45\nEnglish translation  : Vol. 3, Book 22, Hadith 2136",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، وَذَكَرَ، كَلِمَةً مَعْنَاهَا حَدَّثَنَا شُعْبَةُ، عَنْ سَلَمَةَ، قَالَ سَمِعْتُ أَبَا الْحَكَمِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ تِسْعٌ وَعِشْرُونَ يَوْمًا \" ."
  },
  "2135": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2135\nIn-book reference  : Book 22, Hadith 46\nEnglish translation  : Vol. 3, Book 22, Hadith 2137",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ ضَرَبَ بِيَدِهِ عَلَى الأُخْرَى وَقَالَ \" الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . وَنَقَصَ فِي الثَّالِثَةِ إِصْبَعًا ."
  },
  "2136": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2136\nIn-book reference  : Book 22, Hadith 47\nEnglish translation  : Vol. 3, Book 22, Hadith 2138",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ إِسْمَاعِيلَ، عَنْ مُحَمَّدِ بْنِ سَعْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . يَعْنِي تِسْعَةً وَعِشْرِينَ . رَوَاهُ يَحْيَى بْنُ سَعِيدٍ وَغَيْرُهُ عَنْ إِسْمَاعِيلَ عَنْ مُحَمَّدِ بْنِ سَعْدٍ عَنِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "2137": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2137\nIn-book reference  : Book 22, Hadith 48\nEnglish translation  : Vol. 3, Book 22, Hadith 2139",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . وَصَفَّقَ مُحَمَّدُ بْنُ عُبَيْدٍ بِيَدَيْهِ يَنْعَتُهَا ثَلاَثًا ثُمَّ قَبَضَ فِي الثَّالِثَةِ الإِبْهَامَ فِي الْيُسْرَى . قَالَ يَحْيَى بْنُ سَعِيدٍ قُلْتُ لإِسْمَاعِيلَ عَنْ أَبِيهِ قَالَ لاَ ."
  },
  "2138": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2138\nIn-book reference  : Book 22, Hadith 49\nEnglish translation  : Vol. 3, Book 22, Hadith 2140",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا هَارُونُ، قَالَ حَدَّثَنَا عَلِيٌّ، - هُوَ ابْنُ الْمُبَارَكِ - قَالَ حَدَّثَنَا يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ يَكُونُ تِسْعَةً وَعِشْرِينَ وَيَكُونُ ثَلاَثِينَ فَإِذَا رَأَيْتُمُوهُ فَصُومُوا وَإِذَا رَأَيْتُمُوهُ فَأَفْطِرُوا فَإِنْ غُمَّ عَلَيْكُمْ فَأَكْمِلُوا الْعِدَّةَ \" ."
  },
  "2139": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2139\nIn-book reference  : Book 22, Hadith 50\nEnglish translation  : Vol. 3, Book 22, Hadith 2141",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ فَضَالَةَ بْنِ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا مُعَاوِيَةُ، ح وَأَخْبَرَنِي أَحْمَدُ بْنُ مُحَمَّدِ بْنِ الْمُغِيرَةِ، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ سَعِيدٍ، عَنْ مُعَاوِيَةَ، - وَاللَّفْظُ لَهُ - عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، أَنَّ أَبَا سَلَمَةَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ، وَهُوَ - ابْنُ عُمَرَ - يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الشَّهْرُ تِسْعٌ وَعِشْرُونَ \" ."
  },
  "2140": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2140\nIn-book reference  : Book 22, Hadith 51\nEnglish translation  : Vol. 3, Book 22, Hadith 2142",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، عَنْ سَعِيدِ بْنِ عَمْرٍو، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّا أُمَّةٌ أُمِّيَّةٌ لاَ نَكْتُبُ وَلاَ نَحْسِبُ الشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . ثَلاَثًا حَتَّى ذَكَرَ تِسْعًا وَعِشْرِينَ ."
  },
  "2141": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2141\nIn-book reference  : Book 22, Hadith 52\nEnglish translation  : Vol. 3, Book 22, Hadith 2143",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، عَنْ مُحَمَّدٍ، عَنْ شُعْبَةَ، عَنِ الأَسْوَدِ بْنِ قَيْسٍ، قَالَ سَمِعْتُ سَعِيدَ بْنَ عَمْرِو بْنِ سَعِيدِ بْنِ أَبِي الْعَاصِ، أَنَّهُ سَمِعَ ابْنَ عُمَرَ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّا أُمَّةٌ أُمِّيَّةٌ لاَ نَحْسِبُ وَلاَ نَكْتُبُ وَالشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . وَعَقَدَ الإِبْهَامَ فِي الثَّالِثَةِ \" وَالشَّهْرُ هَكَذَا وَهَكَذَا وَهَكَذَا \" . تَمَامَ الثَّلاَثِينَ ."
  },
  "2142": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2142\nIn-book reference  : Book 22, Hadith 53\nEnglish translation  : Vol. 3, Book 22, Hadith 2144",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ جَبَلَةَ بْنِ سُحَيْمٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" الشَّهْرُ هَكَذَا \" . وَوَصَفَ شُعْبَةُ عَنْ صِفَةِ جَبَلَةَ عَنْ صِفَةِ ابْنِ عُمَرَ أَنَّهُ تِسْعٌ وَعِشْرُونَ فِيمَا حَكَى مِنْ صَنِيعِهِ مَرَّتَيْنِ بِأَصَابِعِ يَدَيْهِ وَنَقَصَ فِي الثَّالِثَةِ إِصْبَعًا مِنْ أَصَابِعِ يَدَيْهِ ."
  },
  "2143": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2143\nIn-book reference  : Book 22, Hadith 54\nEnglish translation  : Vol. 3, Book 22, Hadith 2145",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عُقْبَةَ، - يَعْنِي ابْنَ حُرَيْثٍ - قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الشَّهْرُ تِسْعٌ وَعِشْرُونَ \" ."
  },
  "2144": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2144\nIn-book reference  : Book 22, Hadith 55\nEnglish translation  : Vol. 3, Book 22, Hadith 2146",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" . وَقَفَهُ عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ ."
  },
  "2145": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2145\nIn-book reference  : Book 22, Hadith 56\nEnglish translation  : Vol. 3, Book 22, Hadith 2147",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ أَبِي بَكْرِ بْنِ عَيَّاشٍ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ، قَالَ تَسَحَّرُوا . قَالَ عُبَيْدُ اللَّهِ لاَ أَدْرِي كَيْفَ لَفْظُهُ ."
  },
  "2146": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2146\nIn-book reference  : Book 22, Hadith 57\nEnglish translation  : Vol. 3, Book 22, Hadith 2148",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ قَتَادَةَ، وَعَبْدِ الْعَزِيزِ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" ."
  },
  "2147": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2147\nIn-book reference  : Book 22, Hadith 58\nEnglish translation  : Vol. 3, Book 22, Hadith 2149",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ سَعِيدِ بْنِ جَرِيرٍ، - نَسَائِيٌّ - قَالَ حَدَّثَنَا أَبُو الرَّبِيعِ، قَالَ حَدَّثَنَا مَنْصُورُ بْنُ أَبِي الأَسْوَدِ، عَنْ عَبْدِ الْمَلِكِ بْنِ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" ."
  },
  "2148": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2148\nIn-book reference  : Book 22, Hadith 59\nEnglish translation  : Vol. 3, Book 22, Hadith 2150",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا عَبْدُ الْمَلِكِ بْنُ أَبِي سُلَيْمَانَ، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً . رَفَعَهُ ابْنُ أَبِي لَيْلَى ."
  },
  "2149": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2149\nIn-book reference  : Book 22, Hadith 60\nEnglish translation  : Vol. 3, Book 22, Hadith 2151",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا ابْنُ أَبِي لَيْلَى، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" ."
  },
  "2150": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2150\nIn-book reference  : Book 22, Hadith 61\nEnglish translation  : Vol. 3, Book 22, Hadith 2152",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ الأَعْلَى بْنُ وَاصِلِ بْنِ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ سُفْيَانَ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عَطَاءٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" ."
  },
  "2151": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2151\nIn-book reference  : Book 22, Hadith 62\nEnglish translation  : Vol. 3, Book 22, Hadith 2153",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَسَحَّرُوا فَإِنَّ فِي السَّحُورِ بَرَكَةً \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ حَدِيثُ يَحْيَى بْنِ سَعِيدٍ هَذَا إِسْنَادُهُ حَسَنٌ وَهُوَ مُنْكَرٌ وَأَخَافُ أَنْ يَكُونَ الْغَلَطُ مِنْ مُحَمَّدِ بْنِ فُضَيْلٍ ."
  },
  "2152": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2152\nIn-book reference  : Book 22, Hadith 63\nEnglish translation  : Vol. 3, Book 22, Hadith 2154",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، قَالَ قُلْنَا لِحُذَيْفَةَ أَىَّ سَاعَةٍ تَسَحَّرْتَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ هُوَ النَّهَارُ إِلاَّ أَنَّ الشَّمْسَ لَمْ تَطْلُعْ ."
  },
  "2153": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2153\nIn-book reference  : Book 22, Hadith 64\nEnglish translation  : Vol. 3, Book 22, Hadith 2155",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَدِيٍّ، قَالَ سَمِعْتُ زِرَّ بْنَ حُبَيْشٍ، قَالَ تَسَحَّرْتُ مَعَ حُذَيْفَةَ ثُمَّ خَرَجْنَا إِلَى الصَّلاَةِ فَلَمَّا أَتَيْنَا الْمَسْجِدَ صَلَّيْنَا رَكْعَتَيْنِ وَأُقِيمَتِ الصَّلاَةُ وَلَيْسَ بَيْنَهُمَا إِلاَّ هُنَيْهَةٌ ."
  },
  "2154": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2154\nIn-book reference  : Book 22, Hadith 65\nEnglish translation  : Vol. 3, Book 22, Hadith 2156",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا أَبُو يَعْفُورٍ، قَالَ حَدَّثَنَا إِبْرَاهِيمُ، عَنْ صِلَةَ بْنِ زُفَرَ، قَالَ تَسَحَّرْتُ مَعَ حُذَيْفَةَ ثُمَّ خَرَجْنَا إِلَى الْمَسْجِدِ فَصَلَّيْنَا رَكْعَتَىِ الْفَجْرِ ثُمَّ أُقِيمَتِ الصَّلاَةُ فَصَلَّيْنَا ."
  },
  "2155": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2155\nIn-book reference  : Book 22, Hadith 66\nEnglish translation  : Vol. 3, Book 22, Hadith 2157",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا وَكِيعٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قُمْنَا إِلَى الصَّلاَةِ . قُلْتُ كَمْ كَانَ بَيْنَهُمَا قَالَ قَدْرَ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً ."
  },
  "2156": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2156\nIn-book reference  : Book 22, Hadith 67\nEnglish translation  : Vol. 3, Book 22, Hadith 2158",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ أَنَسٍ، عَنْ زَيْدِ بْنِ ثَابِتٍ، قَالَ تَسَحَّرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ قُمْنَا إِلَى الصَّلاَةِ . قُلْتُ زُعِمَ أَنَّ أَنَسًا الْقَائِلُ مَا كَانَ بَيْنَ ذَلِكَ قَالَ قَدْرَ مَا يَقْرَأُ الرَّجُلُ خَمْسِينَ آيَةً ."
  },
  "2157": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2157\nIn-book reference  : Book 22, Hadith 68\nEnglish translation  : Vol. 3, Book 22, Hadith 2159",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، رضى الله عنه قَالَ تَسَحَّرَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَزَيْدُ بْنُ ثَابِتٍ ثُمَّ قَامَا فَدَخَلاَ فِي صَلاَةِ الصُّبْحِ . فَقُلْنَا لأَنَسٍ كَمْ كَانَ بَيْنَ فَرَاغِهِمَا وَدُخُولِهِمَا فِي الصَّلاَةِ قَالَ قَدْرَ مَا يَقْرَأُ الإِنْسَانُ خَمْسِينَ آيَةً ."
  },
  "2158": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2158\nIn-book reference  : Book 22, Hadith 69\nEnglish translation  : Vol. 3, Book 22, Hadith 2160",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُلَيْمَانَ، عَنْ خَيْثَمَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ قُلْتُ لِعَائِشَةَ فِينَا رَجُلاَنِ مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُؤَخِّرُ السُّحُورَ وَالآخَرُ يُؤَخِّرُ الإِفْطَارَ وَيُعَجِّلُ السُّحُورَ . قَالَتْ أَيُّهُمَا الَّذِي يُعَجِّلُ الإِفْطَارَ وَيُؤَخِّرُ السُّحُورَ قُلْتُ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ . قَالَتْ هَكَذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ."
  },
  "2159": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2159\nIn-book reference  : Book 22, Hadith 70\nEnglish translation  : Vol. 3, Book 22, Hadith 2161",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ خَيْثَمَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ قُلْتُ لِعَائِشَةَ فِينَا رَجُلاَنِ أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُؤَخِّرُ السُّحُورَ وَالآخَرُ يُؤَخِّرُ الْفِطْرَ وَيُعَجِّلُ السُّحُورَ . قَالَتْ أَيُّهُمَا الَّذِي يُعَجِّلُ الإِفْطَارَ وَيُؤَخِّرُ السُّحُورَ قُلْتُ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ . قَالَتْ هَكَذَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ."
  },
  "2160": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2160\nIn-book reference  : Book 22, Hadith 71\nEnglish translation  : Vol. 3, Book 22, Hadith 2162",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ دَخَلْتُ أَنَا وَمَسْرُوقٌ، عَلَى عَائِشَةَ فَقَالَ لَهَا مَسْرُوقٌ رَجُلاَنِ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم كِلاَهُمَا لاَ يَأْلُو عَنِ الْخَيْرِ أَحَدُهُمَا يُؤَخِّرُ الصَّلاَةَ وَالْفِطْرَ وَالآخَرُ يُعَجِّلُ الصَّلاَةَ وَالْفِطْرَ . فَقَالَتْ عَائِشَةُ أَيُّهُمَا الَّذِي يُعَجِّلُ الصَّلاَةَ وَالْفِطْرَ قَالَ مَسْرُوقٌ عَبْدُ اللَّهِ بْنُ مَسْعُودٍ . فَقَالَتْ عَائِشَةُ هَكَذَا كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم ."
  },
  "2161": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2161\nIn-book reference  : Book 22, Hadith 72\nEnglish translation  : Vol. 3, Book 22, Hadith 2163",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا هَنَّادُ بْنُ السَّرِيِّ، عَنْ أَبِي مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ أَبِي عَطِيَّةَ، قَالَ دَخَلْتُ أَنَا وَمَسْرُوقٌ، عَلَى عَائِشَةَ فَقُلْنَا لَهَا يَا أُمَّ الْمُؤْمِنِينَ رَجُلاَنِ مِنْ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم أَحَدُهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ وَالآخَرُ يُؤَخِّرُ الإِفْطَارَ وَيُؤَخِّرُ الصَّلاَةَ . فَقَالَتْ أَيُّهُمَا يُعَجِّلُ الإِفْطَارَ وَيُعَجِّلُ الصَّلاَةَ قُلْنَا عَبْدُ اللَّهِ بْنُ مَسْعُودٍ . قَالَتْ هَكَذَا كَانَ يَصْنَعُ رَسُولُ اللَّهِ صلى الله عليه وسلم . وَالآخَرُ أَبُو مُوسَى رضى الله عنهما ."
  },
  "2162": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2162\nIn-book reference  : Book 22, Hadith 73\nEnglish translation  : Vol. 3, Book 22, Hadith 2164",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ الْحَمِيدِ، صَاحِبِ الزِّيَادِيِّ قَالَ سَمِعْتُ عَبْدَ اللَّهِ بْنَ الْحَارِثِ، يُحَدِّثُ عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ دَخَلْتُ عَلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَتَسَحَّرُ فَقَالَ \" إِنَّهَا بَرَكَةٌ أَعْطَاكُمُ اللَّهُ إِيَّاهَا فَلاَ تَدَعُوهُ \" ."
  },
  "2163": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2163\nIn-book reference  : Book 22, Hadith 74\nEnglish translation  : Vol. 3, Book 22, Hadith 2165",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، - بَصْرِيٌّ - قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، عَنْ مُعَاوِيَةَ بْنِ صَالِحٍ، عَنْ يُونُسَ بْنِ سَيْفٍ، عَنِ الْحَارِثِ بْنِ زِيَادٍ، عَنْ أَبِي رُهْمٍ، عَنِ الْعِرْبَاضِ بْنِ سَارِيَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يَدْعُو إِلَى السَّحُورِ فِي شَهْرِ رَمَضَانَ وَقَالَ \" هَلُمُّوا إِلَى الْغَدَاءِ الْمُبَارَكِ \" ."
  },
  "2164": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2164\nIn-book reference  : Book 22, Hadith 75\nEnglish translation  : Vol. 3, Book 22, Hadith 2166",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ بَقِيَّةَ بْنِ الْوَلِيدِ، قَالَ أَخْبَرَنِي بَحِيرُ بْنُ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" عَلَيْكُمْ بِغَدَاءِ السُّحُورِ فَإِنَّهُ هُوَ الْغَدَاءُ الْمُبَارَكُ \" ."
  },
  "2165": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2165\nIn-book reference  : Book 22, Hadith 76\nEnglish translation  : Vol. 3, Book 22, Hadith 2167",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لِرَجُلٍ \" هَلُمَّ إِلَى الْغَدَاءِ الْمُبَارَكِ \" . يَعْنِي السَّحُورَ ."
  },
  "2166": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2166\nIn-book reference  : Book 22, Hadith 77\nEnglish translation  : Vol. 3, Book 22, Hadith 2168",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ مُوسَى بْنِ عُلَىٍّ، عَنْ أَبِيهِ، عَنْ أَبِي قَيْسٍ، عَنْ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ فَصْلَ مَا بَيْنَ صِيَامِنَا وَصِيَامِ أَهْلِ الْكِتَابِ أَكْلَةُ السُّحُورِ \" ."
  },
  "2167": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2167\nIn-book reference  : Book 22, Hadith 78\nEnglish translation  : Vol. 3, Book 22, Hadith 2169",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَذَلِكَ عِنْدَ السُّحُورِ \" يَا أَنَسُ إِنِّي أُرِيدُ الصِّيَامَ أَطْعِمْنِي شَيْئًا \" . فَأَتَيْتُهُ بِتَمْرٍ وَإِنَاءٍ فِيهِ مَاءٌ وَذَلِكَ بَعْدَ مَا أَذَّنَ بِلاَلٌ فَقَالَ \" يَا أَنَسُ انْظُرْ رَجُلاً يَأْكُلُ مَعِي \" . فَدَعَوْتُ زَيْدَ بْنَ ثَابِتٍ فَجَاءَ فَقَالَ إِنِّي قَدْ شَرِبْتُ شَرْبَةَ سَوِيقٍ وَأَنَا أُرِيدُ الصِّيَامَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَأَنَا أُرِيدُ الصِّيَامَ \" . فَتَسَحَّرَ مَعَهُ ثُمَّ قَامَ فَصَلَّى رَكْعَتَيْنِ ثُمَّ خَرَجَ إِلَى الصَّلاَةِ ."
  },
  "2168": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2168\nIn-book reference  : Book 22, Hadith 79\nEnglish translation  : Vol. 3, Book 22, Hadith 2170",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا حُسَيْنُ بْنُ عَيَّاشٍ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، أَنَّ أَحَدَهُمْ، كَانَ إِذَا نَامَ قَبْلَ أَنْ يَتَعَشَّى لَمْ يَحِلَّ لَهُ أَنْ يَأْكُلَ شَيْئًا وَلاَ يَشْرَبَ لَيْلَتَهُ وَيَوْمَهُ مِنَ الْغَدِ حَتَّى تَغْرُبَ الشَّمْسُ حَتَّى نَزَلَتْ هَذِهِ الآيَةُ { وَكُلُوا وَاشْرَبُوا } إِلَى { الْخَيْطِ الأَسْوَدِ } قَالَ وَنَزَلَتْ فِي أَبِي قَيْسِ بْنِ عَمْرٍو أَتَى أَهْلَهُ وَهُوَ صَائِمٌ بَعْدَ الْمَغْرِبِ فَقَالَ هَلْ مِنْ شَىْءٍ فَقَالَتِ امْرَأَتُهُ مَا عِنْدَنَا شَىْءٌ وَلَكِنْ أَخْرُجُ أَلْتَمِسُ لَكَ عَشَاءً . فَخَرَجَتْ وَوَضَعَ رَأْسَهُ فَنَامَ فَرَجَعَتْ إِلَيْهِ فَوَجَدَتْهُ نَائِمًا وَأَيْقَظَتْهُ فَلَمْ يَطْعَمْ شَيْئًا وَبَاتَ وَأَصْبَحَ صَائِمًا حَتَّى انْتَصَفَ النَّهَارُ فَغُشِيَ عَلَيْهِ وَذَلِكَ قَبْلَ أَنْ تَنْزِلَ هَذِهِ الآيَةُ فَأَنْزَلَ اللَّهُ فِيهِ ."
  },
  "2169": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2169\nIn-book reference  : Book 22, Hadith 80\nEnglish translation  : Vol. 3, Book 22, Hadith 2171",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا جَرِيرٌ، عَنْ مُطَرِّفٍ، عَنِ الشَّعْبِيِّ، عَنْ عَدِيِّ بْنِ حَاتِمٍ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنْ قَوْلِهِ تَعَالَى { حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ } قَالَ \" هُوَ سَوَادُ اللَّيْلِ وَبَيَاضُ النَّهَارِ \" ."
  },
  "2170": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2170\nIn-book reference  : Book 22, Hadith 81\nEnglish translation  : Vol. 3, Book 22, Hadith 2172",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا التَّيْمِيُّ، عَنْ أَبِي عُثْمَانَ، عَنِ ابْنِ مَسْعُودٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ بِلاَلاً يُؤَذِّنُ بِلَيْلٍ لِيُنَبِّهَ نَائِمَكُمْ وَيُرْجِعَ قَائِمَكُمْ وَلَيْسَ الْفَجْرُ أَنْ يَقُولَ هَكَذَا \" . وَأَشَارَ بِكَفِّهِ \" وَلَكِنِ الْفَجْرُ أَنْ يَقُولَ هَكَذَا \" . وَأَشَارَ بِالسَّبَّابَتَيْنِ ."
  },
  "2171": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2171\nIn-book reference  : Book 22, Hadith 82\nEnglish translation  : Vol. 3, Book 22, Hadith 2173",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، أَنْبَأَنَا سَوَادَةُ بْنُ حَنْظَلَةَ، قَالَ سَمِعْتُ سَمُرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَغُرَّنَّكُمْ أَذَانُ بِلاَلٍ وَلاَ هَذَا الْبَيَاضُ حَتَّى يَنْفَجِرَ الْفَجْرُ هَكَذَا وَهَكَذَا \" . يَعْنِي مُعْتَرِضًا . قَالَ أَبُو دَاوُدَ وَبَسَطَ بِيَدَيْهِ يَمِينًا وَشِمَالاً مَادًّا يَدَيْهِ ."
  },
  "2172": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2172\nIn-book reference  : Book 22, Hadith 83\nEnglish translation  : Vol. 3, Book 22, Hadith 2174",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ تَقَدَّمُوا قَبْلَ الشَّهْرِ بِصِيَامٍ إِلاَّ رَجُلٌ كَانَ يَصُومُ صِيَامًا أَتَى ذَلِكَ الْيَوْمُ عَلَى صِيَامِهِ \" ."
  },
  "2173": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2173\nIn-book reference  : Book 22, Hadith 84\nEnglish translation  : Vol. 3, Book 22, Hadith 2175",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عِمْرَانُ بْنُ يَزِيدَ بْنِ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، قَالَ أَنْبَأَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ، قَالَ أَخْبَرَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لاَ يَتَقَدَّمَنَّ أَحَدٌ الشَّهْرَ بِيَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَحَدٌ كَانَ يَصُومُ صِيَامًا قَبْلَهُ فَلْيَصُمْهُ \" ."
  },
  "2174": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2174\nIn-book reference  : Book 22, Hadith 85\nEnglish translation  : Vol. 3, Book 22, Hadith 2176",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو خَالِدٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَتَقَدَّمُوا الشَّهْرَ بِصِيَامِ يَوْمٍ وَلاَ يَوْمَيْنِ إِلاَّ أَنْ يُوَافِقَ ذَلِكَ يَوْمًا كَانَ يَصُومُهُ أَحَدُكُمْ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ ."
  },
  "2175": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2175\nIn-book reference  : Book 22, Hadith 86\nEnglish translation  : Vol. 3, Book 22, Hadith 2177",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا شُعَيْبُ بْنُ يُوسُفَ، وَمُحَمَّدُ بْنُ بَشَّارٍ، - وَاللَّفْظُ لَهُ - قَالاَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنْ سَالِمٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ مَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلاَّ أَنَّهُ كَانَ يَصِلُ شَعْبَانَ بِرَمَضَانَ ."
  },
  "2176": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2176\nIn-book reference  : Book 22, Hadith 87\nEnglish translation  : Vol. 3, Book 22, Hadith 2178",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ تَوْبَةَ الْعَنْبَرِيِّ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصِلُ شَعْبَانَ بِرَمَضَانَ ."
  },
  "2177": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2177\nIn-book reference  : Book 22, Hadith 88\nEnglish translation  : Vol. 3, Book 22, Hadith 2179",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي أُسَامَةُ بْنُ زَيْدٍ، أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ، حَدَّثَهُ عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَأَلَ عَائِشَةَ عَنْ صِيَامِ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ لاَ يَصُومُ وَكَانَ يَصُومُ شَعْبَانَ أَوْ عَامَّةَ شَعْبَانَ ."
  },
  "2178": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2178\nIn-book reference  : Book 22, Hadith 89\nEnglish translation  : Vol. 3, Book 22, Hadith 2180",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سَعْدِ بْنِ الْحَكَمِ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا نَافِعُ بْنُ يَزِيدَ، أَنَّ ابْنَ الْهَادِ، حَدَّثَهُ أَنَّ مُحَمَّدَ بْنَ إِبْرَاهِيمَ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ، - يَعْنِي ابْنَ عَبْدِ الرَّحْمَنِ - عَنْ عَائِشَةَ، قَالَتْ لَقَدْ كَانَتْ إِحْدَانَا تُفْطِرُ فِي رَمَضَانَ فَمَا تَقْدِرُ عَلَى أَنْ تَقْضِيَ حَتَّى يَدْخُلَ شَعْبَانُ وَمَا كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ فِي شَهْرٍ مَا يَصُومُ فِي شَعْبَانَ كَانَ يَصُومُهُ كُلَّهُ إِلاَّ قَلِيلاً بَلْ كَانَ يَصُومُهُ كُلَّهُ ."
  },
  "2179": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2179\nIn-book reference  : Book 22, Hadith 90\nEnglish translation  : Vol. 3, Book 22, Hadith 2181",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي لَبِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ سَأَلْتُ عَائِشَةَ فَقُلْتُ أَخْبِرِينِي عَنْ صِيَامِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَلَمْ يَكُنْ يَصُومُ شَهْرًا أَكْثَرَ مِنْ شَعْبَانَ كَانَ يَصُومُ شَعْبَانَ إِلاَّ قَلِيلاً كَانَ يَصُومُ شَعْبَانَ كُلَّهُ ."
  },
  "2180": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2180\nIn-book reference  : Book 22, Hadith 91\nEnglish translation  : Vol. 3, Book 22, Hadith 2182",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا مُعَاذُ بْنُ هِشَامٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، قَالَتْ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي شَهْرٍ مِنَ السَّنَةِ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ كَانَ يَصُومُ شَعْبَانَ كُلَّهُ ."
  },
  "2181": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2181\nIn-book reference  : Book 22, Hadith 92\nEnglish translation  : Vol. 3, Book 22, Hadith 2183",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُ شَعْبَانَ ."
  },
  "2182": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2182\nIn-book reference  : Book 22, Hadith 93\nEnglish translation  : Vol. 3, Book 22, Hadith 2184",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، عَنْ عَبْدَةَ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ لاَ أَعْلَمُ رَسُولَ اللَّهِ صلى الله عليه وسلم قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلاَ قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلاَ صَامَ شَهْرًا كَامِلاً قَطُّ غَيْرَ رَمَضَانَ ."
  },
  "2183": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2183\nIn-book reference  : Book 22, Hadith 94\nEnglish translation  : Vol. 3, Book 22, Hadith 2185",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَحْمَدَ بْنِ أَبِي يُوسُفَ الصَّيْدَلاَنِيُّ، - حَرَّانِيٌّ - قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، عَنْ عَائِشَةَ، قَالَ سَأَلْتُهَا عَنْ صِيَامِ، رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَلَمْ يَصُمْ شَهْرًا تَامًّا مُنْذُ أَتَى الْمَدِينَةَ إِلاَّ أَنْ يَكُونَ رَمَضَانُ ."
  },
  "2184": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2184\nIn-book reference  : Book 22, Hadith 95\nEnglish translation  : Vol. 3, Book 22, Hadith 2186",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ أَنْبَأَنَا خَالِدٌ، - وَهُوَ ابْنُ الْحَارِثِ - عَنْ كَهْمَسٍ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ قُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةَ الضُّحَى قَالَتْ لاَ إِلاَّ أَنْ يَجِيءَ مِنْ مَغِيبِهِ . قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ شَهْرًا كُلَّهُ قَالَتْ لاَ مَا عَلِمْتُ صَامَ شَهْرًا كُلَّهُ إِلاَّ رَمَضَانَ وَلاَ أَفْطَرَ حَتَّى يَصُومَ مِنْهُ حَتَّى مَضَى لِسَبِيلِهِ ."
  },
  "2185": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2185\nIn-book reference  : Book 22, Hadith 96\nEnglish translation  : Vol. 3, Book 22, Hadith 2187",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو الأَشْعَثِ، عَنْ يَزِيدَ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا الْجُرَيْرِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ قُلْتُ لِعَائِشَةَ أَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُصَلِّي صَلاَةَ الضُّحَى قَالَتْ لاَ إِلاَّ أَنْ يَجِيءَ مِنْ مَغِيبِهِ . قُلْتُ هَلْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لَهُ صَوْمٌ مَعْلُومٌ سِوَى رَمَضَانَ قَالَتْ وَاللَّهِ إِنْ صَامَ شَهْرًا مَعْلُومًا سِوَى رَمَضَانَ حَتَّى مَضَى لِوَجْهِهِ وَلاَ أَفْطَرَ حَتَّى يَصُومَ مِنْهُ ."
  },
  "2186": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2186\nIn-book reference  : Book 22, Hadith 97\nEnglish translation  : Vol. 3, Book 22, Hadith 2188",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، عَنْ بَقِيَّةَ، قَالَ حَدَّثَنَا بَحِيرٌ، عَنْ خَالِدٍ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، أَنَّ رَجُلاً، سَأَلَ عَائِشَةَ عَنِ الصِّيَامِ، فَقَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ شَعْبَانَ كُلَّهُ وَيَتَحَرَّى صِيَامَ الاِثْنَيْنِ وَالْخَمِيسِ ."
  },
  "2187": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2187\nIn-book reference  : Book 22, Hadith 98\nEnglish translation  : Vol. 3, Book 22, Hadith 2189",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، قَالَ حَدَّثَنَا ثَوْرٌ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ رَبِيعَةَ الْجُرَشِيِّ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ شَعْبَانَ وَرَمَضَانَ وَيَتَحَرَّى الاِثْنَيْنِ وَالْخَمِيسَ ."
  },
  "2188": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2188\nIn-book reference  : Book 22, Hadith 99\nEnglish translation  : Vol. 3, Book 22, Hadith 2190",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، عَنْ أَبِي خَالِدٍ، عَنْ عَمْرِو بْنِ قَيْسٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ صِلَةَ، قَالَ كُنَّا عِنْدَ عَمَّارٍ فَأُتِيَ بِشَاةٍ مَصْلِيَّةٍ فَقَالَ كُلُوا . فَتَنَحَّى بَعْضُ الْقَوْمِ قَالَ إِنِّي صَائِمٌ . فَقَالَ عَمَّارٌ مَنْ صَامَ الْيَوْمَ الَّذِي يُشَكُّ فِيهِ فَقَدْ عَصَى أَبَا الْقَاسِمِ صلى الله عليه وسلم ."
  },
  "2189": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2189\nIn-book reference  : Book 22, Hadith 100\nEnglish translation  : Vol. 3, Book 22, Hadith 2191",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنْ أَبِي يُونُسَ، عَنْ سِمَاكٍ، قَالَ دَخَلْتُ عَلَى عِكْرِمَةَ فِي يَوْمٍ قَدْ أُشْكِلَ مِنْ رَمَضَانَ هُوَ أَمْ مِنْ شَعْبَانَ وَهُوَ يَأْكُلُ خُبْزًا وَبَقْلاً وَلَبَنًا فَقَالَ لِي هَلُمَّ . فَقُلْتُ إِنِّي صَائِمٌ . قَالَ وَحَلَفَ بِاللَّهِ لَتُفْطِرَنَّ قُلْتُ سُبْحَانَ اللَّهِ مَرَّتَيْنِ فَلَمَّا رَأَيْتُهُ يَحْلِفُ لاَ يَسْتَثْنِي تَقَدَّمْتُ قُلْتُ هَاتِ الآنَ مَا عِنْدَكَ قَالَ سَمِعْتُ ابْنَ عَبَّاسٍ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُومُوا لِرُؤْيَتِهِ وَأَفْطِرُوا لِرُؤْيَتِهِ فَإِنْ حَالَ بَيْنَكُمْ وَبَيْنَهُ سَحَابَةٌ أَوْ ظُلْمَةٌ فَأَكْمِلُوا الْعِدَّةَ عِدَّةَ شَعْبَانَ وَلاَ تَسْتَقْبِلُوا الشَّهْرَ اسْتِقْبَالاً وَلاَ تَصِلُوا رَمَضَانَ بِيَوْمٍ مِنْ شَعْبَانَ \" ."
  },
  "2190": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2190\nIn-book reference  : Book 22, Hadith 101\nEnglish translation  : Vol. 3, Book 22, Hadith 2192",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ أَخْبَرَنِي أَبِي، عَنْ جَدِّي، قَالَ أَخْبَرَنِي شُعَيْبُ بْنُ إِسْحَاقَ، عَنِ الأَوْزَاعِيِّ، وَابْنِ أَبِي عَرُوبَةَ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ كَانَ يَقُولُ \" أَلاَ لاَ تَقَدَّمُوا الشَّهْرَ بِيَوْمٍ أَوِ اثْنَيْنِ إِلاَّ رَجُلٌ كَانَ يَصُومُ صِيَامًا فَلْيَصُمْهُ \" ."
  },
  "2191": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2191\nIn-book reference  : Book 22, Hadith 102\nEnglish translation  : Vol. 3, Book 22, Hadith 2193",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، عَنِ اللَّيْثِ، قَالَ أَنْبَأَنَا خَالِدٌ، عَنِ ابْنِ أَبِي هِلاَلٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2192": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2192\nIn-book reference  : Book 22, Hadith 103\nEnglish translation  : Vol. 3, Book 22, Hadith 2194",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ جَبَلَةَ، قَالَ حَدَّثَنَا الْمُعَافَى، قَالَ حَدَّثَنَا مُوسَى، عَنْ إِسْحَاقَ بْنِ رَاشِدٍ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، زَوْجَ النَّبِيِّ صلى الله عليه وسلم أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُرَغِّبُ النَّاسَ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةِ أَمْرٍ فِيهِ فَيَقُولُ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2193": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2193\nIn-book reference  : Book 22, Hadith 104\nEnglish translation  : Vol. 3, Book 22, Hadith 2195",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ أَنْبَأَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ الْحَارِثِ، عَنْ يُونُسَ الأَيْلِيِّ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي جَوْفِ اللَّيْلِ يُصَلِّي فِي الْمَسْجِدِ فَصَلَّى بِالنَّاسِ وَسَاقَ الْحَدِيثَ وَفِيهِ قَالَتْ فَكَانَ يُرَغِّبُهُمْ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ وَيَقُولُ \" مَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" . قَالَ فَتُوُفِّيَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَالأَمْرُ عَلَى ذَلِكَ ."
  },
  "2194": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2194\nIn-book reference  : Book 22, Hadith 105\nEnglish translation  : Vol. 3, Book 22, Hadith 2196",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي رَمَضَانَ \" مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2195": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2195\nIn-book reference  : Book 22, Hadith 106\nEnglish translation  : Vol. 3, Book 22, Hadith 2197",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مُحَمَّدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ مِنْ جَوْفِ اللَّيْلِ فَصَلَّى فِي الْمَسْجِدِ وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ وَكَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرَغِّبُهُمْ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةِ أَمْرٍ فِيهِ فَيَقُولُ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2196": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2196\nIn-book reference  : Book 22, Hadith 107\nEnglish translation  : Vol. 3, Book 22, Hadith 2198",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا بِشْرُ بْنُ شُعَيْبٍ، عَنْ أَبِيهِ، عَنِ الزُّهْرِيِّ، قَالَ حَدَّثَنَا أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ لِرَمَضَانَ \" مَنْ قَامَهُ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2197": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2197\nIn-book reference  : Book 22, Hadith 108\nEnglish translation  : Vol. 3, Book 22, Hadith 2199",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبِي، عَنْ صَالِحٍ، عَنِ ابْنِ شِهَابٍ، أَنَّ أَبَا سَلَمَةَ، أَخْبَرَهُ أَنَّ أَبَا هُرَيْرَةَ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2198": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2198\nIn-book reference  : Book 22, Hadith 109\nEnglish translation  : Vol. 3, Book 22, Hadith 2200",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا نُوحُ بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2199": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2199\nIn-book reference  : Book 22, Hadith 110\nEnglish translation  : Vol. 3, Book 22, Hadith 2201",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ مَالِكٍ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2200": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2200\nIn-book reference  : Book 22, Hadith 111\nEnglish translation  : Vol. 3, Book 22, Hadith 2202",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ حَدَّثَنَا ابْنُ الْقَاسِمِ، عَنْ مَالِكٍ، قَالَ حَدَّثَنِي ابْنُ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2201": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2201\nIn-book reference  : Book 22, Hadith 112\nEnglish translation  : Vol. 3, Book 22, Hadith 2203",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُحَمَّدِ بْنِ أَسْمَاءَ، قَالَ حَدَّثَنَا جُوَيْرِيَةُ، عَنْ مَالِكٍ، قَالَ الزُّهْرِيُّ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2202": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2202\nIn-book reference  : Book 22, Hadith 113\nEnglish translation  : Vol. 3, Book 22, Hadith 2204",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، وَمُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ يَزِيدَ، قَالاَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ رَمَضَانَ \" . وَفِي حَدِيثِ قُتَيْبَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ شَهْرَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2203": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2203\nIn-book reference  : Book 22, Hadith 114\nEnglish translation  : Vol. 3, Book 22, Hadith 2205",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2204": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2204\nIn-book reference  : Book 22, Hadith 115\nEnglish translation  : Vol. 3, Book 22, Hadith 2206",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2205": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2205\nIn-book reference  : Book 22, Hadith 116\nEnglish translation  : Vol. 3, Book 22, Hadith 2207",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا ابْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2206": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2206\nIn-book reference  : Book 22, Hadith 117\nEnglish translation  : Vol. 3, Book 22, Hadith 2208",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، وَمُحَمَّدُ بْنُ هِشَامٍ، وَأَبُو الأَشْعَثِ، - وَاللَّفْظُ لَهُ - قَالُوا حَدَّثَنَا خَالِدٌ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2207": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2207\nIn-book reference  : Book 22, Hadith 118\nEnglish translation  : Vol. 3, Book 22, Hadith 2209",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مَحْمُودُ بْنُ خَالِدٍ، عَنْ مَرْوَانَ، أَنْبَأَنَا مُعَاوِيَةُ بْنُ سَلاَّمٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ قَامَ شَهْرَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ وَمَنْ قَامَ لَيْلَةَ الْقَدْرِ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ \" ."
  },
  "2208": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2208\nIn-book reference  : Book 22, Hadith 119\nEnglish translation  : Vol. 3, Book 22, Hadith 2210",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا الْفَضْلُ بْنُ دُكَيْنٍ، قَالَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ حَدَّثَنِي النَّضْرُ بْنُ شَيْبَانَ، أَنَّهُ لَقِيَ أَبَا سَلَمَةَ بْنَ عَبْدِ الرَّحْمَنِ فَقَالَ لَهُ حَدِّثْنِي بِأَفْضَلِ، شَىْءٍ سَمِعْتَهُ يُذْكَرُ، فِي شَهْرِ رَمَضَانَ . فَقَالَ أَبُو سَلَمَةَ حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ عَوْفٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ ذَكَرَ شَهْرَ رَمَضَانَ فَفَضَّلَهُ عَلَى الشُّهُورِ وَقَالَ \" مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ أَبُو سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ ."
  },
  "2209": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2209\nIn-book reference  : Book 22, Hadith 120\nEnglish translation  : Vol. 3, Book 22, Hadith 2211",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا النَّضْرُ بْنُ شُمَيْلٍ، قَالَ أَنْبَأَنَا الْقَاسِمُ بْنُ الْفَضْلِ، قَالَ حَدَّثَنَا النَّضْرُ بْنُ شَيْبَانَ، عَنْ أَبِي سَلَمَةَ، فَذَكَرَ مِثْلَهُ وَقَالَ \" مَنْ صَامَهُ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا \" ."
  },
  "2210": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2210\nIn-book reference  : Book 22, Hadith 121\nEnglish translation  : Vol. 3, Book 22, Hadith 2212",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، قَالَ حَدَّثَنَا أَبُو هِشَامٍ، قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ الْفَضْلِ، قَالَ حَدَّثَنَا النَّضْرُ بْنُ شَيْبَانَ، قَالَ قُلْتُ لأَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ حَدِّثْنِي بِشَىْءٍ، سَمِعْتَهُ مِنْ، أَبِيكَ سَمِعَهُ أَبُوكَ، مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيْسَ بَيْنَ أَبِيكَ وَبَيْنَ رَسُولِ اللَّهِ صلى الله عليه وسلم أَحَدٌ فِي شَهْرِ رَمَضَانَ . قَالَ نَعَمْ حَدَّثَنِي أَبِي قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى فَرَضَ صِيَامَ رَمَضَانَ عَلَيْكُمْ وَسَنَنْتُ لَكُمْ قِيَامَهُ فَمَنْ صَامَهُ وَقَامَهُ إِيمَانًا وَاحْتِسَابًا خَرَجَ مِنْ ذُنُوبِهِ كَيَوْمِ وَلَدَتْهُ أُمُّهُ \" ."
  },
  "2211": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2211\nIn-book reference  : Book 22, Hadith 122\nEnglish translation  : Vol. 3, Book 22, Hadith 2213",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ اللَّهِ بْنِ الْحَارِثِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ حِينَ يُفْطِرُ وَحِينَ يَلْقَى رَبَّهُ وَالَّذِي نَفْسِي بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2212": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2212\nIn-book reference  : Book 22, Hadith 123\nEnglish translation  : Vol. 3, Book 22, Hadith 2214",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الأَحْوَصِ، قَالَ عَبْدُ اللَّهِ \" قَالَ اللَّهُ عَزَّ وَجَلَّ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ حِينَ يَلْقَى رَبَّهُ وَفَرْحَةٌ عِنْدَ إِفْطَارِهِ وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2213": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2213\nIn-book reference  : Book 22, Hadith 124\nEnglish translation  : Vol. 3, Book 22, Hadith 2215",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، قَالَ حَدَّثَنَا أَبُو سِنَانٍ، ضِرَارُ بْنُ مُرَّةَ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي سَعِيدٍ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم \" إِنَّ اللَّهَ تَبَارَكَ وَتَعَالَى يَقُولُ الصَّوْمُ لِي وَأَنَا أَجْزِي بِهِ وَلِلصَّائِمِ فَرْحَتَانِ إِذَا أَفْطَرَ فَرِحَ وَإِذَا لَقِيَ اللَّهَ فَجَزَاهُ فَرِحَ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2214": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2214\nIn-book reference  : Book 22, Hadith 125\nEnglish translation  : Vol. 3, Book 22, Hadith 2216",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرٌو، أَنَّ الْمُنْذِرَ بْنَ عُبَيْدٍ، حَدَّثَهُ عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" الصِّيَامُ لِي وَأَنَا أَجْزِي بِهِ وَالصَّائِمُ يَفْرَحُ مَرَّتَيْنِ عِنْدَ فِطْرِهِ وَيَوْمَ يَلْقَى اللَّهَ وَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2215": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2215\nIn-book reference  : Book 22, Hadith 126\nEnglish translation  : Vol. 3, Book 22, Hadith 2217",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَا مِنْ حَسَنَةٍ عَمِلَهَا ابْنُ آدَمَ إِلاَّ كُتِبَ لَهُ عَشْرُ حَسَنَاتٍ إِلَى سَبْعِمِائَةِ ضِعْفٍ قَالَ اللَّهُ عَزَّ وَجَلَّ إِلاَّ الصِّيَامَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي الصِّيَامُ جُنَّةٌ لِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ عِنْدَ فِطْرِهِ وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2216": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2216\nIn-book reference  : Book 22, Hadith 127\nEnglish translation  : Vol. 3, Book 22, Hadith 2218",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ، عَنْ أَبِي صَالِحٍ الزَّيَّاتِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلاَّ الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ وَالصِّيَامُ جُنَّةٌ إِذَا كَانَ يَوْمُ صِيَامِ أَحَدِكُمْ فَلاَ يَرْفُثْ وَلاَ يَصْخَبْ فَإِنْ شَاتَمَهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ مِنْ رِيحِ الْمِسْكِ لِلصَّائِمِ فَرْحَتَانِ يَفْرَحُهُمَا إِذَا أَفْطَرَ فَرِحَ بِفِطْرِهِ وَإِذَا لَقِيَ رَبَّهُ عَزَّ وَجَلَّ فَرِحَ بِصَوْمِهِ \" ."
  },
  "2217": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2217\nIn-book reference  : Book 22, Hadith 128\nEnglish translation  : Vol. 3, Book 22, Hadith 2219",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قِرَاءَةً عَلَيْهِ عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، قَالَ أَخْبَرَنِي عَطَاءٌ الزَّيَّاتُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قَالَ اللَّهُ عَزَّ وَجَلَّ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلاَّ الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ الصِّيَامُ جُنَّةٌ فَإِذَا كَانَ يَوْمُ صَوْمِ أَحَدِكُمْ فَلاَ يَرْفُثْ وَلاَ يَصْخَبْ فَإِنْ شَاتَمَهُ أَحَدٌ أَوْ قَاتَلَهُ فَلْيَقُلْ إِنِّي امْرُؤٌ صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" . وَقَدْ رَوَى هَذَا الْحَدِيثَ عَنْ أَبِي هُرَيْرَةَ سَعِيدُ بْنُ الْمُسَيَّبِ ."
  },
  "2218": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2218\nIn-book reference  : Book 22, Hadith 129\nEnglish translation  : Vol. 3, Book 22, Hadith 2220",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ حَدَّثَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" قَالَ اللَّهُ عَزَّ وَجَلَّ كُلُّ عَمَلِ ابْنِ آدَمَ لَهُ إِلاَّ الصِّيَامَ هُوَ لِي وَأَنَا أَجْزِي بِهِ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخِلْفَةُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2219": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2219\nIn-book reference  : Book 22, Hadith 130\nEnglish translation  : Vol. 1, Book 22, Hadith 2221",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ عِيسَى، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ عَمْرٍو، عَنْ بُكَيْرٍ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" كُلُّ حَسَنَةٍ يَعْمَلُهَا ابْنُ آدَمَ فَلَهُ عَشْرُ أَمْثَالِهَا إِلاَّ الصِّيَامَ لِي وَأَنَا أَجْزِي بِهِ \" ."
  },
  "2220": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2220\nIn-book reference  : Book 22, Hadith 131\nEnglish translation  : Vol. 3, Book 22, Hadith 2222",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا مَهْدِيُّ بْنُ مَيْمُونٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ، قَالَ أَخْبَرَنِي رَجَاءُ بْنُ حَيْوَةَ، عَنْ أَبِي أُمَامَةَ، قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقُلْتُ مُرْنِي بِأَمْرٍ آخُذُهُ عَنْكَ . قَالَ \" عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لاَ مِثْلَ لَهُ \" ."
  },
  "2221": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2221\nIn-book reference  : Book 22, Hadith 132\nEnglish translation  : Vol. 3, Book 22, Hadith 2223",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي جَرِيرُ بْنُ حَازِمٍ، أَنَّ مُحَمَّدَ بْنَ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ الضَّبِّيَّ، حَدَّثَهُ عَنْ رَجَاءِ بْنِ حَيْوَةَ، قَالَ حَدَّثَنَا أَبُو أُمَامَةَ الْبَاهِلِيُّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِأَمْرٍ يَنْفَعُنِي اللَّهُ بِهِ . قَالَ \" عَلَيْكَ بِالصِّيَامِ فَإِنَّهُ لاَ مِثْلَ لَهُ \" ."
  },
  "2222": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2222\nIn-book reference  : Book 22, Hadith 133\nEnglish translation  : Vol. 3, Book 22, Hadith 2224",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ مُحَمَّدٍ الضَّعِيفُ، - شَيْخٌ صَالِحٌ وَالضَّعِيفُ لَقَبٌ لِكَثْرَةِ عِبَادَتِهِ - قَالَ أَخْبَرَنَا يَعْقُوبُ الْحَضْرَمِيُّ قَالَ حَدَّثَنَا شُعْبَةُ عَنْ مُحَمَّدِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي يَعْقُوبَ عَنْ أَبِي نَصْرٍ عَنْ رَجَاءِ بْنِ حَيْوَةَ عَنْ أَبِي أُمَامَةَ أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَىُّ الْعَمَلِ أَفْضَلُ قَالَ \" عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لاَ عِدْلَ لَهُ \" ."
  },
  "2223": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2223\nIn-book reference  : Book 22, Hadith 134\nEnglish translation  : Vol. 3, Book 22, Hadith 2225",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ مُحَمَّدٍ، - هُوَ ابْنُ السَّكَنِ أَبُو عُبَيْدِ اللَّهِ - قَالَ حَدَّثَنَا يَحْيَى بْنُ كَثِيرٍ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ مُحَمَّدِ بْنِ أَبِي يَعْقُوبَ الضَّبِّيِّ، عَنْ أَبِي نَصْرٍ الْهِلاَلِيِّ، عَنْ رَجَاءِ بْنِ حَيْوَةَ، عَنْ أَبِي أُمَامَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِعَمَلٍ . قَالَ \" عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لاَ عِدْلَ لَهُ \" . قُلْتُ يَا رَسُولَ اللَّهِ مُرْنِي بِعَمَلٍ . قَالَ \" عَلَيْكَ بِالصَّوْمِ فَإِنَّهُ لاَ عِدْلَ لَهُ \" ."
  },
  "2224": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2224\nIn-book reference  : Book 22, Hadith 135\nEnglish translation  : Vol. 3, Book 22, Hadith 2226",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ سَمُرَةَ، قَالَ حَدَّثَنَا الْمُحَارِبِيُّ، عَنْ فِطْرٍ، أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الصَّوْمُ جُنَّةٌ \" ."
  },
  "2225": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2225\nIn-book reference  : Book 22, Hadith 136\nEnglish translation  : Vol. 3, Book 22, Hadith 2227",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سُلَيْمَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، وَالْحَكَمِ، عَنْ مَيْمُونِ بْنِ أَبِي شَبِيبٍ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الصَّوْمُ جُنَّةٌ \" ."
  },
  "2226": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2226\nIn-book reference  : Book 22, Hadith 137\nEnglish translation  : Vol. 3, Book 22, Hadith 2228",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الْحَكَمِ، قَالَ سَمِعْتُ عُرْوَةَ بْنَ النَّزَّالِ، يُحَدِّثُ عَنْ مُعَاذٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الصَّوْمُ جُنَّةٌ \" ."
  },
  "2227": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2227\nIn-book reference  : Book 22, Hadith 138\nEnglish translation  : Vol. 3, Book 22, Hadith 2229",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، عَنْ شُعْبَةَ، قَالَ لِي الْحَكَمُ سَمِعْتُهُ مِنْهُ، مُنْذُ أَرْبَعِينَ سَنَةً ثُمَّ قَالَ الْحَكَمُ وَحَدَّثَنِي بِهِ مَيْمُونُ بْنُ أَبِي شَبِيبٍ عَنْ مُعَاذِ بْنِ جَبَلٍ ."
  },
  "2228": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2228\nIn-book reference  : Book 22, Hadith 139\nEnglish translation  : Vol. 3, Book 22, Hadith 2230",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، عَنْ حَجَّاجٍ، قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي عَطَاءٌ، عَنْ أَبِي صَالِحٍ الزَّيَّاتِ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الصِّيَامُ جُنَّةٌ \" ."
  },
  "2229": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2229\nIn-book reference  : Book 22, Hadith 140\nEnglish translation  : Vol. 3, Book 22, Hadith 2231",
    "url": "https://sunnah.com/nasai/22",
    "text": "وَأَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، أَنْبَأَنَا سُوَيْدٌ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ جُرَيْجٍ، قِرَاءَةً عَنْ عَطَاءٍ، قَالَ أَنْبَأَنَا عَطَاءٌ الزَّيَّاتُ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" الصِّيَامُ جُنَّةٌ \" ."
  },
  "2230": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2230\nIn-book reference  : Book 22, Hadith 141\nEnglish translation  : Vol. 3, Book 22, Hadith 2232",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، أَنَّ مُطَرِّفًا، - رَجُلٌ مِنْ بَنِي عَامِرِ بْنِ صَعْصَعَةَ - حَدَّثَهُ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ دَعَا لَهُ بِلَبَنٍ لِيَسْقِيَهُ فَقَالَ مُطَرِّفٌ إِنِّي صَائِمٌ فَقَالَ عُثْمَانُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الصِّيَامُ جُنَّةٌ كَجُنَّةِ أَحَدِكُمْ مِنَ الْقِتَالِ \" ."
  },
  "2231": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2231\nIn-book reference  : Book 22, Hadith 142\nEnglish translation  : Vol. 3, Book 22, Hadith 2233",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ، قَالَ حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، عَنِ ابْنِ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ مُطَرِّفٍ، قَالَ دَخَلْتُ عَلَى عُثْمَانَ بْنِ أَبِي الْعَاصِ فَدَعَا بِلَبَنٍ فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الصَّوْمُ جُنَّةٌ مِنَ النَّارِ كَجُنَّةِ أَحَدِكُمْ مِنَ الْقِتَالِ \" ."
  },
  "2232": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2232\nIn-book reference  : Book 22, Hadith 143\nEnglish translation  : Vol. 3, Book 22, Hadith 2234",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو مُصْعَبٍ، عَنِ الْمُغِيرَةِ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، قَالَ دَخَلَ مُطَرِّفٌ عَلَى عُثْمَانَ نَحْوَهُ مُرْسَلٌ ."
  },
  "2233": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2233\nIn-book reference  : Book 22, Hadith 144\nEnglish translation  : Vol. 3, Book 22, Hadith 2235",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، قَالَ حَدَّثَنَا وَاصِلٌ، عَنْ بَشَّارِ بْنِ أَبِي سَيْفٍ، عَنِ الْوَلِيدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عِيَاضِ بْنِ غُطَيْفٍ، قَالَ أَبُو عُبَيْدَةَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الصَّوْمُ جُنَّةٌ مَا لَمْ يَخْرِقْهَا \" ."
  },
  "2234": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2234\nIn-book reference  : Book 22, Hadith 145\nEnglish translation  : Vol. 3, Book 22, Hadith 2236",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَزِيدَ الآدَمِيُّ، قَالَ حَدَّثَنَا مَعْنٌ، عَنْ خَارِجَةَ بْنِ سُلَيْمَانَ، عَنْ يَزِيدَ بْنِ رُومَانَ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" الصِّيَامُ جُنَّةٌ مِنَ النَّارِ فَمَنْ أَصْبَحَ صَائِمًا فَلاَ يَجْهَلْ يَوْمَئِذٍ وَإِنِ امْرُؤٌ جَهِلَ عَلَيْهِ فَلاَ يَشْتِمْهُ وَلاَ يَسُبَّهُ وَلْيَقُلْ إِنِّي صَائِمٌ وَالَّذِي نَفْسُ مُحَمَّدٍ بِيَدِهِ لَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ \" ."
  },
  "2235": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2235\nIn-book reference  : Book 22, Hadith 146\nEnglish translation  : Vol. 3, Book 22, Hadith 2237",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ مِسْعَرٍ، عَنِ الْوَلِيدِ بْنِ أَبِي مَالِكٍ، قَالَ حَدَّثَنَا أَصْحَابُنَا، عَنْ أَبِي عُبَيْدَةَ، قَالَ الصِّيَامُ جُنَّةٌ مَا لَمْ يَخْرِقْهَا ."
  },
  "2236": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2236\nIn-book reference  : Book 22, Hadith 147\nEnglish translation  : Vol. 3, Book 22, Hadith 2238",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لِلصَّائِمِينَ بَابٌ فِي الْجَنَّةِ يُقَالُ لَهُ الرَّيَّانُ لاَ يَدْخُلُ فِيهِ أَحَدٌ غَيْرُهُمْ فَإِذَا دَخَلَ آخِرُهُمْ أُغْلِقَ مَنْ دَخَلَ فِيهِ شَرِبَ وَمَنْ شَرِبَ لَمْ يَظْمَأْ أَبَدًا \" ."
  },
  "2237": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2237\nIn-book reference  : Book 22, Hadith 148\nEnglish translation  : Vol. 3, Book 22, Hadith 2239",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا يَعْقُوبُ، عَنْ أَبِي حَازِمٍ، قَالَ حَدَّثَنِي سَهْلٌ، أَنَّ فِي الْجَنَّةِ، بَابًا يُقَالُ لَهُ الرَّيَّانُ يُقَالُ يَوْمَ الْقِيَامَةِ أَيْنَ الصَّائِمُونَ هَلْ لَكُمْ إِلَى الرَّيَّانِ مَنْ دَخَلَهُ لَمْ يَظْمَأْ أَبَدًا فَإِذَا دَخَلُوا أُغْلِقَ عَلَيْهِمْ فَلَمْ يَدْخُلْ فِيهِ أَحَدٌ غَيْرُهُمْ ."
  },
  "2238": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2238\nIn-book reference  : Book 22, Hadith 149\nEnglish translation  : Vol. 3, Book 22, Hadith 2240",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، وَالْحَارِثُ بْنُ مِسْكِينٍ، قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، وَيُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ أَنْفَقَ زَوْجَيْنِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ نُودِيَ فِي الْجَنَّةِ يَا عَبْدَ اللَّهِ هَذَا خَيْرٌ فَمَنْ كَانَ مِنْ أَهْلِ الصَّلاَةِ يُدْعَى مِنْ بَابِ الصَّلاَةِ وَمَنْ كَانَ مِنْ أَهْلِ الْجِهَادِ يُدْعَى مِنْ بَابِ الْجِهَادِ وَمَنْ كَانَ مِنْ أَهْلِ الصَّدَقَةِ يُدْعَى مِنْ بَابِ الصَّدَقَةِ وَمَنْ كَانَ مِنْ أَهْلِ الصِّيَامِ دُعِيَ مِنْ بَابِ الرَّيَّانِ \" . قَالَ أَبُو بَكْرٍ الصِّدِّيقُ يَا رَسُولَ اللَّهِ مَا عَلَى أَحَدٍ يُدْعَى مِنْ تِلْكَ الأَبْوَابِ مِنْ ضَرُورَةٍ فَهَلْ يُدْعَى أَحَدٌ مِنْ تِلْكَ الأَبْوَابِ كُلِّهَا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" نَعَمْ وَأَرْجُو أَنْ تَكُونَ مِنْهُمْ \" ."
  },
  "2239": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2239\nIn-book reference  : Book 22, Hadith 150\nEnglish translation  : Vol. 3, Book 22, Hadith 2241",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو أَحْمَدَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ بْنِ عُمَيْرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم وَنَحْنُ شَبَابٌ لاَ نَقْدِرُ عَلَى شَىْءٍ قَالَ \" يَا مَعْشَرَ الشَّبَابِ عَلَيْكُمْ بِالْبَاءَةِ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ \" ."
  },
  "2240": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2240\nIn-book reference  : Book 22, Hadith 151\nEnglish translation  : Vol. 3, Book 22, Hadith 2242",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا بِشْرُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، عَنْ سُلَيْمَانَ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، أَنَّ ابْنَ مَسْعُودٍ، لَقِيَ عُثْمَانَ بِعَرَفَاتٍ فَخَلاَ بِهِ فَحَدَّثَهُ وَأَنَّ، عُثْمَانَ قَالَ لاِبْنِ مَسْعُودٍ هَلْ لَكَ فِي فَتَاةٍ أُزَوِّجُكَهَا فَدَعَا عَبْدُ اللَّهِ عَلْقَمَةَ فَحَدَّثَهُ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لَمْ يَسْتَطِعْ فَلْيَصُمْ فَإِنَّ الصَّوْمَ لَهُ وِجَاءٌ \" ."
  },
  "2241": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2241\nIn-book reference  : Book 22, Hadith 152\nEnglish translation  : Vol. 3, Book 22, Hadith 2243",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا هَارُونُ بْنُ إِسْحَاقَ، قَالَ حَدَّثَنَا الْمُحَارِبِيُّ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، وَالأَسْوَدِ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ وَمَنْ لَمْ يَجِدْ فَعَلَيْهِ بِالصَّوْمِ فَإِنَّهُ لَهُ وِجَاءٌ \" ."
  },
  "2242": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2242\nIn-book reference  : Book 22, Hadith 153\nEnglish translation  : Vol. 3, Book 22, Hadith 2244",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هِلاَلُ بْنُ الْعَلاَءِ بْنِ هِلاَلٍ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا عَلِيُّ بْنُ هَاشِمٍ، عَنِ الأَعْمَشِ، عَنْ عُمَارَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، قَالَ دَخَلْنَا عَلَى عَبْدِ اللَّهِ وَمَعَنَا عَلْقَمَةُ وَالأَسْوَدُ وَجَمَاعَةٌ فَحَدَّثَنَا بِحَدِيثٍ مَا رَأَيْتُهُ حَدَّثَ بِهِ الْقَوْمَ إِلاَّ مِنْ أَجْلِي لأَنِّي كُنْتُ أَحْدَثَهُمْ سِنًّا قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا مَعْشَرَ الشَّبَابِ مَنِ اسْتَطَاعَ مِنْكُمُ الْبَاءَةَ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ \" . قَالَ عَلِيٌّ وَسُئِلَ الأَعْمَشُ عَنْ حَدِيثِ إِبْرَاهِيمَ فَقَالَ عَنْ إِبْرَاهِيمَ عَنْ عَلْقَمَةَ عَنْ عَبْدِ اللَّهِ مِثْلَهُ قَالَ نَعَمْ ."
  },
  "2243": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2243\nIn-book reference  : Book 22, Hadith 154\nEnglish translation  : Vol. 3, Book 22, Hadith 2245",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ زُرَارَةَ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا يُونُسُ، عَنْ أَبِي مَعْشَرٍ، عَنْ إِبْرَاهِيمَ، عَنْ عَلْقَمَةَ، قَالَ كُنْتُ مَعَ ابْنِ مَسْعُودٍ وَهُوَ عِنْدَ عُثْمَانَ فَقَالَ عُثْمَانُ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى فِتْيَةٍ فَقَالَ \" مَنْ كَانَ مِنْكُمْ ذَا طَوْلٍ فَلْيَتَزَوَّجْ فَإِنَّهُ أَغَضُّ لِلْبَصَرِ وَأَحْصَنُ لِلْفَرْجِ وَمَنْ لاَ فَالصَّوْمُ لَهُ وِجَاءٌ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ أَبُو مَعْشَرٍ هَذَا اسْمُهُ زِيَادُ بْنُ كُلَيْبٍ وَهُوَ ثِقَةٌ وَهُوَ صَاحِبُ إِبْرَاهِيمَ رَوَى عَنْهُ مَنْصُورٌ وَمُغِيرَةُ وَشُعْبَةُ وَأَبُو مَعْشَرٍ الْمَدَنِيُّ اسْمُهُ نَجِيحٌ وَهُوَ ضَعِيفٌ وَمَعَ ضَعْفِهِ أَيْضًا كَانَ قَدِ اخْتَلَطَ عِنْدَهُ أَحَادِيثُ مَنَاكِيرُ مِنْهَا مُحَمَّدُ بْنُ عَمْرٍو عَنْ أَبِي سَلَمَةَ عَنْ أَبِي هُرَيْرَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَا بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ قِبْلَةٌ \" . وَمِنْهَا هِشَامُ بْنُ عُرْوَةَ عَنْ أَبِيهِ عَنْ عَائِشَةَ عَنِ النَّبِيِّ صلى الله عليه وسلم \" لاَ تَقْطَعُوا اللَّحْمَ بِالسِّكِّينِ وَلَكِنِ انْهَسُوا نَهْسًا \" ."
  },
  "2244": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2244\nIn-book reference  : Book 22, Hadith 155\nEnglish translation  : Vol. 3, Book 22, Hadith 2246",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، قَالَ أَخْبَرَنِي أَنَسٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ زَحْزَحَ اللَّهُ وَجْهَهُ عَنِ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2245": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2245\nIn-book reference  : Book 22, Hadith 156\nEnglish translation  : Vol. 3, Book 22, Hadith 2247",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا دَاوُدُ بْنُ سُلَيْمَانَ بْنِ حَفْصٍ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ الضَّرِيرُ، عَنْ سُهَيْلٍ، عَنِ الْمَقْبُرِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بَيْنَهُ وَبَيْنَ النَّارِ بِذَلِكَ الْيَوْمِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2246": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2246\nIn-book reference  : Book 22, Hadith 157\nEnglish translation  : Vol. 3, Book 22, Hadith 2248",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ أَخْبَرَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ عَزَّ وَجَلَّ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2247": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2247\nIn-book reference  : Book 22, Hadith 158\nEnglish translation  : Vol. 3, Book 22, Hadith 2249",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ سُهَيْلٍ، عَنْ صَفْوَانَ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَ اللَّهُ وَجْهَهُ مِنْ جَهَنَّمَ سَبْعِينَ عَامًا \" ."
  },
  "2248": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2248\nIn-book reference  : Book 22, Hadith 159\nEnglish translation  : Vol. 3, Book 22, Hadith 2250",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ سُهَيْلٍ، عَنِ ابْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَا مِنْ عَبْدٍ يَصُومُ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ إِلاَّ بَعَّدَ اللَّهُ عَزَّ وَجَلَّ بِذَلِكَ الْيَوْمِ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2249": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2249\nIn-book reference  : Book 22, Hadith 160\nEnglish translation  : Vol. 3, Book 22, Hadith 2251",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْحَسَنُ بْنُ قَزَعَةَ، عَنْ حُمَيْدِ بْنِ الأَسْوَدِ، قَالَ حَدَّثَنَا سُهَيْلٌ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَهُ اللَّهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2250": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2250\nIn-book reference  : Book 22, Hadith 161\nEnglish translation  : Vol. 3, Book 22, Hadith 2252",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُؤَمَّلُ بْنُ إِهَابٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَنْبَأَنَا ابْنُ جُرَيْجٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ سَعِيدٍ، وَسُهَيْلُ بْنُ أَبِي صَالِحٍ، سَمِعَا النُّعْمَانَ بْنَ أَبِي عَيَّاشٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ تَبَارَكَ وَتَعَالَى بَاعَدَ اللَّهُ وَجْهَهُ عَنِ النَّارِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2251": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2251\nIn-book reference  : Book 22, Hadith 162\nEnglish translation  : Vol. 3, Book 22, Hadith 2253",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ، - نَيْسَابُورِيٌّ - قَالَ حَدَّثَنَا يَزِيدُ الْعَدَنِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَصُومُ عَبْدٌ يَوْمًا فِي سَبِيلِ اللَّهِ إِلاَّ بَاعَدَ اللَّهُ تَعَالَى بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2252": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2252\nIn-book reference  : Book 22, Hadith 163\nEnglish translation  : Vol. 3, Book 22, Hadith 2254",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا قَاسِمٌ، عَنْ سُفْيَانَ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ حَرَّ جَهَنَّمَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2253": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2253\nIn-book reference  : Book 22, Hadith 164\nEnglish translation  : Vol. 3, Book 22, Hadith 2255",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ مُحَمَّدِ بْنِ حَنْبَلٍ، قَالَ قَرَأْتُ عَلَى أَبِي حَدَّثَكُمُ ابْنُ نُمَيْرٍ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ سُمَىٍّ، عَنِ النُّعْمَانِ بْنِ أَبِي عَيَّاشٍ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ بَاعَدَ اللَّهُ بِذَلِكَ الْيَوْمِ النَّارَ عَنْ وَجْهِهِ سَبْعِينَ خَرِيفًا \" ."
  },
  "2254": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2254\nIn-book reference  : Book 22, Hadith 165\nEnglish translation  : Vol. 3, Book 22, Hadith 2256",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ الْحَارِثِ، عَنِ الْقَاسِمِ أَبِي عَبْدِ الرَّحْمَنِ، أَنَّهُ حَدَّثَهُ عَنْ عُقْبَةَ بْنِ عَامِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ يَوْمًا فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ بَاعَدَ اللَّهُ مِنْهُ جَهَنَّمَ مَسِيرَةَ مِائَةِ عَامٍ \" ."
  },
  "2255": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2255\nIn-book reference  : Book 22, Hadith 166\nEnglish translation  : Vol. 3, Book 22, Hadith 2257",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ صَفْوَانَ بْنِ عَبْدِ اللَّهِ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ كَعْبِ بْنِ عَاصِمٍ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \" ."
  },
  "2256": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2256\nIn-book reference  : Book 22, Hadith 167\nEnglish translation  : Vol. 3, Book 22, Hadith 2258",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ وَالصَّوَابُ الَّذِي قَبْلَهُ لاَ نَعْلَمُ أَحَدًا تَابَعَ ابْنَ كَثِيرٍ عَلَيْهِ ."
  },
  "2257": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2257\nIn-book reference  : Book 22, Hadith 168\nEnglish translation  : Vol. 3, Book 22, Hadith 2259",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا بَكْرٌ، عَنْ عُمَارَةَ بْنِ غَزِيَّةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى نَاسًا مُجْتَمِعِينَ عَلَى رَجُلٍ فَسَأَلَ فَقَالُوا رَجُلٌ أَجْهَدَهُ الصَّوْمُ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \" ."
  },
  "2258": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2258\nIn-book reference  : Book 22, Hadith 169\nEnglish translation  : Vol. 3, Book 22, Hadith 2260",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ أَخْبَرَنِي جَابِرُ بْنُ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم مَرَّ بِرَجُلٍ فِي ظِلِّ شَجَرَةٍ يُرَشُّ عَلَيْهِ الْمَاءُ قَالَ \" مَا بَالُ صَاحِبِكُمْ هَذَا \" . قَالُوا يَا رَسُولَ اللَّهِ صَائِمٌ . قَالَ \" إِنَّهُ لَيْسَ مِنَ الْبِرِّ أَنْ تَصُومُوا فِي السَّفَرِ وَعَلَيْكُمْ بِرُخْصَةِ اللَّهِ الَّتِي رَخَّصَ لَكُمْ فَاقْبَلُوهَا \" ."
  },
  "2259": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2259\nIn-book reference  : Book 22, Hadith 170\nEnglish translation  : Vol. 3, Book 22, Hadith 2261",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا الْفِرْيَابِيُّ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنِي مَنْ، سَمِعَ جَابِرًا، نَحْوَهُ ."
  },
  "2260": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2260\nIn-book reference  : Book 22, Hadith 171\nEnglish translation  : Vol. 3, Book 22, Hadith 2262",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ ثَوْبَانَ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، رضى الله عنهما عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ عَلَيْكُمْ بِرُخْصَةِ اللَّهِ عَزَّ وَجَلَّ فَاقْبَلُوهَا \" ."
  },
  "2261": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2261\nIn-book reference  : Book 22, Hadith 172\nEnglish translation  : Vol. 3, Book 22, Hadith 2263",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عُثْمَانَ بْنِ عُمَرَ، قَالَ أَنْبَأَنَا عَلِيُّ بْنُ الْمُبَارَكِ، عَنْ يَحْيَى، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ رَجُلٍ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \" ."
  },
  "2262": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2262\nIn-book reference  : Book 22, Hadith 173\nEnglish translation  : Vol. 3, Book 22, Hadith 2264",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَخَالِدُ بْنُ الْحَارِثِ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَسَنٍ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم رَأَى رَجُلاً قَدْ ظُلِّلَ عَلَيْهِ فِي السَّفَرِ فَقَالَ \" لَيْسَ مِنَ الْبِرِّ الصِّيَامُ فِي السَّفَرِ \" ."
  },
  "2263": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2263\nIn-book reference  : Book 22, Hadith 174\nEnglish translation  : Vol. 3, Book 22, Hadith 2265",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ شُعَيْبٍ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنِ ابْنِ الْهَادِ، عَنْ جَعْفَرِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنْ جَابِرٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى مَكَّةَ عَامَ الْفَتْحِ فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ كُرَاعَ الْغَمِيمِ فَصَامَ النَّاسُ فَبَلَغَهُ أَنَّ النَّاسَ قَدْ شَقَّ عَلَيْهِمُ الصِّيَامُ فَدَعَا بِقَدَحٍ مِنَ الْمَاءِ بَعْدَ الْعَصْرِ فَشَرِبَ وَالنَّاسُ يَنْظُرُونَ فَأَفْطَرَ بَعْضُ النَّاسِ وَصَامَ بَعْضٌ فَبَلَغَهُ أَنَّ نَاسًا صَامُوا فَقَالَ \" أُولَئِكَ الْعُصَاةُ \" ."
  },
  "2264": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2264\nIn-book reference  : Book 22, Hadith 175\nEnglish translation  : Vol. 3, Book 22, Hadith 2266",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا هَارُونُ بْنُ عَبْدِ اللَّهِ، وَعَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالاَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ سُفْيَانَ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِطَعَامٍ بِمَرِّ الظَّهْرَانِ فَقَالَ لأَبِي بَكْرٍ وَعُمَرَ \" أَدْنِيَا فَكُلاَ \" . فَقَالاَ إِنَّا صَائِمَانِ . فَقَالَ \" ارْحَلُوا لِصَاحِبَيْكُمُ اعْمَلُوا لِصَاحِبَيْكُمْ \" ."
  },
  "2265": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2265\nIn-book reference  : Book 22, Hadith 176\nEnglish translation  : Vol. 3, Book 22, Hadith 2267",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عِمْرَانُ بْنُ يَزِيدَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ شُعَيْبٍ، قَالَ أَخْبَرَنِي الأَوْزَاعِيُّ، عَنْ يَحْيَى، أَنَّهُ حَدَّثَهُ عَنْ أَبِي سَلَمَةَ، قَالَ بَيْنَمَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَغَدَّى بِمَرِّ الظَّهْرَانِ وَمَعَهُ أَبُو بَكْرٍ وَعُمَرُ فَقَالَ \" الْغَدَاءَ \" . مُرْسَلٌ ."
  },
  "2266": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2266\nIn-book reference  : Book 22, Hadith 177\nEnglish translation  : Vol. 3, Book 22, Hadith 2268",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ حَدَّثَنَا عَلِيٌّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ وَعُمَرَ كَانُوا بِمَرِّ الظَّهْرَانِ مُرْسَلٌ ."
  },
  "2267": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2267\nIn-book reference  : Book 22, Hadith 178\nEnglish translation  : Vol. 3, Book 22, Hadith 2269",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَبْدَةُ بْنُ عَبْدِ الرَّحِيمِ، عَنْ مُحَمَّدِ بْنِ شُعَيْبٍ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي سَلَمَةَ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ أُمَيَّةَ الضَّمْرِيُّ، قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ فَقَالَ \" انْتَظِرِ الْغَدَاءَ يَا أَبَا أُمَيَّةَ \" . فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ \" تَعَالَ ادْنُ مِنِّي حَتَّى أُخْبِرَكَ عَنِ الْمُسَافِرِ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2268": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2268\nIn-book reference  : Book 22, Hadith 179\nEnglish translation  : Vol. 3, Book 22, Hadith 2270",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَبِي كَثِيرٍ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، قَالَ حَدَّثَنِي جَعْفَرُ بْنُ عَمْرِو بْنِ أُمَيَّةَ الضَّمْرِيُّ، عَنْ أَبِيهِ، قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَلاَ تَنْتَظِرُ الْغَدَاءَ يَا أَبَا أُمَيَّةَ \" . قُلْتُ إِنِّي صَائِمٌ . فَقَالَ \" تَعَالَ أُخْبِرْكَ عَنِ الْمُسَافِرِ إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2269": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2269\nIn-book reference  : Book 22, Hadith 180\nEnglish translation  : Vol. 3, Book 22, Hadith 2271",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، قَالَ أَنْبَأَنَا أَبُو الْمُغِيرَةِ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمُهَاجِرِ، عَنْ أَبِي أُمَيَّةَ الضَّمْرِيِّ، قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ فَسَلَّمْتُ عَلَيْهِ فَلَمَّا ذَهَبْتُ لأَخْرُجَ قَالَ \" انْتَظِرِ الْغَدَاءَ يَا أَبَا أُمَيَّةَ \" . قُلْتُ إِنِّي صَائِمٌ يَا نَبِيَّ اللَّهِ . قَالَ \" تَعَالَ أُخْبِرْكَ عَنِ الْمُسَافِرِ إِنَّ اللَّهَ تَعَالَى وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2270": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2270\nIn-book reference  : Book 22, Hadith 181\nEnglish translation  : Vol. 3, Book 22, Hadith 2272",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُوسَى بْنُ مَرْوَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ حَرْبٍ، عَنِ الأَوْزَاعِيِّ، قَالَ أَخْبَرَنِي يَحْيَى، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، قَالَ حَدَّثَنِي أَبُو الْمُهَاجِرِ، قَالَ حَدَّثَنِي أَبُو أُمَيَّةَ يَعْنِي الضَّمْرِيَّ، أَنَّهُ قَدِمَ عَلَى النَّبِيِّ صلى الله عليه وسلم فَذَكَرَ نَحْوَهُ ."
  },
  "2271": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2271\nIn-book reference  : Book 22, Hadith 182\nEnglish translation  : Vol. 3, Book 22, Hadith 2273",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي شُعَيْبُ بْنُ شُعَيْبِ بْنِ إِسْحَاقَ، قَالَ حَدَّثَنَا عَبْدُ الْوَهَّابِ، قَالَ حَدَّثَنَا شُعَيْبٌ، قَالَ حَدَّثَنِي الأَوْزَاعِيُّ، قَالَ حَدَّثَنِي يَحْيَى، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ الْجَرْمِيُّ، أَنَّ أَبَا أُمَيَّةَ الضَّمْرِيَّ، حَدَّثَهُمْ أَنَّهُ، قَدِمَ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ فَقَالَ \" انْتَظِرِ الْغَدَاءَ يَا أَبَا أُمَيَّةَ \" . قُلْتُ إِنِّي صَائِمٌ . قَالَ \" ادْنُ أُخْبِرْكَ عَنِ الْمُسَافِرِ إِنَّ اللَّهَ وَضَعَ عَنْهُ الصِّيَامَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2272": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2272\nIn-book reference  : Book 22, Hadith 183\nEnglish translation  : Vol. 3, Book 22, Hadith 2274",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدِ اللَّهِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ الْحَرَّانِيُّ، قَالَ حَدَّثَنَا عُثْمَانُ، قَالَ حَدَّثَنَا مُعَاوِيَةُ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي قِلاَبَةَ، أَنَّ أَبَا أُمَيَّةَ الضَّمْرِيَّ، أَخْبَرَهُ أَنَّهُ، أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم مِنْ سَفَرٍ وَهُوَ صَائِمٌ فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَلاَ تَنْتَظِرِ الْغَدَاءَ \" . قَالَ إِنِّي صَائِمٌ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَعَالَ أُخْبِرْكَ عَنِ الصِّيَامِ إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنِ الْمُسَافِرِ الصِّيَامَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2273": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2273\nIn-book reference  : Book 22, Hadith 184\nEnglish translation  : Vol. 3, Book 22, Hadith 2275",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا عُثْمَانُ بْنُ عُمَرَ، قَالَ أَنْبَأَنَا عَلِيٌّ، عَنْ يَحْيَى، عَنْ أَبِي قِلاَبَةَ، عَنْ رَجُلٍ، أَنَّ أَبَا أُمَيَّةَ، أَخْبَرَهُ أَنَّهُ، أَتَى النَّبِيَّ صلى الله عليه وسلم مِنْ سَفَرٍ نَحْوَهُ ."
  },
  "2274": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2274\nIn-book reference  : Book 22, Hadith 185\nEnglish translation  : Vol. 3, Book 22, Hadith 2276",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُمَرُ بْنُ مُحَمَّدِ بْنِ الْحَسَنِ بْنِ التَّلِّ، قَالَ حَدَّثَنَا أَبِي قَالَ، حَدَّثَنَا سُفْيَانُ الثَّوْرِيُّ، عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّ اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ نِصْفَ الصَّلاَةِ وَالصَّوْمَ وَعَنِ الْحُبْلَى وَالْمُرْضِعِ \" ."
  },
  "2275": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2275\nIn-book reference  : Book 22, Hadith 186\nEnglish translation  : Vol. 3, Book 22, Hadith 2277",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ حَدَّثَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنِ ابْنِ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ شَيْخٍ، مِنْ قُشَيْرٍ عَنْ عَمِّهِ، حَدَّثَنَا ثُمَّ، أَلْفَيْنَاهُ فِي إِبِلٍ لَهُ فَقَالَ لَهُ أَبُو قِلاَبَةَ حَدِّثْهُ فَقَالَ الشَّيْخُ حَدَّثَنِي عَمِّي أَنَّهُ ذَهَبَ فِي إِبِلٍ لَهُ فَانْتَهَى إِلَى النَّبِيِّ صلى الله عليه وسلم وَهُوَ يَأْكُلُ أَوْ قَالَ يَطْعَمُ فَقَالَ \" ادْنُ فَكُلْ أَوْ قَالَ \" ادْنُ فَاطْعَمْ \" . فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ \" إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ عَنِ الْمُسَافِرِ شَطْرَ الصَّلاَةِ وَالصِّيَامَ وَعَنِ الْحَامِلِ وَالْمُرْضِعِ \" ."
  },
  "2276": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2276\nIn-book reference  : Book 22, Hadith 187\nEnglish translation  : Vol. 3, Book 22, Hadith 2278",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا سُرَيْجٌ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ ابْنُ عُلَيَّةَ، عَنْ أَيُّوبَ، قَالَ حَدَّثَنِي أَبُو قِلاَبَةَ، هَذَا الْحَدِيثَ ثُمَّ قَالَ هَلْ لَكَ فِي صَاحِبِ الْحَدِيثِ فَدَلَّنِي عَلَيْهِ فَلَقِيتُهُ فَقَالَ حَدَّثَنِي قَرِيبٌ لِي يُقَالُ لَهُ أَنَسُ بْنُ مَالِكٍ قَالَ أَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي إِبِلٍ كَانَتْ لِي أُخِذَتْ فَوَافَقْتُهُ وَهُوَ يَأْكُلُ فَدَعَانِي إِلَى طَعَامِهِ فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ \" ادْنُ أُخْبِرْكَ عَنْ ذَلِكَ إِنَّ اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلاَةِ \" ."
  },
  "2277": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2277\nIn-book reference  : Book 22, Hadith 188\nEnglish translation  : Vol. 3, Book 22, Hadith 2279",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي قِلاَبَةَ، عَنْ رَجُلٍ، قَالَ أَتَيْتُ النَّبِيَّ صلى الله عليه وسلم لِحَاجَةٍ فَإِذَا هُوَ يَتَغَدَّى قَالَ \" هَلُمَّ إِلَى الْغَدَاءِ \" . فَقُلْتُ إِنِّي صَائِمٌ . قَالَ \" هَلُمَّ أُخْبِرْكَ عَنِ الصَّوْمِ إِنَّ اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ نِصْفَ الصَّلاَةِ وَالصَّوْمَ وَرَخَّصَ لِلْحُبْلَى وَالْمُرْضِعِ \" ."
  },
  "2278": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2278\nIn-book reference  : Book 22, Hadith 189\nEnglish translation  : Vol. 3, Book 22, Hadith 2280",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ أَبِي الْعَلاَءِ بْنِ الشِّخِّيرِ، عَنْ رَجُلٍ، نَحْوَهُ ."
  },
  "2279": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2279\nIn-book reference  : Book 22, Hadith 190\nEnglish translation  : Vol. 3, Book 22, Hadith 2281",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ هَانِئِ بْنِ الشِّخِّيرِ، عَنْ رَجُلٍ، مِنْ بَلْحَرِيشٍ عَنْ أَبِيهِ، قَالَ كُنْتُ مُسَافِرًا فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَأَنَا صَائِمٌ وَهُوَ يَأْكُلُ قَالَ \" هَلُمَّ \" . قُلْتُ إِنِّي صَائِمٌ . قَالَ \" تَعَالَ أَلَمْ تَعْلَمْ مَا وَضَعَ اللَّهُ عَنِ الْمُسَافِرِ \" . قُلْتُ وَمَا وَضَعَ عَنِ الْمُسَافِرِ قَالَ \" الصَّوْمَ وَنِصْفَ الصَّلاَةِ \" ."
  },
  "2280": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2280\nIn-book reference  : Book 22, Hadith 191\nEnglish translation  : Vol. 3, Book 22, Hadith 2282",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ هَانِئِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ رَجُلٍ، مِنْ بَلْحَرِيشٍ عَنْ أَبِيهِ، قَالَ كُنَّا نُسَافِرُ مَا شَاءَ اللَّهُ فَأَتَيْنَا رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ يَطْعَمُ فَقَالَ \" هَلُمَّ فَاطْعَمْ \" . فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أُحَدِّثُكُمْ عَنِ الصِّيَامِ إِنَّ اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلاَةِ \" ."
  },
  "2281": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2281\nIn-book reference  : Book 22, Hadith 192\nEnglish translation  : Vol. 3, Book 22, Hadith 2283",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ عَبْدِ الْكَرِيمِ، قَالَ حَدَّثَنَا سَهْلُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ هَانِئِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَبِيهِ، قَالَ كُنْتُ مُسَافِرًا فَأَتَيْتُ النَّبِيَّ صلى الله عليه وسلم وَهُوَ يَأْكُلُ وَأَنَا صَائِمٌ فَقَالَ \" هَلُمَّ \" . قُلْتُ إِنِّي صَائِمٌ . قَالَ \" أَتَدْرِي مَا وَضَعَ اللَّهُ عَنِ الْمُسَافِرِ \" . قُلْتُ وَمَا وَضَعَ اللَّهُ عَنِ الْمُسَافِرِ قَالَ \" الصَّوْمَ وَشَطْرَ الصَّلاَةِ \" ."
  },
  "2282": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2282\nIn-book reference  : Book 22, Hadith 193\nEnglish translation  : Vol. 3, Book 22, Hadith 2284",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ أَنْبَأَنَا إِسْرَائِيلُ، عَنْ مُوسَى، - هُوَ ابْنُ أَبِي عَائِشَةَ - عَنْ غَيْلاَنَ، قَالَ خَرَجْتُ مَعَ أَبِي قِلاَبَةَ فِي سَفَرٍ فَقَرَّبَ طَعَامًا فَقُلْتُ إِنِّي صَائِمٌ . فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم خَرَجَ فِي سَفَرٍ فَقَرَّبَ طَعَامًا فَقَالَ لِرَجُلٍ \" ادْنُ فَاطْعَمْ \" . قَالَ إِنِّي صَائِمٌ . قَالَ \" إِنَّ اللَّهَ وَضَعَ عَنِ الْمُسَافِرِ نِصْفَ الصَّلاَةِ وَالصِّيَامَ فِي السَّفَرِ \" . فَادْنُ فَاطْعَمْ فَدَنَوْتُ فَطَعِمْتُ ."
  },
  "2283": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2283\nIn-book reference  : Book 22, Hadith 194\nEnglish translation  : Vol. 3, Book 22, Hadith 2285",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، عَنْ مُوَرِّقٍ الْعِجْلِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ فَنَزَلْنَا فِي يَوْمٍ حَارٍّ وَاتَّخَذْنَا ظِلاَلاً فَسَقَطَ الصُّوَّامُ وَقَامَ الْمُفْطِرُونَ فَسَقَوُا الرِّكَابَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ذَهَبَ الْمُفْطِرُونَ الْيَوْمَ بِالأَجْرِ \" ."
  },
  "2284": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2284\nIn-book reference  : Book 22, Hadith 195\nEnglish translation  : Vol. 3, Book 22, Hadith 2286",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ أَبَانَ الْبَلْخِيُّ، قَالَ حَدَّثَنَا مَعْنٌ، عَنِ ابْنِ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ يُقَالُ الصِّيَامُ فِي السَّفَرِ كَالإِفْطَارِ فِي الْحَضَرِ ."
  },
  "2285": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2285\nIn-book reference  : Book 22, Hadith 196\nEnglish translation  : Vol. 3, Book 22, Hadith 2287",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ الْخَيَّاطِ، وَأَبُو عَامِرٍ قَالاَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ الصَّائِمُ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ ."
  },
  "2286": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2286\nIn-book reference  : Book 22, Hadith 197\nEnglish translation  : Vol. 3, Book 22, Hadith 2288",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مُحَمَّدُ بْنُ يَحْيَى بْنِ أَيُّوبَ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ أَبِيهِ، قَالَ الصَّائِمُ فِي السَّفَرِ كَالْمُفْطِرِ فِي الْحَضَرِ ."
  },
  "2287": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2287\nIn-book reference  : Book 22, Hadith 198\nEnglish translation  : Vol. 3, Book 22, Hadith 2289",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا سُوَيْدٌ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ صلى الله عليه وسلم خَرَجَ فِي رَمَضَانَ فَصَامَ حَتَّى أَتَى قُدَيْدًا ثُمَّ أُتِيَ بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَ وَأَفْطَرَ هُوَ وَأَصْحَابُهُ ."
  },
  "2288": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2288\nIn-book reference  : Book 22, Hadith 199\nEnglish translation  : Vol. 3, Book 22, Hadith 2290",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا، قَالَ حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا عَبْثَرٌ، عَنِ الْعَلاَءِ بْنِ الْمُسَيَّبِ، عَنِ الْحَكَمِ بْنِ عُتَيْبَةَ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنَ الْمَدِينَةِ حَتَّى أَتَى قُدَيْدًا ثُمَّ أَفْطَرَ حَتَّى أَتَى مَكَّةَ ."
  },
  "2289": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2289\nIn-book reference  : Book 22, Hadith 200\nEnglish translation  : Vol. 3, Book 22, Hadith 2291",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ أَنْبَأَنَا الْحَسَنُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنِ الْحَكَمِ، عَنْ مِقْسَمٍ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَامَ فِي السَّفَرِ حَتَّى أَتَى قُدَيْدًا ثُمَّ دَعَا بِقَدَحٍ مِنْ لَبَنٍ فَشَرِبَ فَأَفْطَرَ هُوَ وَأَصْحَابُهُ ."
  },
  "2290": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2290\nIn-book reference  : Book 22, Hadith 201\nEnglish translation  : Vol. 3, Book 22, Hadith 2292",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِلَى مَكَّةَ فَصَامَ حَتَّى أَتَى عُسْفَانَ فَدَعَا بِقَدَحٍ فَشَرِبَ - قَالَ شُعْبَةُ - فِي رَمَضَانَ فَكَانَ ابْنُ عَبَّاسٍ يَقُولُ مَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ ."
  },
  "2291": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2291\nIn-book reference  : Book 22, Hadith 202\nEnglish translation  : Vol. 3, Book 22, Hadith 2293",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ قُدَامَةَ، عَنْ جَرِيرٍ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَافَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي رَمَضَانَ فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَشَرِبَ نَهَارًا يَرَاهُ النَّاسُ ثُمَّ أَفْطَرَ ."
  },
  "2292": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2292\nIn-book reference  : Book 22, Hadith 203\nEnglish translation  : Vol. 3, Book 22, Hadith 2294",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الْعَوَّامِ بْنِ حَوْشَبٍ، قَالَ قُلْتُ لِمُجَاهِدٍ الصَّوْمُ فِي السَّفَرِ قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ وَيُفْطِرُ ."
  },
  "2293": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2293\nIn-book reference  : Book 22, Hadith 204\nEnglish translation  : Vol. 3, Book 22, Hadith 2295",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هِلاَلُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا حُسَيْنٌ، قَالَ حَدَّثَنَا زُهَيْرٌ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ، قَالَ أَخْبَرَنِي مُجَاهِدٌ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم صَامَ فِي شَهْرِ رَمَضَانَ وَأَفْطَرَ فِي السَّفَرِ ."
  },
  "2294": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2294\nIn-book reference  : Book 22, Hadith 205\nEnglish translation  : Vol. 3, Book 22, Hadith 2296",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا أَزْهَرُ بْنُ الْقَاسِمِ، قَالَ حَدَّثَنَا هِشَامٌ، عَنْ قَتَادَةَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ حَمْزَةَ بْنِ عَمْرٍو الأَسْلَمِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فِي السَّفَرِ قَالَ \" إِنْ - ثُمَّ ذَكَرَ كَلِمَةً مَعْنَاهَا إِنْ - شِئْتَ صُمْتَ وَإِنْ شِئْتَ أَفْطَرْتَ \" ."
  },
  "2295": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2295\nIn-book reference  : Book 22, Hadith 206\nEnglish translation  : Vol. 3, Book 22, Hadith 2297",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ بُكَيْرٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، أَنَّ حَمْزَةَ بْنَ عَمْرٍو، قَالَ يَا رَسُولَ اللَّهِ مِثْلَهُ مُرْسَلٌ ."
  },
  "2296": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2296\nIn-book reference  : Book 22, Hadith 207\nEnglish translation  : Vol. 3, Book 22, Hadith 2298",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ حَمْزَةَ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ \" ."
  },
  "2297": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2297\nIn-book reference  : Book 22, Hadith 208\nEnglish translation  : Vol. 3, Book 22, Hadith 2299",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ، قَالَ حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ حَمْزَةَ بْنِ عَمْرٍو، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فِي السَّفَرِ فَقَالَ \" إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ \" ."
  },
  "2298": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2298\nIn-book reference  : Book 22, Hadith 209\nEnglish translation  : Vol. 3, Book 22, Hadith 2300",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، وَاللَّيْثُ، وَذَكَرَ، آخَرَ عَنْ بُكَيْرٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، عَنْ حَمْزَةَ بْنِ عَمْرٍو الأَسْلَمِيِّ، قَالَ يَا رَسُولَ اللَّهِ إِنِّي أَجِدُ قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2299": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2299\nIn-book reference  : Book 22, Hadith 210\nEnglish translation  : Vol. 3, Book 22, Hadith 2301",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، قَالَ أَنْبَأَنَا عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، قَالَ أَخْبَرَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَمْزَةَ بْنِ عَمْرٍو، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ أَنْ تَصُومَ فَصُمْ وَإِنْ شِئْتَ أَنْ تُفْطِرَ فَأَفْطِرْ \" ."
  },
  "2300": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2300\nIn-book reference  : Book 22, Hadith 211\nEnglish translation  : Vol. 3, Book 22, Hadith 2302",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عِمْرَانُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، وَحَنْظَلَةَ بْنِ عَلِيٍّ، قَالَ حَدَّثَانِي جَمِيعًا، عَنْ حَمْزَةَ بْنِ عَمْرٍو، قَالَ كُنْتُ أَسْرُدُ الصِّيَامَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أَسْرُدُ الصِّيَامَ فِي السَّفَرِ فَقَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2301": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2301\nIn-book reference  : Book 22, Hadith 212\nEnglish translation  : Vol. 3, Book 22, Hadith 2303",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، عَنْ عِمْرَانَ بْنِ أَبِي أَنَسٍ، عَنْ حَنْظَلَةَ بْنِ عَلِيٍّ، عَنْ حَمْزَةَ، قَالَ قُلْتُ يَا نَبِيَّ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصِّيَامَ أَفَأَصُومُ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2302": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2302\nIn-book reference  : Book 22, Hadith 213\nEnglish translation  : Vol. 3, Book 22, Hadith 2304",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدٍ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي عِمْرَانُ بْنُ أَبِي أَنَسٍ، أَنَّ سُلَيْمَانَ بْنَ يَسَارٍ، حَدَّثَهُ أَنَّ أَبَا مُرَاوِحٍ حَدَّثَهُ أَنَّ حَمْزَةَ بْنَ عَمْرٍو حَدَّثَهُ أَنَّهُ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَكَانَ رَجُلاً يَصُومُ فِي السَّفَرِ فَقَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2303": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2303\nIn-book reference  : Book 22, Hadith 214\nEnglish translation  : Vol. 3, Book 22, Hadith 2305",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ أَنْبَأَنَا ابْنُ وَهْبٍ، قَالَ أَنْبَأَنَا عَمْرٌو، وَذَكَرَ، آخَرَ عَنْ أَبِي الأَسْوَدِ، عَنْ عُرْوَةَ، عَنْ أَبِي مُرَاوِحٍ، عَنْ حَمْزَةَ بْنِ عَمْرٍو، أَنَّهُ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَجِدُ فِيَّ قُوَّةً عَلَى الصِّيَامِ فِي السَّفَرِ فَهَلْ عَلَىَّ جُنَاحٌ قَالَ \" هِيَ رُخْصَةٌ مِنَ اللَّهِ عَزَّ وَجَلَّ فَمَنْ أَخَذَ بِهَا فَحَسَنٌ وَمَنْ أَحَبَّ أَنْ يَصُومَ فَلاَ جُنَاحَ عَلَيْهِ \" ."
  },
  "2304": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2304\nIn-book reference  : Book 22, Hadith 215\nEnglish translation  : Vol. 3, Book 22, Hadith 2306",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، عَنْ مُحَمَّدِ بْنِ بِشْرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ حَمْزَةَ بْنِ عَمْرٍو الأَسْلَمِيِّ، أَنَّهُ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم أَصُومُ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2305": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2305\nIn-book reference  : Book 22, Hadith 216\nEnglish translation  : Vol. 3, Book 22, Hadith 2307",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللاَّنِيُّ، بِالْكُوفَةِ قَالَ حَدَّثَنَا عَبْدُ الرَّحِيمِ الرَّازِيُّ، عَنْ هِشَامٍ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ حَمْزَةَ بْنِ عَمْرٍو، أَنَّهُ قَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَصُومُ أَفَأَصُومُ فِي السَّفَرِ قَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2306": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2306\nIn-book reference  : Book 22, Hadith 217\nEnglish translation  : Vol. 3, Book 22, Hadith 2308",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ سَلَمَةَ، قَالَ أَنْبَأَنَا ابْنُ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ حَمْزَةَ قَالَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ أَصُومُ فِي السَّفَرِ وَكَانَ كَثِيرَ الصِّيَامِ . فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2307": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2307\nIn-book reference  : Book 22, Hadith 218\nEnglish translation  : Vol. 3, Book 22, Hadith 2309",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ إِنَّ حَمْزَةَ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ أَصُومُ فِي السَّفَرِ فَقَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2308": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2308\nIn-book reference  : Book 22, Hadith 219\nEnglish translation  : Vol. 3, Book 22, Hadith 2310",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا هِشَامُ بْنُ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ حَمْزَةَ الأَسْلَمِيَّ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فِي السَّفَرِ وَكَانَ رَجُلاً يَسْرُدُ الصِّيَامَ . فَقَالَ \" إِنْ شِئْتَ فَصُمْ وَإِنْ شِئْتَ فَأَفْطِرْ \" ."
  },
  "2309": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2309\nIn-book reference  : Book 22, Hadith 220\nEnglish translation  : Vol. 3, Book 22, Hadith 2311",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ سَعِيدٍ الْجُرَيْرِيِّ، عَنْ أَبِي نَضْرَةَ، قَالَ حَدَّثَنَا أَبُو سَعِيدٍ، قَالَ كُنَّا نُسَافِرُ فِي رَمَضَانَ فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ لاَ يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ ."
  },
  "2310": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2310\nIn-book reference  : Book 22, Hadith 221\nEnglish translation  : Vol. 3, Book 22, Hadith 2312",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا سَعِيدُ بْنُ يَعْقُوبَ الطَّالْقَانِيُّ، قَالَ حَدَّثَنَا خَالِدٌ، - وَهُوَ ابْنُ عَبْدِ اللَّهِ الْوَاسِطِيُّ - عَنْ أَبِي مَسْلَمَةَ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ، قَالَ كُنَّا نُسَافِرُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمِنَّا الصَّائِمُ وَمِنَّا الْمُفْطِرُ وَلاَ يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ يَعِيبُ الْمُفْطِرُ عَلَى الصَّائِمِ ."
  },
  "2311": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2311\nIn-book reference  : Book 22, Hadith 222\nEnglish translation  : Vol. 3, Book 22, Hadith 2313",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا الْقَوَارِيرِيُّ، قَالَ حَدَّثَنَا بِشْرُ بْنُ مَنْصُورٍ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي نَضْرَةَ، عَنْ جَابِرٍ، قَالَ سَافَرْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصَامَ بَعْضُنَا وَأَفْطَرَ بَعْضُنَا ."
  },
  "2312": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2312\nIn-book reference  : Book 22, Hadith 223\nEnglish translation  : Vol. 3, Book 22, Hadith 2314",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي أَيُّوبُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنَا مَرْوَانُ، قَالَ حَدَّثَنَا عَاصِمٌ، عَنْ أَبِي نَضْرَةَ الْمُنْذِرِ، عَنْ أَبِي سَعِيدٍ، وَجَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّهُمَا سَافَرَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَصُومُ الصَّائِمُ وَيُفْطِرُ الْمُفْطِرُ وَلاَ يَعِيبُ الصَّائِمُ عَلَى الْمُفْطِرِ وَلاَ الْمُفْطِرُ عَلَى الصَّائِمِ ."
  },
  "2313": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2313\nIn-book reference  : Book 22, Hadith 224\nEnglish translation  : Vol. 3, Book 22, Hadith 2315",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَامَ الْفَتْحِ صَائِمًا فِي رَمَضَانَ حَتَّى إِذَا كَانَ بِالْكَدِيدِ أَفْطَرَ ."
  },
  "2314": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2314\nIn-book reference  : Book 22, Hadith 225\nEnglish translation  : Vol. 3, Book 22, Hadith 2316",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ آدَمَ، قَالَ حَدَّثَنَا مُفَضَّلٌ، عَنْ مَنْصُورٍ، عَنْ مُجَاهِدٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَافَرَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَصَامَ حَتَّى بَلَغَ عُسْفَانَ ثُمَّ دَعَا بِإِنَاءٍ فَشَرِبَ نَهَارًا لِيَرَاهُ النَّاسُ ثُمَّ أَفْطَرَ حَتَّى دَخَلَ مَكَّةَ فَافْتَتَحَ مَكَّةَ فِي رَمَضَانَ قَالَ ابْنُ عَبَّاسٍ فَصَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي السَّفَرِ وَأَفْطَرَ فَمَنْ شَاءَ صَامَ وَمَنْ شَاءَ أَفْطَرَ ."
  },
  "2315": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2315\nIn-book reference  : Book 22, Hadith 226\nEnglish translation  : Vol. 3, Book 22, Hadith 2317",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا مُسْلِمُ بْنُ إِبْرَاهِيمَ، عَنْ وُهَيْبِ بْنِ خَالِدٍ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ سَوَادَةَ الْقُشَيْرِيُّ، عَنْ أَبِيهِ، عَنْ أَنَسِ بْنِ مَالِكٍ، رَجُلٌ مِنْهُمْ أَنَّهُ أَتَى النَّبِيَّ صلى الله عليه وسلم بِالْمَدِينَةِ وَهُوَ يَتَغَدَّى فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" هَلُمَّ إِلَى الْغَدَاءِ \" . فَقَالَ إِنِّي صَائِمٌ . فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" إِنَّ اللَّهَ عَزَّ وَجَلَّ وَضَعَ لِلْمُسَافِرِ الصَّوْمَ وَشَطْرَ الصَّلاَةِ وَعَنِ الْحُبْلَى وَالْمُرْضِعِ \" ."
  },
  "2316": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2316\nIn-book reference  : Book 22, Hadith 227\nEnglish translation  : Vol. 3, Book 22, Hadith 2318",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ أَنْبَأَنَا بَكْرٌ، - وَهُوَ ابْنُ مُضَرَ - عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ بُكَيْرٍ، عَنْ يَزِيدَ، مَوْلَى سَلَمَةَ بْنِ الأَكْوَعِ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، قَالَ لَمَّا نَزَلَتْ هَذِهِ الآيَةُ { وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ } كَانَ مَنْ أَرَادَ مِنَّا أَنْ يُفْطِرَ وَيَفْتَدِيَ حَتَّى نَزَلَتِ الآيَةُ الَّتِي بَعْدَهَا فَنَسَخَتْهَا ."
  },
  "2317": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2317\nIn-book reference  : Book 22, Hadith 228\nEnglish translation  : Vol. 3, Book 22, Hadith 2319",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ أَنْبَأَنَا وَرْقَاءُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَطَاءٍ، عَنِ ابْنِ عَبَّاسٍ، فِي قَوْلِهِ عَزَّ وَجَلَّ { وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ } يُطِيقُونَهُ يُكَلَّفُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ وَاحِدٍ { فَمَنْ تَطَوَّعَ خَيْرًا } طَعَامُ مِسْكِينٍ آخَرَ لَيْسَتْ بِمَنْسُوخَةٍ { فَهُوَ خَيْرٌ لَهُ وَأَنْ تَصُومُوا خَيْرٌ لَكُمْ } لاَ يُرَخَّصُ فِي هَذَا إِلاَّ لِلَّذِي لاَ يُطِيقُ الصِّيَامَ أَوْ مَرِيضٍ لاَ يُشْفَى ."
  },
  "2318": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2318\nIn-book reference  : Book 22, Hadith 229\nEnglish translation  : Vol. 3, Book 22, Hadith 2320",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا عَلِيٌّ، - يَعْنِي ابْنَ مُسْهَرٍ - عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ مُعَاذَةَ الْعَدَوِيَّةِ، أَنَّ امْرَأَةً، سَأَلَتْ عَائِشَةَ أَتَقْضِي الْحَائِضُ الصَّلاَةَ إِذَا طَهُرَتْ قَالَتْ أَحَرُورِيَّةٌ أَنْتِ كُنَّا نَحِيضُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ثُمَّ نَطْهُرُ فَيَأْمُرُنَا بِقَضَاءِ الصَّوْمِ وَلاَ يَأْمُرُنَا بِقَضَاءِ الصَّلاَةِ ."
  },
  "2319": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2319\nIn-book reference  : Book 22, Hadith 230\nEnglish translation  : Vol. 3, Book 22, Hadith 2321",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ سَمِعْتُ أَبَا سَلَمَةَ، يُحَدِّثُ عَنْ عَائِشَةَ، قَالَتْ إِنْ كَانَ لَيَكُونُ عَلَىَّ الصِّيَامُ مِنْ رَمَضَانَ فَمَا أَقْضِيهِ حَتَّى يَجِيءَ شَعْبَانُ ."
  },
  "2320": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2320\nIn-book reference  : Book 22, Hadith 231\nEnglish translation  : Vol. 3, Book 22, Hadith 2322",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ عَبْدِ اللَّهِ بْنِ يُونُسَ أَبُو حَصِينٍ، قَالَ حَدَّثَنَا عَبْثَرٌ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنِ الشَّعْبِيِّ، عَنْ مُحَمَّدِ بْنِ صَيْفِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمَ عَاشُورَاءَ \" أَمِنْكُمْ أَحَدٌ أَكَلَ الْيَوْمَ \" . فَقَالُوا مِنَّا مَنْ صَامَ وَمِنَّا مَنْ لَمْ يَصُمْ . قَالَ \" فَأَتِمُّوا بَقِيَّةَ يَوْمِكُمْ وَابْعَثُوا إِلَى أَهْلِ الْعَرُوضِ فَلْيُتِمُّوا بَقِيَّةَ يَوْمِهِمْ \" ."
  },
  "2321": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2321\nIn-book reference  : Book 22, Hadith 232\nEnglish translation  : Vol. 3, Book 22, Hadith 2323",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا يَحْيَى، عَنْ يَزِيدَ، قَالَ حَدَّثَنَا سَلَمَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لِرَجُلٍ \" أَذِّنْ - يَوْمَ عَاشُورَاءَ - مَنْ كَانَ أَكَلَ فَلْيُتِمَّ بَقِيَّةَ يَوْمِهِ وَمَنْ لَمْ يَكُنْ أَكَلَ فَلْيَصُمْ \" ."
  },
  "2322": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2322\nIn-book reference  : Book 22, Hadith 233\nEnglish translation  : Vol. 3, Book 22, Hadith 2324",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ مَنْصُورٍ، قَالَ حَدَّثَنَا عَاصِمُ بْنُ يُوسُفَ، قَالَ حَدَّثَنَا أَبُو الأَحْوَصِ، عَنْ طَلْحَةَ بْنِ يَحْيَى بْنِ طَلْحَةَ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ \" هَلْ عِنْدَكُمْ شَىْءٌ \" . فَقُلْتُ لاَ . قَالَ \" فَإِنِّي صَائِمٌ \" . ثُمَّ مَرَّ بِي بَعْدَ ذَلِكَ الْيَوْمِ وَقَدْ أُهْدِيَ إِلَىَّ حَيْسٌ فَخَبَأْتُ لَهُ مِنْهُ وَكَانَ يُحِبُّ الْحَيْسَ قَالَتْ يَا رَسُولَ اللَّهِ إِنَّهُ أُهْدِيَ لَنَا حَيْسٌ فَخَبَأْتُ لَكَ مِنْهُ . قَالَ \" أَدْنِيهِ أَمَا إِنِّي قَدْ أَصْبَحْتُ وَأَنَا صَائِمٌ \" . فَأَكَلَ مِنْهُ ثُمَّ قَالَ \" إِنَّمَا مَثَلُ صَوْمِ الْمُتَطَوِّعِ مَثَلُ الرَّجُلِ يُخْرِجُ مِنْ مَالِهِ الصَّدَقَةَ فَإِنْ شَاءَ أَمْضَاهَا وَإِنْ شَاءَ حَبَسَهَا \" ."
  },
  "2323": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2323\nIn-book reference  : Book 22, Hadith 234\nEnglish translation  : Vol. 3, Book 22, Hadith 2325",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَزِيدُ، أَنْبَأَنَا شَرِيكٌ، عَنْ طَلْحَةَ بْنِ يَحْيَى بْنِ طَلْحَةَ، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ دَارَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم دَوْرَةً قَالَ \" أَعِنْدَكِ شَىْءٌ \" . قَالَتْ لَيْسَ عِنْدِي شَىْءٌ . قَالَ \" فَأَنَا صَائِمٌ \" . قَالَتْ ثُمَّ دَارَ عَلَىَّ الثَّانِيَةَ وَقَدْ أُهْدِيَ لَنَا حَيْسٌ فَجِئْتُ بِهِ فَأَكَلَ فَعَجِبْتُ مِنْهُ فَقُلْتُ يَا رَسُولَ اللَّهِ دَخَلْتَ عَلَىَّ وَأَنْتَ صَائِمٌ ثُمَّ أَكَلْتَ حَيْسًا . قَالَ \" نَعَمْ يَا عَائِشَةُ إِنَّمَا مَنْزِلَةُ مَنْ صَامَ فِي غَيْرِ رَمَضَانَ - أَوْ غَيْرِ قَضَاءِ رَمَضَانَ أَوْ فِي التَّطَوُّعِ - بِمَنْزِلَةِ رَجُلٍ أَخْرَجَ صَدَقَةَ مَالِهِ فَجَادَ مِنْهَا بِمَا شَاءَ فَأَمْضَاهُ وَبَخِلَ مِنْهَا بِمَا بَقِيَ فَأَمْسَكَهُ \" ."
  },
  "2324": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2324\nIn-book reference  : Book 22, Hadith 235\nEnglish translation  : Vol. 3, Book 22, Hadith 2326",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْهَيْثَمِ، قَالَ حَدَّثَنَا أَبُو بَكْرٍ الْحَنَفِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ مُجَاهِدٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَجِيءُ وَيَقُولُ \" هَلْ عِنْدَكُمْ غَدَاءٌ \" . فَنَقُولُ لاَ . فَيَقُولُ \" إِنِّي صَائِمٌ \" . فَأَتَانَا يَوْمًا وَقَدْ أُهْدِيَ لَنَا حَيْسٌ فَقَالَ \" هَلْ عِنْدَكُمْ شَىْءٌ \" . قُلْنَا نَعَمْ أُهْدِيَ لَنَا حَيْسٌ . قَالَ \" أَمَا إِنِّي قَدْ أَصْبَحْتُ أُرِيدُ الصَّوْمَ \" . فَأَكَلَ خَالَفَهُ قَاسِمُ بْنُ يَزِيدَ ."
  },
  "2325": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2325\nIn-book reference  : Book 22, Hadith 236\nEnglish translation  : Vol. 3, Book 22, Hadith 2327",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا قَاسِمٌ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ أَتَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقُلْنَا أُهْدِيَ لَنَا حَيْسٌ قَدْ جَعَلْنَا لَكَ مِنْهُ نَصِيبًا . فَقَالَ \" إِنِّي صَائِمٌ \" . فَأَفْطَرَ ."
  },
  "2326": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2326\nIn-book reference  : Book 22, Hadith 237\nEnglish translation  : Vol. 3, Book 22, Hadith 2328",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا يَحْيَى، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، قَالَ حَدَّثَتْنِي عَائِشَةُ بِنْتُ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَأْتِيهَا وَهُوَ صَائِمٌ فَقَالَ \" أَصْبَحَ عِنْدَكُمْ شَىْءٌ تُطْعِمِينِيهِ \" . فَنَقُولُ لاَ . فَيَقُولُ \" إِنِّي صَائِمٌ \" . ثُمَّ جَاءَهَا بَعْدَ ذَلِكَ فَقَالَتْ أُهْدِيَتْ لَنَا هَدِيَّةٌ . فَقَالَ \" مَا هِيَ \" . قَالَتْ حَيْسٌ . قَالَ \" قَدْ أَصْبَحْتُ صَائِمًا \" . فَأَكَلَ ."
  },
  "2327": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2327\nIn-book reference  : Book 22, Hadith 238\nEnglish translation  : Vol. 3, Book 22, Hadith 2329",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا وَكِيعٌ، قَالَ حَدَّثَنَا طَلْحَةُ بْنُ يَحْيَى، عَنْ عَمَّتِهِ، عَائِشَةَ بِنْتِ طَلْحَةَ عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم ذَاتَ يَوْمٍ فَقَالَ \" هَلْ عِنْدَكُمْ شَىْءٌ \" . قُلْنَا لاَ . قَالَ \" فَإِنِّي صَائِمٌ \" ."
  },
  "2328": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2328\nIn-book reference  : Book 22, Hadith 239\nEnglish translation  : Vol. 3, Book 22, Hadith 2330",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، قَالَ أَخْبَرَنِي أَبِي، عَنِ الْقَاسِمِ بْنِ مَعْنٍ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، وَمُجَاهِدٍ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم أَتَاهَا فَقَالَ \" هَلْ عِنْدَكُمْ طَعَامٌ \" . فَقُلْتُ لاَ . قَالَ \" إِنِّي صَائِمٌ \" . ثُمَّ جَاءَ يَوْمًا آخَرَ فَقَالَتْ عَائِشَةُ يَا رَسُولَ اللَّهِ إِنَّا قَدْ أُهْدِيَ لَنَا حَيْسٌ فَدَعَا بِهِ فَقَالَ \" أَمَا إِنِّي قَدْ أَصْبَحْتُ صَائِمًا \" . فَأَكَلَ ."
  },
  "2329": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2329\nIn-book reference  : Book 22, Hadith 240\nEnglish translation  : Vol. 3, Book 22, Hadith 2331",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا الْقَاسِمُ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ مُجَاهِدٍ، وَأُمِّ كُلْثُومٍ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم دَخَلَ عَلَى عَائِشَةَ فَقَالَ \" هَلْ عِنْدَكُمْ طَعَامٌ \" . نَحْوَهُ . قَالَ أَبُو عَبْدِ الرَّحْمَنِ وَقَدْ رَوَاهُ سِمَاكُ بْنُ حَرْبٍ قَالَ حَدَّثَنِي رَجُلٌ عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ ."
  },
  "2330": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2330\nIn-book reference  : Book 22, Hadith 241\nEnglish translation  : Vol. 3, Book 22, Hadith 2332",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي صَفْوَانُ بْنُ عَمْرٍو، قَالَ حَدَّثَنَا أَحْمَدُ بْنُ خَالِدٍ، قَالَ حَدَّثَنَا إِسْرَائِيلُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، قَالَ حَدَّثَنِي رَجُلٌ، عَنْ عَائِشَةَ بِنْتِ طَلْحَةَ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ، قَالَتْ جَاءَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَوْمًا فَقَالَ \" هَلْ عِنْدَكُمْ مِنْ طَعَامٍ \" . قُلْتُ لاَ . قَالَ \" إِذًا أَصُومَ \" . قَالَتْ وَدَخَلَ عَلَىَّ مَرَّةً أُخْرَى فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ أُهْدِيَ لَنَا حَيْسٌ . فَقَالَ \" إِذًا أُفْطِرَ الْيَوْمَ وَقَدْ فَرَضْتُ الصَّوْمَ \" ."
  },
  "2331": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2331\nIn-book reference  : Book 22, Hadith 242\nEnglish translation  : Vol. 3, Book 22, Hadith 2333",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ شُرَحْبِيلَ، قَالَ أَنْبَأَنَا اللَّيْثُ، عَنْ يَحْيَى بْنِ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ لَمْ يُبَيِّتِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلاَ صِيَامَ لَهُ \" ."
  },
  "2332": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2332\nIn-book reference  : Book 22, Hadith 243\nEnglish translation  : Vol. 3, Book 22, Hadith 2334",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ بْنِ سَعْدٍ، قَالَ حَدَّثَنِي أَبِي، عَنْ جَدِّي، قَالَ حَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي بَكْرٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ، عَنْ حَفْصَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ لَمْ يُبَيِّتِ الصِّيَامَ قَبْلَ الْفَجْرِ فَلاَ صِيَامَ لَهُ \" ."
  },
  "2333": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2333\nIn-book reference  : Book 22, Hadith 244\nEnglish translation  : Vol. 3, Book 22, Hadith 2335",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ عَبْدِ الْحَكَمِ، عَنْ أَشْهَبَ، قَالَ أَخْبَرَنِي يَحْيَى بْنُ أَيُّوبَ، وَذَكَرَ، آخَرَ أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، حَدَّثَهُمَا عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ طُلُوعِ الْفَجْرِ فَلاَ يَصُومُ \" ."
  },
  "2334": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2334\nIn-book reference  : Book 22, Hadith 245\nEnglish translation  : Vol. 3, Book 22, Hadith 2336",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ الأَزْهَرِ، قَالَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنِ ابْنِ عُمَرَ، عَنْ حَفْصَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ لَمْ يُبَيِّتِ الصِّيَامَ مِنَ اللَّيْلِ فَلاَ صِيَامَ لَهُ \" ."
  },
  "2335": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2335\nIn-book reference  : Book 22, Hadith 246\nEnglish translation  : Vol. 3, Book 22, Hadith 2337",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا مُعْتَمِرٌ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، عَنِ ابْنِ شِهَابٍ، عَنْ سَالِمٍ، عَنْ عَبْدِ اللَّهِ، عَنْ حَفْصَةَ، أَنَّهَا كَانَتْ تَقُولُ مَنْ لَمْ يُجْمِعِ الصِّيَامَ مِنَ اللَّيْلِ فَلاَ يَصُومُ ."
  },
  "2336": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2336\nIn-book reference  : Book 22, Hadith 247\nEnglish translation  : Vol. 3, Book 22, Hadith 2338",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي حَمْزَةُ بْنُ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، قَالَ قَالَتْ حَفْصَةُ زَوْجُ النَّبِيِّ صلى الله عليه وسلم لاَ صِيَامَ لِمَنْ لَمْ يُجْمِعْ قَبْلَ الْفَجْرِ ."
  },
  "2337": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2337\nIn-book reference  : Book 22, Hadith 248\nEnglish translation  : Vol. 3, Book 22, Hadith 2339",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ عِيسَى، قَالَ أَنْبَأَنَا ابْنُ الْمُبَارَكِ، قَالَ أَنْبَأَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ، قَالَتْ لاَ صِيَامَ لِمَنْ لَمْ يُجْمِعْ قَبْلَ الْفَجْرِ ."
  },
  "2338": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2338\nIn-book reference  : Book 22, Hadith 249\nEnglish translation  : Vol. 3, Book 22, Hadith 2340",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ سُفْيَانَ بْنِ عُيَيْنَةَ، وَمَعْمَرٍ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ حَفْصَةَ، قَالَتْ لاَ صِيَامَ لِمَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ الْفَجْرِ ."
  },
  "2339": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2339\nIn-book reference  : Book 22, Hadith 250\nEnglish translation  : Vol. 3, Book 22, Hadith 2341",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ حَفْصَةَ، قَالَتْ لاَ صِيَامَ لِمَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ الْفَجْرِ ."
  },
  "2340": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2340\nIn-book reference  : Book 22, Hadith 251\nEnglish translation  : Vol. 3, Book 22, Hadith 2342",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ، عَنِ الزُّهْرِيِّ، عَنْ حَمْزَةَ بْنِ عَبْدِ اللَّهِ، عَنْ حَفْصَةَ، قَالَتْ لاَ صِيَامَ لِمَنْ لَمْ يُجْمِعِ الصِّيَامَ قَبْلَ الْفَجْرِ . أَرْسَلَهُ مَالِكُ بْنُ أَنَسٍ ."
  },
  "2341": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2341\nIn-book reference  : Book 22, Hadith 252\nEnglish translation  : Vol. 3, Book 22, Hadith 2343",
    "url": "https://sunnah.com/nasai/22",
    "text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عَائِشَةَ، وَحَفْصَةَ، مِثْلَهُ لاَ يَصُومُ إِلاَّ مَنْ أَجْمَعَ الصِّيَامَ قَبْلَ الْفَجْرِ ."
  },
  "2342": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2342\nIn-book reference  : Book 22, Hadith 253\nEnglish translation  : Vol. 3, Book 22, Hadith 2344",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ عُبَيْدَ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ إِذَا لَمْ يُجْمِعِ الرَّجُلُ الصَّوْمَ مِنَ اللَّيْلِ فَلاَ يَصُمْ ."
  },
  "2343": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2343\nIn-book reference  : Book 22, Hadith 254\nEnglish translation  : Vol. 3, Book 22, Hadith 2345",
    "url": "https://sunnah.com/nasai/22",
    "text": "قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، عَنِ ابْنِ الْقَاسِمِ، قَالَ حَدَّثَنِي مَالِكٌ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّهُ كَانَ يَقُولُ لاَ يَصُومُ إِلاَّ مَنْ أَجْمَعَ الصِّيَامَ قَبْلَ الْفَجْرِ ."
  },
  "2344": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2344\nIn-book reference  : Book 22, Hadith 255\nEnglish translation  : Vol. 3, Book 22, Hadith 2346",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ عَمْرِو بْنِ أَوْسٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَحَبُّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صِيَامُ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَأَحَبُّ الصَّلاَةِ إِلَى اللَّهِ عَزَّ وَجَلَّ صَلاَةُ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَنَامُ نِصْفَ اللَّيْلِ وَيَقُومُ ثُلُثَهُ وَيَنَامُ سُدُسَهُ \" ."
  },
  "2345": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2345\nIn-book reference  : Book 22, Hadith 256\nEnglish translation  : Vol. 3, Book 22, Hadith 2347",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، قَالَ حَدَّثَنَا يَعْقُوبُ، عَنْ جَعْفَرٍ، عَنْ سَعِيدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم لاَ يُفْطِرُ أَيَّامَ الْبِيضِ فِي حَضَرٍ وَلاَ سَفَرٍ ."
  },
  "2346": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2346\nIn-book reference  : Book 22, Hadith 257\nEnglish translation  : Vol. 3, Book 22, Hadith 2348",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي بِشْرٍ، عَنْ سَعِيدِ بْنِ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ لاَ يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يَصُومَ وَمَا صَامَ شَهْرًا مُتَتَابِعًا غَيْرَ رَمَضَانَ مُنْذُ قَدِمَ الْمَدِينَةَ ."
  },
  "2347": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2347\nIn-book reference  : Book 22, Hadith 258\nEnglish translation  : Vol. 3, Book 22, Hadith 2349",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ النَّضْرِ بْنِ مُسَاوِرٍ الْمَرْوَزِيُّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ مَرْوَانَ أَبِي لُبَابَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يُفْطِرَ وَيُفْطِرُ حَتَّى نَقُولَ مَا يُرِيدُ أَنْ يَصُومَ ."
  },
  "2348": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2348\nIn-book reference  : Book 22, Hadith 259\nEnglish translation  : Vol. 3, Book 22, Hadith 2350",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ مَسْعُودٍ، عَنْ خَالِدٍ، قَالَ حَدَّثَنَا سَعِيدٌ، قَالَ حَدَّثَنَا قَتَادَةُ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ لاَ أَعْلَمُ نَبِيَّ اللَّهِ صلى الله عليه وسلم قَرَأَ الْقُرْآنَ كُلَّهُ فِي لَيْلَةٍ وَلاَ قَامَ لَيْلَةً حَتَّى الصَّبَاحِ وَلاَ صَامَ شَهْرًا قَطُّ كَامِلاً غَيْرَ رَمَضَانَ ."
  },
  "2349": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2349\nIn-book reference  : Book 22, Hadith 260\nEnglish translation  : Vol. 3, Book 22, Hadith 2351",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، عَنْ عَبْدِ اللَّهِ بْنِ شَقِيقٍ، قَالَ سَأَلْتُ عَائِشَةَ عَنْ صِيَامِ النَّبِيِّ، صلى الله عليه وسلم قَالَتْ كَانَ يَصُومُ حَتَّى نَقُولَ قَدْ صَامَ وَيُفْطِرُ حَتَّى نَقُولَ قَدْ أَفْطَرَ وَمَا صَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم شَهْرًا كَامِلاً مُنْذُ قَدِمَ الْمَدِينَةَ إِلاَّ رَمَضَانَ ."
  },
  "2350": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2350\nIn-book reference  : Book 22, Hadith 261\nEnglish translation  : Vol. 3, Book 22, Hadith 2352",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ حَدَّثَنَا مُعَاوِيَةُ بْنُ صَالِحٍ، أَنَّ عَبْدَ اللَّهِ بْنَ أَبِي قَيْسٍ، حَدَّثَهُ أَنَّهُ، سَمِعَ عَائِشَةَ، تَقُولُ كَانَ أَحَبَّ الشُّهُورِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم أَنْ يَصُومَهُ شَعْبَانُ بَلْ كَانَ يَصِلُهُ بِرَمَضَانَ ."
  },
  "2351": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2351\nIn-book reference  : Book 22, Hadith 262\nEnglish translation  : Vol. 3, Book 22, Hadith 2353",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ بْنِ دَاوُدَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي مَالِكٌ، وَعَمْرُو بْنُ الْحَارِثِ، وَذَكَرَ، آخَرَ قَبْلَهُمَا أَنَّ أَبَا النَّضْرِ، حَدَّثَهُمْ عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ حَتَّى نَقُولَ مَا يُفْطِرُ وَيُفْطِرُ حَتَّى نَقُولَ مَا يَصُومُ وَمَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فِي شَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ فِي شَعْبَانَ ."
  },
  "2352": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2352\nIn-book reference  : Book 22, Hadith 263\nEnglish translation  : Vol. 3, Book 22, Hadith 2354",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَحْمُودُ بْنُ غَيْلاَنَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ أَنْبَأَنَا شُعْبَةُ، عَنْ مَنْصُورٍ، قَالَ سَمِعْتُ سَالِمَ بْنَ أَبِي الْجَعْدِ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ لاَ يَصُومُ شَهْرَيْنِ مُتَتَابِعَيْنِ إِلاَّ شَعْبَانَ وَرَمَضَانَ ."
  },
  "2353": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2353\nIn-book reference  : Book 22, Hadith 264\nEnglish translation  : Vol. 3, Book 22, Hadith 2355",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ تَوْبَةَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ أُمِّ سَلَمَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ لَمْ يَكُنْ يَصُومُ مِنَ السَّنَةِ شَهْرًا تَامًّا إِلاَّ شَعْبَانَ وَيَصِلُ بِهِ رَمَضَانَ ."
  },
  "2354": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2354\nIn-book reference  : Book 22, Hadith 265\nEnglish translation  : Vol. 3, Book 22, Hadith 2356",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعْدِ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا عَمِّي، قَالَ حَدَّثَنَا أَبِي، عَنِ ابْنِ إِسْحَاقَ، قَالَ حَدَّثَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ لَمْ يَكُنْ رَسُولُ اللَّهِ صلى الله عليه وسلم لِشَهْرٍ أَكْثَرَ صِيَامًا مِنْهُ لِشَعْبَانَ كَانَ يَصُومُهُ أَوْ عَامَّتَهُ ."
  },
  "2355": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2355\nIn-book reference  : Book 22, Hadith 266\nEnglish translation  : Vol. 3, Book 22, Hadith 2357",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ سَلَمَةَ، عَنِ ابْنِ إِسْحَاقَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ شَعْبَانَ إِلاَّ قَلِيلاً ."
  },
  "2356": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2356\nIn-book reference  : Book 22, Hadith 267\nEnglish translation  : Vol. 3, Book 22, Hadith 2358",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، قَالَ حَدَّثَنَا بَقِيَّةُ، قَالَ حَدَّثَنَا بَحِيرٌ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، أَنَّ عَائِشَةَ، قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ شَعْبَانَ كُلَّهُ ."
  },
  "2357": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2357\nIn-book reference  : Book 22, Hadith 268\nEnglish translation  : Vol. 3, Book 22, Hadith 2359",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا ثَابِتُ بْنُ قَيْسٍ أَبُو الْغُصْنِ، - شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ - قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْمَقْبُرِيُّ، قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ لَمْ أَرَكَ تَصُومُ شَهْرًا مِنَ الشُّهُورِ مَا تَصُومُ مِنْ شَعْبَانَ . قَالَ \" ذَلِكَ شَهْرٌ يَغْفُلُ النَّاسُ عَنْهُ بَيْنَ رَجَبٍ وَرَمَضَانَ وَهُوَ شَهْرٌ تُرْفَعُ فِيهِ الأَعْمَالُ إِلَى رَبِّ الْعَالَمِينَ فَأُحِبُّ أَنْ يُرْفَعَ عَمَلِي وَأَنَا صَائِمٌ \" ."
  },
  "2358": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2358\nIn-book reference  : Book 22, Hadith 269\nEnglish translation  : Vol. 3, Book 22, Hadith 2360",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، عَنْ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا ثَابِتُ بْنُ قَيْسٍ أَبُو الْغُصْنِ، - شَيْخٌ مِنْ أَهْلِ الْمَدِينَةِ - قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْمَقْبُرِيُّ، قَالَ حَدَّثَنِي أُسَامَةُ بْنُ زَيْدٍ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ تَصُومُ حَتَّى لاَ تَكَادَ تُفْطِرُ وَتُفْطِرُ حَتَّى لاَ تَكَادَ أَنْ تَصُومَ إِلاَّ يَوْمَيْنِ إِنْ دَخَلاَ فِي صِيَامِكَ وَإِلاَّ صُمْتَهُمَا . قَالَ \" أَىُّ يَوْمَيْنِ \" . قُلْتُ يَوْمَ الاِثْنَيْنِ وَيَوْمَ الْخَمِيسِ . قَالَ \" ذَانِكَ يَوْمَانِ تُعْرَضُ فِيهِمَا الأَعْمَالُ عَلَى رَبِّ الْعَالَمِينَ فَأُحِبُّ أَنْ يُعْرَضَ عَمَلِي وَأَنَا صَائِمٌ \" ."
  },
  "2359": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2359\nIn-book reference  : Book 22, Hadith 270\nEnglish translation  : Vol. 3, Book 22, Hadith 2361",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، قَالَ أَخْبَرَنِي ثَابِتُ بْنُ قَيْسٍ الْغِفَارِيُّ، قَالَ حَدَّثَنِي أَبُو سَعِيدٍ الْمَقْبُرِيُّ، قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَسْرُدُ الصَّوْمَ فَيُقَالُ لاَ يُفْطِرُ وَيُفْطِرُ فَيُقَالُ لاَ يَصُومُ ."
  },
  "2360": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2360\nIn-book reference  : Book 22, Hadith 271\nEnglish translation  : Vol. 3, Book 22, Hadith 2362",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، عَنْ بَقِيَّةَ، قَالَ حَدَّثَنَا بَحِيرٌ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ جُبَيْرِ بْنِ نُفَيْرٍ، أَنَّ عَائِشَةَ، قَالَتْ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَتَحَرَّى صِيَامَ الاِثْنَيْنِ وَالْخَمِيسِ ."
  },
  "2361": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2361\nIn-book reference  : Book 22, Hadith 272\nEnglish translation  : Vol. 3, Book 22, Hadith 2363",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ دَاوُدَ، قَالَ أَخْبَرَنِي ثَوْرٌ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ رَبِيعَةَ الْجُرَشِيِّ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَحَرَّى يَوْمَ الاِثْنَيْنِ وَالْخَمِيسِ ."
  },
  "2362": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2362\nIn-book reference  : Book 22, Hadith 273\nEnglish translation  : Vol. 3, Book 22, Hadith 2364",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ أَنْبَأَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ الأُمَوِيُّ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ ثَوْرٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَحَرَّى الاِثْنَيْنِ وَالْخَمِيسَ ."
  },
  "2363": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2363\nIn-book reference  : Book 22, Hadith 274\nEnglish translation  : Vol. 3, Book 22, Hadith 2365",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ خَالِدِ بْنِ سَعْدٍ، عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَتَحَرَّى يَوْمَ الاِثْنَيْنِ وَالْخَمِيسِ ."
  },
  "2364": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2364\nIn-book reference  : Book 22, Hadith 275\nEnglish translation  : Vol. 3, Book 22, Hadith 2366",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ بْنِ حَبِيبِ بْنِ الشَّهِيدِ، قَالَ حَدَّثَنَا يَحْيَى بْنُ يَمَانٍ، عَنْ سُفْيَانَ، عَنْ عَاصِمٍ، عَنِ الْمُسَيَّبِ بْنِ رَافِعٍ، عَنْ سَوَاءٍ الْخُزَاعِيِّ، عَنْ عَائِشَةَ، قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُ الاِثْنَيْنِ وَالْخَمِيسَ ."
  },
  "2365": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2365\nIn-book reference  : Book 22, Hadith 276\nEnglish translation  : Vol. 3, Book 22, Hadith 2367",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي أَبُو بَكْرِ بْنُ عَلِيٍّ، قَالَ حَدَّثَنَا أَبُو نَصْرٍ التَّمَّارُ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ سَوَاءٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ الاِثْنَيْنِ وَالْخَمِيسَ مِنْ هَذِهِ الْجُمُعَةِ وَالاِثْنَيْنِ مِنَ الْمُقْبِلَةِ ."
  },
  "2366": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2366\nIn-book reference  : Book 22, Hadith 277\nEnglish translation  : Vol. 3, Book 22, Hadith 2368",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا إِسْحَاقُ، قَالَ أَنْبَأَنَا النَّضْرُ، قَالَ أَنْبَأَنَا حَمَّادٌ، عَنْ عَاصِمِ بْنِ أَبِي النَّجُودِ، عَنْ سَوَاءٍ، عَنْ حَفْصَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ يَوْمَ الْخَمِيسِ وَيَوْمَ الاِثْنَيْنِ وَمِنَ الْجُمُعَةِ الثَّانِيَةِ يَوْمَ الاِثْنَيْنِ ."
  },
  "2367": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2367\nIn-book reference  : Book 22, Hadith 278\nEnglish translation  : Vol. 3, Book 22, Hadith 2369",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْقَاسِمُ بْنُ زَكَرِيَّا بْنِ دِينَارٍ، قَالَ حَدَّثَنَا حُسَيْنٌ، عَنْ زَائِدَةَ، عَنْ عَاصِمٍ، عَنِ الْمُسَيَّبِ، عَنْ حَفْصَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم إِذَا أَخَذَ مَضْجَعَهُ جَعَلَ كَفَّهُ الْيُمْنَى تَحْتَ خَدِّهِ الأَيْمَنِ وَكَانَ يَصُومُ الاِثْنَيْنَ وَالْخَمِيسَ ."
  },
  "2368": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2368\nIn-book reference  : Book 22, Hadith 279\nEnglish translation  : Vol. 3, Book 22, Hadith 2370",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ بْنِ شَقِيقٍ، قَالَ أَبِي أَنْبَأَنَا أَبُو حَمْزَةَ، عَنْ عَاصِمٍ، عَنْ زِرٍّ، عَنْ عَبْدِ اللَّهِ بْنِ مَسْعُودٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ ثَلاَثَةَ أَيَّامٍ مِنْ غُرَّةِ كُلِّ شَهْرٍ وَقَلَّمَا يُفْطِرُ يَوْمَ الْجُمُعَةِ ."
  },
  "2369": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2369\nIn-book reference  : Book 22, Hadith 280\nEnglish translation  : Vol. 3, Book 22, Hadith 2371",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو كَامِلٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ رَجُلٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَكْعَتَىِ الضُّحَى وَأَنْ لاَ أَنَامَ إِلاَّ عَلَى وِتْرٍ وَصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنَ الشَّهْرِ ."
  },
  "2370": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2370\nIn-book reference  : Book 22, Hadith 281\nEnglish translation  : Vol. 3, Book 22, Hadith 2372",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنْ عُبَيْدِ اللَّهِ، أَنَّهُ سَمِعَ ابْنَ عَبَّاسٍ، وَسُئِلَ، عَنْ صِيَامِ، عَاشُورَاءَ قَالَ مَا عَلِمْتُ النَّبِيَّ صلى الله عليه وسلم صَامَ يَوْمًا يَتَحَرَّى فَضْلَهُ عَلَى الأَيَّامِ إِلاَّ هَذَا الْيَوْمَ يَعْنِي شَهْرَ رَمَضَانَ وَيَوْمَ عَاشُورَاءَ ."
  },
  "2371": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2371\nIn-book reference  : Book 22, Hadith 282\nEnglish translation  : Vol. 3, Book 22, Hadith 2373",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، عَنْ سُفْيَانَ، عَنِ الزُّهْرِيِّ، عَنْ حُمَيْدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، قَالَ سَمِعْتُ مُعَاوِيَةَ، يَوْمَ عَاشُورَاءَ وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ يَا أَهْلَ الْمَدِينَةِ أَيْنَ عُلَمَاؤُكُمْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ فِي هَذَا الْيَوْمِ \" إِنِّي صَائِمٌ فَمَنْ شَاءَ أَنْ يَصُومَ فَلْيَصُمْ \" ."
  },
  "2372": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2372\nIn-book reference  : Book 22, Hadith 283\nEnglish translation  : Vol. 3, Book 22, Hadith 2374",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا شَيْبَانُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْحُرِّ بْنِ صَيَّاحٍ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ، عَنِ امْرَأَتِهِ، قَالَتْ حَدَّثَتْنِي بَعْضُ، نِسَاءِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ يَصُومُ يَوْمَ عَاشُورَاءَ وَتِسْعًا مِنْ ذِي الْحِجَّةِ وَثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَخَمِيسَيْنِ ."
  },
  "2373": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2373\nIn-book reference  : Book 22, Hadith 284\nEnglish translation  : Vol. 3, Book 22, Hadith 2375",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي حَاجِبُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا الْحَارِثُ بْنُ عَطِيَّةَ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ الأَبَدَ فَلاَ صَامَ \" ."
  },
  "2374": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2374\nIn-book reference  : Book 22, Hadith 285\nEnglish translation  : Vol. 3, Book 22, Hadith 2376",
    "url": "https://sunnah.com/nasai/22",
    "text": "حَدَّثَنَا عِيسَى بْنُ مُسَاوِرٍ، عَنِ الْوَلِيدِ، قَالَ حَدَّثَنَا الأَوْزَاعِيُّ، قَالَ أَخْبَرَنِي عَطَاءٌ، عَنْ عَبْدِ اللَّهِ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنِي الْوَلِيدُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنَا عَطَاءٌ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ الأَبَدَ فَلاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2375": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2375\nIn-book reference  : Book 22, Hadith 286\nEnglish translation  : Vol. 3, Book 22, Hadith 2377",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ، قَالَ حَدَّثَنَا أَبِي وَعُقْبَةُ، عَنِ الأَوْزَاعِيِّ، قَالَ حَدَّثَنِي عَطَاءٌ، قَالَ حَدَّثَنِي مَنْ، سَمِعَ ابْنَ عُمَرَ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم \" مَنْ صَامَ الأَبَدَ فَلاَ صَامَ \" ."
  },
  "2376": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2376\nIn-book reference  : Book 22, Hadith 287\nEnglish translation  : Vol. 3, Book 22, Hadith 2378",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِسْمَاعِيلُ بْنُ يَعْقُوبَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ مُوسَى، قَالَ حَدَّثَنَا أَبِي، عَنِ الأَوْزَاعِيِّ، عَنْ عَطَاءٍ، قَالَ حَدَّثَنِي مَنْ، سَمِعَ ابْنَ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ صَامَ الأَبَدَ فَلاَ صَامَ \" ."
  },
  "2377": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2377\nIn-book reference  : Book 22, Hadith 288\nEnglish translation  : Vol. 3, Book 22, Hadith 2379",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ إِبْرَاهِيمَ بْنِ مُحَمَّدٍ، قَالَ حَدَّثَنَا ابْنُ عَائِذٍ، قَالَ حَدَّثَنَا يَحْيَى، عَنِ الأَوْزَاعِيِّ، عَنْ عَطَاءٍ، أَنَّهُ حَدَّثَهُ قَالَ حَدَّثَنِي مَنْ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ الأَبَدَ فَلاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2378": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2378\nIn-book reference  : Book 22, Hadith 289\nEnglish translation  : Vol. 3, Book 22, Hadith 2380",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ عَطَاءً، أَنَّ أَبَا الْعَبَّاسِ الشَّاعِرَ، أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، قَالَ بَلَغَ النَّبِيَّ صلى الله عليه وسلم أَنِّي أَصُومُ أَسْرُدُ الصَّوْمَ وَسَاقَ الْحَدِيثَ . قَالَ قَالَ عَطَاءٌ لاَ أَدْرِي كَيْفَ ذَكَرَ صِيَامَ الأَبَدِ لاَ صَامَ مَنْ صَامَ الأَبَدَ ."
  },
  "2379": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2379\nIn-book reference  : Book 22, Hadith 290\nEnglish translation  : Vol. 3, Book 22, Hadith 2381",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ أَنْبَأَنَا إِسْمَاعِيلُ، عَنِ الْجُرَيْرِيِّ، عَنْ يَزِيدَ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، عَنْ أَخِيهِ، مُطَرِّفٍ عَنْ عِمْرَانَ، قَالَ قِيلَ يَا رَسُولَ اللَّهِ إِنَّ فُلاَنًا لاَ يُفْطِرُ نَهَارًا الدَّهْرَ . قَالَ \" لاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2380": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2380\nIn-book reference  : Book 22, Hadith 291\nEnglish translation  : Vol. 3, Book 22, Hadith 2382",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي عَمْرُو بْنُ هِشَامٍ، قَالَ حَدَّثَنَا مَخْلَدٌ، عَنِ الأَوْزَاعِيِّ، عَنْ قَتَادَةَ، عَنْ مُطَرِّفِ بْنِ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، أَخْبَرَنِي أَبِي أَنَّهُ، سَمِعَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَذُكِرَ عِنْدَهُ رَجُلٌ يَصُومُ الدَّهْرَ قَالَ \" لاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2381": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2381\nIn-book reference  : Book 22, Hadith 292\nEnglish translation  : Vol. 3, Book 22, Hadith 2383",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ مُطَرِّفَ بْنَ عَبْدِ اللَّهِ بْنِ الشِّخِّيرِ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ فِي صَوْمِ الدَّهْرِ \" لاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2382": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2382\nIn-book reference  : Book 22, Hadith 293\nEnglish translation  : Vol. 3, Book 22, Hadith 2384",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، قَالَ أَنْبَأَنَا أَبُو هِلاَلٍ، قَالَ حَدَّثَنَا غَيْلاَنُ، - وَهُوَ ابْنُ جَرِيرٍ - قَالَ حَدَّثَنَا عَبْدُ اللَّهِ، - وَهُوَ ابْنُ مَعْبَدٍ الزِّمَّانِيُّ - عَنْ أَبِي قَتَادَةَ، عَنْ عُمَرَ، قَالَ كُنَّا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فَمَرَرْنَا بِرَجُلٍ فَقَالُوا يَا نَبِيَّ اللَّهِ هَذَا لاَ يُفْطِرُ مُنْذُ كَذَا وَكَذَا . فَقَالَ \" لاَ صَامَ وَلاَ أَفْطَرَ \" ."
  },
  "2383": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2383\nIn-book reference  : Book 22, Hadith 294\nEnglish translation  : Vol. 3, Book 22, Hadith 2385",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ غَيْلاَنَ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ مَعْبَدٍ الزِّمَّانِيَّ، عَنْ أَبِي قَتَادَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم سُئِلَ عَنْ صَوْمِهِ فَغَضِبَ فَقَالَ عُمَرُ رَضِينَا بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ رَسُولاً . وَسُئِلَ عَمَّنْ صَامَ الدَّهْرَ فَقَالَ \" لاَ صَامَ وَلاَ أَفْطَرَ أَوْ مَا صَامَ وَمَا أَفْطَرَ \" ."
  },
  "2384": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2384\nIn-book reference  : Book 22, Hadith 295\nEnglish translation  : Vol. 3, Book 22, Hadith 2386",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ حَبِيبِ بْنِ عَرَبِيٍّ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، أَنَّ حَمْزَةَ بْنَ عَمْرٍو الأَسْلَمِيَّ، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي رَجُلٌ أَسْرُدُ الصَّوْمَ أَفَأَصُومُ فِي السَّفَرِ قَالَ \" صُمْ إِنْ شِئْتَ أَوْ أَفْطِرْ إِنْ شِئْتَ \" ."
  },
  "2385": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2385\nIn-book reference  : Book 22, Hadith 296\nEnglish translation  : Vol. 3, Book 22, Hadith 2387",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا سُفْيَانُ، عَنِ الأَعْمَشِ، عَنْ أَبِي عَمَّارٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، عَنْ رَجُلٍ، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم قَالَ قِيلَ لِلنَّبِيِّ صلى الله عليه وسلم رَجُلٌ يَصُومُ الدَّهْرَ . قَالَ \" وَدِدْتُ أَنَّهُ لَمْ يَطْعَمِ الدَّهْرَ \" . قَالُوا فَثُلُثَيْهِ قَالَ \" أَكْثَرَ \" . قَالُوا فَنِصْفَهُ قَالَ \" أَكْثَرَ \" . ثُمَّ قَالَ \" أَلاَ أُخْبِرُكُمْ بِمَا يُذْهِبُ وَحَرَ الصَّدْرِ صَوْمُ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ \" ."
  },
  "2386": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2386\nIn-book reference  : Book 22, Hadith 297\nEnglish translation  : Vol. 3, Book 22, Hadith 2388",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْعَلاَءِ، قَالَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، قَالَ حَدَّثَنَا الأَعْمَشُ، عَنْ أَبِي عَمَّارٍ، عَنْ عَمْرِو بْنِ شُرَحْبِيلَ، قَالَ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ مَا تَقُولُ فِي رَجُلٍ صَامَ الدَّهْرَ كُلَّهُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" وَدِدْتُ أَنَّهُ لَمْ يَطْعَمِ الدَّهْرَ شَيْئًا \" . قَالَ فَثُلُثَيْهِ قَالَ \" أَكْثَرَ \" . قَالَ فَنِصْفَهُ قَالَ \" أَكْثَرَ \" . قَالَ \" أَفَلاَ أُخْبِرُكُمْ بِمَا يُذْهِبُ وَحَرَ الصَّدْرِ \" . قَالُوا بَلَى . قَالَ \" صِيَامُ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ \" ."
  },
  "2387": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2387\nIn-book reference  : Book 22, Hadith 298\nEnglish translation  : Vol. 3, Book 22, Hadith 2389",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ مَعْبَدٍ الزِّمَّانِيِّ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ عُمَرُ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ الدَّهْرَ كُلَّهُ قَالَ \" لاَ صَامَ وَلاَ أَفْطَرَ أَوْ لَمْ يَصُمْ وَلَمْ يُفْطِرْ \" . قَالَ يَا رَسُولَ اللَّهِ كَيْفَ بِمَنْ يَصُومُ يَوْمَيْنِ وَيُفْطِرُ يَوْمًا قَالَ \" أَوَيُطِيقُ ذَلِكَ أَحَدٌ \" . قَالَ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا قَالَ \" ذَلِكَ صَوْمُ دَاوُدَ عَلَيْهِ السَّلاَمُ \" . قَالَ فَكَيْفَ بِمَنْ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمَيْنِ قَالَ \" وَدِدْتُ أَنِّي أُطِيقُ ذَلِكَ \" . قَالَ ثُمَّ قَالَ \" ثَلاَثٌ مِنْ كُلِّ شَهْرٍ وَرَمَضَانُ إِلَى رَمَضَانَ هَذَا صِيَامُ الدَّهْرِ كُلِّهِ \" ."
  },
  "2388": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2388\nIn-book reference  : Book 22, Hadith 299\nEnglish translation  : Vol. 3, Book 22, Hadith 2390",
    "url": "https://sunnah.com/nasai/22",
    "text": "قَالَ وَفِيمَا قَرَأَ عَلَيْنَا أَحْمَدُ بْنُ مَنِيعٍ قَالَ حَدَّثَنَا هُشَيْمٌ، قَالَ أَنْبَأَنَا حُصَيْنٌ، وَمُغِيرَةُ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَفْضَلُ الصِّيَامِ صِيَامُ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا \" ."
  },
  "2389": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2389\nIn-book reference  : Book 22, Hadith 300\nEnglish translation  : Vol. 3, Book 22, Hadith 2391",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ حَمَّادٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ مُغِيرَةَ، عَنْ مُجَاهِدٍ، قَالَ قَالَ لِي عَبْدُ اللَّهِ بْنُ عَمْرٍو أَنْكَحَنِي أَبِي امْرَأَةً ذَاتَ حَسَبٍ فَكَانَ يَأْتِيهَا فَيَسْأَلُهَا عَنْ بَعْلِهَا، فَقَالَتْ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لَمْ يَطَأْ لَنَا فِرَاشًا وَلَمْ يُفَتِّشْ لَنَا كَنَفًا مُنْذُ أَتَيْنَاهُ . فَذَكَرَ ذَلِكَ لِلنَّبِيِّ صلى الله عليه وسلم فَقَالَ \" ائْتِنِي بِهِ \" . فَأَتَيْتُهُ مَعَهُ فَقَالَ \" كَيْفَ تَصُومُ \" . قُلْتُ كُلَّ يَوْمٍ . قَالَ \" صُمْ مِنْ كُلِّ جُمُعَةٍ ثَلاَثَةَ أَيَّامٍ \" . قُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ . قَالَ \" صُمْ يَوْمَيْنِ وَأَفْطِرْ يَوْمًا \" . قَالَ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ . قَالَ \" صُمْ أَفْضَلَ الصِّيَامِ صِيَامَ دَاوُدَ عَلَيْهِ السَّلاَمُ صَوْمُ يَوْمٍ وَفِطْرُ يَوْمٍ \" ."
  },
  "2390": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2390\nIn-book reference  : Book 22, Hadith 301\nEnglish translation  : Vol. 3, Book 22, Hadith 2392",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو حَصِينٍ عَبْدُ اللَّهِ بْنُ أَحْمَدَ بْنِ عَبْدِ اللَّهِ بْنِ يُونُسَ، قَالَ حَدَّثَنَا عَبْثَرٌ، قَالَ حَدَّثَنَا حُصَيْنٌ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ زَوَّجَنِي أَبِي امْرَأَةً فَجَاءَ يَزُورُهَا فَقَالَ كَيْفَ تَرَيْنَ بَعْلَكِ فَقَالَتْ نِعْمَ الرَّجُلُ مِنْ رَجُلٍ لاَ يَنَامُ اللَّيْلَ وَلاَ يُفْطِرُ النَّهَارَ . فَوَقَعَ بِي وَقَالَ زَوَّجْتُكَ امْرَأَةً مِنَ الْمُسْلِمِينَ فَعَضَلْتَهَا . قَالَ فَجَعَلْتُ لاَ أَلْتَفِتُ إِلَى قَوْلِهِ مِمَّا أَرَى عِنْدِي مِنَ الْقُوَّةِ وَالاِجْتِهَادِ فَبَلَغَ ذَلِكَ النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" لَكِنِّي أَنَا أَقُومُ وَأَنَامُ وَأَصُومُ وَأُفْطِرُ فَقُمْ وَنَمْ وَصُمْ وَأَفْطِرْ \" . قَالَ \" صُمْ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ \" . فَقُلْتُ أَنَا أَقْوَى مِنْ ذَلِكَ . قَالَ \" صُمْ صَوْمَ دَاوُدَ عَلَيْهِ السَّلاَمُ صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا \" . قُلْتُ أَنَا أَقْوَى مِنْ ذَلِكَ . قَالَ \" اقْرَإِ الْقُرْآنَ فِي كُلِّ شَهْرٍ \" . ثُمَّ انْتَهَى إِلَى خَمْسَ عَشْرَةَ وَأَنَا أَقُولُ أَنَا أَقْوَى مِنْ ذَلِكَ ."
  },
  "2391": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2391\nIn-book reference  : Book 22, Hadith 302\nEnglish translation  : Vol. 3, Book 22, Hadith 2393",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يَحْيَى بْنُ دُرُسْتَ، قَالَ حَدَّثَنَا أَبُو إِسْمَاعِيلَ، قَالَ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، أَنَّ أَبَا سَلَمَةَ، حَدَّثَهُ أَنَّ عَبْدَ اللَّهِ قَالَ دَخَلَ رَسُولُ اللَّهِ صلى الله عليه وسلم حُجْرَتِي فَقَالَ \" أَلَمْ أُخْبَرْ أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ \" . قَالَ بَلَى . قَالَ \" فَلاَ تَفْعَلَنَّ نَمْ وَقُمْ وَصُمْ وَأَفْطِرْ فَإِنَّ لِعَيْنِكَ عَلَيْكَ حَقًّا وَإِنَّ لِجَسَدِكَ عَلَيْكَ حَقًّا وَإِنَّ لِزَوْجَتِكَ عَلَيْكَ حَقًّا وَإِنَّ لِضَيْفِكَ عَلَيْكَ حَقًّا وَإِنَّ لِصَدِيقِكَ عَلَيْكَ حَقًّا وَإِنَّهُ عَسَى أَنْ يَطُولَ بِكَ عُمُرٌ وَإِنَّهُ حَسْبُكَ أَنْ تَصُومَ مِنْ كُلِّ شَهْرٍ ثَلاَثًا فَذَلِكَ صِيَامُ الدَّهْرِ كُلِّهِ وَالْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا \" . قُلْتُ إِنِّي أَجِدُ قُوَّةً فَشَدَّدْتُ فَشُدِّدَ عَلَىَّ . قَالَ \" صُمْ مِنْ كُلِّ جُمُعَةٍ ثَلاَثَةَ أَيَّامٍ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ فَشَدَّدْتُ فَشُدِّدَ عَلَىَّ . قَالَ \" صُمْ صَوْمَ نَبِيِّ اللَّهِ دَاوُدَ عَلَيْهِ السَّلاَمُ \" . قُلْتُ وَمَا كَانَ صَوْمُ دَاوُدَ قَالَ \" نِصْفُ الدَّهْرِ \" ."
  },
  "2392": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2392\nIn-book reference  : Book 22, Hadith 303\nEnglish translation  : Vol. 3, Book 22, Hadith 2394",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الرَّبِيعُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا ابْنُ وَهْبٍ، قَالَ أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، وَأَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ أَنَّ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، قَالَ ذُكِرَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ يَقُولُ لأَقُومَنَّ اللَّيْلَ وَلأَصُومَنَّ النَّهَارَ مَا عِشْتُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَنْتَ الَّذِي تَقُولُ ذَلِكَ \" . فَقُلْتُ لَهُ قَدْ قُلْتُهُ يَا رَسُولَ اللَّهِ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" فَإِنَّكَ لاَ تَسْتَطِيعُ ذَلِكَ فَصُمْ وَأَفْطِرْ وَنَمْ وَقُمْ وَصُمْ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامٍ فَإِنَّ الْحَسَنَةَ بِعَشْرِ أَمْثَالِهَا وَذَلِكَ مِثْلُ صِيَامِ الدَّهْرِ \" . قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ . قَالَ \" صُمْ يَوْمًا وَأَفْطِرْ يَوْمَيْنِ \" . فَقُلْتُ إِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ يَا رَسُولَ اللَّهِ . قَالَ \" فَصُمْ يَوْمًا وَأَفْطِرْ يَوْمًا وَذَلِكَ صِيَامُ دَاوُدَ وَهُوَ أَعْدَلُ الصِّيَامِ \" . قُلْتُ فَإِنِّي أُطِيقُ أَفْضَلَ مِنْ ذَلِكَ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ أَفْضَلَ مِنْ ذَلِكَ \" . قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو لأَنْ أَكُونَ قَبِلْتُ الثَّلاَثَةَ الأَيَّامَ الَّتِي قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحَبُّ إِلَىَّ مِنْ أَهْلِي وَمَالِي ."
  },
  "2393": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2393\nIn-book reference  : Book 22, Hadith 304\nEnglish translation  : Vol. 3, Book 22, Hadith 2395",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي أَحْمَدُ بْنُ بَكَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، - وَهُوَ ابْنُ سَلَمَةَ - عَنِ ابْنِ إِسْحَاقَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، قَالَ دَخَلْتُ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو قُلْتُ أَىْ عَمِّ حَدِّثْنِي عَمَّا قَالَ لَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَالَ يَا ابْنَ أَخِي إِنِّي كُنْتُ أَجْمَعْتُ عَلَى أَنْ أَجْتَهِدَ اجْتِهَادًا شَدِيدًا حَتَّى قُلْتُ لأَصُومَنَّ الدَّهْرَ وَلأَقْرَأَنَّ الْقُرْآنَ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ فَسَمِعَ بِذَلِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَأَتَانِي حَتَّى دَخَلَ عَلَىَّ فِي دَارِي فَقَالَ \" بَلَغَنِي أَنَّكَ قُلْتَ لأَصُومَنَّ الدَّهْرَ وَلأَقْرَأَنَّ الْقُرْآنَ \" . فَقُلْتُ قَدْ قُلْتُ ذَلِكَ يَا رَسُولَ اللَّهِ . قَالَ \" فَلاَ تَفْعَلْ صُمْ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ \" . قُلْتُ إِنِّي أَقْوَى عَلَى أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" فَصُمْ مِنَ الْجُمُعَةِ يَوْمَيْنِ الاِثْنَيْنِ وَالْخَمِيسَ \" . قُلْتُ فَإِنِّي أَقْوَى عَلَى أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" فَصُمْ صِيَامَ دَاوُدَ عَلَيْهِ السَّلاَمُ فَإِنَّهُ أَعْدَلُ الصِّيَامِ عِنْدَ اللَّهِ يَوْمًا صَائِمًا وَيَوْمًا مُفْطِرًا وَإِنَّهُ كَانَ إِذَا وَعَدَ لَمْ يُخْلِفْ وَإِذَا لاَقَى لَمْ يَفِرَّ \" ."
  },
  "2394": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2394\nIn-book reference  : Book 22, Hadith 305\nEnglish translation  : Vol. 3, Book 22, Hadith 2396",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ زِيَادِ بْنِ فَيَّاضٍ، سَمِعْتُ أَبَا عِيَاضٍ، يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ لَهُ \" صُمْ يَوْمًا وَلَكَ أَجْرُ مَا بَقِيَ \" . قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنَ ذَلِكَ . قَالَ \" صُمْ يَوْمَيْنِ وَلَكَ أَجْرُ مَا بَقِيَ \" . قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ ثَلاَثَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ \" . قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ أَرْبَعَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ \" . قَالَ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ أَفْضَلَ الصِّيَامِ عِنْدَ اللَّهِ صَوْمَ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا \" ."
  },
  "2395": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2395\nIn-book reference  : Book 22, Hadith 306\nEnglish translation  : Vol. 3, Book 22, Hadith 2397",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا الْمُعْتَمِرُ، عَنْ أَبِيهِ، قَالَ حَدَّثَنَا أَبُو الْعَلاَءِ، عَنْ مُطَرِّفٍ، عَنِ ابْنِ أَبِي رَبِيعَةَ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ ذَكَرْتُ لِلنَّبِيِّ صلى الله عليه وسلم الصَّوْمَ فَقَالَ \" صُمْ مِنْ كُلِّ عَشْرَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ التِّسْعَةِ \" . فَقُلْتُ إِنِّي أَقْوَى مِنْ ذَلِكَ . قَالَ \" صُمْ مِنْ كُلِّ تِسْعَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ الثَّمَانِيَةِ \" . قُلْتُ إِنِّي أَقْوَى مِنْ ذَلِكَ . قَالَ \" فَصُمْ مِنْ كُلِّ ثَمَانِيَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِلْكَ السَّبْعَةِ \" . قُلْتُ إِنِّي أَقْوَى مِنْ ذَلِكَ قَالَ فَلَمْ يَزَلْ حَتَّى قَالَ \" صُمْ يَوْمًا وَأَفْطِرْ يَوْمًا \" ."
  },
  "2396": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2396\nIn-book reference  : Book 22, Hadith 307\nEnglish translation  : Vol. 3, Book 22, Hadith 2398",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَزِيدُ، قَالَ حَدَّثَنَا حَمَّادٌ، ح وَأَخْبَرَنِي زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا حَمَّادٌ، عَنْ ثَابِتٍ، عَنْ شُعَيْبِ بْنِ عَبْدِ اللَّهِ بْنِ عَمْرٍو، عَنْ أَبِيهِ، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُمْ يَوْمًا وَلَكَ أَجْرُ عَشْرَةٍ \" . فَقُلْتُ زِدْنِي . فَقَالَ \" صُمْ يَوْمَيْنِ وَلَكَ أَجْرُ تِسْعَةٍ \" . قُلْتُ زِدْنِي . قَالَ \" صُمْ ثَلاَثَةَ أَيَّامٍ وَلَكَ أَجْرُ ثَمَانِيَةٍ \" . قَالَ ثَابِتٌ فَذَكَرْتُ ذَلِكَ لِمُطَرِّفٍ فَقَالَ مَا أُرَاهُ إِلاَّ يَزْدَادُ فِي الْعَمَلِ وَيَنْقُصُ مِنَ الأَجْرِ وَاللَّفْظُ لِمُحَمَّدٍ ."
  },
  "2397": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2397\nIn-book reference  : Book 22, Hadith 308\nEnglish translation  : Vol. 3, Book 22, Hadith 2399",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، عَنْ أَسْبَاطٍ، عَنْ مُطَرِّفٍ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّهُ بَلَغَنِي أَنَّكَ تَقُومُ اللَّيْلَ وَتَصُومُ النَّهَارَ \" . قُلْتُ يَا رَسُولَ اللَّهِ مَا أَرَدْتُ بِذَلِكَ إِلاَّ الْخَيْرَ . قَالَ \" لاَ صَامَ مَنْ صَامَ الأَبَدَ وَلَكِنْ أَدُلُّكَ عَلَى صَوْمِ الدَّهْرِ ثَلاَثَةُ أَيَّامٍ مِنَ الشَّهْرِ \" . قُلْتُ يَا رَسُولَ اللَّهِ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ خَمْسَةَ أَيَّامٍ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" فَصُمْ عَشْرًا \" . فَقُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ صَوْمَ دَاوُدَ عَلَيْهِ السَّلاَمُ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا \" ."
  },
  "2398": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2398\nIn-book reference  : Book 22, Hadith 309\nEnglish translation  : Vol. 3, Book 22, Hadith 2400",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ الْحُسَيْنِ، قَالَ حَدَّثَنَا أُمَيَّةُ، عَنْ شُعْبَةَ، عَنْ حَبِيبٍ، قَالَ حَدَّثَنِي أَبُو الْعَبَّاسِ، - وَكَانَ رَجُلاً مِنْ أَهْلِ الشَّامِ وَكَانَ شَاعِرًا وَكَانَ صَدُوقًا - عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم وَسَاقَ الْحَدِيثَ ."
  },
  "2399": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2399\nIn-book reference  : Book 22, Hadith 310\nEnglish translation  : Vol. 3, Book 22, Hadith 2401",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، حَدَّثَنَا شُعْبَةُ، قَالَ أَخْبَرَنِي حَبِيبُ بْنُ أَبِي ثَابِتٍ، قَالَ سَمِعْتُ أَبَا الْعَبَّاسِ، - هُوَ الشَّاعِرُ - يُحَدِّثُ عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا عَبْدَ اللَّهِ بْنَ عَمْرٍو إِنَّكَ تَصُومُ الدَّهْرَ وَتَقُومُ اللَّيْلَ وَإِنَّكَ إِذَا فَعَلْتَ ذَلِكَ هَجَمَتِ الْعَيْنُ وَنَفِهَتْ لَهُ النَّفْسُ لاَ صَامَ مَنْ صَامَ الأَبَدَ صَوْمُ الدَّهْرِ ثَلاَثَةُ أَيَّامٍ مِنَ الشَّهْرِ صَوْمُ الدَّهْرِ كُلِّهِ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ صَوْمَ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَلاَ يَفِرُّ إِذَا لاَقَى \" ."
  },
  "2400": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2400\nIn-book reference  : Book 22, Hadith 311\nEnglish translation  : Vol. 3, Book 22, Hadith 2402",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ بَشَّارٍ، قَالَ حَدَّثَنَا مُحَمَّدٌ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ أَبِي الْعَبَّاسِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" اقْرَإِ الْقُرْآنَ فِي شَهْرٍ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . فَلَمْ أَزَلْ أَطْلُبُ إِلَيْهِ حَتَّى قَالَ \" فِي خَمْسَةِ أَيَّامٍ \" . وَقَالَ \" صُمْ ثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . فَلَمْ أَزَلْ أَطْلُبُ إِلَيْهِ حَتَّى قَالَ \" صُمْ أَحَبَّ الصِّيَامِ إِلَى اللَّهِ عَزَّ وَجَلَّ صَوْمَ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا \" ."
  },
  "2401": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2401\nIn-book reference  : Book 22, Hadith 312\nEnglish translation  : Vol. 3, Book 22, Hadith 2403",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجٌ، قَالَ قَالَ ابْنُ جُرَيْجٍ سَمِعْتُ عَطَاءً، يَقُولُ إِنَّ أَبَا الْعَبَّاسِ الشَّاعِرَ أَخْبَرَهُ أَنَّهُ، سَمِعَ عَبْدَ اللَّهِ بْنَ عَمْرِو بْنِ الْعَاصِ، قَالَ بَلَغَ النَّبِيَّ صلى الله عليه وسلم أَنِّي أَصُومُ أَسْرُدُ الصَّوْمَ وَأُصَلِّي اللَّيْلَ فَأَرْسَلَ إِلَيْهِ وَلَمَّا لَقِيَهُ قَالَ \" أَلَمْ أُخْبَرْ أَنَّكَ تَصُومُ وَلاَ تُفْطِرُ وَتُصَلِّي اللَّيْلَ فَلاَ تَفْعَلْ فَإِنَّ لِعَيْنِكَ حَظًّا وَلِنَفْسِكَ حَظًّا وَلأَهْلِكَ حَظًّا وَصُمْ وَأَفْطِرْ وَصَلِّ وَنَمْ وَصُمْ مِنْ كُلِّ عَشْرَةِ أَيَّامٍ يَوْمًا وَلَكَ أَجْرُ تِسْعَةٍ \" . قَالَ إِنِّي أَقْوَى لِذَلِكَ يَا رَسُولَ اللَّهِ . قَالَ \" صُمْ صِيَامَ دَاوُدَ إِذًا \" . قَالَ وَكَيْفَ كَانَ صِيَامُ دَاوُدَ يَا نَبِيَّ اللَّهِ قَالَ \" كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا وَلاَ يَفِرُّ إِذَا لاَقَى \" . قَالَ وَمَنْ لِي بِهَذَا يَا نَبِيَّ اللَّهِ ."
  },
  "2402": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2402\nIn-book reference  : Book 22, Hadith 313\nEnglish translation  : Vol. 3, Book 22, Hadith 2404",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّاءُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا وَهْبُ بْنُ بَقِيَّةَ، قَالَ أَنْبَأَنَا خَالِدٌ، عَنْ خَالِدٍ، - وَهُوَ الْحَذَّاءُ - عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي الْمَلِيحِ، قَالَ دَخَلْتُ مَعَ أَبِيكَ زَيْدٍ عَلَى عَبْدِ اللَّهِ بْنِ عَمْرٍو فَحَدَّثَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم ذُكِرَ لَهُ صَوْمِي فَدَخَلَ عَلَىَّ فَأَلْقَيْتُ لَهُ وِسَادَةَ أَدَمٍ رَبْعَةً حَشْوُهَا لِيفٌ فَجَلَسَ عَلَى الأَرْضِ وَصَارَتِ الْوِسَادَةُ فِيمَا بَيْنِي وَبَيْنَهُ قَالَ \" أَمَا يَكْفِيكَ مِنْ كُلِّ شَهْرٍ ثَلاَثَةُ أَيَّامٍ \" . قُلْتُ يَا رَسُولَ اللَّهِ . قَالَ \" خَمْسًا \" . قُلْتُ يَا رَسُولَ اللَّهِ . قَالَ \" سَبْعًا \" . قُلْتُ يَا رَسُولَ اللَّهِ . قَالَ \" تِسْعًا \" . قُلْتُ يَا رَسُولَ اللَّهِ . قَالَ \" إِحْدَى عَشْرَةَ \" . قُلْتُ يَا رَسُولَ اللَّهِ . فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" لاَ صَوْمَ فَوْقَ صَوْمِ دَاوُدَ شَطْرَ الدَّهْرِ صِيَامُ يَوْمٍ وَفِطْرُ يَوْمٍ \" ."
  },
  "2403": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2403\nIn-book reference  : Book 22, Hadith 314\nEnglish translation  : Vol. 3, Book 22, Hadith 2405",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ حَدَّثَنِي شُعْبَةُ، عَنْ زِيَادِ بْنِ فَيَّاضٍ، قَالَ سَمِعْتُ أَبَا عِيَاضٍ، قَالَ قَالَ عَبْدُ اللَّهِ بْنُ عَمْرٍو قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُمْ مِنَ الشَّهْرِ يَوْمًا وَلَكَ أَجْرُ مَا بَقِيَ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" فَصُمْ يَوْمَيْنِ وَلَكَ أَجْرُ مَا بَقِيَ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" فَصُمْ ثَلاَثَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . قَالَ \" صُمْ أَرْبَعَةَ أَيَّامٍ وَلَكَ أَجْرُ مَا بَقِيَ \" . قُلْتُ إِنِّي أُطِيقُ أَكْثَرَ مِنْ ذَلِكَ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَفْضَلُ الصَّوْمِ صَوْمُ دَاوُدَ كَانَ يَصُومُ يَوْمًا وَيُفْطِرُ يَوْمًا \" ."
  },
  "2404": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2404\nIn-book reference  : Book 22, Hadith 315\nEnglish translation  : Vol. 1, Book 22, Hadith 2406",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ حُجْرٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ أَبِي حَرْمَلَةَ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي ذَرٍّ، قَالَ أَوْصَانِي حَبِيبِي صلى الله عليه وسلم بِثَلاَثَةٍ لاَ أَدَعُهُنَّ إِنْ شَاءَ اللَّهُ تَعَالَى أَبَدًا أَوْصَانِي بِصَلاَةِ الضُّحَى وَبِالْوِتْرِ قَبْلَ النَّوْمِ وَبِصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ."
  },
  "2405": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2405\nIn-book reference  : Book 22, Hadith 316\nEnglish translation  : Vol. 3, Book 22, Hadith 2407",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَلِيِّ بْنِ الْحَسَنِ، قَالَ سَمِعْتُ أَبِي قَالَ، أَنْبَأَنَا أَبُو حَمْزَةَ، عَنْ عَاصِمٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِثَلاَثٍ بِنَوْمٍ عَلَى وِتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصَوْمِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ."
  },
  "2406": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2406\nIn-book reference  : Book 22, Hadith 317\nEnglish translation  : Vol. 3, Book 22, Hadith 2408",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو كَامِلٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَاصِمِ بْنِ بَهْدَلَةَ، عَنْ رَجُلٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِرَكْعَتَىِ الضُّحَى وَأَنْ لاَ أَنَامَ إِلاَّ عَلَى وِتْرٍ وَصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ."
  },
  "2407": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2407\nIn-book reference  : Book 22, Hadith 318\nEnglish translation  : Vol. 3, Book 22, Hadith 2409",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو النَّضْرِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عَاصِمٍ، عَنِ الأَسْوَدِ بْنِ هِلاَلٍ، عَنْ أَبِي هُرَيْرَةَ، رضى الله عنه قَالَ أَمَرَنِي رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَوْمٍ عَلَى وِتْرٍ وَالْغُسْلِ يَوْمَ الْجُمُعَةِ وَصِيَامِ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ."
  },
  "2408": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2408\nIn-book reference  : Book 22, Hadith 319\nEnglish translation  : Vol. 3, Book 22, Hadith 2410",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ حَدَّثَنَا عَبْدُ الأَعْلَى، قَالَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَبِي عُثْمَانَ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" شَهْرُ الصَّبْرِ وَثَلاَثَةُ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صَوْمُ الدَّهْرِ \" ."
  },
  "2409": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2409\nIn-book reference  : Book 22, Hadith 320\nEnglish translation  : Vol. 3, Book 22, Hadith 2411",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ الْحَسَنِ اللاَّنِيُّ، بِالْكُوفَةِ عَنْ عَبْدِ الرَّحِيمِ، - وَهُوَ ابْنُ سُلَيْمَانَ - عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ صَامَ ثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ فَقَدْ صَامَ الدَّهْرَ كُلَّهُ \" . ثُمَّ قَالَ \" صَدَقَ اللَّهُ فِي كِتَابِهِ { مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا } \" ."
  },
  "2410": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2410\nIn-book reference  : Book 22, Hadith 321\nEnglish translation  : Vol. 3, Book 22, Hadith 2412",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ عَاصِمٍ، عَنْ أَبِي عُثْمَانَ، عَنْ رَجُلٍ، قَالَ أَبُو ذَرٍّ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ صَامَ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ فَقَدْ تَمَّ صَوْمُ الشَّهْرِ أَوْ فَلَهُ صَوْمُ الشَّهْرِ \" . شَكَّ عَاصِمٌ ."
  },
  "2411": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2411\nIn-book reference  : Book 22, Hadith 322\nEnglish translation  : Vol. 3, Book 22, Hadith 2413",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا قُتَيْبَةُ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، أَنَّ مُطَرِّفًا، حَدَّثَهُ أَنَّ عُثْمَانَ بْنَ أَبِي الْعَاصِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" صِيَامٌ حَسَنٌ ثَلاَثَةُ أَيَّامٍ مِنَ الشَّهْرِ \" ."
  },
  "2412": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2412\nIn-book reference  : Book 22, Hadith 323\nEnglish translation  : Vol. 3, Book 22, Hadith 2414",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا زَكَرِيَّا بْنُ يَحْيَى، قَالَ أَنْبَأَنَا أَبُو مُصْعَبٍ، عَنْ مُغِيرَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، قَالَ عُثْمَانُ بْنُ أَبِي الْعَاصِ نَحْوَهُ مُرْسَلٌ ."
  },
  "2413": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2413\nIn-book reference  : Book 22, Hadith 324\nEnglish translation  : Vol. 3, Book 22, Hadith 2415",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا يُوسُفُ بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا حَجَّاجٌ، عَنْ شَرِيكٍ، عَنِ الْحُرِّ بْنِ صَيَّاحٍ، قَالَ سَمِعْتُ ابْنَ عُمَرَ، يَقُولُ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ ."
  },
  "2414": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2414\nIn-book reference  : Book 22, Hadith 325\nEnglish translation  : Vol. 3, Book 22, Hadith 2416",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا الْحَسَنُ بْنُ مُحَمَّدٍ الزَّعْفَرَانِيُّ، قَالَ حَدَّثَنَا سَعِيدُ بْنُ سُلَيْمَانَ، عَنْ شَرِيكٍ، عَنِ الْحُرِّ بْنِ صَيَّاحٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ يَوْمَ الاِثْنَيْنِ مِنْ أَوَّلِ الشَّهْرِ وَالْخَمِيسَ الَّذِي يَلِيهِ ثُمَّ الْخَمِيسَ الَّذِي يَلِيهِ ."
  },
  "2415": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2415\nIn-book reference  : Book 22, Hadith 326\nEnglish translation  : Vol. 3, Book 22, Hadith 2417",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَلِيُّ بْنُ مُحَمَّدِ بْنِ عَلِيٍّ، قَالَ حَدَّثَنَا خَلَفُ بْنُ تَمِيمٍ، عَنْ زُهَيْرٍ، عَنِ الْحُرِّ بْنِ الصَّيَّاحِ، قَالَ سَمِعْتُ هُنَيْدَةَ الْخُزَاعِيَّ، قَالَ دَخَلْتُ عَلَى أُمِّ الْمُؤْمِنِينَ سَمِعْتُهَا تَقُولُ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَصُومُ مِنْ كُلِّ شَهْرٍ ثَلاَثَةَ أَيَّامٍ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ ثُمَّ الْخَمِيسَ ثُمَّ الْخَمِيسَ الَّذِي يَلِيهِ ."
  },
  "2416": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2416\nIn-book reference  : Book 22, Hadith 327\nEnglish translation  : Vol. 3, Book 22, Hadith 2418",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَبُو بَكْرِ بْنُ أَبِي النَّضْرِ، قَالَ حَدَّثَنَا أَبُو إِسْحَاقَ الأَشْجَعِيُّ، - كُوفِيٌّ - عَنْ عَمْرِو بْنِ قَيْسٍ الْمُلاَئِيِّ، عَنِ الْحُرِّ بْنِ الصَّيَّاحِ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ الْخُزَاعِيِّ، عَنْ حَفْصَةَ، قَالَتْ أَرْبَعٌ لَمْ يَكُنْ يَدَعُهُنَّ النَّبِيُّ صلى الله عليه وسلم صِيَامَ عَاشُورَاءَ وَالْعَشْرَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ وَرَكْعَتَيْنِ قَبْلَ الْغَدَاةِ ."
  },
  "2417": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2417\nIn-book reference  : Book 22, Hadith 328\nEnglish translation  : Vol. 3, Book 22, Hadith 2419",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى، عَنْ أَبِي نُعَيْمٍ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْحُرِّ بْنِ الصَّيَّاحِ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ، عَنِ امْرَأَتِهِ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَصُومُ تِسْعًا مِنْ ذِي الْحِجَّةِ وَيَوْمَ عَاشُورَاءَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ أَوَّلَ اثْنَيْنِ مِنَ الشَّهْرِ وَخَمِيسَيْنِ ."
  },
  "2418": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2418\nIn-book reference  : Book 22, Hadith 329\nEnglish translation  : Vol. 3, Book 22, Hadith 2420",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عُثْمَانَ بْنِ أَبِي صَفْوَانَ الثَّقَفِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنِ الْحُرِّ بْنِ الصَّيَّاحِ، عَنْ هُنَيْدَةَ بْنِ خَالِدٍ، عَنِ امْرَأَتِهِ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ كَانَ النَّبِيُّ صلى الله عليه وسلم يَصُومُ الْعَشْرَ وَثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ الاِثْنَيْنِ وَالْخَمِيسَ ."
  },
  "2419": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2419\nIn-book reference  : Book 22, Hadith 330\nEnglish translation  : Vol. 3, Book 22, Hadith 2421",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنِ الْحَسَنِ بْنِ عُبَيْدِ اللَّهِ، عَنْ هُنَيْدَةَ الْخُزَاعِيِّ، عَنْ أُمِّهِ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُ بِصِيَامِ ثَلاَثَةِ أَيَّامٍ أَوَّلِ خَمِيسٍ وَالاِثْنَيْنِ وَالاِثْنَيْنِ ."
  },
  "2420": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2420\nIn-book reference  : Book 22, Hadith 331\nEnglish translation  : Vol. 3, Book 22, Hadith 2422",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مَخْلَدُ بْنُ الْحَسَنِ، قَالَ حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ زَيْدِ بْنِ أَبِي أُنَيْسَةَ، عَنْ أَبِي إِسْحَاقَ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" صِيَامُ ثَلاَثَةِ أَيَّامٍ مِنْ كُلِّ شَهْرٍ صِيَامُ الدَّهْرِ وَأَيَّامُ الْبِيضِ صَبِيحَةَ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" ."
  },
  "2421": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2421\nIn-book reference  : Book 22, Hadith 332\nEnglish translation  : Vol. 3, Book 22, Hadith 2423",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم بِأَرْنَبٍ قَدْ شَوَاهَا فَوَضَعَهَا بَيْنَ يَدَيْهِ فَأَمْسَكَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَأْكُلْ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَأَمْسَكَ الأَعْرَابِيُّ فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" مَا يَمْنَعُكَ أَنْ تَأْكُلَ \" . قَالَ إِنِّي أَصُومُ ثَلاَثَةَ أَيَّامٍ مِنَ الشَّهْرِ . قَالَ \" إِنْ كُنْتَ صَائِمًا فَصُمِ الْغُرَّ \" ."
  },
  "2422": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2422\nIn-book reference  : Book 22, Hadith 333\nEnglish translation  : Vol. 3, Book 22, Hadith 2424",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْعَزِيزِ، قَالَ أَنْبَأَنَا الْفَضْلُ بْنُ مُوسَى، عَنْ فِطْرٍ، عَنْ يَحْيَى بْنِ سَامٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي ذَرٍّ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَصُومَ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامِ الْبِيضِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ."
  },
  "2423": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2423\nIn-book reference  : Book 22, Hadith 334\nEnglish translation  : Vol. 3, Book 22, Hadith 2425",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنْ أَبِي ذَرٍّ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ صلى الله عليه وسلم أَنْ نَصُومَ مِنَ الشَّهْرِ ثَلاَثَةَ أَيَّامِ الْبِيضِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ."
  },
  "2424": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2424\nIn-book reference  : Book 22, Hadith 335\nEnglish translation  : Vol. 3, Book 22, Hadith 2426",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ يَزِيدَ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ، قَالَ حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، قَالَ سَمِعْتُ يَحْيَى بْنَ سَامٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ سَمِعْتُ أَبَا ذَرٍّ، بِالرَّبَذَةِ قَالَ قَالَ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا صُمْتَ شَيْئًا مِنَ الشَّهْرِ فَصُمْ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" ."
  },
  "2425": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2425\nIn-book reference  : Book 22, Hadith 336\nEnglish translation  : Vol. 3, Book 22, Hadith 2427",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، عَنْ سُفْيَانَ، عَنْ بَيَانِ بْنِ بِشْرٍ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنِ ابْنِ الْحَوْتَكِيَّةِ، عَنْ أَبِي ذَرٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ لِرَجُلٍ \" عَلَيْكَ بِصِيَامِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ هَذَا خَطَأٌ لَيْسَ مِنْ حَدِيثِ بَيَانٍ وَلَعَلَّ سُفْيَانَ قَالَ حَدَّثَنَا اثْنَانِ فَسَقَطَ الأَلِفُ فَصَارَ بَيَانٌ ."
  },
  "2426": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2426\nIn-book reference  : Book 22, Hadith 337\nEnglish translation  : Vol. 3, Book 22, Hadith 2428",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا رَجُلاَنِ، مُحَمَّدٌ وَحَكِيمٌ عَنْ مُوسَى بْنِ طَلْحَةَ، عَنِ ابْنِ الْحَوْتَكِيَّةِ، عَنْ أَبِي ذَرٍّ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَ رَجُلاً بِصِيَامِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ."
  },
  "2427": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2427\nIn-book reference  : Book 22, Hadith 338\nEnglish translation  : Vol. 3, Book 22, Hadith 2429",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ عُثْمَانَ بْنِ حَكِيمٍ، عَنْ بَكْرٍ، عَنْ عِيسَى، عَنْ مُحَمَّدٍ، عَنِ الْحَكَمِ، عَنْ مُوسَى بْنِ طَلْحَةَ، عَنِ ابْنِ الْحَوْتَكِيَّةِ، قَالَ قَالَ أُبَىٌّ جَاءَ أَعْرَابِيٌّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعَهُ أَرْنَبٌ قَدْ شَوَاهَا وَخُبْزٌ فَوَضَعَهَا بَيْنَ يَدَىِ النَّبِيِّ صلى الله عليه وسلم ثُمَّ قَالَ إِنِّي وَجَدْتُهَا تَدْمَى . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِهِ \" لاَ يَضُرُّ كُلُوا \" . وَقَالَ لِلأَعْرَابِيِّ \" كُلْ \" . قَالَ إِنِّي صَائِمٌ . قَالَ \" صَوْمُ مَاذَا \" . قَالَ صَوْمُ ثَلاَثَةِ أَيَّامٍ مِنَ الشَّهْرِ . قَالَ \" إِنْ كُنْتَ صَائِمًا فَعَلَيْكَ بِالْغُرِّ الْبِيضِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" . قَالَ أَبُو عَبْدِ الرَّحْمَنِ الصَّوَابُ عَنْ أَبِي ذَرٍّ وَيُشْبِهُ أَنْ يَكُونَ وَقَعَ مِنَ الْكُتَّابِ ذَرٌّ فَقِيلَ أُبَىٌّ ."
  },
  "2428": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2428\nIn-book reference  : Book 22, Hadith 339\nEnglish translation  : Vol. 3, Book 22, Hadith 2430",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ يَحْيَى بْنِ الْحَارِثِ، قَالَ حَدَّثَنَا الْمُعَافَى بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا الْقَاسِمُ بْنُ مَعْنٍ، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ مُوسَى بْنِ طَلْحَةَ، أَنَّ رَجُلاً، أَتَى النَّبِيَّ صلى الله عليه وسلم بِأَرْنَبٍ وَكَانَ النَّبِيُّ صلى الله عليه وسلم مَدَّ يَدَهُ إِلَيْهَا فَقَالَ الَّذِي جَاءَ بِهَا إِنِّي رَأَيْتُ بِهَا دَمًا . فَكَفَّ رَسُولُ اللَّهِ صلى الله عليه وسلم يَدَهُ وَأَمَرَ الْقَوْمَ أَنْ يَأْكُلُوا وَكَانَ فِي الْقَوْمِ رَجُلٌ مُنْتَبِذٌ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" مَا لَكَ \" . قَالَ إِنِّي صَائِمٌ . فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" فَهَلاَّ ثَلاَثَ الْبِيضِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" ."
  },
  "2429": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2429\nIn-book reference  : Book 22, Hadith 340\nEnglish translation  : Vol. 3, Book 22, Hadith 2431",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ بْنِ إِبْرَاهِيمَ، قَالَ حَدَّثَنَا يَعْلَى، عَنْ طَلْحَةَ بْنِ يَحْيَى، عَنْ مُوسَى بْنِ طَلْحَةَ، قَالَ أُتِيَ النَّبِيُّ صلى الله عليه وسلم بِأَرْنَبٍ قَدْ شَوَاهَا رَجُلٌ فَلَمَّا قَدَّمَهَا إِلَيْهِ قَالَ يَا رَسُولَ اللَّهِ إِنِّي قَدْ رَأَيْتُ بِهَا دَمًا فَتَرَكَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَلَمْ يَأْكُلْهَا وَقَالَ لِمَنْ عِنْدَهُ \" كُلُوا فَإِنِّي لَوِ اشْتَهَيْتُهَا أَكَلْتُهَا \" . وَرَجُلٌ جَالِسٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" ادْنُ فَكُلْ مَعَ الْقَوْمِ \" . فَقَالَ يَا رَسُولَ اللَّهِ إِنِّي صَائِمٌ . قَالَ \" فَهَلاَّ صُمْتَ الْبِيضَ \" . قَالَ وَمَا هُنَّ قَالَ \" ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ \" ."
  },
  "2430": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2430\nIn-book reference  : Book 22, Hadith 341\nEnglish translation  : Vol. 3, Book 22, Hadith 2432",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الأَعْلَى، قَالَ حَدَّثَنَا خَالِدٌ، عَنْ شُعْبَةَ، قَالَ أَنْبَأَنَا أَنَسُ بْنُ سِيرِينَ، عَنْ رَجُلٍ، يُقَالُ لَهُ عَبْدُ الْمَلِكِ يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يَأْمُرُ بِهَذِهِ الأَيَّامِ الثَّلاَثِ الْبِيضِ وَيَقُولُ \" هُنَّ صِيَامُ الشَّهْرِ \" ."
  },
  "2431": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2431\nIn-book reference  : Book 22, Hadith 342\nEnglish translation  : Vol. 3, Book 22, Hadith 2433",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ شُعْبَةَ، عَنْ أَنَسِ بْنِ سِيرِينَ، قَالَ سَمِعْتُ عَبْدَ الْمَلِكِ بْنَ أَبِي الْمِنْهَالِ، يُحَدِّثُ عَنْ أَبِيهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم أَمَرَهُمْ بِصِيَامِ ثَلاَثَةِ أَيَّامِ الْبِيضِ قَالَ \" هِيَ صَوْمُ الشَّهْرِ \" ."
  },
  "2432": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2432\nIn-book reference  : Book 22, Hadith 343\nEnglish translation  : Vol. 3, Book 22, Hadith 2434",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَعْمَرٍ، قَالَ حَدَّثَنَا حَبَّانُ، قَالَ حَدَّثَنَا هَمَّامٌ، قَالَ حَدَّثَنَا أَنَسُ بْنُ سِيرِينَ، قَالَ حَدَّثَنِي عَبْدُ الْمَلِكِ بْنُ قُدَامَةَ بْنِ مِلْحَانَ، عَنْ أَبِيهِ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم يَأْمُرُنَا بِصَوْمِ أَيَّامِ اللَّيَالِي الْغُرِّ الْبِيضِ ثَلاَثَ عَشْرَةَ وَأَرْبَعَ عَشْرَةَ وَخَمْسَ عَشْرَةَ ."
  },
  "2433": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2433\nIn-book reference  : Book 22, Hadith 344\nEnglish translation  : Vol. 3, Book 22, Hadith 2435",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَمْرُو بْنُ عَلِيٍّ، قَالَ حَدَّثَنِي سَيْفُ بْنُ عُبَيْدِ اللَّهِ، مِنْ خِيَارِ الْخَلْقِ قَالَ حَدَّثَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ، عَنْ أَبِيهِ، قَالَ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الصَّوْمِ فَقَالَ \" صُمْ يَوْمًا مِنَ الشَّهْرِ \" . قُلْتُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي . قَالَ \" تَقُولُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ \" . قُلْتُ يَا رَسُولَ اللَّهِ زِدْنِي زِدْنِي إِنِّي أَجِدُنِي قَوِيًّا . فَقَالَ \" زِدْنِي زِدْنِي أَجِدُنِي قَوِيًّا \" . فَسَكَتَ رَسُولُ اللَّهِ صلى الله عليه وسلم حَتَّى ظَنَنْتُ أَنَّهُ لَيَرُدُّنِي قَالَ \" صُمْ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ \" ."
  },
  "2434": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Fasting",
    "book_num": "22",
    "reference": "Reference  : Sunan an-Nasa'i 2434\nIn-book reference  : Book 22, Hadith 345\nEnglish translation  : Vol. 3, Book 22, Hadith 2436",
    "url": "https://sunnah.com/nasai/22",
    "text": "أَخْبَرَنَا عَبْدُ الرَّحْمَنِ بْنُ مُحَمَّدِ بْنِ سَلاَّمٍ، قَالَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، قَالَ أَنْبَأَنَا الأَسْوَدُ بْنُ شَيْبَانَ، عَنْ أَبِي نَوْفَلِ بْنِ أَبِي عَقْرَبٍ، عَنْ أَبِيهِ، أَنَّهُ سَأَلَ النَّبِيَّ صلى الله عليه وسلم عَنِ الصَّوْمِ فَقَالَ \" صُمْ يَوْمًا مِنْ كُلِّ شَهْرٍ \" . وَاسْتَزَادَهُ قَالَ بِأَبِي أَنْتَ وَأُمِّي أَجِدُنِي قَوِيًّا فَزَادَهُ قَالَ \" صُمْ يَوْمَيْنِ مِنْ كُلِّ شَهْرٍ \" . فَقَالَ بِأَبِي أَنْتَ وَأُمِّي يَا رَسُولَ اللَّهِ إِنِّي أَجِدُنِي قَوِيًّا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنِّي أَجِدُنِي قَوِيًّا إِنِّي أَجِدُنِي قَوِيًّا \" . فَمَا كَادَ أَنْ يَزِيدَهُ فَلَمَّا أَلَحَّ عَلَيْهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" صُمْ ثَلاَثَةَ أَيَّامٍ مِنْ كُلِّ شَهْرٍ \" ."
  }
}