{
  "3679": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3679\nIn-book reference  : Book 31, Hadith 8\nEnglish translation  : Vol. 4, Book 31, Hadith 3709",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، قَالَ حَدَّثَنَا يَزِيدُ، - وَهُوَ ابْنُ زُرَيْعٍ - قَالَ حَدَّثَنَا دَاوُدُ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ، قَالَ انْطَلَقَ بِهِ أَبُوهُ يَحْمِلُهُ إِلَى النَّبِيِّ صلى الله عليه وسلم قَالَ اشْهَدْ أَنِّي قَدْ نَحَلْتُ النُّعْمَانَ مِنْ مَالِي كَذَا وَكَذَا . قَالَ \" كُلَّ بَنِيكَ نَحَلْتَ مِثْلَ الَّذِي نَحَلْتَ النُّعْمَانَ \" ."
  },
  "3680": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3680\nIn-book reference  : Book 31, Hadith 9\nEnglish translation  : Vol. 4, Book 31, Hadith 3710",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، عَنْ عَبْدِ الْوَهَّابِ، قَالَ حَدَّثَنَا دَاوُدُ، عَنْ عَامِرٍ، عَنِ النُّعْمَانِ، أَنَّ أَبَاهُ، أَتَى بِهِ النَّبِيَّ صلى الله عليه وسلم يُشْهِدُ عَلَى نُحْلٍ نَحَلَهُ إِيَّاهُ . فَقَالَ \" أَكُلَّ وَلَدِكَ نَحَلْتَ مِثْلَ مَا نَحَلْتَهُ \" . قَالَ لاَ . قَالَ \" فَلاَ أَشْهَدُ عَلَى شَىْءٍ أَلَيْسَ يَسُرُّكَ أَنْ يَكُونُوا إِلَيْكَ فِي الْبِرِّ سَوَاءً \" . قَالَ بَلَى . قَالَ \" فَلاَ إِذًا \" ."
  },
  "3681": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3681\nIn-book reference  : Book 31, Hadith 10\nEnglish translation  : Vol. 4, Book 31, Hadith 3711",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا مُوسَى بْنُ عَبْدِ الرَّحْمَنِ، قَالَ حَدَّثَنَا أَبُو أُسَامَةَ، قَالَ حَدَّثَنَا أَبُو حَيَّانَ، عَنِ الشَّعْبِيِّ، قَالَ حَدَّثَنِي النُّعْمَانُ بْنُ بَشِيرٍ الأَنْصَارِيُّ، أَنَّ أُمَّهُ ابْنَةَ رَوَاحَةَ، سَأَلَتْ أَبَاهُ بَعْضَ الْمَوْهِبَةِ مِنْ مَالِهِ لاِبْنِهَا فَالْتَوَى بِهَا سَنَةً ثُمَّ بَدَا لَهُ فَوَهَبَهَا لَهُ فَقَالَتْ لاَ أَرْضَى حَتَّى تُشْهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم . فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ هَذَا ابْنَةَ رَوَاحَةَ قَاتَلَتْنِي عَلَى الَّذِي وَهَبْتُ لَهُ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَا بَشِيرُ أَلَكَ وَلَدٌ سِوَى هَذَا \" . قَالَ نَعَمْ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَفَكُلُّهُمْ وَهَبْتَ لَهُمْ مِثْلَ الَّذِي وَهَبْتَ لاِبْنِكَ هَذَا \" . قَالَ لاَ . قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" فَلاَ تُشْهِدْنِي إِذًا فَإِنِّي لاَ أَشْهَدُ عَلَى جَوْرٍ \" ."
  },
  "3682": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3682\nIn-book reference  : Book 31, Hadith 11\nEnglish translation  : Vol. 4, Book 31, Hadith 3712",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا أَبُو دَاوُدَ، قَالَ حَدَّثَنَا يَعْلَى، قَالَ حَدَّثَنَا أَبُو حَيَّانَ، عَنِ الشَّعْبِيِّ، عَنِ النُّعْمَانِ، قَالَ سَأَلَتْ أُمِّي أَبِي بَعْضَ الْمَوْهِبَةِ فَوَهَبَهَا لِي فَقَالَتْ لاَ أَرْضَى حَتَّى أُشْهِدَ رَسُولَ اللَّهِ صلى الله عليه وسلم . قَالَ فَأَخَذَ أَبِي بِيَدِي وَأَنَا غُلاَمٌ فَأَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ أُمَّ هَذَا ابْنَةَ رَوَاحَةَ طَلَبَتْ مِنِّي بَعْضَ الْمَوْهِبَةِ وَقَدْ أَعْجَبَهَا أَنْ أُشْهِدَكَ عَلَى ذَلِكَ . قَالَ \" يَا بَشِيرُ أَلَكَ ابْنٌ غَيْرُ هَذَا \" . قَالَ نَعَمْ . قَالَ \" فَوَهَبْتَ لَهُ مِثْلَ مَا وَهَبْتَ لِهَذَا \" . قَالَ لاَ . قَالَ \" فَلاَ تُشْهِدْنِي إِذًا فَإِنِّي لاَ أَشْهَدُ عَلَى جَوْرٍ \" ."
  },
  "3683": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3683\nIn-book reference  : Book 31, Hadith 12\nEnglish translation  : Vol. 4, Book 31, Hadith 3713",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ عُبَيْدٍ، قَالَ حَدَّثَنَا إِسْمَاعِيلُ، عَنْ عَامِرٍ، قَالَ أُخْبِرْتُ أَنَّ بَشِيرَ بْنَ سَعْدٍ أَتَى رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ إِنَّ امْرَأَتِي عَمْرَةَ بِنْتَ رَوَاحَةَ أَمَرَتْنِي أَنْ أَتَصَدَّقَ عَلَى ابْنِهَا نُعْمَانَ بِصَدَقَةٍ وَأَمَرَتْنِي أَنْ أُشْهِدَكَ عَلَى ذَلِكَ . فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" هَلْ لَكَ بَنُونَ سِوَاهُ \" . قَالَ نَعَمْ . قَالَ \" فَأَعْطَيْتَهُمْ مِثْلَ مَا أَعْطَيْتَ لِهَذَا \" . قَالَ لاَ . قَالَ \" فَلاَ تُشْهِدْنِي عَلَى جَوْرٍ \" ."
  },
  "3684": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3684\nIn-book reference  : Book 31, Hadith 13\nEnglish translation  : Vol. 4, Book 31, Hadith 3714",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا أَحْمَدُ بْنُ سُلَيْمَانَ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا زَكَرِيَّا، عَنْ عَامِرٍ، قَالَ حَدَّثَنِي عَبْدُ اللَّهِ بْنُ عُتْبَةَ بْنِ مَسْعُودٍ، ح وَأَنْبَأَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ رَجُلاً، جَاءَ إِلَى النَّبِيِّ صلى الله عليه وسلم - وَقَالَ مُحَمَّدٌ أَتَى النَّبِيَّ صلى الله عليه وسلم - فَقَالَ إِنِّي تَصَدَّقْتُ عَلَى ابْنِي بِصَدَقَةٍ فَاشْهَدْ فَقَالَ \" هَلْ لَكَ وَلَدٌ غَيْرُهُ \" . قَالَ نَعَمْ . قَالَ \" أَعْطَيْتَهُمْ كَمَا أَعْطَيْتَهُ \" . قَالَ لاَ . قَالَ \" أَأَشْهَدُ عَلَى جَوْرٍ \" ."
  },
  "3685": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3685\nIn-book reference  : Book 31, Hadith 14\nEnglish translation  : Vol. 4, Book 31, Hadith 3715",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، عَنْ يَحْيَى، عَنْ فِطْرٍ، قَالَ حَدَّثَنِي مُسْلِمُ بْنُ صُبَيْحٍ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ ذَهَبَ بِي أَبِي إِلَى النَّبِيِّ صلى الله عليه وسلم يُشْهِدُهُ عَلَى شَىْءٍ أَعْطَانِيهِ فَقَالَ \" أَلَكَ وَلَدٌ غَيْرُهُ \" . قَالَ نَعَمْ . وَصَفَّ بِيَدِهِ بِكَفِّهِ أَجْمَعَ كَذَا أَلاَ سَوَّيْتَ بَيْنَهُمْ ."
  },
  "3686": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3686\nIn-book reference  : Book 31, Hadith 15\nEnglish translation  : Vol. 4, Book 31, Hadith 3716",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ حَاتِمٍ، قَالَ أَنْبَأَنَا حِبَّانُ، قَالَ أَنْبَأَنَا عَبْدُ اللَّهِ، عَنْ فِطْرٍ، عَنْ مُسْلِمِ بْنِ صُبَيْحٍ، قَالَ سَمِعْتُ النُّعْمَانَ، يَقُولُ وَهُوَ يَخْطُبُ انْطَلَقَ بِي أَبِي إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم يُشْهِدُهُ عَلَى عَطِيَّةٍ أَعْطَانِيهَا فَقَالَ \" هَلْ لَكَ بَنُونَ سِوَاهُ \" . قَالَ نَعَمْ . قَالَ \" سَوِّ بَيْنَهُمْ \" ."
  },
  "3687": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Presents",
    "book_num": "31",
    "reference": "Reference  : Sunan an-Nasa'i 3687\nIn-book reference  : Book 31, Hadith 16\nEnglish translation  : Vol. 4, Book 31, Hadith 3717",
    "url": "https://sunnah.com/nasai/31",
    "text": "أَخْبَرَنَا يَعْقُوبُ بْنُ سُفْيَانَ، قَالَ حَدَّثَنَا سُلَيْمَانُ بْنُ حَرْبٍ، قَالَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ حَاجِبِ بْنِ الْمُفَضَّلِ بْنِ الْمُهَلَّبِ، عَنْ أَبِيهِ، قَالَ سَمِعْتُ النُّعْمَانَ بْنَ بَشِيرٍ، يَخْطُبُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اعْدِلُوا بَيْنَ أَبْنَائِكُمُ اعْدِلُوا بَيْنَ أَبْنَائِكُمْ \" ."
  }
}