{
  "1454": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Shortening the Prayer When Traveling",
    "book_num": "15",
    "reference": "Reference  : Sunan an-Nasa'i 1454\nIn-book reference  : Book 15, Hadith 22\nEnglish translation  : Vol. 2, Book 15, Hadith 1455",
    "url": "https://sunnah.com/nasai/15",
    "text": "أَخْبَرَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ زَنْجَوَيْهِ، عَنْ عَبْدِ الرَّزَّاقِ، عَنِ ابْنِ جُرَيْجٍ، قَالَ أَخْبَرَنِي إِسْمَاعِيلُ بْنُ مُحَمَّدِ بْنِ سَعْدٍ، أَنَّ حُمَيْدَ بْنَ عَبْدِ الرَّحْمَنِ، أَخْبَرَهُ أَنَّ السَّائِبَ بْنَ يَزِيدَ أَخْبَرَهُ أَنَّهُ، سَمِعَ الْعَلاَءَ بْنَ الْحَضْرَمِيِّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَمْكُثُ الْمُهَاجِرُ بَعْدَ قَضَاءِ نُسُكِهِ ثَلاَثًا \" ."
  },
  "1455": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Shortening the Prayer When Traveling",
    "book_num": "15",
    "reference": "Reference  : Sunan an-Nasa'i 1455\nIn-book reference  : Book 15, Hadith 23\nEnglish translation  : Vol. 2, Book 15, Hadith 1456",
    "url": "https://sunnah.com/nasai/15",
    "text": "أَخْبَرَنَا أَبُو عَبْدِ الرَّحْمَنِ، قَالَ الْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، فِي حَدِيثِهِ عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ حُمَيْدٍ، عَنِ السَّائِبِ بْنِ يَزِيدَ، عَنِ الْعَلاَءِ بْنِ الْحَضْرَمِيِّ، قَالَ قَالَ النَّبِيُّ صلى الله عليه وسلم \" يَمْكُثُ الْمُهَاجِرُ بِمَكَّةَ بَعْدَ نُسُكِهِ ثَلاَثًا \" ."
  },
  "1456": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Shortening the Prayer When Traveling",
    "book_num": "15",
    "reference": "Reference  : Sunan an-Nasa'i 1456\nIn-book reference  : Book 15, Hadith 24\nEnglish translation  : Vol. 2, Book 15, Hadith 1457",
    "url": "https://sunnah.com/nasai/15",
    "text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى الصُّوفِيُّ، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا الْعَلاَءُ بْنُ زُهَيْرٍ الأَزْدِيُّ، قَالَ حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ الأَسْوَدِ، عَنْ عَائِشَةَ، أَنَّهَا اعْتَمَرَتْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم مِنَ الْمَدِينَةِ إِلَى مَكَّةَ حَتَّى إِذَا قَدِمَتْ مَكَّةَ قَالَتْ يَا رَسُولَ اللَّهِ بِأَبِي أَنْتَ وَأُمِّي قَصَرْتَ وَأَتْمَمْتُ وَأَفْطَرْتَ وَصُمْتُ . قَالَ \" أَحْسَنْتِ يَا عَائِشَةُ \" . وَمَا عَابَ عَلَىَّ ."
  },
  "1457": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Shortening the Prayer When Traveling",
    "book_num": "15",
    "reference": "Reference  : Sunan an-Nasa'i 1457\nIn-book reference  : Book 15, Hadith 25\nEnglish translation  : Vol. 2, Book 15, Hadith 1458",
    "url": "https://sunnah.com/nasai/15",
    "text": "أَخْبَرَنِي أَحْمَدُ بْنُ يَحْيَى، قَالَ حَدَّثَنَا أَبُو نُعَيْمٍ، قَالَ حَدَّثَنَا الْعَلاَءُ بْنُ زُهَيْرٍ، قَالَ حَدَّثَنَا وَبَرَةُ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ كَانَ ابْنُ عُمَرَ لاَ يَزِيدُ فِي السَّفَرِ عَلَى رَكْعَتَيْنِ لاَ يُصَلِّي قَبْلَهَا وَلاَ بَعْدَهَا . فَقِيلَ لَهُ مَا هَذَا قَالَ هَكَذَا رَأَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَصْنَعُ ."
  },
  "1458": {
    "collection": "Sunan an-Nasa'i",
    "book": "The Book of Shortening the Prayer When Traveling",
    "book_num": "15",
    "reference": "Reference  : Sunan an-Nasa'i 1458\nIn-book reference  : Book 15, Hadith 26\nEnglish translation  : Vol. 2, Book 15, Hadith 1459",
    "url": "https://sunnah.com/nasai/15",
    "text": "أَخْبَرَنِي نُوحُ بْنُ حَبِيبٍ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، قَالَ حَدَّثَنَا عِيسَى بْنُ حَفْصِ بْنِ عَاصِمٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، كُنْتُ مَعَ ابْنِ عُمَرَ فِي سَفَرٍ فَصَلَّى الظُّهْرَ وَالْعَصْرَ رَكْعَتَيْنِ ثُمَّ انْصَرَفَ إِلَى طِنْفِسَةٍ لَهُ فَرَأَى قَوْمًا يُسَبِّحُونَ قَالَ مَا يَصْنَعُ هَؤُلاَءِ قُلْتُ يُسَبِّحُونَ . قَالَ لَوْ كُنْتُ مُصَلِّيًا قَبْلَهَا أَوْ بَعْدَهَا لأَتْمَمْتُهَا صَحِبْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَكَانَ لاَ يَزِيدُ فِي السَّفَرِ عَلَى الرَّكْعَتَيْنِ وَأَبَا بَكْرٍ حَتَّى قُبِضَ وَعُمَرَ وَعُثْمَانَ - رضى الله عنهم - كَذَلِكَ ."
  }
}