{
  "1471": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1471u\nIn-book reference  : Book 18, Hadith 21\nUSC-MSA web (English) reference  : Book 9, Hadith 3490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "A hadith like this is reported on the same authority (but with this difference that the narrator) 'Abd al-Rahman b. Aiman (was mentioned) as the freed slave of 'Urwa (Imam Muslim said:\nHe made a mistake who said that it was 'Urwa; it was in fact the freed slave of 'Azza.)"
  },
  "1472": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1472c\nIn-book reference  : Book 18, Hadith 24\nUSC-MSA web (English) reference  : Book 9, Hadith 3493\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Abu al-Sahba' said to Ibn 'Abbas:\nEnlighten us with your information whether the three divorces (pronounced at one and the same time) were not treated as one during the lifetime of Allah's Messenger (ﷺ) and Abu Bakr. He said: It was in fact so, but when during the caliphate of 'Umar (Allah be pleased with him) people began to pronounce divorce frequently, he allowed them to do so (to treat pronouncements of three divorces in a single breath as one)."
  },
  "1473": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1473b\nIn-book reference  : Book 18, Hadith 26\nUSC-MSA web (English) reference  : Book 9, Hadith 3495\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Ibn Abbas (Allah be pleased with them) reported:\nWhen a man declares his wife unlawful for himself that is an oath which must be atoned, and he said: There is in the Messenger of Allah (ﷺ) a noble pattern for you."
  },
  "1474": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1474c\nIn-book reference  : Book 18, Hadith 29\nUSC-MSA web (English) reference  : Book 9, Hadith 3497\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "This hadith has been narrated on the authority of 'Urwa with the same chain of transmitters."
  },
  "1475": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1475\nIn-book reference  : Book 18, Hadith 30\nUSC-MSA web (English) reference  : Book 9, Hadith 3498\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "'A'isha (Allah be pleased with her) reported:\nWhen the Messenger of Allah (ﷺ) was commanded to give option to his wives, he started it from me saying: I am going to mention to you a matter which you should not (decide) in haste until you have consulted your parents. She said that he already knew that my parents would never allow me to seek separation from him She said: Then he said: Allah, the Exalted and Glorious, said: Prophet, say to thy wives: If you desire this world's life and its adornment, then come, I will give you a provision and allow you to depart a goodly departing; and if you desire Allah and His Messenger and the abode of the Hereafter, then Allah has prepared for the doers of good among you a great reward She is reported to have said: About what should I consult my parents, for I desire Allah and His Messenger and the abode of the Hereafter? She ('A'isha) said: Then all the wives of Allah's Messenger (ﷺ) did as I had done."
  },
  "1476": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1476b\nIn-book reference  : Book 18, Hadith 32\nUSC-MSA web (English) reference  : Book 9, Hadith 3499\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "The above hadith has likewise been narrated through another chain."
  },
  "1477": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1477f\nIn-book reference  : Book 18, Hadith 38\nUSC-MSA web (English) reference  : Book 9, Hadith 3505\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "A hadith like this has been transmitted on the authority of 'A'isha through another chain of narrators."
  },
  "1478": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1478\nIn-book reference  : Book 18, Hadith 39\nUSC-MSA web (English) reference  : Book 9, Hadith 3506\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:\nAbu Bakr (Allah be pleased with him) came and sought permission to see Allah's Messenger (ﷺ). He found people sitting at his door and none amongst them had been granted permission, but it was granted to Abu Bakr and he went in. Then came 'Umar and he sought permission and it was granted to him, and he found Allah's Apostle (ﷺ) sitting sad and silent with his wives around him. He (Hadrat 'Umar) said: I would say something which would make the Prophet (ﷺ) laugh, so he said: Messenger of Allah, I wish you had seen (the treatment meted out to) the daughter ofKhadija when you asked me some money, and I got up and slapped her on her neck. Allah's Messenger (mav peace be upon him) laughed and said: They are around me as you see, asking for extra money. Abu Bakr (Allah be pleased with him) then got up went to 'A'isha (Allah be pleased with her) and slapped her on the neck, and 'Umar stood up before Hafsa and slapped her saying: You ask Allah's Messenger (ﷺ) which he does not possess. They said: By Allah, we do not ask Allah's Messenger (ﷺ) for anything he does not possess. Then he withdrew from them for a month or for twenty-nine days. Then this verse was revealed to him:\" Prophet: Say to thy wives... for a mighty reward\" (xxxiii. 28). He then went first to 'A'isha (Allah be pleased with her) and said: I want to propound something to you, 'A'isha, but wish no hasty reply before you consult your parents. She said: Messenger of Allah, what is that? He (the Holy Prophet) recited to her the verse, whereupon she said: Is it about you that I should consult my parents, Messenger of Allah? Nay, I choose Allah, His Messenger, and the Last Abode; but I ask you not to tell any of your wives what I have said He replied: Not one of them will ask me without my informing her. God did not send me to be harsh, or cause harm, but He has sent me to teach and make things easy."
  },
  "1479": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1479e, 1475b\nIn-book reference  : Book 18, Hadith 44\nUSC-MSA web (English) reference  : Book 9, Hadith 3511\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported. I had always been anxious to ask 'Umar (Allah be pleased with him) about the two ladies amongst the wives of Allah's Prophet (may peace be upon Lim) about whom Allah, the Exalted, said:\n\" If you both turn in repentance to Allah, then indeed your hearts are inclined (to this)\" (Ixvi. 4), until 'Umar (Allah be pleased with him) set out for Hajj and I also went along with him. And as we were going along a path, 'Umar (Allah be pleased with hiyn) went aside and I also went aside with him with a jug (of water). He answered the call of nature, and then came to me and I poured water over his hands and he performed ablution I said: Commander of the Faithful, who are the two ladies amongst the wives of Allah's Prophet (ﷺ) about whom Allah, the Exalted and Majestic, said: 'If you both turn to Allah in repentance, then indeed your heart are inclined to it\"? 'Umar (Allah he pleased with him) said: How strange is it for you, Ibn 'Abbas! (Zuhri said: By Allah, he disliked what he asked about, but did not keep it a secret.) He ('Umar) said: They are Hafsa and 'A'isha; and he then began to narrate the hadith and said: We were such people among the Quraish who dominated women, and as we reached Medina we found there people who were dominated by their women, and our women began to learn (the habits) of their women. He further said: And my house was situated in the suburb of Aledina in the tribe of Banu Umayya b. Zaid. One day I became angry with my wife and she retorted upon me. I did not like that she should retort upon me. She said: You disapprove of my retorting upon you By Allah, the wives of Allah's Apostle (ﷺ) retort upon him, and one of them detaches herself from him for the day until the night. So I ('Umar) went out and visited Hafsa and said: Do you retort upon Allah's Messenger (ﷺ)? She said: Yes. I said; Does any one of you detach herself from him from the day to the night? She said: Yes. He said: She who did like it amongst you in fact failed and incurred loss. Does everyone amongst you not fear the wrath of Allah upon her due to the wrath of His Messenger (ﷺ), and (as a result thereof) she may perish? So do not retort upon Allah's Messenger (ﷺ) and do not ask him for anything, but ask me that which you desire, (and the frank behaviour) of your companion may not mislead you, if she is more graceful and is dearer to Allah's Messenger (ﷺ) than you (meaning 'A'isha) (Allah be pleased with her). He (Hadrat 'Umar further) said: I had a compalaion from the Ansar and, we used to remain in the company of the Messenger (ﷺ) turn by turn. He remained there for a day while I remained there on the other day, and he brought me the news about the revelation and other (matter), and I brought him (the news) like this. And we discussed that the Ghassanids were shoeing the horses in order to attack us. Id y companion once attended (the Apostle). and then came to me at night and knocked at my door and called me, and I came out to him, and he said: A matter of great importance has happened. I said: What is that? Have the Ghassanids come? He said: No, but even more serious and more significant than that: the Prophet (ﷺ) has divorced his wives. I said: Hafsa has failed and has incurred loss. and I feared that it would happen. When it was dawn I observed the dawn prayer and dressed myself, and then came there (in the house of the Holy Prophet) and visited Hafsa, and she was weeping. I said: Has Allah's Messenger (ﷺ) divorced you (all)? She said: I do not know. He has, however, separated himself in his attic. I came to a black servant and said to him: Seek permission for 'Umar. He went in and then came to me and said: I made mention of you to him, but he kept quiet. I then went to the pulpit and sat there, and there was a group of people sitting by it and some of then were weeping. I sat there for some time, until I was overpowered (by that very idea) which was in my mind. I then came back to the boy and said to him: Seek permission for Umar. He went in and came to me and said: I made mention of you to him but he kept quiet. I was about to turn back when the boy called me and said: Go in; permission has been granted to you. I went in and greeted Allah's Messenger (ﷺ) and he was reclining against the couch of mat and it had left its marks upon his side. I said: Messenger of Allah, have you divorced your wives? He raised his head towards me and said: No. I said: Allah is the Greatest. Messenger of Allah, I wish if you had seen how we the people of Quraish had domination over women but when we came to Medina we found people whom their women dominated. So our women began to learn from their women. One dily I became angry with my wife and she began to retort upon me. I did not approve that she should retort upon me. She said: You do not like that I should retort upon you, but, by Allah. the wives of Allah's Apostle (ﷺ) retort upon him and any one of them separates herself from him for a day until night. I said: He who did that amongst them in fact failed and incurred loss. Does any of them feel sate from the wrath of Allahupon her due to the wrath of Allah's Messenger (ﷺ), and she has certainly perished. Allah's Messtnger (ﷺ) smiled, I said: Messenger of Allah, I visited Hafsa and said: (The behaviour) of your companion ('A'isha) may not mislead you, If she is more graceful than you and is dearer to Allah's Messenger (ﷺ) than you. Allah's Messenger (ﷺ) smiled for the second time. I said: Allah's Messenger, way I talk to you about agreeable things? He said: Yes. I sat down and lifted my head (to see things) in the house and, by Allah, I did not see anything significant besides three hides. I said: Messenger of Allah, supplicate the Lord that He should make (life) prosperous for your Ummah as He has made plentiful for the people of Persia and Rome (in spite of the fact) that they do no, worship Allah, the Exalted and Majestic, whereupon he (Allah's Messenger) sat up an I then said: Ibn Khattab, do you doubt that they are a nation whom their nice things have been given immediately in the life of this world. I said: Allah's Messenger! seek pardon for me. And he (Allah's Messenger) had taken an oath that he would not visit them for a month due to extreme annoyance with them until Allah showed His displeasure to him (Allah's Messenger). Zuhri said: 'Urwa informed me that 'A'Isha (Allah be pleased with her) said: When twenty-nine nights were over, Allah's Messenger (ﷺ) visited me, and he began (his visit) with me. I said: Messenger of Allah, you had taken an oath that you would not visit us for a month, while you have visited after I have counted only twenty-nine (nights). Thereupon he said: The month may also be of twenty-nine (days). He then said: 'A'isha, I am going to talk to you about a matter, and you should not be hasty in it (and do not give your final decision) until you have consulted your parents. He then recited this verse to me:\" O Prophet, say to your wives\" till he reached\" mighty reward\" (xxxiii. 28). 'A'isha (Allah be pleased with her) said: By Allah, he knew that my parents would not allow me to separate from him. I said: Is there any need to consult my parents in this matter? I in fact choose Allah and His Messenger (ﷺ) and the abode in the Hereafter. Ma'mar said: Ayyub reported to me that 'A'isha said: Don't inform your wives that I have chosen you, whereupon Allah's Apostle (ﷺ) said: Verily Allah has sent me as a conveyer of message, and He has not sent me as a source of hardship (to others). Qatada said:\" Saghat qulubukum\" means\" Your hearts have inclined.\""
  },
  "1480": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1480t\nIn-book reference  : Book 18, Hadith 64\nUSC-MSA web (English) reference  : Book 9, Hadith 3530\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Fatima bint Qais (Allah be pleased with her) reported:\nMy husband divorced me with three pronouncements and Allah's Messenger (ﷺ) made no provision for lodging and maintenance allowance."
  },
  "1481": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1481c\nIn-book reference  : Book 18, Hadith 68\nUSC-MSA web (English) reference  : Book 9, Hadith 3534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Ibn al-Qasim narrated on the authority of his father that 'Urwa b. Zubair (Allah be pleased with him) said to 'A'isha (Allah be pleased with her):\nDidn't you see that such and such daughter of al-Hakam was divorced by her husband with an irrevocable divorce, and she left (the house of her husband)? Thereupon 'A'isha (Allah be pleased with her) said: It was bad that she did. He ( Urwa) said: Have you not heard the words of Fatima? Thereupon she said: There if no good for her in making mention of it."
  },
  "1482": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1482\nIn-book reference  : Book 18, Hadith 66\nUSC-MSA web (English) reference  : Book 9, Hadith 3532\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Fatima bint Qais (Allah be pleased with her) reported that she said:\nAllah's Messenger, my husband has divorcee me with three pronouncements and I am afraid that I may be put to hardship, and so he commanded her and so she moved (to another house)."
  },
  "1483": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1483\nIn-book reference  : Book 18, Hadith 69\nUSC-MSA web (English) reference  : Book 9, Hadith 3535\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:\nMy maternal aunt was divorced, and she intended to pluck her dates. A person scolded her for having come out (during the period of 'Idda). She came to Allah's Prophet (may peace be upon him.) and he said: Certainly you can pluck (dates) from your palm trees, for perhaps you may give charity or do an act of kindness."
  },
  "1484": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1484\nIn-book reference  : Book 18, Hadith 70\nUSC-MSA web (English) reference  : Book 9, Hadith 3536\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "'Ubaidullah b. 'Abdullah b. 'Utba (b. Mas'ud) reported that his father wrote to Umar b. 'Abdullah b al Arqam al-Zuhri that he would go to Subai'ah bint al-Hirith al-Aslamiyya (Allah be pleased with her) and ask her about a verdict from him which Allah's Messenger (ﷺ) gave her when she had asked that from him (in regard to the termination of 'Idda at the birth of a child) 'Umar b. Abdullah wrote to 'Abdullah b. 'Utba informing him that Subai'ah had told him that she had been married to Sa'd b. Khaula and he belonged to the tribe of Amir b. Lu'ayy, and was one of those who participated in the Battle of Badr, and he died in the Farewell Pilgrimage and she had been in the family way at that time. And much time had not elapsed that she gave birth to a child after his death and when she was free from the effects of childbirth she embellished herself for those who had to give proposals of marriage. Abd al-Sunabil b. Ba'kak (from Banu 'Abd al-Dar) came to her and said:\nWhat is this that I see you embellished; perhaps you are inclined to marry, By Allah, you cannot marry unless four months and ten days (of 'Idda are passed). When he said that. I dressed myself, and as it was evening I came to Allah's Messenger (ﷺ) and asked him about it, and he gave me a religious verdict that I was allowed to marry when I had given birth to a child and asked me to marry if I so liked. Ibn Shihab said: I do not find any harm fur her in marrying when she has given birth to a child even when she is bleeding (after the birth of the child) except that her husband should not go near her until she is purified."
  },
  "1485": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1485b\nIn-book reference  : Book 18, Hadith 72\nUSC-MSA web (English) reference  : Book 9, Hadith 3538\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "This hadith has been narated with the same chain of transrmitters except with a small change of words (and that is):\nThey sent him to Umm Salama, but no mention was made of Kuraib."
  },
  "1486": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1486d\nIn-book reference  : Book 18, Hadith 79\nUSC-MSA web (English) reference  : Book 9, Hadith 3544\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Zainab bint Abu Salama reported that when the news of the death of Abu Safyan came to Umm Habiba she sent for yellow (perfume) on the third day and rubbed it on her forearms and on her cheeks and said:\nI had in fact no need of it, but I heard Allah's Messenger (ﷺ) as saying: It is not permissible for the women believing in Allah and the Hereafter to abstain from adornment beyond three days except (at the death of) husband (in which case she must abstain from adornment) for four months and ten days."
  },
  "1487": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1487, 1488b\nIn-book reference  : Book 18, Hadith 75\nUSC-MSA web (English) reference  : Book 9, Hadith 3540\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "This hadith was narrated by Zainab from her mother and from Zainab, the wife of Allah's Apostle (ﷺ), or from some other lady from among the wives of the Prophet (ﷺ)."
  },
  "1488": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1488d\nIn-book reference  : Book 18, Hadith 77\nUSC-MSA web (English) reference  : Book 9, Hadith 3542\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Humaid b. Nafi' narrated two traditions from Umm Salama dealing with collyrium and the other hadith from the wives of Allah's Prophet (ﷺ) except with this that no mention was made of Zainab."
  },
  "1490": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1490d\nIn-book reference  : Book 18, Hadith 83\nUSC-MSA web (English) reference  : Book 9, Hadith 3548\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Safiyya bint Abu 'Ubaid narrated this tradition of Allah's Prophet (ﷺ) on the authority of some wives of Allah's Apostle (ﷺ)"
  },
  "1491": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1491\nIn-book reference  : Book 18, Hadith 84\nUSC-MSA web (English) reference  : Book 9, Hadith 3549\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:\nIt is not permissible for a woman believing in Allah and the Hereafter to observe mourning on the dead for more than three (days), except in case of her husband."
  },
  "938": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 938e\nIn-book reference  : Book 18, Hadith 87\nUSC-MSA web (English) reference  : Book 9, Hadith 3552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "Umm 'Atiyya ('Allah be pleased with her) said:\nWe were forbidden to observe mourning for the dead beyond three days except in the case of husband (where it is permissible) for four months and ten days, and (that during this period) we should neither use collyrium nor touch perfume, nor wear dyed clothes, but concession was given to a woman when one of us was purified of our courses to make use of a little incense or scent."
  }
}