{
  "2675": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2675j\nIn-book reference  : Book 50, Hadith 3\nUSC-MSA web (English) reference  : Book 37, Hadith 6612\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "This hadith has been narrated on the authority of Abu Huraira through another chain of transmitters."
  },
  "2744": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2744c\nIn-book reference  : Book 50, Hadith 6\nUSC-MSA web (English) reference  : Book 37, Hadith 6615\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "'Abdullah reported Allah's Messenger (ﷺ) as saying:\nAllah is more pleased with the repentance of a believing man. The rest of the hadith is the same."
  },
  "2745": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2745\nIn-book reference  : Book 50, Hadith 7\nUSC-MSA web (English) reference  : Book 37, Hadith 6616\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Nu'man b. Bashir reported:\nAllah is more pleased with the repentance of a believing servant than of a person who set out on a journey with a provision of food and drink on the back of his camel. He went on until he came to a waterless desert and he felt like sleeping. So he got down under the shade of a tree and was overcome by sleep and his camel ran away. As he got up he tried to see (the camel) standing upon a mound. but did not find it. He then got upon the other mound, but could not see anything. He then climbed upon the third mound but did not see anything until he came back to the place where he had been previously. And as he was sitting (in utter disappointment) there came to him the camel, till that (camel) placed its nosestring in his hand. Allah is more pleased with the repentance of His servant than the person who found (his lost camel) in this very state. Simak reported that Sha'bi was of the opinion that Nu'min traced it to Allah's Apostle (ﷺ). Simak, however, did not hear that himself."
  },
  "2746": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2746\nIn-book reference  : Book 50, Hadith 8\nUSC-MSA web (English) reference  : Book 37, Hadith 6617\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Al-Bara' b. 'Azib reported Allah's Messenger (ﷺ) as saying that Allah's Messenger (ﷺ) said:\nWhat is your opinion about the delight of a person whose camel loaded with the provisions of food and drink is lost and that moves about with its nosestring trailing upon the waterless desert in which there is neither food nor drink, and lie wanders about in search of that until he is completely exhausted and then accidentally it happens to pass by the trunk of a tree and its nosestring gets entangled in that and he finds it entangled therein? He (in response to the question of the Holy Prophet) said: Allah's Messenger, he would feel highly delighted. Thereupon Allah's Messenger (ﷺ) said. By Allah, Allah is more delighted at the repentance of His servant than that person (as he finds his lost) camel."
  },
  "2747": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2747b, c\nIn-book reference  : Book 50, Hadith 10\nUSC-MSA web (English) reference  : Book 37, Hadith 6619\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:\nAllah is more pleased with the repentance of His servant than if one of you gets up and he finds his camel missing in a waterless desert (and then he accidentally finds it). This hadith has been narrated on the authority of Anas b. Malik through another chain of transmitters."
  },
  "2748": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2748b\nIn-book reference  : Book 50, Hadith 12\nUSC-MSA web (English) reference  : Book 37, Hadith 6621\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Ayyub Ansari reported that Allah's Messenger (ﷺ) said:\nIf you were not to commit sins, Allah would have swept you out of existence and would have replaced you by another people who have committed sin, and then asked forgiveness from Allah, and He would have granted them pardon."
  },
  "2749": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2749\nIn-book reference  : Book 50, Hadith 13\nUSC-MSA web (English) reference  : Book 37, Hadith 6622\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) having said:\nBy Him in Whose Hand is my life, if you were not to commit sin, Allah would sweep you out of existence and He would replace (you by) those people who would commit sin and seek forgiveness from Allah, and He would have pardoned them."
  },
  "2750": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2750c\nIn-book reference  : Book 50, Hadith 16\nUSC-MSA web (English) reference  : Book 37, Hadith 6625\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Hanzala Taimi Ufayyidi, the scribe of Allah's Messenger (ﷺ), reported:\nWe were in the presence of Allah's Messenger (ﷺ) and he brought to our minds the problems pertaining to Paradise and Hell-Fire. The rest of the hadith is the same."
  },
  "2751": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2751c\nIn-book reference  : Book 50, Hadith 19\nUSC-MSA web (English) reference  : Book 37, Hadith 6628\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nWhen Allah created the creation, He ordained for Himself and this document is with Him: Verily, My mercy predominates Mv wrath."
  },
  "2752": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2752c\nIn-book reference  : Book 50, Hadith 22\nUSC-MSA web (English) reference  : Book 37, Hadith 6631\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThere are one hundred (parts of) mercy for Allah and He has sent down out of these one part of mercy upon the jinn and human beings and animals and the insects, and it is because of this (one part) that they love one another, show kindness to one another and even the beast treats its young one with affection, and Allah has reserved ninety nine parts of mercy with which He would treat His servants on the Day of Resurrection."
  },
  "2753": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2753c\nIn-book reference  : Book 50, Hadith 25\nUSC-MSA web (English) reference  : Book 37, Hadith 6634\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Salman reported that Allah's Messenger (ﷺ) said:\nVerily, Allah created, on the same very day when He created the heavens and the earth, one hundred parts of mercy. Every part of mercy is coextensive with the space between the heavens. and the earth and He out of this mercy endowed one part to the earth and it is because of this that the mother shows affection to her child and even the beasts and birds show kindness to one another and when there would be the Day of Resurrection, Allah would make full (use of Mercy)."
  },
  "2754": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2754\nIn-book reference  : Book 50, Hadith 26\nUSC-MSA web (English) reference  : Book 37, Hadith 6635\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "'Umar b. Khattab reported that there were brought some prisoners to Allah's Messenger (ﷺ) amongst whom there was also a woman, who was searching (for someone) and when she found a child amongst the prisoners, she took hold of it, pressed it against her chest and provided it suck. Thereupon Allah's Messenger (ﷺ) said:\nDo you think this woman would ever afford to throw her child in the Fire? We said: By Allah, so far as it lies in her power, she would never throw the child in Fire. ' Thereupon Allah's Messenger (ﷺ) said: Allah is more kind to His servants than this woman is to her child."
  },
  "2755": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2755\nIn-book reference  : Book 50, Hadith 27\nUSC-MSA web (English) reference  : Book 37, Hadith 6636\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "'Ala' reported on the authority of his father who reported on the authority of Abu Huraira that Allah's Messenger (ﷺ) said:\nIf a believer were to know the punishment (in Hell) none would have the audacity to aspire for Paradise (but he would earnestly desire to be rescued from Hell), and if a non-believer were to know what is there with Allah as a mercy. none would have been disappointed in regard to Paradise."
  },
  "2756": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2756c\nIn-book reference  : Book 50, Hadith 30\nUSC-MSA web (English) reference  : Book 37, Hadith 6639\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying that a servant transgressed the litnit in committing sins. The rest of the hadith is the same but there is no mention of the story of the cat in it and in the hadith transmitted on the authority of Ziibaidl (the words are):\n\" Allah, the Exalted and Glorious, said to everything which had taken a part of lies ashes to return what it had taken.\""
  },
  "2757": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2757b\nIn-book reference  : Book 50, Hadith 32\nUSC-MSA web (English) reference  : Book 37, Hadith 6641\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "This hadith has been narrated on the authority of Shu'ba with the chain of transmitters but with a slight variation of wording and Qatada explained the word\" lam yasiru\" as:\n\" I find no good in store for rxie in the eye of Allah.\""
  },
  "2758": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2758c\nIn-book reference  : Book 50, Hadith 35\nUSC-MSA web (English) reference  : Book 37, Hadith 6643\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Huraira reported lie heard Allah's Messenger (ﷺ) as saying that a servant committed a sin. The rest of the hadith is the same, but there is a slight variation of wording."
  },
  "2759": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2759a, b\nIn-book reference  : Book 50, Hadith 36\nUSC-MSA web (English) reference  : Book 37, Hadith 6644\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Musa reported Allah's Messenger (ﷺ) as saying that Allah, the Exalted and Glorious, Stretches out His Hand during the night so that the people may repent for the fault committed from dawn till dusk and He stretches out His Hand during the day so that the people may repent for the fault committed from dusk to dawn. (He would accept repentance) before the sun rises in the west (before the Day of Resurrection). A hadith like this has been narrated on the authority of Shu'ba with the same chain of transmitters."
  },
  "2760": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2760d\nIn-book reference  : Book 50, Hadith 40\nUSC-MSA web (English) reference  : Book 37, Hadith 6648\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abdullah b. Mas'ud reported that Allah's Messenger (ﷺ) said:\nNone loves one's own praise more than Allah, the Exalted and Glurious, does. It is because of this that He has praised Himself, and none is more self-respecting than Allah and it is because of this that He has prohibited abominable acts and there is none who is more anxious to accept the apologies of the people than Allah Himself and it is because of this that He has revealed the Book and sent the Messengers."
  },
  "2761": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2761d\nIn-book reference  : Book 50, Hadith 46\nUSC-MSA web (English) reference  : Book 37, Hadith 6654\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "This hadith has been narrated on the authority of Shu'ba through another chain of transmitters."
  },
  "2762": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2762b\nIn-book reference  : Book 50, Hadith 44\nUSC-MSA web (English) reference  : Book 37, Hadith 6652\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Asma' reported that Allah's Apostle (ﷺ) said:\nThere is none more self-respecting than Allah, the Exalted and Glorious."
  },
  "2763": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2763e\nIn-book reference  : Book 50, Hadith 51\nUSC-MSA web (English) reference  : Book 37, Hadith 6659\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "This hadith has been transmitted by Abu al-Ahwas and in this (these words are) also found:\nMu'adh said: Allah's Messenger, does it concern this particular case or to all of us? And he (the Holy Prophet) said: Of course, to all of you."
  },
  "2764": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2764\nIn-book reference  : Book 50, Hadith 52\nUSC-MSA web (English) reference  : Book 37, Hadith 6660\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Anas reported that a person came to Allah's Apostle (ﷺ) said:\nAllah's Messenger, I have committed an offence which deserves imposition of haad, so impose it upon me according to the Book of Allah. Thereupon he said: Were you not present with us at the time of prayer? He said: Yes. Thereupon he said: You have been granted pardon."
  },
  "2765": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2765\nIn-book reference  : Book 50, Hadith 53\nUSC-MSA web (English) reference  : Book 37, Hadith 6661\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Umama reported:\nWe were sitting in the mosque in the company of Allah's Messenger (ﷺ). A person came there and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. Allah's Messenger (ﷺ) kept silent. He repeated it and said: Allah's Messenger, I have committed an offence which deserves the imposition of hadd upon me, so impose it upon me. He (the Holy Prophet) kept silent, and it was at this time that Iqama was pronounced for prayer (and the prayer was observed). And when Allah's Apostle (ﷺ) had concluded the payer that person followed Allah's Messenger (ﷺ). Abu Umama said: I too followed Allah's Messenger (ﷺ) after he had concluded the prayer, so that I should know what answer he would give to that person. That person remained attached to Allah's Messenger (ﷺ) and said: Allah's Messenger, I have committed an offence which deserves imposition of hadd upon me, so impose it upon me. Abu Umama reported that Allah's Messenger (ﷺ) said to him: Didn't you see that as you got out of the house, you performed ablution perfectly well. He said: Allah's Messenger, of course. I did it. He again said to him: Then you observed prayer along with us. He said: Allah's Messenger, yes, it is so. Thereupon Allah's Messenger (ﷺ) said to him: Verily, Allah has exempted you from the imposition of hadd, or he said. From your sin."
  },
  "2766": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2766c\nIn-book reference  : Book 50, Hadith 56\nUSC-MSA web (English) reference  : Book 37, Hadith 6664\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "This hadith has been narrated on the authority of Qatida with the same chain of transmitters but (with this variation of wording):\n\" Allah commanded the earth (from where) he wanted to come out to move itself away and to the other earth (where he wanted to go) to draw nearer.\""
  },
  "2767": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2767d\nIn-book reference  : Book 50, Hadith 60\nUSC-MSA web (English) reference  : Book 37, Hadith 6668\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Abu Burda reported Allah's Messenger (ﷺ) as saying:\nThere would come people amongst the Muslims on the Day of Resurrection with as heavy sins as a mountain, and Allah would forgive them and He would place in their stead the Jews and the Christians. (As far as I think), Abu Raub said: I do not know as to who is in doubt. Abu Burda said: I narrated it to 'Umar b. 'Abd al-'Aziz, whereupon he said: Was it your father who narrated it to you from Allah's Apostle (ﷺ)? I said: Yes."
  },
  "2768": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2768\nIn-book reference  : Book 50, Hadith 61\nUSC-MSA web (English) reference  : Book 37, Hadith 6669\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Safwan b. Muhriz reported that a person said to Ibn 'Umar:\nHow did you hear Allah's Messenger (ﷺ) as saying something about intimate conversation? He said: I heard him say: A believer will be brought to his Lord, the Exalted and Glorious, on the Day of Resurrection and He would place upon him His veil (of Light) and make him confess his faults and say: Do you recognise (your faults)? He would say: My Lord, I do recognise (them). He (the Lord) would say: I concealed them for you in the world. And today I forgive them. And he would then be given the Book containing (the account of his) good deeds. And so far as the non-believers and hypocrites are concerned, there would be general announcement about them before all creation telling them that these (people, i. e. non-believers and hypocrites) told a lie about Allah."
  },
  "2769": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2769d\nIn-book reference  : Book 50, Hadith 64\nUSC-MSA web (English) reference  : Book 37, Hadith 6672\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "It is reported on the authority of Abdullah b. K'ab and he was the guide of Ka'b as he lost his eyesight and he was the greatest scholar amongst his people and he retained in his mind many ahadith of the Companions of Allah's Messenger (ﷺ). He said:\nI heard my father Ka'b b. Malik, and he fas one of those three whose repentance was accepted (by Allah). He transmitted that He never lagged behind Allah's Messenger (ﷺ) from any expedition that he undertook except two expeditions; the rest of the hadith is the same, and in the tradition narrated through another chain of transmitters the words are:\" That Allah's Messenger (ﷺ) set out on an expedition with a large number of persons more than ten thousand and this could not be recorded in the census register.\""
  },
  "2770": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2770c\nIn-book reference  : Book 50, Hadith 67\nUSC-MSA web (English) reference  : Book 37, Hadith 6675\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "'A'Isha reported:\nWhen I came under discussion what the people had to say about me, Allah's Messenger (ﷺ) stood up for delivering an address and he recited tashahhud (I bear witness to the fact that iheie is no god but Allah) and praised Allah, lauded Him what He rightly deserves and then said: Coming to the point. Give me an advice about them who have brought false charge about my family. By Allah, I know no evil in the members of my family and the person in connection with whom the false charge is being levelled, I know no evil in him too. And he never entered my house but in my presence and when I was away on a journey, he remained with me even in that. The rest of the hadith is the same but with this change that Allah's Messenger (ﷺ) came to my house and asked my maidservant and she said: By Allah, I know no fault in her but this that she sleeps, and goat comes and eats the kneaded flour. Some of the Companions (of the Holy Prophet) scolded her and said: State the fact before Allah's Messenger (ﷺ) and they even made a pointed reference (to this incident). She said: gallowed be Allah. By Allah, I know about her as does the jeweller know about the pure piece of gold. And when this news reached the person in connection with whom the allegation was made he said: Hallowed be Allah. By Allah, I have never unveiled any woman. 'A'isha said: He fell as a martyr in the cause of Allah, and there is this addition in this hadith that the people who had brought false allegation amongst them were Mistah and Hamna and Hassan. And so far as the hypocrite 'Abdullah b. Ubayy is concerned, he was one who tried his best to gather the false news and then gave them the wind. And he was in fact a fabricator and there was Hamna, daughter of Jahsh with him."
  },
  "2771": {
    "collection": "Sahih Muslim",
    "book": "The Book of Repentance",
    "book_num": "50",
    "reference": "Reference  : Sahih Muslim 2771\nIn-book reference  : Book 50, Hadith 68\nUSC-MSA web (English) reference  : Book 37, Hadith 6676\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/50",
    "text": "Anas reported that a person was charged with fornication with the slavegirl of Allah's Messenger (ﷺ). Thereupon Allah's Messenger (ﷺ) said to 'Ali:\nGo and strike his neck. 'Ali came to him and he found him in a well making his body cool. 'Ali said to him: Come out, and as he took hold of his hand and brought him out, he found that his sexual organ had been cut. Hadrat 'Ali refrained from striking his neck. He came to Allah's Apostle (ﷺ) and said: Allah's Messenger, he has not even the sexual organ with him."
  }
}