{
  "901": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 901g\nIn-book reference  : Book 10, Hadith 8\nUSC-MSA web (English) reference  : Book 4, Hadith 1972\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "This hadith is narrated thus on the authority of 'A'isha through another chain of transmitters:\n\" The Messenger of Allah (ﷺ) observed six ruku's and four prostration in (two rak'ahs).\""
  },
  "902": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 902b\nIn-book reference  : Book 10, Hadith 6\nUSC-MSA web (English) reference  : Book 4, Hadith 1971\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Zuhri said:\nKathir b. Abbas used to narrate that Ibn 'Abbas used to relate about the prayer of the Messenger of Allah (ﷺ) in regard to the eclipse of the sun like that what was narrated by 'Urwa on the authority of 'A'isha."
  },
  "903": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 903b\nIn-book reference  : Book 10, Hadith 10\nUSC-MSA web (English) reference  : Book 4, Hadith 1974\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "This hadith has been narrated by Yahya b. Sa'id with the same chain of transmitters."
  },
  "904": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 904c\nIn-book reference  : Book 10, Hadith 12\nUSC-MSA web (English) reference  : Book 4, Hadith 1976\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Jabir reported that the sun eclipsed during the lifetime of the Messenger of Allah (ﷺ) on that very day when Ibrahim (the Prophet's son) died. The Apostle of Allah (ﷺ) stood up and led people in (two rak'ahs of) prayer with six ruku's and four prostrations. He commenced (the prayer) with takbir (Allah-o-Akbar) and then recited and prolonged his recital. He then bowed nearly the (length of time) that he stood up. He then raised his head from the ruku' and recited but less than the first recital. He then bowed (to the length of time) that he stood up. He then raised his head from the ruku' and again recited but less than the second recital. He then bowed (to the length of time) that he stood up. He then lifted his head from the ruku'. He then fell in prostration and observed two prostrations. He stood up and then bowed, observing six ruku's like it, without (completing) the rak'ah in them, except (this difference) that the first (qiyam of ruku') was longer than the later one, and the ruku' was nearly (of the same length) as prostration. He then moved backward and the rows behind him also moved backward till we reached the extreme (Abu Bakr said:\ntill he reached near the women) He then moved forward and the people also moved forward along with him till he stood at his (original) place (of worship). He then completed the prayer as it was required to complete and the sun brightened and he said: O people! verily the sun and the moon are among the signs of Allah and they do not eclipse at the death of anyone among people (Abu Bakr said: On the death of any human being). So when you see anything like it (of the nature of eclipse), pray till it is bright. There is nothing which you have been promised (in the next world) but I have seen it in this prayer of mine. Hell was brought to me as you saw me moving back on account of fear lest its heat might affect me; and I saw the owner of the curved staff who dragged his intestines in the fire, and he used to steal (the belongings) of the pilgrims with his curved staff. If he (the owner of the staff) became aware, he would say: It got (accidentally) entangled in my curved staff, but if he was unaware of that, he would take that away. I also saw in it (in Hell) the owner of a cat whom she had tied and did not feed her nor set her free so that she could eat the creatures of the earth, till the cat died of starvation. Paradise was brought to me, and it was on that occasion that you saw me moving forward till I stood at my place (of worship). I stretched my hand as I wanted to catch hold of its fruits so that you may see them. Then I thought of not doing it. Nothing which you have been promised was there that I did not see in this prayer of mine."
  },
  "905": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 905b, c\nIn-book reference  : Book 10, Hadith 14\nUSC-MSA web (English) reference  : Book 4, Hadith 1978\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Asma' said:\nI came to 'A'isha when the people were standing (in prayer) and she was also praying. I said: What is this excitement of the people for? And the rest of the hadith was narrated like one, (narrated above). 'Urwa said: Do not say Kasafat-ush-Shamsu, but say Khasafat-ush-Shamsu."
  },
  "906": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 906c\nIn-book reference  : Book 10, Hadith 17\nUSC-MSA web (English) reference  : Book 4, Hadith 1981\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Asma' daughter of Abu Bakr reported:\nThe sun eclipsed during the lifetime of the Messenger of Allah (ﷺ) ; so he felt perturbed and he, by mistake, took hold of the outer garment of a woman till he was given his own cloak. After this I satisfied my need and then came and entered the mosque. I saw the Messenger of Allah (ﷺ) standing in prayer. I stood along with him. He prolonged his qiyam till I wished to sit down. Then I cast a glance towards an old woman. So I said: She is older than I. I, therefore, kept standing. He (the Holy Prophet) then observed ruku', and prolonged his ruku'. He then raised his head. He then prolonged his qiyam to such an extent that if a person happened to come he would have thought that he had not observed the ruku'."
  },
  "907": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 907b\nIn-book reference  : Book 10, Hadith 19\nUSC-MSA web (English) reference  : Book 4, Hadith 1983\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters except with this difference that he (the narrator said):\n\" then we saw you keeping aloof (back).\""
  },
  "908": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 908\nIn-book reference  : Book 10, Hadith 20\nUSC-MSA web (English) reference  : Book 4, Hadith 1984\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Ibn 'Abbas reported:\nWhen there was a solar eclipse the Messenger of Allah (way peace be upon him) observed eight ruku's and four prostrations (in two rak'ahs). This has been narrated by 'Ali also."
  },
  "909": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 909\nIn-book reference  : Book 10, Hadith 21\nUSC-MSA web (English) reference  : Book 4, Hadith 1985\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Ibn 'Abbas reported:\nThe Apostle of Allah (ﷺ) observed prayer while it was (solar) eclipse. He recited (the Qur'an in qiyam) and then bowed. He again recited and again bowed. He again recited and again bowed and again recited and again bowed, and then prostrated; and the second (rak'ah) was like this."
  },
  "910": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 910\nIn-book reference  : Book 10, Hadith 22\nUSC-MSA web (English) reference  : Book 4, Hadith 1986\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "'Amr b. al-'As reported:\nWhen the sun eclipsed during the lifetime of the Messenger of Allah (ﷺ), they (the people) were called to congregational prayers. The Messenger of Allah (ﷺ) observed two ruku's in one rak'ah. He then stood and observed two ruku's in (the second) rak'ah. The sun then became bright, and 'A'isha said; Never did I observe, ruku' and prostration longer than this (ruku' and prostration)."
  },
  "911": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 911c\nIn-book reference  : Book 10, Hadith 25\nUSC-MSA web (English) reference  : Book 4, Hadith 1989\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "This hadith has been narrated on the authority of Isma'il with the same chain of transmitters and in the hadith narrated by Sufyan and Waki' (the words are):\n\" The sun eclipsed on the day when Ibrahim died, and the people said: It has eclipsed on the death of Ibrahim.\""
  },
  "912": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 912\nIn-book reference  : Book 10, Hadith 26\nUSC-MSA web (English) reference  : Book 4, Hadith 1990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Abu Musa reported:\nThe sun eclipsed during the time of the Messenger of Allah (ﷺ). He stood in great anxiety fearing that it might be the Doomsday, till he came to the mosque. He stood up to pray with prolonged qiyam, ruku', and prostration which I never saw him doing in prayer; and then he said: These are the signs which Allah sends, not on account of the death of anyone or life of any one, but Allah sends them to frighten thereby His servants. So when you see any such thing, hasten to remember Him, supplicate Him and beg pardon from Him, and in the narration transmitted by Ibn 'Ala the words are:\" The sun eclipsed\".\"\" He frightens His servants.\""
  },
  "913": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 913c\nIn-book reference  : Book 10, Hadith 29\nUSC-MSA web (English) reference  : Book 4, Hadith 1993\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "'Abd al-Rahman b. Samura reported:\nI was shooting some of my arrows during the lifetime of the Messenger of Allah (ﷺ) that the sun eclipsed. The rest of the hadith is the same."
  },
  "914": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 914\nIn-book reference  : Book 10, Hadith 30\nUSC-MSA web (English) reference  : Book 4, Hadith 1994\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "'Abdullah b. 'Umar reported that the Messenger of Allah (ﷺ) observed:\nVerily the sun and the moon do not eclipse on account of the death or life of anyone. They are in fact the signs among the signs of Allah. So when you see them, observe prayer."
  },
  "915": {
    "collection": "Sahih Muslim",
    "book": "The Book of Prayer - Eclipses",
    "book_num": "10",
    "reference": "Reference  : Sahih Muslim 915\nIn-book reference  : Book 10, Hadith 31\nUSC-MSA web (English) reference  : Book 4, Hadith 1995\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/10",
    "text": "Ziyad b. 'Ilaqa reported:\nI heard Mughira b. Shu'ba saying that the sun eclipsed during the lifetime of the Messenger of Allah (ﷺ) on the day when Ibrahim died. Upon this the Messenger of Allah (ﷺ) said: Verily the sun and the moon are the two signs among the signs of Allah. They do not eclipse on account of the death of anyone or on account of the birth of anyone. So when you see them, supplicate Allah, and observe prayer till it is over."
  }
}