{
  "1177": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1177c\nIn-book reference  : Book 15, Hadith 3\nUSC-MSA web (English) reference  : Book 7, Hadith 2649\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Umar reported that the Messenger of Allah (ﷺ) forbade the Muhrim to put on a cloth dyed in saffron or wars and he further said:\nOne who does not find shoes (to wear) he may wear stockings, but (only) after trimming them below the ankles."
  },
  "1178": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1178c\nIn-book reference  : Book 15, Hadith 6\nUSC-MSA web (English) reference  : Book 7, Hadith 2652\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of 'Amr b. Dinar with the same chain of transmitters, but none of them (the narrators) made a mention that he (the Holy Prophet) was delivering address at 'Arafat except Shu'ba."
  },
  "1179": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1179\nIn-book reference  : Book 15, Hadith 7\nUSC-MSA web (English) reference  : Book 7, Hadith 2653\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nHe who does not find shoes to wear may wear socks, and he who does not find lower garment to wear may put on trousers."
  },
  "1180": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1180e\nIn-book reference  : Book 15, Hadith 12\nUSC-MSA web (English) reference  : Book 7, Hadith 2658\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ya'la reported:\nWe were with the Messenger of Allah (ﷺ) that a person came to him with a cloak on him having the traces of scent. He said, Messenger of Allah, I put on Ihram for 'Umra: what should I do? He (the Holy Prophet) kept quiet and did not make him any reply. And 'Umar screened him and it was (usual) with 'Umar that when the revelation descended upon him, he provided him shade (with the help of a piece of cloth). I (the person who came to the Holy Prophet) said: I said to 'Umar I wish to project my head into the cloth (to see how the Prophet receives revelation). So when the revelation began to descend upon him 'Umar wrapped him (the Holy Prophet) with cloth I came to him and projected my head with him into the cloth, and saw him (the Holy Prophet) (receiving the revelation). When he (the Holy Prophet) was relieved (of its burden), he said: Where is the inquirer who was just inquiring about 'Umra? That man came to him. Thereupon he (the Messenger of Allah) said: Take off the cloak from (your body) and wash the traces of perfume which were upon you, and do in 'Umra what you did in Hajj."
  },
  "1181": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1181b\nIn-book reference  : Book 15, Hadith 14\nUSC-MSA web (English) reference  : Book 7, Hadith 2660\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) specified Dhu'l-Hulaifa for the people of Medina; Juhfa for the people of Syria, Qarn al-Manazil for the people of Najd, Yalamlam for the people of Yemen (as their respective Mawaqit), and he also said:\nThese are (Mawaqit) of them too (who live there) and everyone who comes from outside (through) their (directions) for the sake of Hajj and 'Umra and for those who live within (those bounds their Miqat is that) from which they commenced (their journey), and for the people of Mecca, Mecca itself is (the Miqat)."
  },
  "1182": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1182d\nIn-book reference  : Book 15, Hadith 18\nUSC-MSA web (English) reference  : Book 7, Hadith 2664\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Umar (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) had commanded the people of Medina to enter upon the state of Ihram at Dhu'l-Hulaifa; the people of Syria at Juhfa; the people of Najd at Qarn (al-Manazil). 'Abdullah b. 'Umar (Allah be pleased with them) said:\nI was informed that he said that the people of Yemen should enter upon the state of Ihram at Yalamlam."
  },
  "1183": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1183b\nIn-book reference  : Book 15, Hadith 20\nUSC-MSA web (English) reference  : Book 7, Hadith 2666\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Zubair heard Jabir b. 'Abdullah (Allah be pleased with them) as saying as he was asked about (the place for entering upon the) state of Ihram:\nI heard (and I think he carried it directly to the Messenger of Allah) him saying: For the people of Medina Dhu'l-Hulaifa is the place for entering upon the state of Ihram, and for (the people coming through the other way, i.e. Syria) it is Juhfa; for the people of Iraq it is Dhat al-'Irq; for the people of Najd it is Qarn (al-Manazil) and for the people of Yemen it is Yalamlam."
  },
  "1184": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1184d\nIn-book reference  : Book 15, Hadith 24\nUSC-MSA web (English) reference  : Book 7, Hadith 2670\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. 'Umar (Allah be pleased with them) reported:\nI heard the Messenger of Allah (ﷺ) pronouncing Talbiya with compacted hair: Here I am at Thy service. O Allah: here I am at Thy service; here I am at Thy service. There is no associate with Thee; here I am at Thy service. Verily all praise and grace is due to Thee and the Sovereignty (too). There is no associate with Thee; and he did not make any addition to these words. 'Abdullah b. 'Umar (Allah be pleased with them) (further) said: The Messenger of Allah (ﷺ) used to offer two rak'ahs of prayer at Dhu'l-Hulaifa and then when his camel stood up with him on its back near the mosque at Dhu'l-Hulaifa, he pronounced these words (of Talbiya). And 'Abdullah b. 'Umar (Allah be pleased'with them) said that 'Umar b. Khattab (Allah be pleased with him) pronounced, the Talbiya of the Messenger of Allah (ﷺ) in these words of his (Prophet's words) and said: Here I am at Thy service, O Lord; here I am at Thy service, ready to obey Thee, and good is in Thy Hand, Here I am at Thy service. Unto Thee is the petition and deed (is also for Thee)."
  },
  "1185": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1185\nIn-book reference  : Book 15, Hadith 25\nUSC-MSA web (English) reference  : Book 7, Hadith 2671\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported that the polytheists also pronounced (Talbiya) as:\nHere I am at Thy service, there is no associate with Thee. The Messenger of Allah (ﷺ) said: Woe be upon them, as they also said: But one associate with Thee, you possess mastery over him, but he does not possess mastery (over you). They used to say this and circumambulate the Ka'ba."
  },
  "1186": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1186b\nIn-book reference  : Book 15, Hadith 27\nUSC-MSA web (English) reference  : Book 7, Hadith 2673\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Salim reported that when it was said to Ibn 'Umar (Allah be pleased with them) that the state of Ihram (commences from)a al-Baida' he said:\nAl-Baida', you attribute lie about it to the Messenger of Allah (ﷺ). And the Messenger of Allah (ﷺ) did not enter upon the state of Ihram but near the tree when his camel stood up with him."
  },
  "1187": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1187e\nIn-book reference  : Book 15, Hadith 32\nUSC-MSA web (English) reference  : Book 7, Hadith 2678\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. 'Umar reported:\nI saw the Messenger of Allah (ﷺ) riding on his camel at Dhu'l-Hulaifa and pronouncing Talbiya as it stood up with him."
  },
  "1188": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1188\nIn-book reference  : Book 15, Hadith 33\nUSC-MSA web (English) reference  : Book 7, Hadith 2679\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. 'Umar (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) spent the night at Dhu'l-Hulaifa while commencing (the rites of) Pilgrimage and he observed prayer in the mosque."
  },
  "1189": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1189h\nIn-book reference  : Book 15, Hadith 41\nUSC-MSA web (English) reference  : Book 7, Hadith 2687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'A'isha (Allah be pleased with her) reported:\nI applied the best available perfume I could find to the Messenger of Allah (ﷺ) before he entered upon the state of Ihram and after he was free from it."
  },
  "1190": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1190i\nIn-book reference  : Book 15, Hadith 50\nUSC-MSA web (English) reference  : Book 7, Hadith 2696\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated by 'Ubaidullah with the same chain of transmitters."
  },
  "1191": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1191\nIn-book reference  : Book 15, Hadith 51\nUSC-MSA web (English) reference  : Book 7, Hadith 2697\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'A'isha (Allah be pleased with her) reported:\nI used to perfume the Messenger of Allah (ﷺ) with a perfume containing musk before entering upon the state of Ihram and on the day of sacrifice (10th of Dhu'l-Hijja) and (at the conclusion of Ihram) before circumambulating the House (for Tawaf-i-Ifada)."
  },
  "1192": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1192c\nIn-book reference  : Book 15, Hadith 54\nUSC-MSA web (English) reference  : Book 7, Hadith 2700\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Muhammad b. al-Muntashir reported on the authority of his father:\nI heard from Ibn 'Umar having said this:\" It is dearer to me to rub tar (on my body) than to enter upon the state of Ihram (in a state) of shaking off the perfume.\" He (the narrator) said: I went to 'A'isha and told her about this statement of his (of Ibn 'Umar). Thereupon she said: I applied perfume to the Messenger of Allah (ﷺ) and he then went round his wives and then entered upon the state of Ihram in the morning."
  },
  "1193": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1193c\nIn-book reference  : Book 15, Hadith 57\nUSC-MSA web (English) reference  : Book 7, Hadith 2703\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "It is narrated on the authority of Zuhri with the same chain of transmitters (the narrator having) said this:\n\" I presented to him the flesh of a wild ass.\""
  },
  "1194": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1194b\nIn-book reference  : Book 15, Hadith 59\nUSC-MSA web (English) reference  : Book 7, Hadith 2705\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "The narration transmitted by Hakam (the words are):\nAl-Sa'b b. Jaththama presented to the Messenger of Allah (ﷺ) the leg of a wild ass. And in the narration transmitted by Shu'ba (the words are): (He presented to him) the rump of a wild ass as the blood was trickling from it. In the narration transmitted by Shu'ba on the authority of Habib (the words are): A part of a wild ass was presented to the Apostle (may peace he upon him) and he returned it to him (who presented it)."
  },
  "1195": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1195\nIn-book reference  : Book 15, Hadith 60\nUSC-MSA web (English) reference  : Book 7, Hadith 2706\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Tawus reported on the authority of Ibn 'Abbas (Allah be pleased with them) that Zaid b. Arqam went to him (Ibn 'Abbas) and said:\nNarrate how you informed me about the meat of the game presented to the Messenger of Allah (ﷺ) as he was in the state of Ihram. Thereupon he said: He was presented with a slice of the meat of game, but he returned it to him (who presented it) saying: We are not going to eat it, as we are in the state of Ihram."
  },
  "1196": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1196i\nIn-book reference  : Book 15, Hadith 69\nUSC-MSA web (English) reference  : Book 7, Hadith 2715\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. Abi Qatada reported that Abu Qatada was among the party of those who had entered upon the state of Ihram whereas he was not. The rest of the hadith is the same (and herein it is also narrated):\n\" He (the Holy Prophet) said: Did any person among you point to him (to hunt) or command him (in any form)? They said: Messenger of Allah, not at all. Thereupon he said: Then eat it.\""
  },
  "1197": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1197\nIn-book reference  : Book 15, Hadith 70\nUSC-MSA web (English) reference  : Book 7, Hadith 2716\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "`Abd al-Rahman b. `Uthman Taimi reported on the authority of his father:\nWhile we were with Talha b. Ubaidullah and were in the state of Ihram we were presented a (cooked) bird. Talha was sleeping. Some of us ate it and some of us refrained from (eating) it. When Talha awoke he agreed with him who ate it, and said: We ate it along with the Messenger of Allah (ﷺ)."
  },
  "1198": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1198g\nIn-book reference  : Book 15, Hadith 77\nUSC-MSA web (English) reference  : Book 7, Hadith 2723\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "IA'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:\nFive are the beasts 1618 harmful and vicious and these must be killed even within the precincts of the Ka'ba: crow, kite, voracio@s dog, kcorpion and rat."
  },
  "1199": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1199f\nIn-book reference  : Book 15, Hadith 86\nUSC-MSA web (English) reference  : Book 7, Hadith 2731\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. Umar (Allah be pleased with them) reported Allah's Messen- ger (ﷺ) as saying:\nFive (are the animals) which, it one kills them In the state of Ihram, entail no sin for one (who does it): scorpion, rat, voracious dog, crow and kite."
  },
  "1200": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1200c\nIn-book reference  : Book 15, Hadith 81\nUSC-MSA web (English) reference  : Book 7, Hadith 2727\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Zaid b. Jubair reported:\nA person asked Ibn 'Umar which beast a Muhrim could kill, whereupon he said: One of the wives of Allahs Apostle (ﷺ) told me: He (the Holy Prophet) commanded to kill voracious dog, rat, scorpion, kite, crow, and snake (and this is allowed) likewise in prayer."
  },
  "1201": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1201h\nIn-book reference  : Book 15, Hadith 94\nUSC-MSA web (English) reference  : Book 7, Hadith 2739\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ka'b b. Ujra (Allah be pleased with him) reported that he went out with the Messenger of Allah (ﷺ) in the state of Ihram, and his (Ka'b's) head and beard were infested with lice. This was conveyed to the Messenger of Allah (ﷺ). He sent for him (Ka'b) and called a barber (who) shaved his head. He (the Holy Prophet) said. Is there any sacrificial animal with you? He (Kalb) said:\nI cannot afford it. He then commanded him to observe fasts for three days or feed six needy persons, one sa' for every two needy persons. And Allah the Exalted and Majestic revealed this (verse) particular with regard to him:\" So whosoever among you is sick and has an ailment of the head..\" ; then (its application) became general for the Muslims."
  },
  "1202": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1202\nIn-book reference  : Book 15, Hadith 95\nUSC-MSA web (English) reference  : Book 7, Hadith 2740\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported that the Messenger of Allah (ﷺ) got himself cupped in the state of lhrim."
  },
  "1203": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1203\nIn-book reference  : Book 15, Hadith 96\nUSC-MSA web (English) reference  : Book 7, Hadith 2741\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Buhaina reported that the Messenger of Allah (ﷺ) got himself cupped in the middle of his head on his way to Mecca."
  },
  "1204": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1204b\nIn-book reference  : Book 15, Hadith 98\nUSC-MSA web (English) reference  : Book 7, Hadith 2743\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nubaih b Wahb reported that the eyes of Umar b. Ubaidnllah b. Ma'mar were swollen, and he decided to use antimony. Aban b. 'Uthman forbade him to do so and commanded him to apply aloes on them, and reported on the authority of 'Uthman b. Affan that the Messenger of Allah (ﷺ) had done that."
  },
  "1205": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1205b\nIn-book reference  : Book 15, Hadith 100\nUSC-MSA web (English) reference  : Book 7, Hadith 2745\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Zaid b. Aslam with the same chain of transmitters that Abu Ayyub rubbed his whole head with his hands and then moved them forward and backward. Miswar said to Ibn 'Abbas:\nI would never dispute with you (in future)."
  },
  "1206": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1206k\nIn-book reference  : Book 15, Hadith 110\nUSC-MSA web (English) reference  : Book 7, Hadith 2755\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with him) reported that there was a person in the company of Allah's Messenger (may peace' be upon him) whose camel broke his neck and he died. thereupon Allah's Apostle (ﷺ) said:\nWash him, but do not apply perfume and do not cover his face, for he would be raised (on the Day of Resurrection) pronouncing Talbiya."
  },
  "1207": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1207c\nIn-book reference  : Book 15, Hadith 113\nUSC-MSA web (English) reference  : Book 7, Hadith 2758\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been reported on the authority of A'isha through another chain of transmitters."
  },
  "1208": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1208c\nIn-book reference  : Book 15, Hadith 116\nUSC-MSA web (English) reference  : Book 7, Hadith 2761\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Ibn 'Abbas with a slight variation of words."
  },
  "1209": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1209\nIn-book reference  : Book 15, Hadith 117\nUSC-MSA web (English) reference  : Book 7, Hadith 2762\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "`A'isha (Allah be pleased with her) reported that Asma' bint `Umais gave birth to Muhammad b Abu Bakr near Dhu'l-Hulaifa. The Messenger of Allah (ﷺ) commanded Abu Bakr to convey to her that she should take a bath and then enter into the state of Ihram."
  },
  "1210": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1210\nIn-book reference  : Book 15, Hadith 118\nUSC-MSA web (English) reference  : Book 7, Hadith 2763\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. `Abdullah (Allah be pleased with them) reported that when Asma' bint `Umais gave birth (to a child) in Dhu'l-Hulaifa. Allah's Messenger (ﷺ) commanded Abu Bakr (to convey to her) that she should take a bath and enter into the state of Ihram."
  },
  "1211": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1211ah\nIn-book reference  : Book 15, Hadith 433\nUSC-MSA web (English) reference  : Book 7, Hadith 3067\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith is narrated by 'A'isha (Allah be pleased with her) through another chain of transmitters, but no mention is made of\" sad and downcast\"."
  },
  "1212": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1212\nIn-book reference  : Book 15, Hadith 145\nUSC-MSA web (English) reference  : Book 7, Hadith 2790\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abd al-Rahman b. Abu Bakr reported that the Messenger of Allah (ﷺ) ordered him to mount A'isha behind him and enable her to (enter into the state of Ihram for 'Umra) at Tan'im."
  },
  "1213": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1213d\nIn-book reference  : Book 15, Hadith 149\nUSC-MSA web (English) reference  : Book 7, Hadith 2794\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (Allah be pleased with him) said.:\nWe went with Allah's Messenger (ﷺ) in 'a state of Ihram for the Hajj. There were women and children with us. When we reached Mecca we circumambulated the House and (ran) between al-Safa and al-Marwa. The Messenger of Allah (ﷺ) said: He who has no sacrificial animal with him should put off lhram. We said: What kind of putting off? He said: Getting out of lhram completely. So we came to our wives, and put on our clothes and applied perfume. When it was the day of Tarwiya, we put on Ihram for Hajj. and the first circumambulation and (running) between al-Safa and al-Marwa sufficed us.. Allah's Messenger (ﷺ) commanded us to become seven partners (in the sacrifice) of a camel and a cow."
  },
  "1214": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1214\nIn-book reference  : Book 15, Hadith 150\nUSC-MSA web (English) reference  : Book 7, Hadith 2795\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Abdullah reported that the Messenger of Allah (ﷺ) ordered us to put on Ihram (again) as we proceeded towards Mina after we had put it off (i. e. 'on the 8th of Dhu'l-Hijja). So we pronounced Talbiya at al-Abtah."
  },
  "1215": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1215\nIn-book reference  : Book 15, Hadith 151\nUSC-MSA web (English) reference  : Book 7, Hadith 2796\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Abdullah is reported to have said:\nNeither Allah's Apostle (ﷺ) nor his Companions (circumambulated the Ka'ba and) ran between al-Safa and al-Marwa but once (sufficing both for Hajj and 'Umra). But in the hadith transmitted by Muhammad b. Bakr there is an addition:\" That is first circumambulation.\""
  },
  "1216": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1216e\nIn-book reference  : Book 15, Hadith 158\nUSC-MSA web (English) reference  : Book 7, Hadith 2802\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. 'Abdullah (Allah be pleased with them) reported:\nWe came with the Messenger of Allah (May peace be upon him) pronouncing Talbiya for Hajj, and the Messenger of Allah (May peace be upon him) commanded us to make (our Ihram) into that of Umra."
  },
  "1217": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1217b\nIn-book reference  : Book 15, Hadith 157\nUSC-MSA web (English) reference  : Book 7, Hadith 2801\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Qatada narrated this hadith with the same chain of transmitters saying:\n(That 'Umar also said): Separate your Hajj from 'Umra, for that is the most complete Hajj, and complete your Umra."
  },
  "1218": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1218d\nIn-book reference  : Book 15, Hadith 162\nUSC-MSA web (English) reference  : Book 7, Hadith 2806\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Abdullah (Allah be pleased with them) reported that when Allah's Messenger (ﷺ) proceeded to Mecca, he came to it (the Black Stone). he kissed it. and moved to his right. and moved quickly in three circuits, and walked in four circuits."
  },
  "1219": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1219b\nIn-book reference  : Book 15, Hadith 164\nUSC-MSA web (English) reference  : Book 7, Hadith 2808\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Hisham narrated on the authority of his father that the Arabs with the exception of Hums who were Quraish, and their descendants, circumambulated the House naked. They kept circumambulating In this state of nudity unless the Hums supplied to them the clothes. The male provided (clothes) to the male and the female provided clothes to the female. And the Hums did not get out of Muzdalifa, whereas the people (other than the Quraish) went t o 'Arafat. Hisham said on the authority of his father who related from 'A'isha (Allah be pleased with her) who said:\nHums are those about whom Allah, the Exalted and Glorious, revealed this verse:\" Then hasten to where the people hasten.\" She (further) said: The people hastened on from 'Arafat, whereas Hums hastened from Muzdalifa, and said: We'do not hasten but from Haram. But when this (verse) was revealed:\" Hasten on from that (place) where the people hasten on,\" they (the Quraish) then went to 'Arafat."
  },
  "1220": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1220\nIn-book reference  : Book 15, Hadith 165\nUSC-MSA web (English) reference  : Book 7, Hadith 2809\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jubair. b. Mut'im reported:\nI lost my camel and went in search of it on the day of 'Arafa, and I saw the Messenger of Allah (ﷺ) staying along with people in 'Ara'fit. Thereupon I said: By Allah, he is among the Hums (Quraish) ; what has happened to him that he has come to this (place)? The Quraish were counted among Hums."
  },
  "1221": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1221d\nIn-book reference  : Book 15, Hadith 169\nUSC-MSA web (English) reference  : Book 7, Hadith 2813\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Musa (Allah be pleased with him) reported:\nThe Messenger of Allah (May peace be upon im) had sent me to Yemen and I came back In the year in which he (the Holy Prophet) performed the (Farewell) Pilgrimage. Allah's Messenger (may peace be upon, him) said to me: Abu Musa, what did you ' say when you entered into the state of Ihram? I said: At thy beck and call; my (Ihram) is that of the Ihram of Allah's Apostle (May peace be upon him). He said: Have you brought the sacrificial animals? I said: No. Thereupon he said: Go and circumambulate the House, and (run) between al-Safa' and al-Marwa and then put off Ihram. The rest of the hadith is the same."
  },
  "1222": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1222\nIn-book reference  : Book 15, Hadith 170\nUSC-MSA web (English) reference  : Book 7, Hadith 2814\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Musa, (Allah be pleased with him) reported that he used to deliver religious verdict in favor of Hajj Tamattu'. A person said to him:\nExercise restraint in delivering some of your religious verdicts, for you do not know what the Commander of Believers has introduced in the rites (of Hajj) after you (when you were away in Yemen). He (Abu Musa, ) met him (Hadrat Umar) subsequently and asked him (about it), whereupon 'Umar said: I know that Allah's Apostle (May peace be upon him) and also his Companions did that (observed Tamattu'), but I do not approve that the married persons should have intercourse with their wives under the shade of the trees, and then set out for Hajj with water trickling down from their heads."
  },
  "1223": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1223c\nIn-book reference  : Book 15, Hadith 173\nUSC-MSA web (English) reference  : Book 7, Hadith 2816\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Sa'id b. al-Musayyab reported that 'Ali and 'Uthman (Allah be pleased with them) met at 'Usfan; and Uthman used to forbid (people) from performing Tamattu' and 'Umra (during the period of Hajj), whereupon 'Ali said:\nWhat is your opinion about a matter which the Messenger of Allah (ﷺ) did but you forbid it? Thereupon Uthman said: You leave us alone, whereupon he ('Ali) said: I cannot leave you alone. When 'Ali saw this, he put on Ihram for both of them together (both for Hajj and 'Umra)."
  },
  "1224": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1224d\nIn-book reference  : Book 15, Hadith 177\nUSC-MSA web (English) reference  : Book 7, Hadith 2820\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abd al-Rahman b. Abi al-Sha'tha' reported:\nI came to Ibrahim al-Nakha'I and Ibrahim Taimi and said: I intend to combine 'Umra and Hajj this year, whereupon Ibrahim al-Nakha'i said: But your father did not make such intention. Ibrahim narrated on the authority of, his father that he passed by Abu Dharr (Allah be pleased with him) at Rabdha, and made a mention of that, whereupon he said: It was a special concession for us and not for you."
  },
  "1225": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1225c\nIn-book reference  : Book 15, Hadith 180\nUSC-MSA web (English) reference  : Book 7, Hadith 2823\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been transmitted on the authority of Sulaiman (but with a slight modification of words)."
  },
  "1226": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1226j\nIn-book reference  : Book 15, Hadith 189\nUSC-MSA web (English) reference  : Book 7, Hadith 2831\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this is transmitted on the authority of Imran b. Husain, but with this variation that he ('Imran) said:\nWe did that (Tamattu') in the company of Allah's Messenger (ﷺ) and he did not say anything but he (the Holy Prophet) commanded us to do it."
  },
  "1227": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1227\nIn-book reference  : Book 15, Hadith 190\nUSC-MSA web (English) reference  : Book 7, Hadith 2832\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. 'Umar (Allah be pleased with them) reported:\nAllah's Messenger (ﷺ) observed Tamattu' in Hajjat-ul-Wada'. He first put on Ihram for 'Umra and then for Hajj. and then offered animal sacrifice. So he drove the sacrificial animals with him from Dhu'l-Hulaifa. Allah's Messenger (ﷺ) commenced Ihram of Umra and thus pronounced Talbiya for 'Umra. and then (put on Ihram for Hajj) and pronounced Talbiya for Hajj. And the people performed Tamattu' in the company of Allah's Messenger (ﷺ). They put on Ihram for Umra (first) and then for Hajj. Some of them had sacrificial animals which they had brought with them, whereas some of them had none to sacrifice. So when Allah's Messenger (ﷺ) came to Mecca, he said to the people: He who amongst you has brought sacrificial animals along with him must not treat as lawful anything which has become unlawful for him till he has completed the Hajj; and he, who amongst you has not brought the sacrificial animals should circumambulate the House, and run between al-Safa' and al-Marwa and clip (his hair) and put off the Ihram, and then again put on the Ihram for Hajj and offer sacrifice of animals. But he who does not find the sacrificial animal, he should observe fast for three days during the Hajj and for seven days when he returns to his family. Allah's Messenger (ﷺ) circumambulated (the House) when he came to Mecca: he first kissed the corner (of the Ka'ba containing the Black Stone), then ran in three circuits out of seven and walked in four circuits. And then when he had finished the circumambulation of the House he observed two rak'ahs of prayer at the Station (of Ibrahim), and then pronounced Salaam (for concluding the rak'ahs), and departed and came to al-Safa' and ran seven times between al-Safa' and al-Marwa. After that he did not treat anything as lawful which had become unlawful till he had completed his Hajj and sacrificed his animal on the day of sacrifice (10th of Dhu'l-Hijja). and then went back quickly (to Mecca) and performed circumambulation of the House (known as tawaf ifada) after which all that was unlawful for him became lawful; and those who had brought the sacrificial animals along with them did as Allah's Messenger (ﷺ) had done"
  },
  "1228": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1228\nIn-book reference  : Book 15, Hadith 191\nUSC-MSA web (English) reference  : Book 7, Hadith 2832\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of 'A'isha. The wife of Allah's Messenger (ﷺ), concerning his Tamattu' of Hajj and 'Umra and performing of Tamattu' by people in his company."
  },
  "1229": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1229e\nIn-book reference  : Book 15, Hadith 196\nUSC-MSA web (English) reference  : Book 7, Hadith 2837\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Hafsa (Allah be pleased with her) said that Allah's Apostle (ﷺ) commanded his wives that they should put off Ihram during the year of Hajj (at-ul-Wada'). whereupon she (Hafsa) said:\nWhat hinders you that you have not put off Ihram? Thereupon he said: I have stuck my hair and driven my sacrificial animal along with men and it is not permissible to put off Ihram (under this condition until I have sacrificed the animal."
  },
  "1230": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1230e\nIn-book reference  : Book 15, Hadith 201\nUSC-MSA web (English) reference  : Book 7, Hadith 2842\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated from Ibn Umar through another chain of transmitters except with (this variation) that Allah's Apostle (ﷺ) was mentioned in the first part of the hadith,. i. e. when it was said to him:\nThey would bar you (from going) to the House. He said: In that, case I would do what Allah's Messenger (ﷺ) had done. He did not mention at the end of this hadith (i. e. these words):\" This is how the Messenger of Allah (ﷺ) had done,\" as it Is narrated by al-Laith."
  },
  "1231": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1231\nIn-book reference  : Book 15, Hadith 202\nUSC-MSA web (English) reference  : Book 7, Hadith 2843\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' thus reported on the authority of Ibn Umar:\nWe entered into the state of Ihram with Allah's Messenger (ﷺ) for Hajj Mufrad and in the narration of Ibn 'Aun (the words are):\" Allah's Messenger (ﷺ) entered into the state of Ihram (with the intention) of Hajj Mufrad.\""
  },
  "1232": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1232b\nIn-book reference  : Book 15, Hadith 204\nUSC-MSA web (English) reference  : Book 7, Hadith 2845\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Bakr b. 'Abdullah reported:\nAnas (Allah be pleased with him) had narrated to us that he saw Allah's Apostle (ﷺ) combining Hajj and 'Umra. He (Bakr) said: I asked (about it) from Ibn 'Umar, whereupon he said: We entered into the state of Ihram for Hajj (only). I came to Anas and told him what Ibn Umar had said, whereupon he remarked: (You are treating us) as if we were children."
  },
  "1233": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1233b\nIn-book reference  : Book 15, Hadith 206\nUSC-MSA web (English) reference  : Book 7, Hadith 2847\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Wabara reported:\nA person asked Ibn Umar (Allah be pleased with him): May I circumambulate the House, whereas I have entered-into the state of Ihram for Hajj? Thereupon he said: What prevents you from doing it? He said: I saw the son of so and so showing disapproval of it, and you are dearer to us as compared with him. And we see that he is allured by the world, whereupon he said: Who amongst you and us is not allured by the world? And said (further) ': 'We saw that Allah's Messenger (ﷺ) put on Ihram for Hajj and circumambulated the House and run between al Safa' and al-Marwa. And the way prescribed by Allah and that prescribed by His Apostle (ﷺ) deserve more to be followed than the way shown by so and so, if you speak the truth."
  },
  "1234": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1234b\nIn-book reference  : Book 15, Hadith 208\nUSC-MSA web (English) reference  : Book 7, Hadith 2849\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith is narrated by another chain of transmitters."
  },
  "1235": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1235\nIn-book reference  : Book 15, Hadith 209\nUSC-MSA web (English) reference  : Book 7, Hadith 2850\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Muhammad b. 'Abd al-Rahman reported:\nA person from Iraq said to him to inquire from 'Urwa b. Zubair for him whether a person who puts on Ihram for Hajj is allowed to put it off or not as he circumambulates the House. And if he says:\" No, it can't be put off,\" then tell him that there is a person who makes such an assertion. He (Muhammad b. 'Abd al-Rahman) then said: I asked him ( Urwa b. Zubair), where- upon he said: The person who has entered into the state of Ihram for Hajj cannot get out of it unless he has, completed the Hajj I (further) said (to him): (What) if a person makes that assertion? Thereupon he said: It is indeed unfortunate that he makes such an assertion. That person ('Iraqi) then met me and he asked me and I narrated to him (the reply of 'Urwa), whereupon he (the Iraqi) said: Tell him ('Urwa) that a person had informed him that Allah's Messenger (ﷺ) had done that; and why is it that Asma' and Zubair have done like this? He (Muhammad b. 'Abd al-Rahman) said: I went to him and made a mention of that to him, whereupon he ('Urwa) said: Who is he (the 'Iraqi)? I said: I do not know, whereupon he said: What is the matter that he does not come to me himself and ask me? I suppose he is an 'Iraqi. I said: I do not know, whereupon he said: He has told a lie. Allah's Messenger (ﷺ) performed Hajj, and 'A'isha (Allah be pleased with her) has told me that the first thing with which he commenced (the rituals) when he arrived at Mecca was that he performed ablution and then circumambulated the Ka'ba. Then Abu Bakr performed Hajj and the first thing with which he commenced (the Hajj) as the circumambulation of the Ka'ba and nothing besides it. So did 'Umar. Then 'Uthman performed Hajj and I saw that the first thing with which he commenced the Hajj was the circumambulation of the Ka'ba and nothing besides it. Then Mu'awiya and Abdullah b. 'Umar did that. Then I performed Hajj with my father Zubair b. al-'Awwam, and the first thing with which he commenced (Hajj) was the circumambulation of the House. He then did nothing besides it. I then saw the emigrants (Muhajirin) and the helpers (Ansar) doing like this and nothing besides it. And the last one whom I saw doing like this was Ibn 'Umar. And he did not break it (the Hajj) after performing 'Umra. And Ibn 'Umar is with them. Why don't they ask him (to testify it)? And none amongst those who had passed away commenced (the rituals of Hajj) but by circumambulating the Ka'ba on their (first arrival) and they did not put off Ihram (without completing the Hajj), and I saw my mother and my aunt commencing (their Hajj) with the circumambulation of the House, and they did not put off Ihram. My mother informed me that she came and her sister, and Zubair and so and so for 'Umra, and when they had kissed the corner (the Black Stone, after Sa'i and circumambulation), they put off Ihram. And he (the 'Iraqi) has told a lie in this matter."
  },
  "1236": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1236b\nIn-book reference  : Book 15, Hadith 211\nUSC-MSA web (English) reference  : Book 7, Hadith 2852\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Asma bint Abu Bakr (Allah be pleased with th (m) said:\nWe came for Hajj in the state of Ihram with Allah's Messenger (ﷺ). The rest of the hadith is the same except (for the words) that he (Zubair) said: Keep away from me, keep away from me, whereupon I said: Do you fear that I will jump upon you?"
  },
  "1237": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1237\nIn-book reference  : Book 15, Hadith 212\nUSC-MSA web (English) reference  : Book 7, Hadith 2853\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah, the freed slave of Asma' bint Abu Bakr (Allah be pleased with them), narrated that he used to hear Asma, ' whenever she passed by Hajun, saying (these words):\n\" May there be peace and blessing of Allah upon His Messenger.\" We used to stay here along with him with light burdens. Few were our rides, and small were our provisions. I performed 'Umra and so did my sister 'A'isha, and Zubair and so and so. And as we touched the House (performed circumambulation and Sa'i) we put off Ihram, and then again put on Ihram in the afternoon for Hajj. Harun (one of the narrators) in one of the narrations said: The freed slave of Asma' and he did not mention 'Abdullah."
  },
  "1238": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1238b\nIn-book reference  : Book 15, Hadith 214\nUSC-MSA web (English) reference  : Book 7, Hadith 2855\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters, but with a slight variation of words."
  },
  "1239": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1239b\nIn-book reference  : Book 15, Hadith 216\nUSC-MSA web (English) reference  : Book 7, Hadith 2857\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters but with this variation (of words):\n\" Talha and another person also were among those who had not brought the sacrificial animals with them and so they put off Ihram.\""
  },
  "1240": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1240e\nIn-book reference  : Book 15, Hadith 221\nUSC-MSA web (English) reference  : Book 7, Hadith 2862\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (ﷺ) observed the morning prayer at Dhu Tawa (a valley near Mecca) and arrived (in Mecca) when four days of Dhul-Hijja had passed and he commanded his Companions that they should change their Ihram (of Hajj) to that of Umra, except those who had brought sacrificial animals with them."
  },
  "1241": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1241\nIn-book reference  : Book 15, Hadith 222\nUSC-MSA web (English) reference  : Book 7, Hadith 2863\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported Allah's Messenger (ﷺ) as saying:\nThis is the 'Umra of which we have taken advantage. So he who has not the sacrificial animal with him should get out of the state of Ihram completely, for 'Umra has been incorporated in Hajj until the Day of Resurrection,"
  },
  "1242": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1242\nIn-book reference  : Book 15, Hadith 223\nUSC-MSA web (English) reference  : Book 7, Hadith 2864\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Jam at al-Dubu'i reported:\nI performed Tamattu' but the people dis- couraged me to do so. I came to Ibn 'Abbas and asked him about it. He ordered me to do so. I came to the House (Ka'ba) and slept. I saw a visitant in the dream who said: 'Umra is acceptable and so is the Hajj performed for God's sake. I came to Ibn Abbas and informed him about that Which I saw in the dream whereupon he said: Allah is the Greatest, Allah is the Greatest This is the Sunnah of Abu'l-Qasim (the Holy Pro- phet) (ﷺ)."
  },
  "1243": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1243b\nIn-book reference  : Book 15, Hadith 225\nUSC-MSA web (English) reference  : Book 7, Hadith 2866\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters but with this variation (of words):\n\" When Allah's Apostle (ﷺ) came to Dhu'l-Hulaifa\" and he made no mention (of the fact) that he led the Zuhr prayer."
  },
  "1244": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1244b\nIn-book reference  : Book 15, Hadith 227\nUSC-MSA web (English) reference  : Book 7, Hadith 2868\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Hassan reported:\nIt was said to Ibn 'Abbas (Allah be pleased with them) that this affair had engaged the attention of the people that he who circumambu- lates the House was permitted to circumambulate for Umra (even though he was in a state of Ihram for Hajj), whereupon he said: That is the Sunnah of your Apostle (ﷺ), even though you may not approve of it."
  },
  "1245": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1245\nIn-book reference  : Book 15, Hadith 228\nUSC-MSA web (English) reference  : Book 7, Hadith 2869\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ata' said:\nIbn 'Abbas (Allah be pleased with them) used to say that a pilgrim or non-pilgrim (one performing 'Umar) who circumambulates the House is free from the responsibility of Ihram. I (Ibn Juraij, one of the narrators) said to 'Ata': On what authority does he (Ibn Abbas) say this? He said: On the authority uf Allah's words:\" Then their place of sacrifice is the Ancient House\" (al-Qur'an, xxii. 33). I said: It concerns the time after staying at 'Arafat, whereupon he said: Ibn 'Abbas (Allah be pleased with them) had stated (that the place of sacrifice is the Ancient House) ; it way be after staying at 'Arafat or before (staying there). And he (Ibn Abbas) made this deduction I from the command of Allah's Apostle (ﷺ) when he had ordered to put off Ihram on the occasion of the Farewell Pilgrimage."
  },
  "1246": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1246b\nIn-book reference  : Book 15, Hadith 230\nUSC-MSA web (English) reference  : Book 7, Hadith 2871\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbis (Allah be pleased with him) reported that Mu'awiya b. Abu Safyin had told him:\nI clipped the hair (from the head of) Allah's Messenger (may peace he upon him) with a clipper while he was at al-Marwa, or I saw him getting his hair clipped with a clipper as he was at al-Marwa. 1722"
  },
  "1247": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1247\nIn-book reference  : Book 15, Hadith 231\nUSC-MSA web (English) reference  : Book 7, Hadith 2872\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Sa'id (Allah be pleased with him) reported:\nWe went out with Allah's messenger (ﷺ) pronouncing loudly the Talbiya for Hajj When we came to Mecca, he commanded us that we should change this (Ihram for Hajj) to that of Umra except one who had brought the sacrificial animal with him. When it was the day of Tarwiya (8th of Dhul-Hijja) and we went to Mini, we (again) pronounced Talbiya for Hajj."
  },
  "1248": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1248\nIn-book reference  : Book 15, Hadith 232\nUSC-MSA web (English) reference  : Book 7, Hadith 2873\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "jibir and Abil Salld al-Khudri (Allah be pleased with them) reported:\nWe went with Allah's Apostle (ﷺ) and we were pronouncing Talbiya for Hajj loudly."
  },
  "1249": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1249\nIn-book reference  : Book 15, Hadith 233\nUSC-MSA web (English) reference  : Book 7, Hadith 2874\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abd Nadra reported:\nWhile I was in the company of Jibir, a person came and said: There is difference of opinion amomg Ibn Abbas and Ibn Zubair about two Mut'as (benefits, Tamattul in Hajj and temporary marriage with women), whereupon jibir said: We have been doing this during the lifetime of Allah's Messenger (way peace be upon him), and then 'Umar forbade us to do so, and we never resorted to them."
  },
  "1250": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1250b\nIn-book reference  : Book 15, Hadith 235\nUSC-MSA web (English) reference  : Book 7, Hadith 2875\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith is narrated by Salim b. Hayyin with the same chain of transmitters, but with a slight variation of words."
  },
  "1251": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1251a,b\nIn-book reference  : Book 15, Hadith 236\nUSC-MSA web (English) reference  : Book 7, Hadith 2876\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas (Allah be pleased with him) reported:\nI heard Allah's Messenger (ﷺ) pronouncing Talbiya for both simultaneously, Talbiya for 'Umra and Hajj. Talbiya for Uwra and Hajj (he performed both Hajj and Umra as a Qarin). In another version words are: I heard Allah's Messenger (ﷺ) pronouncing Talbiya for Umra and Hajj (simultaneously).\""
  },
  "1252": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1252c\nIn-book reference  : Book 15, Hadith 239\nUSC-MSA web (English) reference  : Book 7, Hadith 2879\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Qatida saia. that Anas (Allah be pleased with him) had informed him that Allah's Messenger (ﷺ) performed four 'Umras, all during the month of Dhu'l-Qa'da except the one he performed along with Hajj (and these are) the Umra that he performed from al-Hudaibiya or during the time of (the truce of) Hudaibiya in the month of Dhu'l-Qa'da then the Umra of the next year in the month of Dhu'l-Qa'da, then the Umra for which b'e had started from ji'rana, the place where he distributed the spoils of (the battle of) Hunain in the month of Dhu'l-Qa'da, and then the 'Umra that he performed along with his Hajj (on the occasion of the Farewell Pilgrimage)."
  },
  "1253": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1253b\nIn-book reference  : Book 15, Hadith 241\nUSC-MSA web (English) reference  : Book 7, Hadith 2881\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu lshaq said:\nI asked Zaid b. Arqam: In how many military expeditions have you participated with Allah's Messenger (ﷺ)? He said: In seventeen (expeditions). He (Abu Ishaq) said: Zaid b. Arqam reported to me that Allah's Messenger (ﷺ) had led nineteen expeditions. And he performed Hajj only once after Migration, and that was the Farewell Pilgrimage. Abu Ishaq also said: The second (Hajj) he performed at Mecca (before his Migration to Medina)"
  },
  "1254": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1254\nIn-book reference  : Book 15, Hadith 242\nUSC-MSA web (English) reference  : Book 7, Hadith 2882\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Ataa reported that 'Urwa b. Zubair (Allah be pleased with him) had informed him (this):\nI and Ibn 'Umar were reclining against the (wall) of the apartment of A'isha and we were listening to the sound produced by the brushing of her teeth. I said Abu Abd al-Rahman (the kunya of 'Abdullah b. Umar), did Allah's Apostle (ﷺ) perform 'Umra in the month of Rijab? He said: Yes. I said to 'A'isha: Mother, are you listening to what Abu Abd al-Rabman is saying? She said: What is he Saying? I said: He is saying that Allah's Apostle (ﷺ) performed 'Umra during the month of Rajab, whereupon she said: May Allah grant pardon to Abu Abd al-Rahman I By my life he (the Holy Prophet) did not perform 'Umra during the month of Rajab. And never was there an Umra performed by him (the Holy Prophet) in which he ('Abdullah b. 'Umar) did not join him. Ibn 'Umar heard this and said nothing to affirm It or to deny it, but kept quiet."
  },
  "1255": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1255b\nIn-book reference  : Book 15, Hadith 244\nUSC-MSA web (English) reference  : Book 7, Hadith 2884\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ataa reported:\nI heard Ibn Abbas (Allah be pleased with him) narrating to us that Allah's Messenger (ﷺ) said to a woman of the Ansar (Ibn Abbas had mentioned her name but I have forgotten it): 'What has prevented you that you do not perform Hajj along with us? She said: We have only two camels for carrying water. One of the camels has been taken by my husband and my son for performing Hajj and one has been left for us for carrying water, whereupon he (the Holy Prophet) said: So when the month of Ramadan come, perform Umra, for'Umra in this (month) is equal to Hajj (in reward)."
  },
  "1256": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1256\nIn-book reference  : Book 15, Hadith 245\nUSC-MSA web (English) reference  : Book 7, Hadith 2885\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbis reported that Allah's Apostle (ﷺ) said to a woman of the Ansar who was called Umm Sinan:\nWhat has prevented you that you did not perform Hajj with us? She said: The father of so and so (i. e. her husband) had only two camels. One of them had been taken away by him (my busbard) and his son for Hajj, whereas the other one is used by our boy to carry water. Upon this he (the Holy Prophet) said: Umra during the month of Rawadin would suffice for Hajj or Hajj along with me."
  },
  "1257": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1257e\nIn-book reference  : Book 15, Hadith 488\nUSC-MSA web (English) reference  : Book 7, Hadith 3122\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' reported that when 'Abdullah b. 'Umar returned from Hajj or 'Umra he made his camel kneel down (i. e. halted) in the stony ground of Dhu'l-Hulaifa where Allah's Messenger (ﷺ) had made his camel halt."
  },
  "1258": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1258b\nIn-book reference  : Book 15, Hadith 249\nUSC-MSA web (English) reference  : Book 7, Hadith 2888\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A'isha (Allah be pleased with her) reported that Allah's Messenger (ﷺ) entered Mecca during the year of Victory from Kada I. e. from the upper side. Hisham said.. My father entered It from both the Fides, but generally he entered from Kada."
  },
  "1259": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1259c\nIn-book reference  : Book 15, Hadith 252\nUSC-MSA web (English) reference  : Book 7, Hadith 2891\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah (b. 'Umar) reported that whenever Allah's Messenger (ﷺ) entered Mecca, he got down at Dhi Tuwa and spend the night there until he observed the dawn prayer. And Allah's Messenger (ﷺ) observed this prayer on a rough hillock, and not in the mosque which had been then built there, but to the lower side of it (the mosque) on a hillock."
  },
  "1260": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1260\nIn-book reference  : Book 15, Hadith 253\nUSC-MSA web (English) reference  : Book 7, Hadith 2892\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' reported that Abdullah (b. 'Umar) informed him that Allah's Messenger (ﷺ) turned his face to the two hillocks which intervened between him and the long mountain by the side of the Ka'ba, and the mosque which had been built there was thus on the left of the hillock. Allah's Messenger's (ﷺ) place of prayer was lower than the black hillock, at a distance of ten cubits or near it. He (ﷺ) would then observe prayer facing these two hillocks of the long mountain that is intervening between you and the Ka'ba."
  },
  "1261": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1261c\nIn-book reference  : Book 15, Hadith 256\nUSC-MSA web (English) reference  : Book 7, Hadith 2895\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. 'Umar (Allah be pleased with them) reported:\nI saw that when Allah's Messenger (ﷺ) came to Mecca and kissed the Black Stone, (in the first circumambulation) he moved quickly in three circuits out of seven circuits."
  },
  "1262": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1262b\nIn-book reference  : Book 15, Hadith 258\nUSC-MSA web (English) reference  : Book 7, Hadith 2897\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' reported that Ibn Umar (Allah he pleased with them) walked swiftly from stone to stone, and stated that Allah's Messenger (ﷺ) did like this."
  },
  "1263": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1263b\nIn-book reference  : Book 15, Hadith 260\nUSC-MSA web (English) reference  : Book 7, Hadith 2899\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b.\" Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) walked swiftly in three circuitsfrom stone to stone."
  },
  "1264": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1264c\nIn-book reference  : Book 15, Hadith 263\nUSC-MSA web (English) reference  : Book 7, Hadith 2902\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Tufail reported:\nI said to Ibn 'Abbas (Allah be pleased with them): People are of the view that Allah's Messenger (ﷺ) moved quickly round the House and between al-Safa and al-Marwa, and (thus) it is Sunnah. He said: They told the truth and they told the lie."
  },
  "1265": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1265\nIn-book reference  : Book 15, Hadith 264\nUSC-MSA web (English) reference  : Book 7, Hadith 2903\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Tufail reported; I. said to Ibn 'Abbas (Allah be pleased with them):\nI think that I saw Allah's Messenger (ﷺ). He (Ibn 'Abbis) said' Give a description of him to me. I said: I saw him near al-Marwa on the back of a she- camel, and people had thronged around him. Thereupon Ibn'Abbis said: It was Allah's Messenger (ﷺ) for they (the Compainions of the Holy Prophet) were neither pushed aside from him, nor were they turned away."
  },
  "1266": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1266b\nIn-book reference  : Book 15, Hadith 266\nUSC-MSA web (English) reference  : Book 7, Hadith 2905\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported:\nAllah. 's Messenger (peace be upon him) observed Sa'i and walked quickly round the House with a view to showing his strength to the polytheists."
  },
  "1267": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1267c\nIn-book reference  : Book 15, Hadith 269\nUSC-MSA web (English) reference  : Book 7, Hadith 2908\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' reported on the authority of 'Abdullah (Allah be pleased with him) that Allah's Messenger (way peace be upon him) did not touch but the Stone and the Yamani corner."
  },
  "1268": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1268b\nIn-book reference  : Book 15, Hadith 271\nUSC-MSA web (English) reference  : Book 7, Hadith 2910\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "NAfi' (Allah be pleased with him) reported:\nI saw'lbn 'Umar (Allah be pleased with them) touching the Stone with his hand and then kissing his hand. and he said: I have never abandoned it since I saw Allah's Messenger (way peace be upon him) doing It."
  },
  "1269": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1269\nIn-book reference  : Book 15, Hadith 272\nUSC-MSA web (English) reference  : Book 7, Hadith 2911\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) is reported to have said that he did not see Allah's Messenger (ﷺ) touching other than the Yamani corners."
  },
  "1270": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1270d\nIn-book reference  : Book 15, Hadith 276\nUSC-MSA web (English) reference  : Book 7, Hadith 2915\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abis b. Rabi'a reported:\nI saw 'Umar (Allah'be pleased with him) kissing the Stone and saying: I am kissing you and I know that you are a stone. And if I had not seen Allah's Messenger (ﷺ) kissing you, I would not have kissed you."
  },
  "1271": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1271b\nIn-book reference  : Book 15, Hadith 278\nUSC-MSA web (English) reference  : Book 7, Hadith 2916\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Sufyan with the same chain of transmitters (and the words are):\n\" That he ('Umar) said: But I saw Abu'l-Qasim (way peace be upon him) having great love for you.\" And he did not mention about clinging to it."
  },
  "1272": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1272\nIn-book reference  : Book 15, Hadith 279\nUSC-MSA web (English) reference  : Book 7, Hadith 2917\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with him) reported that Allah's Messenger (ﷺ) circumambulated the House on the occasion of the Farewell Pilgrimage on the back of his camel and touched the Corner (of Black Stone) with a stick."
  },
  "1273": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1273b\nIn-book reference  : Book 15, Hadith 281\nUSC-MSA web (English) reference  : Book 7, Hadith 2919\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Apostle (ﷺ) circumambulated the House (and ran) between al-Safa and al-Marwa on the back of his she-camel, at the occasion of the Farewell Pilgrimage. so that the people should see him and he should be conspicuous, and they should be able to ask him (questions pertaining to religion), and the people had crowded round him. In the hadith transmitted on the authority of Ibn Khashram no mention Is made of:\n\" So that they should ask him.\""
  },
  "1274": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1274\nIn-book reference  : Book 15, Hadith 282\nUSC-MSA web (English) reference  : Book 7, Hadith 2920\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'A'isha (Allah be pleased with her) reported that Allah's Apostle (ﷺ) circumambulated the Ka'ba on the back of his camel on the occasion of the Farewell Pilgrimage and touched the corner and he did not like that the people should be pushed away from him."
  },
  "1275": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1275\nIn-book reference  : Book 15, Hadith 283\nUSC-MSA web (English) reference  : Book 7, Hadith 2921\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Tufail reported:\nI saw Allah's Messenger (ﷺ) circumambulating the House. and touching the corner with a stick that he had with him, and then kissing the stick."
  },
  "1276": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1276\nIn-book reference  : Book 15, Hadith 284\nUSC-MSA web (English) reference  : Book 7, Hadith 2922\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Umm Salama reported:\nI made a complaint to Allah's Messenger (ﷺ) of my ailment, whereupon be said: Circumambulate behind the people while riding. She said: So I circumambulated and Allah's Messenger (ﷺ) was at that time praying towards the side of the House and he was reciting al-Tur and a Book Inscribed (i. e. Sura Iii. of the Qur'un)."
  },
  "1277": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1277e\nIn-book reference  : Book 15, Hadith 289\nUSC-MSA web (English) reference  : Book 7, Hadith 2927\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Urwa b. Zabair narrated on the authority of 'A'isha (Allah be pleased with her) who informed him that the Ansar and the people of the tribe of Ghassan before embracing Islam pronounced Talbiya for Manat, and so they avoided circumambulating between al-Safa' and al-Marwa, and it was a common practice with their forefather, that he who put on Ihram for Manat did not circumambulate between al-Safa' and al-Marwa. And when they embraced Islam, they asked Allah's Messenger (ﷺ) about it, and then Allah, the Exalted and Majestic, revealed this verse:\n\" Verily al-Safa' and al-Marwa are among the Signs of Allah\" ; so he who performs Hajj or Umra, for him there is no harm if he should circumambulate between them, and he who does good spontaneously-surely Allah is Bountiful in rewarding and Knowing."
  },
  "1278": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1278\nIn-book reference  : Book 15, Hadith 290\nUSC-MSA web (English) reference  : Book 7, Hadith 2928\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas (Allah be pleased with him) reported that the Ansar felt reluctant that they should circumambulate between al-Safa' and al-Marwa until it was revealed:\n\" Verily al-Safa' and al-Marwa are among the Signs of Allah\" ; so whoever performs Hajj or 'Umra, for him there is no harm that he should circumambulate between them."
  },
  "1279": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1279b\nIn-book reference  : Book 15, Hadith 292\nUSC-MSA web (English) reference  : Book 7, Hadith 2930\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Juraij reported on the same authority a hadith like that, and said:\nBut one Tawaf and that was the first Tawaf."
  },
  "1280": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1280g\nIn-book reference  : Book 15, Hadith 309\nUSC-MSA web (English) reference  : Book 7, Hadith 2946\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Usama b. Zaid (Allah be pleased with him) reported that he sat behind Allah's Messenger (ﷺ) on his ride as he came back from 'Arafa. And as he came to the valley, he halted his camel, and then went to the wilderness (to urinate). And when he came back, I poured water on him from the jug and he performed ablution, and then rode on until he came to Muzdalifa and there he combined the sunset and 'Isha' prayers."
  },
  "1281": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1281b\nIn-book reference  : Book 15, Hadith 294\nUSC-MSA web (English) reference  : Book 7, Hadith 2932\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (ﷺ) made al-Fadl sit behind him (on the camel back) from the place (where the two prayers) are combined (Muzdalifa). Ibn Abbas (Allah be pleased with them) also informed that Allah's Apostle (ﷺ) did not stop pronouncing Talbiya till he threw pebbles at Jamrat al-'Aqaba."
  },
  "1282": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1282b\nIn-book reference  : Book 15, Hadith 296\nUSC-MSA web (English) reference  : Book 7, Hadith 2933\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Abd Zubair with the same chain of transmitters but with this variation that in the hadith no mention is made of (this) that Allah's Messenger (ﷺ) continued pronouncing Talbiya till he stoned the Jamra, and he made this addition in his hadith:\n\" The Apostle (ﷺ) pointed with his hand how a person should catch hold of pebbles (in order to throw them).\""
  },
  "1283": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1283d\nIn-book reference  : Book 15, Hadith 299\nUSC-MSA web (English) reference  : Book 7, Hadith 2936\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abd al-Rahman b. Yazid and al-Aswad b. Yazid reported:\nWe heard 'Abdullah b. Mas'ud saying to the gathering of people (at Muzdalifa) that he had heard Talbiya from him, upon whom Surah al-Baqara was revealed, at this very place. And so he ('Abdullah b. Mas'ud) pronounced Talbiya and we also pronounced it with him."
  },
  "1284": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1284b\nIn-book reference  : Book 15, Hadith 301\nUSC-MSA web (English) reference  : Book 7, Hadith 2938\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. 'Umar reported on the authority of his father (Allah be pleased with them):\nWe were along with Allah's Messenger (way peace he upon him) in the morning of 'Arafa (9th of Dhu'l-Hijja). Some of us pronounced Takbir and some of us Tahlil La ilaha ill-Allah). And to those of us who pronounced Takbir, I said: By Allah, how strange it is that you did not care to ask him: What did you see Allah's Messenger (ﷺ) doing (on this occasion)?"
  },
  "1285": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1285b\nIn-book reference  : Book 15, Hadith 303\nUSC-MSA web (English) reference  : Book 7, Hadith 2940\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Muhammad b. Abu Bakr reported:\nI said to Anas b. Malik in the morning of 'Arafa: What do you say as to pronouncing Talbiya on this day? He said: I travelled with Allah's Apostle (may peace he upon him) and his Companions in this journey. Some of us pronounced Takbir and some of us pronounced Tahlil, and none of us found fault with his companion."
  },
  "1286": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1286c\nIn-book reference  : Book 15, Hadith 312\nUSC-MSA web (English) reference  : Book 7, Hadith 2949\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of 'Urwa with the same chain of transmitters. and in the hadith narrated by Humaid there is an addition (of these words):\n\" Hisham said: Al-nass (speed of camel) is faster than al-'anaq.\""
  },
  "1287": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1287a, b\nIn-book reference  : Book 15, Hadith 313\nUSC-MSA web (English) reference  : Book 7, Hadith 2950\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. Yazid al-Khatmi reported on the authority of Abu Ayyub (Allah be pleased with him) that he prayed the sunset and 'Isha' prayers (together) at Muzdalifa in the company of Allah's Messenger (ﷺ) on the occasion of the Farewell Pilgrimage."
  },
  "703": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 703e\nIn-book reference  : Book 15, Hadith 314\nUSC-MSA web (English) reference  : Book 7, Hadith 2951\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Umar (Allah be pleased with them) reported that Allah's Messenger (ﷺ) observed the sunset and 'Isha' prayers together at Muzdalifa."
  },
  "1288": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1288e\nIn-book reference  : Book 15, Hadith 319\nUSC-MSA web (English) reference  : Book 7, Hadith 2955\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Sa'id b. Jubair reported:\nWe came back along with Ibn 'Umar till we reached Muzdalifa. There he led us in the sunset and 'Isha' prayers with one iqama and we then proceeded and he said: This is how Allah's Messenger (ﷺ) led us in prayer at this place."
  },
  "1289": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1289b\nIn-book reference  : Book 15, Hadith 321\nUSC-MSA web (English) reference  : Book 7, Hadith 2957\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been transmitted by Al-A`mash with a slight variation of words, i.e. he said before its time when it was still dark."
  },
  "1290": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1290d\nIn-book reference  : Book 15, Hadith 325\nUSC-MSA web (English) reference  : Book 7, Hadith 2961\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated by 'Abd al-Rahman b. al-Qasim with the same chain of transmitters."
  },
  "1291": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1291b\nIn-book reference  : Book 15, Hadith 327\nUSC-MSA web (English) reference  : Book 7, Hadith 2962\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated by Ibn Juraij with the same chain of transmitters, and In his narration (the words are):\n\" She (Asma') said: My son, Allah's Apostle (ﷺ) granted permission to women.\""
  },
  "1292": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1292b\nIn-book reference  : Book 15, Hadith 329\nUSC-MSA web (English) reference  : Book 7, Hadith 2964\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "It is narrated from Umm Habiba:\nWe used to set forth from Muzdalifa to Mina, (very early in the dawn) when it was dark. And in the narration of Naqid (the words are):\" We set from Muzdalifa in the darkness (of the dawn).\""
  },
  "1293": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1293c\nIn-book reference  : Book 15, Hadith 332\nUSC-MSA web (English) reference  : Book 7, Hadith 2967\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been transmitted by Ibn 'Abbas (Allah be pleased with them) with a slight variation of words."
  },
  "1294": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1294\nIn-book reference  : Book 15, Hadith 333\nUSC-MSA web (English) reference  : Book 7, Hadith 2968\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Ata' reported from Ibn Abbas (Allah be pleased with them):\nAllah's Messenger (ﷺ) sent me from Muzdalifa along with his luggage (in the very early part of @he dawn). I (Ibn Juraij, one of the narrators) said (to 'Ati'): Has this (news) reached you that Ibn 'Abbas (Allah be pleased with them) had said:\" He (Allah's Messenger) had sent me in the latter part of the night\"? Thereupon he said: No, it was the dawn. I (again) said to him: (Did you hear) Ibn 'Abbas (Allah be pleased with them) having said this (too):\" We stoned al-Jamra before the dawn prayer\"? So where did he observe the dawn prayer? He said: No. But he said only so much (as described above)."
  },
  "1295": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1295\nIn-book reference  : Book 15, Hadith 334\nUSC-MSA web (English) reference  : Book 7, Hadith 2969\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Salim b. 'Abdullah reported that 'Abdullah b. 'Umar (Allah be pleased with them) used to send ahead of him the weak members of his household to stay during the night at Mash'ar al-Haram at Muzdalifa. They remembered Allah so long as they could afford, and then they proceeded before the stay of the Imam, and before his return. So some of them reached Mina for the dawn prayer and some of them reached there after that; and as they reached there, they stoned al-Jamra; and Ibn 'Umar (Allah be pleased with them) used to say:\nAllah's Messenger (ﷺ) has granted this concession to them."
  },
  "1296": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1296f\nIn-book reference  : Book 15, Hadith 340\nUSC-MSA web (English) reference  : Book 7, Hadith 2975\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abd al-Rahman b. Yazid reported:\nIt was said to 'Abdullah (Allah be pleased with bird) that people threw pebbles at the Jamra from the upper side of 'Aqaba, whereas he threw stones at it from the heart of the valley, whereupon he said: By Him besides Whom there is no god, it is at this very place that one upon whom was revealed Surah al-Baqara threw stones at it."
  },
  "1297": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1297\nIn-book reference  : Book 15, Hadith 341\nUSC-MSA web (English) reference  : Book 7, Hadith 2976\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (Allah be pleased with him) reported:\nI saw Allah's Apostle (ﷺ) flinging pebbles while riding his camel on the Day of Nahr, and he was saying: Learn your rituals (by seeing me performing them), for I do not know whether I would be performing Hajj after this Hajj of mine."
  },
  "1298": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1298b\nIn-book reference  : Book 15, Hadith 343\nUSC-MSA web (English) reference  : Book 7, Hadith 2978\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Umm al-Husain (Allah be pleased with her) reported:\nI performed Hajj along with Allah's Messenger (ﷺ) on the occasion of the Farewell Pilgrimage and saw Usama and Bilal (too), one of whom had caught hold of the lose string of the she-camel of Allah's Apostle (ﷺ) while the other one was raising his cloth (over his head) protecting him from the heat, till he flung pebbles at Jamrat al-'Aqaba."
  },
  "1299": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1299c\nIn-book reference  : Book 15, Hadith 346\nUSC-MSA web (English) reference  : Book 7, Hadith 2981\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Abdullah reported a hadith like this from Allah's Apostle (ﷺ)."
  },
  "1300": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1300\nIn-book reference  : Book 15, Hadith 347\nUSC-MSA web (English) reference  : Book 7, Hadith 2982\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (b. Abdullab) (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nOdd number of stones are to be used for cleaning (the private parts after answering the call of nature), and casting of pebbles at the Jamras is to be done by odd numbers (seven), and (the number) of circuits between al-Safa' and al-Marwa is also odd (seven), and the number of circuits (around the Ka'ba) is also odd (seven). Whenever any one of you is required to use stones (for cleaning the private parts) he should use odd number of stones (three, five or seven)."
  },
  "1301": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1301d\nIn-book reference  : Book 15, Hadith 351\nUSC-MSA web (English) reference  : Book 7, Hadith 2986\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ubaidullah reported this hadith with the same chain of transmitters and (it is said) that it was on the fourth turn that he (the Holy Prophet) said:\n(May Allah have mercy upon) those who got their hair clipped.\""
  },
  "1302": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1302b\nIn-book reference  : Book 15, Hadith 353\nUSC-MSA web (English) reference  : Book 7, Hadith 2988\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this is narrated on the authority of Abu Huraira."
  },
  "1303": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1303\nIn-book reference  : Book 15, Hadith 354\nUSC-MSA web (English) reference  : Book 7, Hadith 2989\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Yahya b. al-Husain reported on the authority of his grandfather that Allah's Apostle (ﷺ) invoked blessing on the occasion of the Farewell Pilgrimage three times for those who got their heads shaved and once for those who got their hair clipped. In the narration transmitted by Waki' there is no mention of the Farewell Pilgrimage."
  },
  "1304": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1304\nIn-book reference  : Book 15, Hadith 355\nUSC-MSA web (English) reference  : Book 7, Hadith 2990\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Umar reported that Allah's Messenger (ﷺ) got his head shaved on the occasion of the Farewell Pilgrimage."
  },
  "1305": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1305d\nIn-book reference  : Book 15, Hadith 359\nUSC-MSA web (English) reference  : Book 7, Hadith 2994\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas b. Malik (Allah be pleased with him) reported:\nWhen Allah's Messenger (ﷺ) had thrown pebbles at the Jamra and had sacrificed the animal, he turned (the right side) of his head towards the barber, and i. e shaved it. He then called Abu Talha al-Ansari and gave it to him. He then turned his left side and asked him (the barber) to shave. And he (the barber) shaved. and gave it to Abu Talha and told him to distribute it amongst the people."
  },
  "1306": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1306h\nIn-book reference  : Book 15, Hadith 367\nUSC-MSA web (English) reference  : Book 7, Hadith 3002\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. 'Amr b. al-As (Allah be pleased with them) said:\nAs Allah's Messenger (may peace be'upon him) was standing near the jamra, a person came to him on the Day of Nahr and said: Messenger of Allah, I got (my head shaved) before throwing pebbles, whereupon he (the Holy Prophet) said: Throw pebbles (now) ; there is no harm in it. Another man (then) came and said: I have sacrificed before throwing the stones. He said: Throw stones (now) and there is no harm. Another came to him and said: I have observed the circumambulation of Ifada of the House before throwing pebbles. He said: Throw pebbles (now) ; there is no harm in it, He (the narrator) said: I did not see that he (the Holy Prophet) was asked about anything on that day, but he said: Do, and there is no harm in it."
  },
  "1307": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1307\nIn-book reference  : Book 15, Hadith 368\nUSC-MSA web (English) reference  : Book 7, Hadith 3003\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that it was said to Allah's Apostle (ﷺ) about sacrificing of animals, shaving of one's head, throwing of pebbles, and (the order of) precedence and succession, and he said:\nThere is no harm in it."
  },
  "1308": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1308\nIn-book reference  : Book 15, Hadith 369\nUSC-MSA web (English) reference  : Book 7, Hadith 3004\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Umar reported that Allah's Messenger (ﷺ) observed the circumambulation of Ifada on the Day of Nabr (10th of Dhu'l-Hijja), and then came back and observed the noon prayer at Mina. Nafi' (one of the narrators) said that Ibn Umar used to observe the circumambulation of Ifada on the Day of Nahr, and then return and observe the noon prayer at Mina, and mentioned that Allah's Apostle (ﷺ) did that."
  },
  "1309": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1309\nIn-book reference  : Book 15, Hadith 370\nUSC-MSA web (English) reference  : Book 7, Hadith 3005\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abd al-'Aziz b. Rufai' (Allah be pleased with him) said:\nI asked Anas b. Malik to tell me about something he knew about Allah's Messenger (ﷺ), viz. where he observed the noon prayer on Yaum al-Tarwiya. He said: At Mina. I said: Where did he observe the afternoon prayer on the Yaum an-Nafr? and he said: It was at al-Abtah. He then said: Do as your rulers do."
  },
  "1310": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1310b\nIn-book reference  : Book 15, Hadith 372\nUSC-MSA web (English) reference  : Book 7, Hadith 3007\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' reported that Ibn 'Umar regarded halt at Muhassab as Sunnah (of the Holy Prophet) and observed the noon prayer on Yaum al-Nafr at that place. Nafi' said:\nAllah's Messenger (ﷺ) halted at Muhassab and the Caliphs did the same after him."
  },
  "1311": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1311c\nIn-book reference  : Book 15, Hadith 375\nUSC-MSA web (English) reference  : Book 7, Hadith 3010\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Salim reported that Abu Bakr, 'Umar and Ibn Umar used to halt at Abtah. 'Urwa narrated from 'A'isha (Allah be pleased with her) that he did not observe this practice and said:\nAllah's Messenger (ﷺ) halted there, for it is a place from where it was easy to depart."
  },
  "1312": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1312\nIn-book reference  : Book 15, Hadith 376\nUSC-MSA web (English) reference  : Book 7, Hadith 3011\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported:\nHalt at Muhassab is not something (significant from the point of view of the Shari'ah). It is a place of halt where Allah's Messenger (way peace be upon him) halted."
  },
  "1313": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1313\nIn-book reference  : Book 15, Hadith 377\nUSC-MSA web (English) reference  : Book 7, Hadith 3012\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Rafi' reported:\nAllah's Messenger (ﷺ) did not command me to observe halt at al-Abtah when be departed from Mina, but I came and set up his (the Holy Prcphet's) tent (of my own accord) ; and he (Allah's Apostle) came and observed halt. This hadith is narrated through another chain of transmitters from Abu Rafi' who was (in charge) of the luggage of Allah's Apostle (ﷺ)."
  },
  "1314": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1314c\nIn-book reference  : Book 15, Hadith 380\nUSC-MSA web (English) reference  : Book 7, Hadith 3015\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:\nGod willing, when Allah has granted us victory, our halt tomorrow will be at Khaif, where they (the unbelievers of Mecca) had taken an oath on unbelief."
  },
  "1315": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1315b\nIn-book reference  : Book 15, Hadith 382\nUSC-MSA web (English) reference  : Book 7, Hadith 3017\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated by 'Ubaidullah b. Umar with the the same chain of transmitters."
  },
  "1316": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1316\nIn-book reference  : Book 15, Hadith 383\nUSC-MSA web (English) reference  : Book 7, Hadith 3018\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Bakr b. 'Abdullah al-Muzani said:\nWhile I was sitting along with Ibn 'Abbas (Allah be pleased with him) near the Ka'ba, there came a bedouin to him and said: What is the matter that I see that the progeny of your uncle supply honey and milk (as drink to the travellers), whereas you supply al-nabidh (water sweetened with dates)? Is it due to your poverty or due to your close-fistedness? Thereupon Ibn 'Abbas said: Allah be praised, it is neither due to poverty nor due to close-fistedness (but due to the fact) that Allah's Apostle (ﷺ) came here riding his she-came, and there was sitting behind him Usama. He asked for water, and we gave him a cup full of nabidh and he drank it, and gave the remaining (part) to Usama; and he (the Holy Prophet) said: You have done Food, You have done well. So continue doing like it So we do not like to change what Allah's Messenger (ﷺ) had commanded us to do."
  },
  "1317": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1317e\nIn-book reference  : Book 15, Hadith 388\nUSC-MSA web (English) reference  : Book 7, Hadith 3023\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of Hadrat 'Ali (Allah be pleased with him)."
  },
  "1318": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1318f\nIn-book reference  : Book 15, Hadith 394\nUSC-MSA web (English) reference  : Book 7, Hadith 3029\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jaibir b. 'Abdullah (Allah be pleased with them) reported:\nWe performed Hajj Tamattu' along with Allah's Messenger (ﷺ) and we slaughtered a cow on behalf of seven persons sharing in it."
  },
  "1319": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1319b\nIn-book reference  : Book 15, Hadith 396\nUSC-MSA web (English) reference  : Book 7, Hadith 3031\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. 'Abdullah (Allah be pleased with them) reported that Allah's Messenger (ﷺ) sacrificed (animals) on behalf of his wives, and in the hadith transmitted by Ibn Abu Bakr (the words are):\n\" A cow on behalf of 'A'isha on the occasion of the Hajj.\""
  },
  "1320": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1320\nIn-book reference  : Book 15, Hadith 397\nUSC-MSA web (English) reference  : Book 7, Hadith 3032\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ziyad b. Jubair reported that Ibn 'Umar came upon a person who was slaughtering (sacrificing) his camel and had made him kneel down. So he told him to make it stand up festered (and then sacrifice it) according to the Sunnah of the Prophet (ﷺ)."
  },
  "1321": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1321n\nIn-book reference  : Book 15, Hadith 411\nUSC-MSA web (English) reference  : Book 7, Hadith 3045\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of 'A'isha (Allah be pleased with her) through another chain of transmitters."
  },
  "1322": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1322c\nIn-book reference  : Book 15, Hadith 414\nUSC-MSA web (English) reference  : Book 7, Hadith 3048\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Hammam b. Munabbih reported:\nIt is one out of these (narrations) that Abu Huraira (Allah be pleased with him) narrated to us from Muhammad the Messenger of Allah (ﷺ), and he narrated to us traditions out of which is that he said: When there was a person who was driving a garlanded sacrificial camel, Allah's Messenger (ﷺ) said to him: Woe to you; ride on it. He said: Messenger of Allah, it is a sacrificial animal, whereupon Allah's Messenger (ﷺ) said: Woe to you, ride on it; woe to you, ride on it."
  },
  "1323": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1323c\nIn-book reference  : Book 15, Hadith 417\nUSC-MSA web (English) reference  : Book 7, Hadith 3051\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas (Allah be pleased with him) reported:\nThere happened to pass (a person) with a sacrificial camel by Allah's Apostle (ﷺ) and the rest of the hadith is the same."
  },
  "1324": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1324b\nIn-book reference  : Book 15, Hadith 419\nUSC-MSA web (English) reference  : Book 7, Hadith 3053\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Zubair reported:\nI asked Jabir (Allah be pleased with him) about riding on the sacrificial animal, to which he replied: I heard Allah's Apostle (ﷺ) as saying: Ride on them gently until you find another mount."
  },
  "1325": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1325b\nIn-book reference  : Book 15, Hadith 421\nUSC-MSA web (English) reference  : Book 7, Hadith 3055\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that Allah's Messenger (ﷺ) sent eighteen sacrificial camels with a person. The rest of the hadith is the same, and the first part (of the above-mentioned hadith) is not mentioned."
  },
  "1326": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1326\nIn-book reference  : Book 15, Hadith 422\nUSC-MSA web (English) reference  : Book 7, Hadith 3056\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that Dhuwaib, father of Qabisa (Allah be pleased with him) narrated to him that Allah's Messenger (ﷺ) sent under his charge the sacrificial camels, and said:\nIf any of these is completely exhausted and you apprehend its death, then slaughter it, then dip its hoofs in its blood and imprint it on its hump; but neither you nor any one of your comrades should eat it."
  },
  "1327": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1327\nIn-book reference  : Book 15, Hadith 423\nUSC-MSA web (English) reference  : Book 7, Hadith 3057\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn 'Abbas (Allah be pleased with them) reported that the people used to return through every path, whereupon Allah's Messenger (way peace be upon him) said:\nNone amongst you should depart until he performs the last circumambulation round the House. Zuhair said (the words are): [ARABIC: YANSWARIFUWN KULLA WAJH] and the word [arabic: FIY] was not mentioned."
  },
  "1328": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1328b\nIn-book reference  : Book 15, Hadith 425\nUSC-MSA web (English) reference  : Book 7, Hadith 3059\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Tawus reported:\nI was in the company of Ibn Abbas (Allah be pleased with them) when Zaid b. Thabit said: Do you give religious verdict that the woman who is in menses is allowed to go without performing the last circumambulation of the House? Ibn 'Abbas (Allah be pleased with them) said to him: Ask such and such woman of the Ansar, if you do not (believe my religious verdict) whether Allah's Messenger (ﷺ) had coimmanded her this. Zaid b Thabit (went to that lady and after getting this verdict attested by her) came back to Ibn Abbas (Allah be pleased with them) smilingly and said: I did not find you but telling the truth."
  },
  "1329": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1329g\nIn-book reference  : Book 15, Hadith 440\nUSC-MSA web (English) reference  : Book 7, Hadith 3074\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Salim b. Abdullah reported his father (Allah be pleased with him) saying:\nI saw Allah's Messenger (ﷺ) entering the Ka'ba, and Usama b. Zaid, Bilal and 'Uthman b. Talha were along with him, but none (else) entered therein along with them. Then the door was closed for them from within. 'Abdullah b. Umar (Allah be pleased with them) said: Bilal and Uthman b. Talha informed me that Allah's Messenger (ﷺ) observed prayer in the interior of the Ka'ba between the two Yemenite pillars."
  },
  "1330": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1330\nIn-book reference  : Book 15, Hadith 441\nUSC-MSA web (English) reference  : Book 7, Hadith 3075\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Juraij reported:\nI said to 'Ata': Have you heard Ibn 'Abbas saying: You have been commanded to observe circumambulation, and not commanded to enter it (the Ka'ba)? He ('Ata') said: He (Ibn Abbas) (at the same time) did not forbid entrance into it. I, however, heard him saying: Usama b. Zaid informed me that when Allah's Apostle (ﷺ) entered the House, he supplicated in all sides of it; and he did not observe prayer therein till he came out, and as he came out he observed two rak'ahs in front of the House, and said: This is your Qibla. I said to him: What is meant by its sides? Does that mean its corners? He said: (In all sides and nooks of the House) there is Qibla."
  },
  "1331": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1331\nIn-book reference  : Book 15, Hadith 442\nUSC-MSA web (English) reference  : Book 7, Hadith 3076\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that Allah's Apostle (ﷺ) entered the Ka'ba, and in it there were six pillars, and he stood near a pillar and made supplication, but did not observe the prayer."
  },
  "1332": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1332\nIn-book reference  : Book 15, Hadith 443\nUSC-MSA web (English) reference  : Book 7, Hadith 3077\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Isma'il b. Abu Khalid reported:\nI asked Abdullah b. Abu Aufa (Allah be pleased with him), a Companion of Allah's Messenger (ﷺ), whether Allah's Apostle (ﷺ) had entered the House, while performing 'Umra, He said: NO."
  },
  "1333": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1333k\nIn-book reference  : Book 15, Hadith 454\nUSC-MSA web (English) reference  : Book 7, Hadith 3088\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'A'isha reported:\nI asked Allah's Messenger (ﷺ) about Hijr, and the rest of the hadith is the same. I also said: Why is it that the door has been made on a higher level, and one cannot (get into it) but with the help of a ladder? The rest of the hadith is the same as reported above and the concluding words are: (I do not change it) out of the apprehension that their hearts may disapprove of it.\""
  },
  "1334": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1334\nIn-book reference  : Book 15, Hadith 455\nUSC-MSA web (English) reference  : Book 7, Hadith 3089\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. 'Abbas reported that while al-Fadl b. Abbas had been riding behind Allah's Messenger (ﷺ) a women of the tribe of Khath'am came to him (to the Holy Proppet) asking for a religious verdict. Fadl looked at her and she looked at him. Allah's Messenger (ﷺ) turned the face of al-Fadl to the other side. She said:\nMessenger of Allah, there is an obligation from Allah upon His servants in regard to Hajj. (But) my father is an aged man; he is incapable of riding safely. May I perform Hajj on his behalf? He said: Yes. It was during the Farewell Pilgrimage."
  },
  "1335": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1335\nIn-book reference  : Book 15, Hadith 456\nUSC-MSA web (English) reference  : Book 7, Hadith 3090\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Fadl reported that a woman of Banu Khath'am said:\nMessenger of Allah, my father is very old. There is an old obligation of Hajj upon him from Allah, but he is not capable of sitting on the back of the camel. Thereupon Allah's Apostle (ﷺ) said: Perform Hajj on his behalf."
  },
  "1336": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1336d\nIn-book reference  : Book 15, Hadith 460\nUSC-MSA web (English) reference  : Book 7, Hadith 3094\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of Ibn 'Abbas through another chain of transmitters."
  },
  "1337": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1337\nIn-book reference  : Book 15, Hadith 461\nUSC-MSA web (English) reference  : Book 7, Hadith 3095\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported:\nAllah's Messenger (ﷺ) addressed us and said: O people, Allah has made Hajj obligatory for you; so perform Hajj. Thereupon a person said: Messenger of Allah, (is it to be performed) every year? He (the Holy Prophet) kept quiet, and he repeated (these words) thrice, whereupon Allah's Messenger (ﷺ) said: If I were to say\" Yes,\" it would become obligatory (for you to perform it every year) and you would not be able to do it. Then he said: Leave me with what I have left to you, for those who were before you were desroyed because of excessive questioning, and their opposition to their apostles. So when I command you to do anything, do it as much as it lies in your power and when I forbid you to do anything, then abandon it."
  },
  "1338": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1338c\nIn-book reference  : Book 15, Hadith 464\nUSC-MSA web (English) reference  : Book 7, Hadith 3098\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Abdullah b. Umar (Allah -be pleased with them) reported Allah's Apostle (ﷺ) as saying:\nIt is not lawful for a woman who believes in Allah and the Hereafter to travel for more than three nights journey except when there is a Mahram with her."
  },
  "827": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 827h\nIn-book reference  : Book 15, Hadith 469\nUSC-MSA web (English) reference  : Book 7, Hadith 3103\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Qatada with the same chain of transmitters and he said:\n\" More than three (days) except in the company of a Mahram.\""
  },
  "1339": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1339d\nIn-book reference  : Book 15, Hadith 473\nUSC-MSA web (English) reference  : Book 7, Hadith 3107\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nIt is not lawful for a woman to undertake three (days, ) journey except when there is a Mahram with her."
  },
  "1340": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1340b\nIn-book reference  : Book 15, Hadith 475\nUSC-MSA web (English) reference  : Book 7, Hadith 3109\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated by A'mash with the same chain of transmitters."
  },
  "1341": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1341c\nIn-book reference  : Book 15, Hadith 478\nUSC-MSA web (English) reference  : Book 7, Hadith 3112\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Juraij narrated this hadith with the same chain of transmitters, but he made no mention of it:\n\" No person (man) should be alone with a woman except when there is a Mahram with her.\""
  },
  "1342": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1342\nIn-book reference  : Book 15, Hadith 479\nUSC-MSA web (English) reference  : Book 7, Hadith 3113\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Umar (Allah be pleased with them) reported that whenever Allah's Messenger (ﷺ) mounted his camel while setting out on a journey, he glorified Allah (uttered Allah-o-Akbar) thrice, and then said:\nHallowed is He Who subdued for us this (ride) and we were not ourselves powerful enough to use It as a ride, and we are going to return to our Lord. O Allah, we seek virtue and piety from Thee in this journey of ours and the act which pleaseth Thee. O Allah, lighten this journey of ours, and make its distance easy for us. O Allah, Thou art (our) companion during the journey, and guardian of (our) family. O Allah, I seek refuge with Thee from hardships of the journey, gloominess of the sights, and finding of evil changes in property and family on return. And he (the Holy Prophet) uttered (these words), and made this addition to them: We are returning, repentant, worshipping our Lord. and praising Him."
  },
  "1343": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1343b\nIn-book reference  : Book 15, Hadith 481\nUSC-MSA web (English) reference  : Book 7, Hadith 3115\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadlth like this has been narrated on the authority of Asim With the same chain of transmitters except (this difference) that the hadith transmitted by 'Abd al-Wahid (one of the narrators) the (word)\" property\" precedes the family, and in the hadith transmitted by Mahammad b. Khazim (the word)\" family\" precedes (theword\" Property\" ), on returning home, in the narrations of both the narrators (these words are found):\n\" O Allah I seek refuge with Thee from the hardships of the journey.\""
  },
  "1344": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1344b\nIn-book reference  : Book 15, Hadith 483\nUSC-MSA web (English) reference  : Book 7, Hadith 3117\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Ibn Umar through another chain of transmitters (but with one alteration) that here Allah-o-Akbar is mentioned twice."
  },
  "1345": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1345b\nIn-book reference  : Book 15, Hadith 485\nUSC-MSA web (English) reference  : Book 7, Hadith 3119\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated by Anas b. Malik (Allah be pleased with him) through another chain of transmitters."
  },
  "1346": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1346b\nIn-book reference  : Book 15, Hadith 490\nUSC-MSA web (English) reference  : Book 7, Hadith 3124\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Salim b. Abdullah b. Umar reported on the authority of his father (Allah be pleased with them) that Allah's Apostle (ﷺ) came to Dhu'l- Hulaifa in the heart of the valley at the fag end of the night, and it was said to him:\nIt is a blessed stony ground. Musa (one of the narrators) said: Salim made his came) halt at the mosque where 'Abdullah made his camel halt as seeking the place of stay of Allah's Messenger (ﷺ). It is, in fact, situated at a lower plain than the mosque, which stands in the heart of the valley, and it is between it (the mosque) (and Qibla) that that place (where Allah's Apostle used to get down for rest and prayer) is situated."
  },
  "1347": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1347\nIn-book reference  : Book 15, Hadith 491\nUSC-MSA web (English) reference  : Book 7, Hadith 3125\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported:\nAbu Bakr Siddiq (Allah be pleased with him) sent me during Hajj before the Farewell Pilgrimage for which Allah's Messenger (ﷺ) had appointed him an Amir, among a group of people whom he had ordered to make announcement to the people on the Day of Nahr:\" After this year no polytheist may perform the Pilgrimage and no naked person may circumambulate the House.\" Ibn Shihab stated that Humaid b. Abd al-Rahman said that according to this narration of Abu Huraira (Allah be pleased with him) the day of Hajj al-Akbar (Great Hajj) is this Day of Nahr (10th of Dhu'l-Hijja)."
  },
  "1348": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1348\nIn-book reference  : Book 15, Hadith 492\nUSC-MSA web (English) reference  : Book 7, Hadith 3126\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'A'isha (Allah be pleased with her) reported Allah's Messenger (ﷺ) as saying:\nThere is no day when God sets free more servants from Hell than the Day of 'Arafa. He draws near, then praises them to the angels, saying: What do these want?"
  },
  "1349": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1349b\nIn-book reference  : Book 15, Hadith 494\nUSC-MSA web (English) reference  : Book 7, Hadith 3128\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated on the authority of Abu Huraira (Allah be pleased with him) through another chain of transmitters."
  },
  "1350": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1350c\nIn-book reference  : Book 15, Hadith 497\nUSC-MSA web (English) reference  : Book 7, Hadith 3131\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of Abu Huraira (Allah be pleased with him)."
  },
  "1351": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1351c\nIn-book reference  : Book 15, Hadith 500\nUSC-MSA web (English) reference  : Book 7, Hadith 3133\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Narrated Usama b. Zaid :\nUsama b. Zaid (Allah be pleased with him) said: Allah's Messenger, God willing, where will you stay tomorrow? Thereupon he (the Holy Prophet) said: Has 'Aqil left any accommodation for us?"
  },
  "1352": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1352e\nIn-book reference  : Book 15, Hadith 505\nUSC-MSA web (English) reference  : Book 7, Hadith 3138\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Juraij narrated this hadith with the same chain of transmitters."
  },
  "1353": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1353b\nIn-book reference  : Book 15, Hadith 507\nUSC-MSA web (English) reference  : Book 7, Hadith 3140\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of Mansur, but he did not mention:\n\" On that very day He created the heavens and the earth,\" and he (the narrator) substituted the word\" fighting\" (qital) for\" killing\" (qatl), and further said:\" No one is to pick up the dropped thing except one who makes a public announcement of it.\""
  },
  "1354": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1354\nIn-book reference  : Book 15, Hadith 508\nUSC-MSA web (English) reference  : Book 7, Hadith 3141\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Shuraih al-'Adawi reported that he said to Amr b. Sa'id when he was sending troops to Mecca:\nLet me tell you something. O Commander, which Allah's Messenger (ﷺ) said on the day following, the Conquest which my ears heard and my heart has retained, and my eyes saw as he spoke it. He praised Allah and extolled Him and then said: Allah, not men, has made Mecca sacred; so it is not permissible for any person believing in Allah and the Last Day to shed blood in it, or lop a tree in it. If anyone seeks a concession on the basis of fighting of Allah's Messenger (ﷺ), tell him that Allah permitted His Messenger, but not you, and He gave him permission only for an hour on one day, and its sacredness was restored on the very day like that of yesterday. Let him who is present convey the information to him who is absent. It was said to Abu Shuraih: What did Amr say to you? He said: I am better informed of that than you, Abu Shuraih, but the sacred territory does not grant protection to one who is disobedient, or one who runs away after shedding blood, or one who runs away after committing"
  },
  "1355": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1355b\nIn-book reference  : Book 15, Hadith 510\nUSC-MSA web (English) reference  : Book 7, Hadith 3143\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported:\nThe people of the Khuza'ah tribe killed a man of the tribe of Laith in the Year of Victory as a retaliation for one whom they had killed (whom the people of the tribe of Laith had killed). It was reported to Allah's Messenger (ﷺ). He mounted his camel and delivered this address: Verily Allah, the Exalted and Majestic, held back the Ele- phants from Mecca, and gave its domination to His Messenger and believers. Behold, it was not violable for anyone before me and it will not be violable for anyone after me. Behold, it was made violable for me for an hour of a day; and at this very hour it has again been made inviolable (for me as well as for others). So its thorns are not to be cut, its trees are not to be lopped, and (no one is allowed to) pick up a thing dropped, but the one who makes an announcement of it. And one whose fellow is killed is allowed to opt between two alternatives: either he should receive blood-money or get the life of the (murderer) in return. He (the narrator said): A person from the Yemen, who was called Abu Shah, came to him and said: Messenger of Allah, write it down for me, whereupon he (Allah's Messenger) said: Write it down for Abu Shah. One of the persons from among the Quraish also said: Except Idhkhir, for we use it in our houses ant our graves. Thereupon Allah's Messenger (ﷺ) said: Except Idhkhir."
  },
  "1356": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1356\nIn-book reference  : Book 15, Hadith 511\nUSC-MSA web (English) reference  : Book 7, Hadith 3144\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (Allah be pleased with him) reported:\nI heard Allah's Apostle (ﷺ) say: It is not permissible for any one of you to carry weapons in Mecca."
  },
  "1357": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1357\nIn-book reference  : Book 15, Hadith 512\nUSC-MSA web (English) reference  : Book 7, Hadith 3145\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas b. Malik (Allah be pleased with them) reported that Allah's Apostle (ﷺ) entered Mecca in the Year of Victory with a helmet on his head; and when he took it off, a man came to him and said:\nIbn Khatal is hanging on to the curtains of the Ka'ba, whereupon he said: Kill him. Malik (one of the narrators) attested this statement having been made."
  },
  "1358": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1358b\nIn-book reference  : Book 15, Hadith 514\nUSC-MSA web (English) reference  : Book 7, Hadith 3147\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Abdullah reported that Allah's Apostle (ﷺ) entered on the day of Victory of Mecca wearing a black turban on his head."
  },
  "1359": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1359b\nIn-book reference  : Book 15, Hadith 516\nUSC-MSA web (English) reference  : Book 7, Hadith 3149\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ja'far b. 'Amr b. Huraith reported his father as saying:\nAs if I am seeing Allah's Messenger (ﷺ) on the pulpit with a black turban on his head, and its two ends hanging between his shoulders. Abu Bakr (another narrator) did not make mention of:\" Upon the pulpit\"."
  },
  "1360": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1360b\nIn-book reference  : Book 15, Hadith 518\nUSC-MSA web (English) reference  : Book 7, Hadith 3150\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated through another chain of transmitters with a slight variation of words."
  },
  "1361": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1361b\nIn-book reference  : Book 15, Hadith 520\nUSC-MSA web (English) reference  : Book 7, Hadith 3152\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Nafi' b. Jubair reported that Marwan b. al-Hakam (Allah be pleased with him) addressed people and made mention of Mecca and its inhabitants and its sacredness, but he made no mention of Medina, its inhabitants and its sacredness. Rafi' b. Khadij called to him and said:\nWhat is this that I hear you making mention of Mecca and its inhabitants and its sacredness, but you did not make mention of Medina and its inhabitants and its sacredness, while the Messenger of Allah (ﷺ) has also declared sacred (the area) between its two lava lands (Medina)? And (we have record of this) with us written on Khaulani parchment. If you like, I can read it out to you. Thereupon Marwan became silent, and then Said: I too have heard some part of it."
  },
  "1362": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1362\nIn-book reference  : Book 15, Hadith 521\nUSC-MSA web (English) reference  : Book 7, Hadith 3153\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:\nIbrahim declared Mecca as sacred; I declare Medina, that between the two mountains, as inviolable. No tree should be lopped and no game is to be molested."
  },
  "1363": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1363b\nIn-book reference  : Book 15, Hadith 523\nUSC-MSA web (English) reference  : Book 7, Hadith 3155\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Amir b. Sa'd b. Abu Waqqas reported on the authority of his father (Allah be pleased with him) that Allah's Messenger (ﷺ) said, and then the (above-mentioned) hadith was narrated with this addition:\n\" None should nurse ill-will towards the people of Medina, or Allah will melt him in fire like the melting of lead or the dissolution of salt in water."
  },
  "1364": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1364\nIn-book reference  : Book 15, Hadith 524\nUSC-MSA web (English) reference  : Book 7, Hadith 3156\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Amir b. Sa'd reported that Sa'd rode to his castle in al-'Aqiq and found a slave cutting down the trees, or beating off their leaves, so he stripped him off his belongings. When Sa'd returned, there came to him the masters of the slave and negotiated with him asking him to return to their slave or to them what he had taken from their slave, whereupon he said:\nGod forbid that I should return anything which Allah's Messenger (ﷺ) has given me as spoil, and refused to return anything to them."
  },
  "1365": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1365b\nIn-book reference  : Book 15, Hadith 526\nUSC-MSA web (English) reference  : Book 7, Hadith 3158\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas b. Malik reported a hadith like this from Allah's Apostle (ﷺ) except with this variation that he said:\n\" I declare sacred the area between its two lava mountains.\""
  },
  "1366": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1366\nIn-book reference  : Book 15, Hadith 527\nUSC-MSA web (English) reference  : Book 7, Hadith 3159\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Asim reported:\nI asked Anas b. Malik whether Allah's Messenger (ﷺ) had declared Medina as sacred. He said: Yes. (the area) between so and so. He who made any innovation in it, and further said to me: It is something serious to make any innovation in it (and he who does it) there is upon him the curse of Allah, and that of the angels and of all the people, Allah will not accept from him on the Day of Resurrection either obligatory acts or the surpererogatory acts. Ibn Anas said: Or he accommodates an innovator."
  },
  "1367": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1367\nIn-book reference  : Book 15, Hadith 528\nUSC-MSA web (English) reference  : Book 7, Hadith 3160\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "'Asim reported:\nI asked Anas (Allah be pleased with him) whether Allah's Messenger (ﷺ) had declared Medina as sacred. He said: Yes, it is sacred, so its tree is not to be cut; and he who did that let the curse of Allah and that of the angels and of all people be upon him."
  },
  "1368": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1368\nIn-book reference  : Book 15, Hadith 529\nUSC-MSA web (English) reference  : Book 7, Hadith 3161\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas b. Malik (Allah be pleased with him) reported that Allah's Messenger (ﷺ) said:\nAllah bless them in their measurements, bless them in their sa's and bless them in their mudd."
  },
  "1369": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1369\nIn-book reference  : Book 15, Hadith 530\nUSC-MSA web (English) reference  : Book 7, Hadith 3162\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Anas b. Malik (Allah he pleased with him) reported that Allah's Messenger (ﷺ) said:\nO Allah, increase in Medina twice the blessings (Thou showered) on Mecca."
  },
  "1370": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1370c\nIn-book reference  : Book 15, Hadith 533\nUSC-MSA web (English) reference  : Book 7, Hadith 3165\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated with the same chain of transmitters by A'mash with a slight variation of words."
  },
  "1371": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1371b\nIn-book reference  : Book 15, Hadith 535\nUSC-MSA web (English) reference  : Book 7, Hadith 3167\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "A hadith like this has been narrated on the authority of A'mash with the same chain of transmitters, but no mention has been made of the Day of Resurrection. But this addition is made:\n\" The protection granted by Muslims is one and must be respected by the humblest of them. And he who broke the covenant made by a Muslim, there is a curse of Allah, of his angels, and of the whole people upon him, and neither an obligatory act nor a supererogatory act would be accepted from him as recompense on the Day of Resurrection.\""
  },
  "1372": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1372b\nIn-book reference  : Book 15, Hadith 537\nUSC-MSA web (English) reference  : Book 7, Hadith 3169\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) declared sacred the territory between two lava mountains of Medina. Abu Huraira said:\nIf I were to find deer in the territory between the two mountains, I would not molest them, and he (the Holy Prophet) declared twelve miles of suburb around Medina as a prohibited pasture."
  },
  "1373": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1373b\nIn-book reference  : Book 15, Hadith 539\nUSC-MSA web (English) reference  : Book 7, Hadith 3171\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported that Allah's Messenger (ﷺ) was given the first fruit and he said:\nO Allah, shower blessings upon us in our city, and in our fruits, in our mudd and in our sa's, blessings upon blessings, and he would then give that to the youngest of the children present there."
  },
  "1374": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1374e\nIn-book reference  : Book 15, Hadith 544\nUSC-MSA web (English) reference  : Book 7, Hadith 3176\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abd al-Rahman reported on the authority of his father Abu Sa'id (Allah be pleased with him) that he heard Allah's Messenger (ﷺ) as saying:\nI have declared sacred what is between the two lava grounds of Medina just as Ibrahim (peace be upon him) declared Mecca as sacred. He (the narrator) then said: Abu Sa'id caught hold of (Abu Bakr, another narrator, used the word\" found\" ) a bird in his hand and then released it from his hand and set it free."
  },
  "1375": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1375\nIn-book reference  : Book 15, Hadith 545\nUSC-MSA web (English) reference  : Book 7, Hadith 3177\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Sahl b. Hunif reported that Allah's Messenger (ﷺ) pointed with his hands towards Medina and said:\nThat is a sacred territory and a place of safety."
  },
  "1376": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1376b\nIn-book reference  : Book 15, Hadith 547\nUSC-MSA web (English) reference  : Book 7, Hadith 3179\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated by Hisham b. 'Urwa with the same chain of transmitters."
  },
  "1377": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1377c\nIn-book reference  : Book 15, Hadith 550\nUSC-MSA web (English) reference  : Book 7, Hadith 3182\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. 'Umar (Allah be pleased with them) said:\nI heard Allah's Messenger (ﷺ) as saying: He who patiently endured the hardships and rigours of (this city, i. e. Medina), I would be his witness and intercessor on the Day of Resurrection."
  },
  "1378": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1378c\nIn-book reference  : Book 15, Hadith 553\nUSC-MSA web (English) reference  : Book 7, Hadith 3185\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nNone who shows endurance on the hardships of Medina,... (the rest of the hadith is the same)."
  },
  "1379": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1379\nIn-book reference  : Book 15, Hadith 554\nUSC-MSA web (English) reference  : Book 7, Hadith 3186\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nThere are at the approaches of Medina angels so that plague and the Dajjal shall not penetrate into it."
  },
  "1380": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1380\nIn-book reference  : Book 15, Hadith 555\nUSC-MSA web (English) reference  : Book 7, Hadith 3187\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nDajjal will come from the eastern side with the intention of attacking Medina until he will get down behind Uhud. Then the angels will turn his face towards Syria and there he will perish."
  },
  "1381": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1381\nIn-book reference  : Book 15, Hadith 556\nUSC-MSA web (English) reference  : Book 7, Hadith 3188\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nA time will come for the people (of Medina) when a man will invite his cousin and any other near relation: Come (and settle) at (a place) where living is cheap, come to where there is plenty, but Medina will be better for them; would they know it! By Him in Whose Hand is my life, none amongst them would go out (of the city) with a dislike for it, but Allah would make his successor in it someone better than be. Behold. Medina is like furnace which eliminates from it the impurities. And the Last Hour will not come until Medina banishes its evils just as a furnace eliminates the impurities of iron."
  },
  "1382": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1382b\nIn-book reference  : Book 15, Hadith 558\nUSC-MSA web (English) reference  : Book 7, Hadith 3190\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated by Yabya b. Sa'id with the same chain of transmitters (and the words are):\n\" Just as a furance removes impurity,\" but no mention is made of iron."
  },
  "1383": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1383\nIn-book reference  : Book 15, Hadith 559\nUSC-MSA web (English) reference  : Book 7, Hadith 3191\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. `Abdullah (Allah be pleased with them) reported that a desert Arab swore allegiance to Allah's Messenger (ﷺ). He suffered from a severe fever in Medina (and) so he came to Allah's Messenger (ﷺ) saying:\nMuhammad, cancel my oath of allegiance. But Allah's Messenger (ﷺ) refused it. He again came and said: Cancel my oath of allegiance. But he (the Holy Prophet) refused it. He again came to him and said: Cancel my oath of allegiance, but he refused. The desert Arab, however, went away (cancelling the allegiance himself). Thereupon Allah's Messenger (ﷺ) said: Medina is like a furnace which drives away its impurity and purifies what is good."
  },
  "1384": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1384\nIn-book reference  : Book 15, Hadith 560\nUSC-MSA web (English) reference  : Book 7, Hadith 3192\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Zaid b. Thabit reported Allah's Apostle (ﷺ) as saying:\nIt is Taiba, thereby meaning Medina. It drives away impurity just as fire removes the impurity of silver."
  },
  "1385": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1385\nIn-book reference  : Book 15, Hadith 561\nUSC-MSA web (English) reference  : Book 7, Hadith 3193\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Jabir b. Samura (Allah be pleased with him) reported that he heard Allah's Messenger (ﷺ) say:\nAllah named Medina as Tabba."
  },
  "1386": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1386c\nIn-book reference  : Book 15, Hadith 564\nUSC-MSA web (English) reference  : Book 7, Hadith 3196\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith is narrated on the authority of Abu Huraira by another chain of transmitters."
  },
  "1387": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1387c\nIn-book reference  : Book 15, Hadith 567\nUSC-MSA web (English) reference  : Book 7, Hadith 3199\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira and Sa'd reported Allah's Messenger (way peace be upon him) as saying:\nO Allah, bless the people of Medina in their mudd, the rest of the hadith being the same, and in It (this is also mentioned):\" He wo intends to do harm to its people, Allah would efface him just as salt it dissolved in water.\""
  },
  "1388": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1388b\nIn-book reference  : Book 15, Hadith 569\nUSC-MSA web (English) reference  : Book 7, Hadith 3201\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Sufyan b. Abu Zuhair heard Allah's Messenger (ﷺ) say:\nYemen will be conquered and some people will go away (to that country) driving their camels and carrying their families on them and those who are under their authority, while Medina is better for them if they were to know it. Then Syria will be conquered and some people will go away driving their camels along with them and carrying their families with them and those who are under their authority, while Medina is better for theni if they were to know it. Thtn lraq will be conquered and some people will go away (to that country) driving their camels and carrying their families with them and those who are under their authority. while Medina is better for them if they were to know it."
  },
  "1389": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1389b\nIn-book reference  : Book 15, Hadith 571\nUSC-MSA web (English) reference  : Book 7, Hadith 3203\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) heard Allah's Messenger (ﷺ) say:\nThey (the residents of) Medina will abandon Medina whereas it is good for them and it will be haunted by beasts and birds, and two shepherds will come out from Muzainah intending (to go) towards Medina and tending their herd, and will find nothing but wilderness there until when they will reach the mountain path of Wada, they will fall down on their faces."
  },
  "1390": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1390b\nIn-book reference  : Book 15, Hadith 573\nUSC-MSA web (English) reference  : Book 7, Hadith 3205\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abdullah b. Zaid al-Ansari heard Allah's Messenger (ﷺ) as saying:\nThat which exists between my pulpit and my house is a garden from the gardens of Paradise."
  },
  "1391": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1391\nIn-book reference  : Book 15, Hadith 574\nUSC-MSA web (English) reference  : Book 7, Hadith 3206\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nThat which exists between my house and my pulpit is a garden from the gardens of Paradise, and my pulpit is upon my cistern."
  },
  "1392": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1392\nIn-book reference  : Book 15, Hadith 575\nUSC-MSA web (English) reference  : Book 7, Hadith 3207\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Humaid (Allah be pleased with him) reported:\nWe went out along with Allah's Messenger (ﷺ) in the expedition of Tabuk, and Abu Humaid further related: We proceeded until we reached the valley of Qura; and Allah's Messenger (ﷺ) said: I am going forth, so he among you who wants to move fast with me may do so; and he who likes to go slowly may do so. We proceeded until Medina was within our sight, and he said: This is Tabah (another name of Medina); this is Uhud, the mountain which loves us and we love it."
  },
  "1393": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1393b\nIn-book reference  : Book 15, Hadith 577\nUSC-MSA web (English) reference  : Book 7, Hadith 3208\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith is narrated by Anas b. Malik (Allah be pleased with him) with another chain of transmitters (and the words are):\n\" Allah's Messenger (ﷺ) cast a glance at Uhud and said: Uhud is a mountain which loves us and we love it.\""
  },
  "1394": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1394e\nIn-book reference  : Book 15, Hadith 582\nUSC-MSA web (English) reference  : Book 7, Hadith 3212\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadith has been narrated by Yabya b. Sa'id with the same chain of transmitters."
  },
  "1395": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1395d\nIn-book reference  : Book 15, Hadith 586\nUSC-MSA web (English) reference  : Book 7, Hadith 3216\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Umar narrated from Allah's Apostle (ﷺ) a hadlth like this."
  },
  "1396": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1396\nIn-book reference  : Book 15, Hadith 587\nUSC-MSA web (English) reference  : Book 7, Hadith 3217\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Ibn Abbas (Allah be pleased with them) reported that a woman fell ill and she said:\nIn case Allah cures me I will certainly go and observe prayer in Bait al-Maqdis. She recovered and so she made preparations to go out (to that place). She came to Maimuna. the wife of Allah's Apostle (ﷺ). and after greeting her she informed her about it, whereupon she said: Stay here. and eat the provision (which you had made) and observe prayer In the mosque of the Messenger (ﷺ). for I heard Allah's Messenger (ﷺ) say: Prayer In it is better than a thousand prayers observed in other mosques except the mosque of the Ka'ba."
  },
  "1397": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1397c\nIn-book reference  : Book 15, Hadith 590\nUSC-MSA web (English) reference  : Book 7, Hadith 3220\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Haraira (Allah be pleased with him) reported Allah's Messenger (way peace be upon him) as saying:\nOne should undertake journey to three mosques: the mosque of the Ka'ba, my mosque, and the mosque of Elia (Bait al-Maqdis)."
  },
  "1398": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1398b\nIn-book reference  : Book 15, Hadith 592\nUSC-MSA web (English) reference  : Book 7, Hadith 3222\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "Abu Sa'id reported from Allah's Apostle (ﷺ) a hadlth like this, but in the chain of transmitters no mention was made of Abd al- Rahman b. Abu Sa'id."
  },
  "1399": {
    "collection": "Sahih Muslim",
    "book": "The Book of Pilgrimage",
    "book_num": "15",
    "reference": "Reference  : Sahih Muslim 1399i\nIn-book reference  : Book 15, Hadith 601\nUSC-MSA web (English) reference  : Book 7, Hadith 3230\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/15",
    "text": "This hadlth has been narrated on the authority of Ibn Dinar, but he made no mention of:\n\" Every Saturday.\""
  }
}