{
  "2880": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2880d\nIn-book reference  : Book 54, Hadith 4\nUSC-MSA web (English) reference  : Book 41, Hadith 6884\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Zuhri with a different chain of transmitters."
  },
  "2881": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2881\nIn-book reference  : Book 54, Hadith 5\nUSC-MSA web (English) reference  : Book 41, Hadith 6885\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:\nToday the wall (barrier) of Gog and Magog has been opened so much, and Wuhaib (in order to explain it) made the figure of ninety with the help of his hand."
  },
  "2882": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2882b\nIn-book reference  : Book 54, Hadith 7\nUSC-MSA web (English) reference  : Book 41, Hadith 6887\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of 'Abdullah b. Rufai, with the same chain of transmitters (but with the addition of these words):\n\" When I met Abu Ja'far I told him that she (simply) meant the plain ground. Thereupon Abu Ja'far said: No, by God, she meant the plain ground of Medina."
  },
  "2883": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2883b\nIn-book reference  : Book 54, Hadith 9\nUSC-MSA web (English) reference  : Book 41, Hadith 6889\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abdullah b. Safwan reported the Mother of the Faithful as saying that Allah's Messenger (ﷺ) said:\nThey would soon seek protection in this House, viz. Ka'ba (the defenceless), people who would have nothing to protect themselves in the shape of weapons or the strength of the people. An army would be sent to fight (and kill) them and when they would enter a plain ground the army would be sunk in it. Yusuf (one of the narrators) said: It was a people of Syria (hordes of Hajjaj) who had been on that day coming towards Mecca for an attack (on 'Abdulllah b. Zubair) and Abdullah b. Safwan said: By God, it does not imply this army."
  },
  "2884": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2884\nIn-book reference  : Book 54, Hadith 10\nUSC-MSA web (English) reference  : Book 41, Hadith 6890\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "'A'isha reported that Allah's Messenger (ﷺ) was startled in the state of sleep. We said:\nAllah's Messenger, you have done something in the state of your sleep which you never did before, Thereupon he said: Strange it is that some people of my Ummah would attack the House (Ka'ba) (for killing) a person who would belong to the tribe of the Quraish and he would try to seek protection in the House. And when they would reach the plain ground they would be sunk. We said: Allah's Messenger, all sorts of people throng the path. Thereupon he said: Yes, there would be amongst them people who would come with definite designs and those who would come under duress and there would be travellers also, but they would all be destroyed through one (stroke) of destruction. though they would be raised in different states (on the Day of Resurrection). Allah would, however, raise them according to their intention."
  },
  "2885": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2885b\nIn-book reference  : Book 54, Hadith 12\nUSC-MSA web (English) reference  : Book 41, Hadith 6892\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Zuhri with the same chain of transmitters."
  },
  "2886": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2886c\nIn-book reference  : Book 54, Hadith 15\nUSC-MSA web (English) reference  : Book 41, Hadith 6895\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Apostle (ﷺ) as saying:\nThere would be turmoil and the one who would sleep would be better than who would be awake and the one who would be awake would be better than one who would stand and one who would stand would be better than one who would run. So he who finds refuge or shelter should take that refuge or shelter."
  },
  "2887": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2887b\nIn-book reference  : Book 54, Hadith 17\nUSC-MSA web (English) reference  : Book 41, Hadith 6897\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been transmitted on the authority of Waki' with a slight variation of wording."
  },
  "2888": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2888d\nIn-book reference  : Book 54, Hadith 21\nUSC-MSA web (English) reference  : Book 41, Hadith 6901\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Bakra reported Allah's Messenger (ﷺ) as saying:\nWhen two Muslims (confront each other) and the one amongst them attacks his brother with a weapon, both of them are at the brink of Hell-Fire. And when one of them kills his companion, both of them get into Hell-Fire."
  },
  "157": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 157n\nIn-book reference  : Book 54, Hadith 107\nUSC-MSA web (English) reference  : Book 41, Hadith 6989\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been transmitted on the authority of Abu Huraira with a slight variation of wording."
  },
  "2889": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2889b\nIn-book reference  : Book 54, Hadith 25\nUSC-MSA web (English) reference  : Book 41, Hadith 6905\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Thauban reported that Allah's Messenger (ﷺ) said. Verily, Allah drew the ends of the world near me until I saw its east and west, and He bestowed upon me two treasures, the red and the white. The rest of the hadith is the same."
  },
  "2890": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2890b\nIn-book reference  : Book 54, Hadith 27\nUSC-MSA web (English) reference  : Book 41, Hadith 6907\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Amir b. Sa'd reported on the authority of his father that Allah's Messenger (ﷺ) came with a group of his Companions and he passed by the mosque of Banu Mu'awiya. The rest of the hadith is the same."
  },
  "2891": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2891e\nIn-book reference  : Book 54, Hadith 32\nUSC-MSA web (English) reference  : Book 41, Hadith 6912\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters."
  },
  "2892": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2892\nIn-book reference  : Book 54, Hadith 33\nUSC-MSA web (English) reference  : Book 41, Hadith 6913\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Zaid (viz. Amr b. Akhtab) reported:\nAllah's Messenger (ﷺ) led us in the dawn prayer and then mounted the pulpit and addressed us until it was (time for the) noon prayer. He then came down the pulpit and observed prayer and then again mounted the pulpit and again addressed us until it was time for the 'Asr prayer. He then again came down and observed the prayer and again mounted the pulpit and addressed us until the sun was set and he informed (about) everything (pertaining to turmoil) that lay hidden in the past and what lies in (the womb) of) the future and the most learned amongst us is one who remembers them well"
  },
  "144": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 144f\nIn-book reference  : Book 54, Hadith 36\nUSC-MSA web (English) reference  : Book 41, Hadith 6916\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Hudhaifa reported that Umar said:\nWho would narrate to us (the ahadith pertaining to turmoil) and he reported a hadith similar to these ahadith."
  },
  "2893": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2893\nIn-book reference  : Book 54, Hadith 37\nUSC-MSA web (English) reference  : Book 41, Hadith 6917\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Jundub reported:\nI came on the day of Jara`a that a person was (found) sitting. I said: They would shed their blood today. That person said: By Allah. not at all. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it. I said: By Allah, of course, they would do it. He said: By Allah, they would not do it, and I have heard a hadith of Allah's Messenger (ﷺ) which I am narrating to you in this connection. I said: You are a bad seat fellow. I have been opposing you since morning and you are listening to me in spite of the fact that you have heard a hadith from Allah's Apostle (ﷺ) (contrary to my statement). I myself felt that there was no use of this annoyance. (He could tell me earlier that it was a hadith of the Prophet (may peace be upon him], and I would not have opposed him at all.) I turned my face toward him and asked him and he was Hadrat Hudhaifa."
  },
  "2894": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2894d\nIn-book reference  : Book 54, Hadith 41\nUSC-MSA web (English) reference  : Book 41, Hadith 6921\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe Euphrates would soon uncover a mountain of gold but he who is present there should not take anything from that."
  },
  "2895": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2895\nIn-book reference  : Book 54, Hadith 42\nUSC-MSA web (English) reference  : Book 41, Hadith 6922\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "`Abdullah b. Harith b. Naufal reported:\nI was standing along with Ubayy b. Ka`b and he said: The opinions of the people differ in regard to the achievement of worldly ends. I said: Yes, of course. Thereupon he said: I heard Allah's Messenger (ﷺ) as saying: The Euphrates would soon uncover a mountain of gold and when the people would bear of it they would flock towards it but the people who would possess that (treasure) (would say): If we allow these persons to take out of it they would take away the whole of it. So they would fight and ninety-nine out of one hundred would be killed. Abu Kamil in his narration said: I and Ubayy b. Ka`b stood under the shade of the battlement of Hassan."
  },
  "2896": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2896\nIn-book reference  : Book 54, Hadith 43\nUSC-MSA web (English) reference  : Book 41, Hadith 6923\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nIraq would withhold its dirhams and qafiz; Syria would withhold its mudd and dinar and Egypt would withhold its irdab and dinar and you would recoil to that position from where you started and you would recoil to that position from where you started and you would recoil to that position from where you started, the flesh and blood of Abu Huraira would bear testimony to it."
  },
  "2897": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2897\nIn-book reference  : Book 54, Hadith 44\nUSC-MSA web (English) reference  : Book 41, Hadith 6924\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe Last Hour would not come until the Romans would land at al-A'maq or in Dabiq. An army consisting of the best (soldiers) of the people of the earth at that time will come from Medina (to counteract them). When they will arrange themselves in ranks, the Romans would say: Do not stand between us and those (Muslims) who took prisoners from amongst us. Let us fight with them; and the Muslims would say: Nay, by Allah, we would never get aside from you and from our brethren that you may fight them. They will then fight and a third (part) of the army would run away, whom Allah will never forgive. A third (part of the army) which would be constituted of excellent martyrs in Allah's eye, would be killed and the third who would never be put to trial would win and they would be conquerors of Constantinople. And as they would be busy in distributing the spoils of war (amongst themselves) after hanging their swords by the olive trees, the Satan would cry: The Dajjal has taken your place among your family. They would then come out, but it would be of no avail. And when they would come to Syria, he would come out while they would be still preparing themselves for battle drawing up the ranks. Certainly, the time of prayer shall come and then Jesus (peace be upon him) son of Mary would descend and would lead them. When the enemy of Allah would see him, it would (disappear) just as the salt dissolves itself in water and if he (Jesus) were not to confront them at all, even then it would dissolve completely, but Allah would kill them by his hand and he would show them their blood on his lance (the lance of Jesus Christ)."
  },
  "2898": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2898b\nIn-book reference  : Book 54, Hadith 46\nUSC-MSA web (English) reference  : Book 41, Hadith 6926\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Mustaurid Qurashi reported:\nI heard Allah's Messenger (ﷺ) as saying: The Last Hour would come when the Romans would form a majority amongst people. This reached 'Amr b. al-'As and he said: What are these ahadith which are being transmitted from you and which you claim to have heard from Allah's Messenger (ﷺ)? Mustaurid said to him: I stated only that which I heard from Allah's Messenger (ﷺ). Thereupon 'Amr said: If you state this (it is true), for they have the power of tolerance amongst people at the time of turmoil and restore themselves to sanity after trouble, and are good amongst people so far as the destitute and the weak are concerned."
  },
  "2899": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2899c\nIn-book reference  : Book 54, Hadith 49\nUSC-MSA web (English) reference  : Book 41, Hadith 6929\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Jabir reported:\nI was in the house of 'Abdullah b. Mas'ud and the house was fully packed that a red storm blew in Kufah."
  },
  "2900": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2900\nIn-book reference  : Book 54, Hadith 50\nUSC-MSA web (English) reference  : Book 41, Hadith 6930\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Nafi' b. Utba reported:\nWe were with Allah's Messenger (ﷺ) in an expedition that there came a people to Allah's Apostle (ﷺ) from the direction of the west. They were dressed in woollen clothes and they stood near a hillock and they met him as Allah's Messenger (ﷺ) was sitting. I said to myself: Better go to them and stand between him and them that they may not attack him. Then I thought that perhaps there had been going on secret negotiation amongst them. I however, went to them and stood between them and him and I remember four of the words (on that occasion) which I repeat (on the fingers of my hand) that he (Allah's Messenger) said: You will attack Arabia and Allah will enable you to conquer it, then you would attack Persia and He would make you to conquer it. Then you would attack Rome and Allah will enable you to conquer it, then you would attack the Dajjal and Allah will enable you to conquer him. Nafi' said: Jabir, we thought that the Dajjal would appear after Rome (Syrian territory) would be conquered."
  },
  "2901": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2901d\nIn-book reference  : Book 54, Hadith 54\nUSC-MSA web (English) reference  : Book 41, Hadith 6933\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Another chain of transmitters reports the like of the previous two chains.\nAbu Sariha reported:\nWe were discussing (the Last Hour) that Allah's Apostle (ﷺ) looked towards us. The rest of the hadith is the same and the tenth (sign) was the descent of Jesus Christ son of Mary, and Shu'ba said: 'Abd al-'Aziz did not trace it directly to Allah's Apostle (ﷺ)."
  },
  "2902": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2902\nIn-book reference  : Book 54, Hadith 55\nUSC-MSA web (English) reference  : Book 41, Hadith 6935\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported that Allah's Messenger (ﷺ) said:\nThe Last Hour would not come until fire emits from the earth of Hijaz which would illuminate the necks of the camels of the Busra."
  },
  "2903": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2903\nIn-book reference  : Book 54, Hadith 56\nUSC-MSA web (English) reference  : Book 41, Hadith 6936\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported that Allah's Messenger (ﷺ) said:\n(The Last Hour would not come) until the habitations of Medina would extend to Ihab or Yahab. Zubair said: I said to Suhail how far these were from Medina. He said: So and so miles."
  },
  "2904": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2904\nIn-book reference  : Book 54, Hadith 57\nUSC-MSA web (English) reference  : Book 41, Hadith 6937\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe famine would not break out because of drought, but there would be famine despite heavy rainfall as nothing would grow from the earth."
  },
  "2905": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2905f\nIn-book reference  : Book 54, Hadith 63\nUSC-MSA web (English) reference  : Book 41, Hadith 6943\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Ibn Fudail reported on the authority of his father that he heard Salim b. `Abdullah b. `Umar as saying:\nO people of Iraq, how strange it is that you ask about the minor sins but commit major sins? I heard from my father `Abdullah b. `Umar, narrating that he heard Allah's Messenger (ﷺ) as saying while pointing his hand towards the east: Verily, the turmoil would come from this side, from where appear the horns of Satan and you would strike the necks of one another; and Moses killed a person from among the people of Pharaoh unintentionally and Allah, the Exalted and Glorious, said: \"You killed a person but We relieved you from the grief and tried you with (many a) trial\" (xx. 40). Ahmad b. `Umar reported this hadith from Salim, but he did not make a mention of the words: \"I heard\"."
  },
  "2906": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2906\nIn-book reference  : Book 54, Hadith 64\nUSC-MSA web (English) reference  : Book 41, Hadith 6944\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe Last Hour would not come until the women of the tribe of Daus would be seen going round Dhi al-Khalasa (for worship) and Dhi al-Khalasa is a place in Tabala, where there was a temple in which the people of the tribe of Daus used to worship the idol."
  },
  "2907": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2907b\nIn-book reference  : Book 54, Hadith 66\nUSC-MSA web (English) reference  : Book 41, Hadith 6946\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Ibn Ja'far with the same chain of transmitters."
  },
  "2908": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2908b\nIn-book reference  : Book 54, Hadith 70\nUSC-MSA web (English) reference  : Book 41, Hadith 6950\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe world would not come to an end until a day would come to the people on which the murderer would not know as to why he has killed and the slain would not know as to why he has been murdered. It would be said: Why would It happen? To which he replied: It would be because of general massacre and bloodshed. And the slaughterers and the slain would be in Fire, and in the narration of Ibn Aban, the name of Abu Isma'il has been mentioned."
  },
  "2909": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2909c\nIn-book reference  : Book 54, Hadith 73\nUSC-MSA web (English) reference  : Book 41, Hadith 6953\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nIt would be an Abyssinian having two small shanks who would destroy the House ol Allah, the Exalted and Glorious."
  },
  "2910": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2910\nIn-book reference  : Book 54, Hadith 74\nUSC-MSA web (English) reference  : Book 41, Hadith 6954\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messengar (ﷺ) as saying:\nThe Last Hour would not come before a person of Qahtan comes forth driving people with his stick."
  },
  "2911": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2911\nIn-book reference  : Book 54, Hadith 75\nUSC-MSA web (English) reference  : Book 41, Hadith 6955\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe day and the night would not come to an end before a man called al-Jahjah would occupy the throne."
  },
  "2912": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2912e\nIn-book reference  : Book 54, Hadith 80\nUSC-MSA web (English) reference  : Book 41, Hadith 6960\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nYou shall fight in the hours to come against a nation wearing shoes made of hair and faces like hammered shields, with red complexion and small eyes."
  },
  "2913": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2913/2914b\nIn-book reference  : Book 54, Hadith 85\nUSC-MSA web (English) reference  : Book 41, Hadith 6965\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Abu Sa'id through another chain of transmitters."
  },
  "2914": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2914\nIn-book reference  : Book 54, Hadith 83\nUSC-MSA web (English) reference  : Book 41, Hadith 6963\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Sa'id reported that Allah's Messenger (may peace he upon him) I said:\nThere would be amongst your caliphs a caliph who would give handfuls of wealth to the people, but would not count it. In the narration transmitted on the authority of Ibn Hujr, there is a slight variation of wording."
  },
  "2915": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2915b\nIn-book reference  : Book 54, Hadith 87\nUSC-MSA web (English) reference  : Book 41, Hadith 6967\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been transmitted on the same authority but with this variation that the hadith transmitted on the authority of Nabra (the words are):\nOne who is better than I informed me, and he was Abu Qatada, and in the hadith transmitted on the authority of Khalid instead of the word 'bu'us' there is 'wayys' or 'ya wayys', i.e., \" how sad it is\"."
  },
  "2916": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2916c\nIn-book reference  : Book 54, Hadith 90\nUSC-MSA web (English) reference  : Book 41, Hadith 6970\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Umm Salama reported that Allah's Messenger (ﷺ) said:\nA band of rebels would kill `Ammar."
  },
  "2917": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2917\nIn-book reference  : Book 54, Hadith 91\nUSC-MSA web (English) reference  : Book 41, Hadith 6971\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported that Allah's Apostle (ﷺ) as saying:\nThis tribe of the Quraish would kill (people) of my Ummah. They (the Companions) said: What do you command us to do (in such a situation)? Thereupon he said: Would that the people remain aside from them (and not besmear their hands with the blood of the Muslim).\nThis hadith has been narrated on the authority of Shu'ba with the same chain of transmitters."
  },
  "2918": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2918b\nIn-book reference  : Book 54, Hadith 93\nUSC-MSA web (English) reference  : Book 41, Hadith 6975\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Hammam b. Munabbih reported:\nThis is what Abu Huraira reported from Allah's messenger (ﷺ) and in this connection he reported so many hadith (and one of them was this): Allah's Messenger (ﷺ) said: Kisra would die and then there would be no Kisra after him. Qaisar would die and there would be no Qaisar after him, but you will distribute their treasures in the cause of Allah."
  },
  "2919": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2919c\nIn-book reference  : Book 54, Hadith 96\nUSC-MSA web (English) reference  : Book 41, Hadith 6978\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Jabir b. Samura reported:\nI heard Allah's Messenger (ﷺ) a hadith like this."
  },
  "2920": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2920b\nIn-book reference  : Book 54, Hadith 98\nUSC-MSA web (English) reference  : Book 41, Hadith 6980\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Thaur b. Zaid has narrated this hadith with the same chain of transmitters."
  },
  "2921": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2921d\nIn-book reference  : Book 54, Hadith 102\nUSC-MSA web (English) reference  : Book 41, Hadith 6984\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abdullah b. 'Umar reported that Allah's Messenger (ﷺ) said:\nThe Jews will fight against you and you will gain victory over them until the stone would say: Muslim, here is a Jew behind me; kill him."
  },
  "2922": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2922\nIn-book reference  : Book 54, Hadith 103\nUSC-MSA web (English) reference  : Book 41, Hadith 6985\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe last hour would not come unless the Muslims will fight against the Jews and the Muslims would kill them until the Jews would hide themselves behind a stone or a tree and a stone or a tree would say: Muslim, or the servant of Allah, there is a Jew behind me; come and kill him; but the tree Gharqad would not say, for it is the tree of the Jews."
  },
  "2923": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2923b\nIn-book reference  : Book 54, Hadith 105\nUSC-MSA web (English) reference  : Book 41, Hadith 6987\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Simak with the same chain of transmitters. and Simak said:\nI heard my brother say that jabir had stated: Be on your guard against them."
  },
  "2924": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2924b\nIn-book reference  : Book 54, Hadith 109\nUSC-MSA web (English) reference  : Book 41, Hadith 6991\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "'Abdullah reported:\nWe were walking with Allah's Messenger (ﷺ) that Ibn Sayyad happened to pass by him. Allah's Messenger (ﷺ) said to him: I have concealed for you (something to test you, so tell me that). He said: It is Dukh. Thereupon Allah's Messenger (ﷺ) said to him: Be off. You cannot get farther than your rank, whereupon 'Umar said: Allah's Messenger, permit me to strike his neck. Thereupon Allah's Messenger (ﷺ) said: Leave him; if he is that one (Dajjal) whom you apprehend, you will not be able to kill him."
  },
  "2925": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2925\nIn-book reference  : Book 54, Hadith 110\nUSC-MSA web (English) reference  : Book 41, Hadith 6992\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Sa'id reported that Allah's Messenger (ﷺ) met him (Ibn Sayyad) and so did Abu Bakr and 'Umar on some of the roads of Medina. Allah's Messenger (ﷺ) said:\nDo you bear testimony to the fact that I am the Messenger of Allah? Thereupon he said: Do you bear testimony to the fact that I am the messenger of Allah? Thereupon Allah's Messenger (ﷺ) said: I affirm my faith in Allah and in His Angels and in His Books, and what do you see? He said: I see the throne over water. Whereupon Allah's Messenger (ﷺ) said: You see the throne of Iblis upon the water, and what else do you see? He said: I see two truthfuls and a liar or two liars and one truthful. Thereupon Allah's Messenger (ﷺ) said: Leave him He has been confounded."
  },
  "2926": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2926\nIn-book reference  : Book 54, Hadith 111\nUSC-MSA web (English) reference  : Book 41, Hadith 6993\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Jabir b 'Abdullah reported that Allah's Messenger (ﷺ) met Ibn Sa'id (Sayyad) and there were with him Abu Bakr and 'Umar and Ibn Sayyad was in the company of children. The rest of the hadith is the same."
  },
  "2927": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2927c\nIn-book reference  : Book 54, Hadith 114\nUSC-MSA web (English) reference  : Book 41, Hadith 6996\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Sa`id al-Khudri reported:\nWe came back after having performed Pilgrimage or `Umra and lbn Sa'id was along with us. And we encamped at a place and the people dispersed and I and he were left behind. I felt terribly frightend from him as it was said about him that he was the Dajjal. He brought his goods and placed them by my luggage and I said: It is intense heat. Would you not place that under that tree? And he did that. Then there appeared before us a flock of sheep. He went and brought a cup of milk and said: Abu Sa`id, drink that. I said it is intense heat and the milk is also hot (whereas the fact was) that I did not like to drink from his hands or to take it from his hand and he said: Abu Sa`id, I think that I should take a rope and suspend it by the tree and then commit suicide because of the talks of the people, and he further said. Abu Sa`id he who is ignorant of the saying of Allah's Messenger (ﷺ) (he is to be pardoned), but O people of Ansar, is this hadith of Allah's Messenger (ﷺ) concealed from you whereas you have the best knowledge of the hadith of Allah's Messenger (ﷺ) amongst people? Did Allah's Messenger (ﷺ) not say that he (Dajjal) would be a non believer whereas I am a believer? Did Allah's Messenger (ﷺ) not say he would be barren and no child would be born to him, whereas I have left my children in Medina? Did Allah's Messenger (may peace upon him) not say: He would not get into Medina and Mecca whereas I have been coming from Medina and now I intend to go to Mecca? Abu Sa`id said: I was about to accept the excuse put forward by him. Then he said: I know the place where he would be born and where he is now. So I said to him: May your whole day be spent."
  },
  "2928": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2928b\nIn-book reference  : Book 54, Hadith 116\nUSC-MSA web (English) reference  : Book 41, Hadith 6998\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Sa'id reported that Ibn Sayyad asked Allah's Messenger (ﷺ) about the earth of Paradise. Whereupon he said:\nIt is like white shining pure musk."
  },
  "2929": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2929\nIn-book reference  : Book 54, Hadith 117\nUSC-MSA web (English) reference  : Book 41, Hadith 6999\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "'Muhammad b. Munkadir reported:\nAs I saw Jabir b. 'Abdullah taking an oath in the name of Allah that it was Ibn Sa'id who was the Dajjal I said: Do you take an oath in the name of Allah? Thereupon he said: I heard 'Umar taking an oath in the presence of Allah's Apostle (ﷺ) to this effect but Allah's Apostle (ﷺ) did not disapprove of it."
  },
  "2930": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2930c\nIn-book reference  : Book 54, Hadith 120\nUSC-MSA web (English) reference  : Book 41, Hadith 7002\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Ibn 'Umar reported that Allah's Messenger (ﷺ) happened to pass by Ibn Sayyad along with his Companions including 'Umar b. Khattab as he was playing with children near the battlement of Bani Maghala and he was also a child by that time. The rest of the hadith is the same as narrated by Ibn Umar (in which there is a mention of) setting out of Allah's Apostle (ﷺ) along with Ubayy b. Ka'b towards the date-palm trees."
  },
  "2932": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2932b\nIn-book reference  : Book 54, Hadith 122\nUSC-MSA web (English) reference  : Book 41, Hadith 7004\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Nafi' reported that Ibn 'Umar said:\nI met lbn Sayyad twice and said to some of them (his friends): You state that it was he (the Dajjal). He said: By Allah, it is not so. I said: You have not told me the truth; by Allah some of you informed me that he would not die until he would have the largest number of offspring and huge wealth and it is he about whom it is thought so. Then Ibn Sayyad talked to us. I then departed and met him again for the second time and his eye had been swollen. I said: What has happened to your eye? He said: I do not know. I said: This is in your head and you do not know about it? He said: If Allah so wills He can create it (eye) in your staff. He then produced a sound like the braying of a donkey. Some of my companions thought that I had struck him with the staff as he was with me that the staff broke into pieces, but, by Allah, I was not conscious of it. He then came to the Mother of the Faithful (Hafsa) and narrated it to her and she said: What concern you have with him? Don't you know that Allah's Apostle (ﷺ) said that the first thing (by the incitement of which) he would come out before the public would be his anger?"
  },
  "169": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 169f\nIn-book reference  : Book 54, Hadith 124\nUSC-MSA web (English) reference  : Book 41, Hadith 7006\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Ibn 'Umar through another chain of transmitters."
  },
  "2933": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2933c\nIn-book reference  : Book 54, Hadith 127\nUSC-MSA web (English) reference  : Book 41, Hadith 7009\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:\nDajjal is blind of one eye and there is written between his eyes the word\" Kafir\". He then spelled the word as k. f. r., which every Muslim would be able to read."
  },
  "2934": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2934/2935\nIn-book reference  : Book 54, Hadith 130\nUSC-MSA web (English) reference  : Book 41, Hadith 7011\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Hudhaifa reported Allah's Messenger (ﷺ) as saying:\nthe Dajjal would have with him water and fire and his fire would have the effect of cold water and his water would have the effect of fire, so don't put yourself to ruin. Abu Mas'ud reported: I also heard it from Allah's Messenger (ﷺ)."
  },
  "2935": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2935b\nIn-book reference  : Book 54, Hadith 132\nUSC-MSA web (English) reference  : Book 41, Hadith 7013\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Hudhaifa and Ibn Mas'ud met together. Hudhaifa said:\nI know more than you as to what there would be along with the Dajjal. There would be along with him two canals (one flowing with water) and the other one (having) fire (within it), and what you would see as fire would be water and what you would see as water would be fire. So he who amongst you is able to see that and is desirous of water should drink out of that which he sees as fire."
  },
  "2936": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2936\nIn-book reference  : Book 54, Hadith 133\nUSC-MSA web (English) reference  : Book 41, Hadith 7014\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nMay I not inform you about the Dajjal what no Apostle of Allah narrated to his people? He would be blind and he would bring along with him an Image of Paradise and Hell-Fire and what he would call as Paradise that would be Hell-Fire and I warn you as Noah warned his people."
  },
  "2937": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2937b\nIn-book reference  : Book 54, Hadith 135\nUSC-MSA web (English) reference  : Book 41, Hadith 7016\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Jabir with the same chain of transmitters but with this addition that Gog and Magog would walk until they would reach the mountain of al-Khamar and it is a mountain of Bait-ul-Maqdis and they would say:\nWe have killed those who are upon the earth. Let us now kill those who are In the sky and they would throw their arrows towards the sky and the arrows would return to them besmeared with blood. And in the narration of Ibn Hujr (the words are):\" I have sent such persons (Gog and Magog) that none would dare fight against them."
  },
  "2938": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2938c\nIn-book reference  : Book 54, Hadith 138\nUSC-MSA web (English) reference  : Book 41, Hadith 7019\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Sa'id al-Khudri reported Allah's Messenger (ﷺ) as saying:\nThe Dajjal would come forth and a person from amongst the believers would go towards him and the armed men of the Dajjal would meet him and they would say to him: Where do you intend to go? He would say: I intend to go to this one who is coming forth. They would say to him: Don't you believe in our Lord? He would say: There is nothing hidden about our Lord. They would say: Kill him. Then some amongst them would say: Has your master (Dajjal) not forbidden you to kill anyone without (his consent)? And so they would take him to the Dajjal and when the believer would see him, he would say: O people. he is the Dajjil about whom Allah's Messenger (ﷺ) has informed (us). The Dajjal would then order for breaking his head and utter (these words): Catch hold of him and break his head. He would be struck even on his back and on his stomach. Then the Dajjal would ask him: Don't you believe in me? He would say: You are a false Masih. He would then order him to be torn (into pieces) with a saw from the parting of his hair up to his legs. After that the Dajjal would walk between the two pieces. He would then say to him: Stand, and he would stand erect. He would then say to him: Don't you believe in me? And the person would say: It has only added to my insight concerning you (that you are really the Dajjal). He would then say: O people, he would not behave with anyone amongst people (in such a manner) after me. The Dajjal would try to catch hold of him so that he should kill him (again). The space between his neck and collar bone would be turned into copper and he would find no means to kill him. So he would catch hold of him by his hand and feet and throw him (into the air) and the people would think as if he had been thrown in the Hell-Fire whereas he would be thrown in Paradise. Thereupon Allah's Messenger (ﷺ) said: He would be the most eminent amongst persons in regard to martyrdom in the eye of the Lord of the world."
  },
  "2939": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2939c\nIn-book reference  : Book 54, Hadith 141\nUSC-MSA web (English) reference  : Book 41, Hadith 7022\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Isma'il through other chains of transmitters with a slight variation of wording."
  },
  "2940": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2940b\nIn-book reference  : Book 54, Hadith 143\nUSC-MSA web (English) reference  : Book 41, Hadith 7024\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Ya'qub b. 'Asim b. Urwa b. Mas'ud reported:\nI heard a person saying to 'Abdullah b. Amr: You say that the Last Hour would come at such and such time, whereupon he said: I had made up my mind that I would not narrate anything to you. I only said: But you would soon see after some time a very significant affair, for example the burning of the House (Ka'ba). Shu'ba said like this and 'Abdullah b Amr reported Allah's Messenger (ﷺ) having said: The Dajjal would appear in my Ummah. And in another hadith (the words are): None would survive who would have even a speck of faith in his heart, but he would be dead. Muhammad b. Ja'far reported that Shu'ba narrated to him this hadith many a time and I also read it out to him many a time."
  },
  "2941": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2941c\nIn-book reference  : Book 54, Hadith 146\nUSC-MSA web (English) reference  : Book 41, Hadith 7027\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Zur'a reported that there was a discussion in the presence of Marwan about the Last Hour, and Abdullah b. 'Amr said:\nI heard Allah's Messenger (ﷺ) as saying. The rest of the hadith is the same, but there is no mention of forenoon."
  },
  "2942": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2942d\nIn-book reference  : Book 54, Hadith 150\nUSC-MSA web (English) reference  : Book 41, Hadith 7031\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Fatima b. Qais reported that Allah's Messenger (ﷺ) sat on the pulpit and said:\nO people, Tamim Dari has reported to me that some persons of his tribe sailed in the ocean in a boat and it capsised and then some of them travelled on one of the planks of the boat and they went to an island in the ocean. The rest of the hadith is the same."
  },
  "2943": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2943b\nIn-book reference  : Book 54, Hadith 152\nUSC-MSA web (English) reference  : Book 41, Hadith 7033\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been transmitted on the authority of Anas that Allah's Messenger (ﷺ) said this but with this addition that (the Dajjal would come) and pitch his tent in the waste-land of Juruf and thus there would come out of (the city) every hypocrite, man and woman."
  },
  "2944": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2944\nIn-book reference  : Book 54, Hadith 153\nUSC-MSA web (English) reference  : Book 41, Hadith 7034\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Anas b. Malik reported that Allah's Messenger (ﷺ) said:\nThe Dajjal would be followed by seventy thousand Jews of Isfahan wearing Persian shawls."
  },
  "2945": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2945b\nIn-book reference  : Book 54, Hadith 155\nUSC-MSA web (English) reference  : Book 41, Hadith 7036\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Ibn Juraij with the same chain of transmitters."
  },
  "2946": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2946b\nIn-book reference  : Book 54, Hadith 157\nUSC-MSA web (English) reference  : Book 41, Hadith 7038\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been transmitted on the authority of 'Imran b. Husain with a slight variation of wording."
  },
  "2947": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2947c\nIn-book reference  : Book 54, Hadith 160\nUSC-MSA web (English) reference  : Book 41, Hadith 7041\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been narrated on the authority of Qatada through another chain of transmitters."
  },
  "2948": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2948b\nIn-book reference  : Book 54, Hadith 162\nUSC-MSA web (English) reference  : Book 41, Hadith 7042\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "The previous hadith is narrated through Abu Kamil from Hammad with the same chain."
  },
  "2949": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2949\nIn-book reference  : Book 54, Hadith 163\nUSC-MSA web (English) reference  : Book 41, Hadith 7043\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abdullah reported Allah's Apostle (ﷺ) as saying:\nThe Last Hour would affect (most terribly) the wicked persons."
  },
  "2950": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2950\nIn-book reference  : Book 54, Hadith 164\nUSC-MSA web (English) reference  : Book 41, Hadith 7044\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "This hadith has been reported by Sahl b. Sa'd that he heard Allah's Messenger (ﷺ) as saying:\nI and the Last Hour are (close to each other) like this (and he, in order to explain it) pointed (by joining his) forefinger, (one) next to the thumb and the middle finger (together)."
  },
  "2951": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2951e\nIn-book reference  : Book 54, Hadith 169\nUSC-MSA web (English) reference  : Book 41, Hadith 7049\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Anas reported Allah's Messenger (ﷺ) as saying:\nI and the Last Hour have been sent like this and (he while doing it) joined the forefinger with the middle finger."
  },
  "2952": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2952\nIn-book reference  : Book 54, Hadith 170\nUSC-MSA web (English) reference  : Book 41, Hadith 7050\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "'A'isha reported that when the desert Arabs came to Allah's Messenger (ﷺ) they asked about the Last Hour as to when that would come. And he looked towards the youngest amongst them and said:\nIf he lives he would not grow very old that he would find your Last Hour coming to you (he would see you dying)."
  },
  "2953": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2953c\nIn-book reference  : Book 54, Hadith 173\nUSC-MSA web (English) reference  : Book 41, Hadith 7053\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Anas reported:\nA young boy of Mughira b. Shu'ba happened to pass by (the Holy Prophet) and he was of my age. Thereupon Allah's Apostle (ﷺ) said: If he lives long he would not grow very old till the Last Hour would come (to the old people of this generation)."
  },
  "2954": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2954\nIn-book reference  : Book 54, Hadith 174\nUSC-MSA web (English) reference  : Book 41, Hadith 7054\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nThe Last Hour would come (so sudden) that a person would be milking the she- camel and the (milk) would not reach the brim of the vessel that the Last Hour would come, and the two persons would be engaged in buying and selling of the clothes and their bargain would not be struck before the Last Hour would come. And someone would be setting his tank in order and he would have hardly set it right when the Last Hour would come."
  },
  "2955": {
    "collection": "Sahih Muslim",
    "book": "The Book of Tribulations and Portents of the Last Hour",
    "book_num": "54",
    "reference": "Reference  : Sahih Muslim 2955c\nIn-book reference  : Book 54, Hadith 177\nUSC-MSA web (English) reference  : Book 41, Hadith 7057\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/54",
    "text": "Abu Huraira reported so many ahadith from Allah's Apostle (ﷺ) and amongst these one was this that Allah's Messenger (ﷺ) said:\nThere is a bone in the human being which the earth would never consume and it is from this that new bodies would be reconstituted (on the Day of Resurrection). They said: Allah's Messenger, which bone is that? Thereupon he said: It is the spinal bone."
  }
}