{
  "1669": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1669h\nIn-book reference  : Book 28, Hadith 8\nUSC-MSA web (English) reference  : Book 16, Hadith 4126\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Abu Laila 'Abdullah b. 'Abd al-Rahman b. Sahl reported that the elderly persons of (the tribe) had informed Sahl b. Abu Hathma that 'Abdullah b. Sahl and Muhayyisa went out to Khaibar under some distress which had afflicted them. Muhayyisa came and informed that Abdutlah b. Sahl had been killed, and (his dead body) had been thrown in a well or in a ditch. He came to the Jews and said:\nBy Allah, it is you who have killed him. They said: By Allah, we have not killed him. He then came to his people, and made mention of that to them. Then came he and his brother Huwayyisa, and he was older than he, and 'Abd al-Rahman b. Sahl. Then Muhayyisa went to speak, and it was he who had accompanied ('Abdullah) to Khaibar, whereupon Allah's Messenger (ﷺ) said to Muhayyisa: Observe greatness of the great (he meant the seniority of age). Then Huwayyisa spoke and then Muhayyisa also spoke. Thereupon Allah's Messenger (ﷺ) said: They should either pay blood-wit for your companion, or be prepared for war. Allah's Messenger (ﷺ) wrote about it to them (to the Jews). They wrote: Verily, by Allah, we have not killed him. Thereupon Allah's Messenger (ﷺ) said to Huwayyisa and Muhayyisa and Abd al-Rahman: Are you prepared to take oath in order to entitle yourselves for the blood-wit of your companion? They said: No. He (the Holy Prophet) said: Then the Jews will take oath (of their innocence). They said: They are not Muslims. Allah's Messenger (ﷺ), however, himself paid the blood-wit to them and sent to them one hundred camels until they entered into their houses, Sahl said: One red she-camel among them kicked me."
  },
  "1670": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1670c\nIn-book reference  : Book 28, Hadith 11\nUSC-MSA web (English) reference  : Book 16, Hadith 4129\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been narrated on the authority of Abu Salama b. 'Abd al-Rahman and Sulaiman b. Yasar."
  },
  "1671": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1671h\nIn-book reference  : Book 28, Hadith 19\nUSC-MSA web (English) reference  : Book 16, Hadith 4137\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Anas reported that Allah's Messenger (ﷺ) pierced their eyes because they had pierced the eyes of the shepherds."
  },
  "1672": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1672e\nIn-book reference  : Book 28, Hadith 24\nUSC-MSA web (English) reference  : Book 16, Hadith 4142\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Anas b. Malik reported:\nA girl was found with her head crushed between two stones. They asked her as to who had done that-has so and so (done it) until they mentioned a Jew. She indicated with the nod of her head (that it was so). So the Jew was caught, and he made confession (of his guilt). And Allah's Messenger (ﷺ) commanded that his head be smashed with stones."
  },
  "1673": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1673d\nIn-book reference  : Book 28, Hadith 29\nUSC-MSA web (English) reference  : Book 16, Hadith 4147\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "'Imran b. Husain reported that a person bit the hand of a person. He withdrew his hand and his foretooth or foreteeth fell down. He (the man who lost his teeth) referred the matter to Allah's Messenger (ﷺ) and he said, What do you want me to do? Do you ask me that I should order him to put his hand in your mouth, and you should bite it as the camel bites? (If you want retaliation, then the only way out is) that you put your hand in his mouth (allow him) to bite that and then draw it away."
  },
  "1674": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1674d\nIn-book reference  : Book 28, Hadith 32\nUSC-MSA web (English) reference  : Book 16, Hadith 4150\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been narrated on the authority of Juraij with the same chain of transmitters."
  },
  "1675": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1675\nIn-book reference  : Book 28, Hadith 33\nUSC-MSA web (English) reference  : Book 16, Hadith 4151\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Anas reported that Umm Haritha, the sister of Rubayyi' (she was the father's sister of Hadrat Anas) injured a person (she broke his teeth). The dispute was referred to Allah's Apostle (ﷺ). Allah's Messenger (ﷺ) said:\nRetribution, retribution. Umm Rubayyi' said: Messenger of Allah, will retribution be taken from so and so? By Allah, it shall not be taken from her (i. e. from Umm Haritha). Thereupon Allah's Apostle said: Hallowed be Allah. O Umm Rubayyi', Qisas (retribution is a command, prescribed) in the Book of Allah. She said: No, by Allah, Qisas will never be taken from her; and she went on saying this until they (the relatives of the one who had been injured) accepted the blood-wit. Thereupon Allah's Messenger (ﷺ) said: Verily there are amongst the servants of Allah (such pious persons) who, if they take oath of Allah, He honours it."
  },
  "1676": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1676d\nIn-book reference  : Book 28, Hadith 37\nUSC-MSA web (English) reference  : Book 16, Hadith 4155\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been reported on the authority of A'mash with the same chain of narrators but with a slight variation of words, i. e. he did not say:\nBy Him besides Whom there is no god."
  },
  "1677": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1677b\nIn-book reference  : Book 28, Hadith 39\nUSC-MSA web (English) reference  : Book 16, Hadith 4157\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been narrated on the authority of Jarir and 'Isa b. Yunus with a slight variation of words."
  },
  "1678": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1678b\nIn-book reference  : Book 28, Hadith 41\nUSC-MSA web (English) reference  : Book 16, Hadith 4159\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters with a slight variation of words."
  },
  "1679": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1679d\nIn-book reference  : Book 28, Hadith 45\nUSC-MSA web (English) reference  : Book 16, Hadith 4163\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "This hadith has been narrated on the authority of Abu Bakra through another chain of transmitters (and the words are):\n\" Allah's Messenger (ﷺ) addressed us on the day of Nahr (Sacrifice) and said: What day is this? And the rest of the hadith is the same except that he did not make mention of\" your honour,\" and also did not make mention of this: He then turned his attention towards two rams and what follows, and in a hadith (the words pertaining to sacred- ness are recorded in this way):\" Like the sacredness of this day of yours, in this month of yours, in this city of yours to the day when you will meet your Lord. Behold, have I not conveyed (the Message of God)? They said: Yes. He said: O Allah, bear witness.\""
  },
  "1680": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1680b\nIn-book reference  : Book 28, Hadith 47\nUSC-MSA web (English) reference  : Book 16, Hadith 4165\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "'Alaqama b. Wa'il reported on the authority of his father that a person was brought to the Messenger of Allah (ﷺ) who had killed another person, and the heir of the person slain had dragged him (to the Holy Prophet) with a strap around his neck. As he turned away Allah's Messenger (ﷺ) said:\nThe killer and the killed are (doomed) to fire. A person came to the other person (the heir of the deceased) and he reported to him the words of the Messenger of Allah (ﷺ), and so he let him off. Isma'il b. Salim said: I made a mention of it to Habib b. Abu Thabit and he said: Ibn Ashwa' reported to me that Allah's Apostle (ﷺ) had asked him to pardon him, but he refused."
  },
  "1681": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1681d\nIn-book reference  : Book 28, Hadith 51\nUSC-MSA web (English) reference  : Book 16, Hadith 4169\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Abu Huraira reported that two women fought-the rest of the hadith is the same but herein no mention has been made of:\nHe made her son and those who were with them her heirs. Someone said: Why should we pay blood-wit? And he did not name Hamal b. Malik."
  },
  "1682": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1682d\nIn-book reference  : Book 28, Hadith 55\nUSC-MSA web (English) reference  : Book 16, Hadith 4173\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Mansur transmitted this hadith with a slight variation of words."
  },
  "1683": {
    "collection": "Sahih Muslim",
    "book": "The Book of Oaths, Muharibin, Qasas (Retaliation), and Diyat (Blood Money)",
    "book_num": "28",
    "reference": "Reference  : Sahih Muslim 1683\nIn-book reference  : Book 28, Hadith 56\nUSC-MSA web (English) reference  : Book 16, Hadith 4174\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/28",
    "text": "Miswar b. Makhrama reported that 'Umar b. Khattab consulted people about the diyat of abortion of an unboam child. Mughira b. Shu'ba said:\nI bear witness to the fact that Allah's Messenger (ﷺ) gave judgment about it that a good quality of slave or female slave should be given for it. Thereupon 'Umar said: Bring one who may bear witness to you. Then Muhammad b. Maslama bore witness to him."
  }
}