{
  "2665": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2665\nIn-book reference  : Book 47, Hadith 1\nUSC-MSA web (English) reference  : Book 34, Hadith 6442\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "'A'isha reported that Allah's Messenger (ﷺ) recited (these verses of the Qur'an):\n\"He it is Who revealed to thee (Muhammad) the Book (the Qur'an) wherein there are clear revelations-these are the substance of the Book and others are allegorical (verses). And as for those who have a yearning for error they go after the allegorical verses seeking (to cause) dissension, by seeking to explain them. And none knows their implications but Allah, and those who are sound in knowledge say: We affirm our faith in everything which is from our Lord. It is only the persons of understanding who really heed\" (Al-Qur'an 3:7). 'A'isha (further) reported that Allah's Messenger (ﷺ) said (in connection with these verses): When you see such verses, avoid them, for it is they whom Allah has pointed out (in the mentioned verses)."
  },
  "2666": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2666\nIn-book reference  : Book 47, Hadith 2\nUSC-MSA web (English) reference  : Book 34, Hadith 6443\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "'Abdullah b. 'Umar reported:\nI went to Allah's Messenger (ﷺ) in the morning and he heard the voice of two persons who had an argumentation with each other about a verse. Allah's Apostle (ﷺ) came to us (and) the (signs) of anger could be seen on his face. He said: Verily, the (peoples) before you were ruined because of their disputation in the Book."
  },
  "2667": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2667c\nIn-book reference  : Book 47, Hadith 5\nUSC-MSA web (English) reference  : Book 34, Hadith 6446\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "Abu Imran reported that Jundub told us as we we-re young boys living in Kilfa, that Allah's Messenger (ﷺ) had said:\nRecite the Qur'an. The rest of the hadith is the same."
  },
  "2668": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2668\nIn-book reference  : Book 47, Hadith 6\nUSC-MSA web (English) reference  : Book 34, Hadith 6447\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "'A'isha reported Allah's Messenger (ﷺ) as saying:\nThe most despicable amongst persons in the eye of Allah is one who tries to fall into dispute with others (for nothing but only to display his knowledge and power of argumentation)."
  },
  "2669": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2669c\nIn-book reference  : Book 47, Hadith 9\nUSC-MSA web (English) reference  : Book 34, Hadith 6449\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "This hadith has been narrated on the authority of 'Ata' b. Yasir through another chain of transmitters."
  },
  "2670": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2670\nIn-book reference  : Book 47, Hadith 10\nUSC-MSA web (English) reference  : Book 34, Hadith 6450\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "Abdullah reported Allah's Messenger (ﷺ) as saying:\nRuined, were those who indulged in hair-splitting. He (the Holy Prophet) repeated this thrice."
  },
  "2671": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2671c\nIn-book reference  : Book 47, Hadith 13\nUSC-MSA web (English) reference  : Book 34, Hadith 6453\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "This hadith has been transmitted on the authority of Anas b. Malik through another chain of narrators, but with a slight variation of wording."
  },
  "2672": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2672d\nIn-book reference  : Book 47, Hadith 17\nUSC-MSA web (English) reference  : Book 34, Hadith 6457\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "Abu Wa'il reported:\nI was sitting with Abu Musa and 'Abdullah and they were conversing with each other and Abu Musa reported Allah's Messenger (ﷺ) as saying (that we find in the above-mentioned ahadith)."
  },
  "157": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 157h\nIn-book reference  : Book 47, Hadith 21\nUSC-MSA web (English) reference  : Book 34, Hadith 6461\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "This hadith has been transmitted on the authority of Abu Huraira through other chains of narrators and there is no mention of:\n\" Miserliness would be put (in the hearts of the people).\""
  },
  "2673": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2673d\nIn-book reference  : Book 47, Hadith 25\nUSC-MSA web (English) reference  : Book 34, Hadith 6465\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "'Urwa b. Zubair reported that 'A'isha said to him:\nThis news has reached me that 'Abdullah b. 'Amr al-'As would pass by us during the Hajj season, so you meet him and ask him (about religious matters) as he has acquired great knowledge from Allah's Messenger (ﷺ). I thus met him and asked him about things which he narrated from Allah's Messenger (ﷺ). And amongst these the one he mentioned was that Allah's Apostle (ﷺ) said: Verily, Allah does not take away knowledge from people directly but he takes away the scholars and consequently takes away (knowledge) along with them and leaves amongst persons the ignorant as their leaders who deliver religious verdicts without (adequate) knowledge and themselves go astray and lead others astray. 'Urwa said: When I narrated this to 'A'isha, she deemed it too much (to believe) and thus showed reluctance to accept that (as perfectly true) and said to, 'Urwa: Did he ('Abdullah b. 'Amr) say to you that he had heard Allah's Apostle (ﷺ) as saying: ('Urwa had forgotten to ask this from 'Abdullah b. 'Amr). So when it was the next year, she ('A'isha) said to him ('Urwa): Ibn Amr has come (for Hajj), so meet him. talk to him and ask him about this hadith that he narrated to You (last year on the occasion of the Hajj) pertaining to knowledge. He ('Urwa), said: So I met him, and asked about it and he narrated to me exactly like one that he had narrated (to me) for the first time. So when I informed her ('A'isha) about that, she said: I do not think but this that he has certainly told the truth and I find that be has neither made any addition to it, nor missed anything from it."
  },
  "1017": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 1017h\nIn-book reference  : Book 47, Hadith 29\nUSC-MSA web (English) reference  : Book 34, Hadith 6469\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "Jarir transmitted this hadith from his father through several other chains of narrators."
  },
  "2674": {
    "collection": "Sahih Muslim",
    "book": "The Book of Knowledge",
    "book_num": "47",
    "reference": "Reference  : Sahih Muslim 2674\nIn-book reference  : Book 47, Hadith 30\nUSC-MSA web (English) reference  : Book 34, Hadith 6470\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/47",
    "text": "Abu Huraira reported Allah's Messenger (ﷺ) as saying:\nHe who called (people) to righteousness, there would be reward (assured) for him like the rewards of those who adhered to it, without their rewards being diminished in any respect. And he who called (people) to error, he shall have to carry (the burden) of its sin, like those who committed it, without their sins being diminished in any respect."
  }
}