{
  "1818": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1818b\nIn-book reference  : Book 33, Hadith 2\nUSC-MSA web (English) reference  : Book 20, Hadith 4474\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Hammam b. Munabbih who said:\nThis is one of the traditions narrated by Abu Huraira from the Messenger of Allah (ﷺ) who said: People are subservient to the Quraish: the Muslims among them being subservient to the Muslims among them, and the disbelievers among them being subservient to the disbelievers among them."
  },
  "1819": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1819\nIn-book reference  : Book 33, Hadith 3\nUSC-MSA web (English) reference  : Book 20, Hadith 4475\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Jabir b. 'Abdullah that the Messenger of Allah (ﷺ) said:\nPeople are the followers of Quraish in good as well as evil (i. e. in the customs of Islamic as well as pre-Islamic times)."
  },
  "1820": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1820\nIn-book reference  : Book 33, Hadith 4\nUSC-MSA web (English) reference  : Book 20, Hadith 4476\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Abdullah that the Messenger of Allah (ﷺ) said:\nThe Caliphate will remain among the Quraish even if only two persons are left (on the earth),"
  },
  "1821": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1821f\nIn-book reference  : Book 33, Hadith 10\nUSC-MSA web (English) reference  : Book 20, Hadith 4482\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Jabir b. Samura who said:\nI went with my father to the Messenger of Allah (may peeace be upon him) and I heard him say: This religion would continue to remain powerful and dominant until there have been twelve Caliphs. Then he added something which I couldn't catch on account of the noise of the people. I asked my father: What did he say? My father said: He has said that all of them will be from the Quraish."
  },
  "1822": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1822b\nIn-book reference  : Book 33, Hadith 12\nUSC-MSA web (English) reference  : Book 20, Hadith 4484\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Ibn Samura al-'Adawi reported:\nI heard Allah's Messenger (ﷺ) say, and he then narrated (the above-mentioned hadith)."
  },
  "1823": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1823b\nIn-book reference  : Book 33, Hadith 14\nUSC-MSA web (English) reference  : Book 20, Hadith 4486\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Ibn 'Umar who said:\nI entered the apartment of (my sister) Hafsa. She said: Do yoa know that your father is not going to nominate his successor? I said: He won't do that (i. e. he would nominate). She said: He is going to do that. The narrator said: I took an oath that I will talk to him about the matter. I kept quiet until the next morning, still I did not talk to him, and I felt as if I were carryint, a mountain on my right hand. At last I came to him and entered his apartment. (Seeing me) he began to ask me about the condition of the people, and I informed him (about them). Then I said to him: I heard something from the people and took an oath that I will communicate it to you. They presume that you are not going to nominate a successor. If a grazer of camels and sheep that you had appointed comes back to you leaving the cattle, you will (certainly) think that the cattle are lost. To look after the people is more serious and grave. (The dying Caliph) was moved at my words. He bent his head in a thoughtful mood for some time and raised it to me and said: God will doubtlessly protect His religion. If I do not nominate a successor (I have a precedent before me), for the Messenger of Allah (ﷺ) did not nominate his successor. And if I nominate one (I have a precedent), for Abu Bakr did nominate. The narrator (Ibn Umar) said: By God. when he mentioned the Messenger of Allah (ﷺ) and Abu Bakr, I (at once) understood that he would not place anyone at a par with the Messenger of Allah (ﷺ) and would not nominate anyone."
  },
  "1652": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1652d\nIn-book reference  : Book 33, Hadith 16\nUSC-MSA web (English) reference  : Book 20, Hadith 4488\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been narrated through a different chain of transmitters."
  },
  "1733": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1733d\nIn-book reference  : Book 33, Hadith 18\nUSC-MSA web (English) reference  : Book 20, Hadith 4490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Abu Musa who said:\nI went to the Prophet (ﷺ) and with me were two men from the Ash'ari tribe. One of them was on my right hand and the other on my left. Both of them made a request for a position (of authority) while the Prophet (ﷺ) was brushing his teeth with a tooth-stick. He said (to me): Abu Musa (or 'Abdullah b. Qais), what do you say (about the request they have made)? I said: By God Who sent thee on thy mission with truth, they did not disclose to me what they had in their minds, and I did not know that they would ask for a position. The narrator says (while recalling this hadith): I visualise as if I were looking at the miswak of the Prophet (ﷺ) between his lips. He (the Holy Prophet) said: We shall not or shall never appoint to the public offices (in our State) those who with to have them, but you may go, Abu Musa (or Abdullah b. Qais) (to take up your assignment). He sent him to Yemen as governor. then he sent Mu'adh b. jabal in his wake (to help him in the discharge of duties). When Mu'adh reached the camp of Abu Musa, the latter (received him and) said: Please get yourself down; and he spread for him a mattress, while there was a man bound hand and foot as a prisoner. Mu'adh said: Who is this? Abu Musa said: He was a Jew. He embraced Islam. Then he reverted to his false religion and became a Jew. Mu'adh said: I won't sit until he is killed according to the decree of Allah and His Apostle (ﷺ) (in this case). Abu Musa said: Be seated. It will be done. He said: I won't sit unless he is killed in accordance with the decree of Allah and His Apostle (ﷺ). He repeated these words thrice. Then Abu Musa ordered him (to be killed) and he was kilied. Then the two talked of standing in prayer at night. One of them, i. e. Mu'adh, said: I sleep (for a part of the night) and stand in prayer (for a part) and I hope that I shall get the same reward for steeping as I shall get for standing (in prayer)."
  },
  "1825": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1825\nIn-book reference  : Book 33, Hadith 19\nUSC-MSA web (English) reference  : Book 20, Hadith 4491\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Dharr who said:\nI said to the Prophet (ﷺ): Messenger of Allah, will you not appoint me to a public office? He stroked my shoulder with his hand and said: Abu Dharr, thou art weak and authority is a trust. and on the Day of judgment it is a cause of humiliation and repentance except for one who fulfils its obligations and (properly) discharges the duties attendant thereon."
  },
  "1826": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1826\nIn-book reference  : Book 33, Hadith 20\nUSC-MSA web (English) reference  : Book 20, Hadith 4492\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Abu Dharr that the Messenger of of Allah (ﷺ) said:\nAbu Dharr, I find that thou art weak and I like for thee what I like for myself. Do not rule over (even) two persons and do not manage the property of an orphan."
  },
  "1827": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1827\nIn-book reference  : Book 33, Hadith 21\nUSC-MSA web (English) reference  : Book 20, Hadith 4493\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Abdullah b. 'Umar that the Messenger of Allah (ﷺ) said:\nBehold! the Dispensers of justice will be seated on the pulpits of light beside God, on the right side of the Merciful, Exalted and GlorioUS. Either side of the Being is the right side both being equally mrneritorious. (The Dispensers of justice are) those who do justice in their rules, in matters relating to their families and in all that they undertake to do."
  },
  "1828": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1828b\nIn-book reference  : Book 33, Hadith 23\nUSC-MSA web (English) reference  : Book 20, Hadith 4495\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadith has been narrated on the authority of Abd al-Rahman b. Shumasa with another chain of transmitters."
  },
  "1829": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1829e\nIn-book reference  : Book 33, Hadith 27\nUSC-MSA web (English) reference  : Book 20, Hadith 4499\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A hadith having the same meaning has been transmitted on the authority of 'Abdullah b. 'Umar."
  },
  "142": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 142h\nIn-book reference  : Book 33, Hadith 31\nUSC-MSA web (English) reference  : Book 20, Hadith 4503\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu al-Aswad who said:\nMy father related to me that Ma'qil b. Yasir fell ill. 'Ubaidullah b. Ziyad called on him to inquire after his health. Here follows the tradition as narrated by Hasan from Ma'qil."
  },
  "1830": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1830\nIn-book reference  : Book 33, Hadith 32\nUSC-MSA web (English) reference  : Book 20, Hadith 4504\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Hasan that A'idh b. 'Amr who was one of the Companions of the Messenger of Allah (ﷺ) called on 'Ubaidullah b. Ziyad and said (to him):\nO my son, I have heard the Messenger of Allah (ﷺ) say: The worst of guardians is the cruel ruler. Beware of being one of them. Ubaidullah said (to him out of arrogance): Sit you down. You are from the chaff of the Companions of Muhammad (ﷺ). A'idh said: Was there worthless chaff among them? Such worthless chaff appeared after them and among other people."
  },
  "1831": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1831d\nIn-book reference  : Book 33, Hadith 36\nUSC-MSA web (English) reference  : Book 20, Hadith 4508\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Abu Huraira has narrated this hadith similar to the above mentioned hadith."
  },
  "1832": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1832e\nIn-book reference  : Book 33, Hadith 41\nUSC-MSA web (English) reference  : Book 20, Hadith 4513\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Humaid as-Sa'idi that the Messenger of Allah (ﷺ) appointed a man in charge of Sadaqa (authorising him to receive charity from the people on behalf of the State). He came (back to the Holy prophet) with a large number of things and started saying:\nThis is for you and this has been presented to me as a gift. Here follows the tradition that has gone before except that 'Urwa (one of the narrators in the chain of transmitters) asked Abu Humaid: Did you hear it from the Messenger of Allah (himself) (ﷺ)? He replied: My ears heard it from his mouth."
  },
  "1833": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1833c\nIn-book reference  : Book 33, Hadith 44\nUSC-MSA web (English) reference  : Book 20, Hadith 4516\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Adi b. 'Amira al-Kindi heard Allah's Messenger (ﷺ) as saying (as) was narrated in the (above-mentioned) hadith."
  },
  "1834": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1834\nIn-book reference  : Book 33, Hadith 45\nUSC-MSA web (English) reference  : Book 20, Hadith 4517\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Ibn Juraij that the Qur'anic injunction:\n\" 0 you who believe, obey Allah, His Apostle and those in authority from amongst You\" (iv. 59) -was revealed in respect of 'Abdullah b. Hudhafa b. Qais b. Adi al-Sahmi who was despatched by the Prophet (ﷺ) as leader of a military campaign. The narrator said: He was informed of this fact by Ya'la b. Muslim who was informed by Sa'id b. Jubair who in turn was informed by Ibn Abbas."
  },
  "1835": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1835g\nIn-book reference  : Book 33, Hadith 51\nUSC-MSA web (English) reference  : Book 20, Hadith 4523\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "According to one version of the tradition, the Messenger of Allah (ﷺ) said:\nWhoso obeys the commander. He did not say:\" My commander.\""
  },
  "1836": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1836\nIn-book reference  : Book 33, Hadith 52\nUSC-MSA web (English) reference  : Book 20, Hadith 4524\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nIt is obligatory for you to listen to the ruler and obey him in adversity and prosperity, in pleasure and displeasure, and even when another person is given (rather undue) preference over you."
  },
  "1837": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1837c\nIn-book reference  : Book 33, Hadith 55\nUSC-MSA web (English) reference  : Book 20, Hadith 4527\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Abu 'Imran narrated this hadith with a slight change of wording."
  },
  "1838": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1838e\nIn-book reference  : Book 33, Hadith 60\nUSC-MSA web (English) reference  : Book 20, Hadith 4532\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Yahya b. Husain who learnt the tradition from his grandmother. Umm Husain. He said':\nI heard her say: I performed Hajjat-ul-Wada' in the company of the Messenger of Allah (ﷺ). He said a lot of things (on this occasion). Then I heard him say: If a maimed slave is appointed a commander over you the narrator says: I think she said:\" a black stave\" who leads you according to the Book of Allah, then listen to him and obey him."
  },
  "1839": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1839b\nIn-book reference  : Book 33, Hadith 62\nUSC-MSA web (English) reference  : Book 20, Hadith 4534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadith has been transmitted on the authority of 'Ubaidullah."
  },
  "1840": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1840c\nIn-book reference  : Book 33, Hadith 65\nUSC-MSA web (English) reference  : Book 20, Hadith 4537\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadith has been transmitted on the authority of A'mash."
  },
  "1709": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1709h\nIn-book reference  : Book 33, Hadith 69\nUSC-MSA web (English) reference  : Book 20, Hadith 4541\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Junida b. Abu Umayya who said:\nWe called upon 'Ubada b. Samit who was ill and said to him: May God give you health I Narrate to us a tradition which God may prove beneficial (to us) and which you have heard from the Messenger of Allah (ﷺ). He said: The Messenger of Allah (ﷺ) called us and we took the oath of allegiance to him. Among the injunctions he made binding upon us was: Listening and obedience (to the Amir) in our pleasure and displeasure, in our adversity and prosperity, even when somebody is given preference over us, and without disputing the delegation of powers to a man duly invested with them (Obedience shall be accorded to him in all circumstances) except when you have clear signs of his disbelief in (or disobedience to) God-signs that could be used as a conscientious justification (for non-compliance with his orders)."
  },
  "1841": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1841\nIn-book reference  : Book 33, Hadith 70\nUSC-MSA web (English) reference  : Book 20, Hadith 4542\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the Prophet of Allah (ﷺ) said:\nA commander (of the Muslims) is a shield for them. They fight behind him and they are protected by (him from tyrants and aggressors). If he enjoins fear of God, the Exalted and Glorious, and dispenses justice, there will be a (great) reward for him; and if he enjoins otherwise, it redounds on him."
  },
  "1842": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1842b\nIn-book reference  : Book 33, Hadith 72\nUSC-MSA web (English) reference  : Book 20, Hadith 4544\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been transmitted by a different chain of narrators."
  },
  "1843": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1843\nIn-book reference  : Book 33, Hadith 73\nUSC-MSA web (English) reference  : Book 20, Hadith 4545\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Abdullah who said:\nThe Messenger of Allah (ﷺ) said: After me there will be favouritism and many things that you will not like. They (his Companions) said: Messenger of Allah, what do you order that one should do if anyone from us has to live through such a time? He said: You should discharge your own responsibility (by obeying your Amir), and ask God for your right (by guiding the Amir to the right path or by replacing him by one more just and God-fearing)."
  },
  "1844": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1844c\nIn-book reference  : Book 33, Hadith 76\nUSC-MSA web (English) reference  : Book 20, Hadith 4548\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Abd Rabb al-Ka'ba as-Sa'idl who said:\nI saw a group of people near the Ka'ba.... Then he narrated the tradition as narrated by A'mash."
  },
  "1845": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1845b, c\nIn-book reference  : Book 33, Hadith 78\nUSC-MSA web (English) reference  : Book 20, Hadith 4550\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been narrated on the same authority through a different chain of transmitters. Another version of the tradition narrated on the authority of Shu'ba does not include the words:\n\" He took the Messenger of Allah (ﷺ) aside.\""
  },
  "1846": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1846b\nIn-book reference  : Book 33, Hadith 80\nUSC-MSA web (English) reference  : Book 20, Hadith 4552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated through a different chain of transmitters, on the authority of Simak who said:\nAsh'ath b. Qais pulled him (Salama b. Yazid) when the Messenger of Allah (ﷺ) said: Listen to them and obey them, for on them shall be the burden of what they do and on you shall be the burden of what you do."
  },
  "1847": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1847b\nIn-book reference  : Book 33, Hadith 82\nUSC-MSA web (English) reference  : Book 20, Hadith 4554\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It his been narrated through a different chain of transmitters, on the authority of Hudhaifa b. al-Yaman who said:\nMessenger of Allah, no doubt, we had an evil time (i. e. the days of Jahiliyya or ignorance) and God brought us a good time (i. e. Islamic period) through which we are now living Will there be a bad time after this good time? He (the Holy Prophet) said: Yes. I said: Will there be a good time after this bad time? He said: Yes. I said: Will there be a bad time after good time? He said: Yes. I said: How? Whereupon he said: There will be leaders who will not be led by my guidance and who will not adopt my ways? There will be among them men who will have the hearts of devils in the bodies of human beings. I said: What should I do. Messenger of Allah, if I (happen) to live in that time? He replied: You will listen to the Amir and carry out his orders; even if your back is flogged and your wealth is snatched, you should listen and obey."
  },
  "1848": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1848d\nIn-book reference  : Book 33, Hadith 86\nUSC-MSA web (English) reference  : Book 20, Hadith 4558\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadlth has been narrated on the authority of Jarir with the same chain of transmitters with a slight variation in wording."
  },
  "1849": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1849b\nIn-book reference  : Book 33, Hadith 88\nUSC-MSA web (English) reference  : Book 20, Hadith 4560\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated (through a different chain of transmitters) on the authority of Ibn Abbas that the Messenger of Allah (may peace be upoh him) said:\nOne who dislikes a thing done by his Amir should be patient over it, for anyone from the people who withdraws (his obedience) from the government, even to the extent of a handspan and died in that conditions, would die the death of one belonging to the days of jahilliyya."
  },
  "1850": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1850\nIn-book reference  : Book 33, Hadith 89\nUSC-MSA web (English) reference  : Book 20, Hadith 4561\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Ibn 'Abdullah al-Bajali that the Messenger of Allah (ﷺ) said:\nOne who is killed under the banner of a man who is blind (to his just cause), who raises the slogan of family or supports his own tribe, dies the death of one belonging to the days of Jahiliyya."
  },
  "1851": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1851c\nIn-book reference  : Book 33, Hadith 92\nUSC-MSA web (English) reference  : Book 20, Hadith 4564\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been transmitted by a different chain of narrators."
  },
  "1852": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1852c\nIn-book reference  : Book 33, Hadith 95\nUSC-MSA web (English) reference  : Book 20, Hadith 4567\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated (through a still different chain of transmitters) on the Same authority (i. e. 'Arfaja) who said similarly-but adding:\n\" Kill all of them.\" I heard the Messenger of Allah (ﷺ) say: When you are holding to one single man as your leader, you should kill who seeks to undermine your solidarity or disrupt your unity."
  },
  "1853": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1853\nIn-book reference  : Book 33, Hadith 96\nUSC-MSA web (English) reference  : Book 20, Hadith 4568\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Aba Sa'id al-Khudri that the Messenger of Allah (ﷺ) said:\nWhen oath of allegiance has been taken for two caliphs, kill the one for whom the oath was taken later."
  },
  "1854": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1854d\nIn-book reference  : Book 33, Hadith 100\nUSC-MSA web (English) reference  : Book 20, Hadith 4572\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version omits a portion at the end of the tradition-a portion which begins with man radiya wa taba and ends with the last word of the tradition."
  },
  "1855": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1855c\nIn-book reference  : Book 33, Hadith 103\nUSC-MSA web (English) reference  : Book 20, Hadith 4575\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above hadith has been narrated through addtional chains of transmitters."
  },
  "1856": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1856h\nIn-book reference  : Book 33, Hadith 111\nUSC-MSA web (English) reference  : Book 20, Hadith 4583\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated (through a different chain of transmitters) on the authority of Salim b. al-Ja'd who said:\nI asked Jabir: How many were you on the Day of Hudaibiya? He said: One thousand and four hundred."
  },
  "1857": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1857b\nIn-book reference  : Book 33, Hadith 113\nUSC-MSA web (English) reference  : Book 20, Hadith 4585\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been handed down through a different chain of transmitters."
  },
  "1858": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1858b\nIn-book reference  : Book 33, Hadith 115\nUSC-MSA web (English) reference  : Book 20, Hadith 4587\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadith has been narrated on the authority of Yunus with the same chain of transmitters."
  },
  "1859": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1859c\nIn-book reference  : Book 33, Hadith 117\nUSC-MSA web (English) reference  : Book 20, Hadith 4589\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The tradition has been narrated on the authority of Sa'id b. Musayyib who learnt it from his father. The latter said:\nI had seen the tree. When I came to the spot afterwards, I could not recognise it."
  },
  "1860": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1860b\nIn-book reference  : Book 33, Hadith 119\nUSC-MSA web (English) reference  : Book 20, Hadith 4591\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above tradition has also been handed down through a different chain of transmitters."
  },
  "1861": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1861\nIn-book reference  : Book 33, Hadith 120\nUSC-MSA web (English) reference  : Book 20, Hadith 4592\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abdullah b. Zaid who said:\nA person came to him and said: Here is Ibn Hanzala who is making people swear allegiance to him. He (, Abdullah) asked: To what effect? He replied: To the effect that they will die for him. 'Abdullah said: I will never swear allegiance to this effect after the Messenger of Allah (ﷺ)."
  },
  "1862": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1862\nIn-book reference  : Book 33, Hadith 121\nUSC-MSA web (English) reference  : Book 20, Hadith 4593\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated by Salama b. al-Akwa' that he visited al-Hajjaj who said to him:\nO son of al-Akwa', you have turned apostate and have come to live again in the desert with the Bedouins (after your migration). He said: No, but the Messenger of Allah (ﷺ) has permitted me to live in the desert."
  },
  "1863": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1863c\nIn-book reference  : Book 33, Hadith 124\nUSC-MSA web (English) reference  : Book 20, Hadith 4596\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version of the tradition transmitted on the authority of Asim has the same wording but does not mention the name of Abu Ma'bad."
  },
  "1353": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1353d\nIn-book reference  : Book 33, Hadith 126\nUSC-MSA web (English) reference  : Book 20, Hadith 4598\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above tradition has been handed down through a different chain of transmitters."
  },
  "1864": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1864\nIn-book reference  : Book 33, Hadith 127\nUSC-MSA web (English) reference  : Book 20, Hadith 4599\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "'A'isha reported that the Messenger of Allah (ﷺ) was asked about migration, whereupon he said:\nThere is no migration after the Conquest (of Mecca), but Jihad and sincere intention. When you are asked to set out (for the cause of Islam), you should set out,"
  },
  "1865": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1865b\nIn-book reference  : Book 33, Hadith 129\nUSC-MSA web (English) reference  : Book 20, Hadith 4601\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down through a different chain of transmitter with the addition of the following words at the end:\n\" Do you milk them on the day they arrive at the water? He replied: Yes.\""
  },
  "1866": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1866b\nIn-book reference  : Book 33, Hadith 131\nUSC-MSA web (English) reference  : Book 20, Hadith 4603\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Urwa that 'A'isha described to him the way the Prophet (ﷺ) took the oath of fealty from women. She said:\nThe Messenger of Allah (ﷺ) never touched a woman with his hand. He would only take a vow from her and when he had taken the (verbal) vow, he would say: You may go. I have accepted your fealty."
  },
  "1867": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1867\nIn-book reference  : Book 33, Hadith 132\nUSC-MSA web (English) reference  : Book 20, Hadith 4604\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abdullah b. 'Umar who said:\nWe used to take oath to the Messenger of Allah (ﷺ) that we would listen to and obey his orders. He would tell us (to say in the oath): As far as it lies in my power."
  },
  "1868": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1868b\nIn-book reference  : Book 33, Hadith 134\nUSC-MSA web (English) reference  : Book 20, Hadith 4606\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down through a different chain Of transmitters with the following change in the wording:\n\" I was fourteen years old and he thought me too young (to participate in the fight).\""
  },
  "1869": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1869d\nIn-book reference  : Book 33, Hadith 138\nUSC-MSA web (English) reference  : Book 20, Hadith 4609\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above hadith has been narrated through several other chains with slight differences of wording."
  },
  "1870": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1870b\nIn-book reference  : Book 33, Hadith 140\nUSC-MSA web (English) reference  : Book 20, Hadith 4611\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down through several other chains of transmitters. One of the chaines has the addition of the following words from Abdullah b. 'Umar:\n\" I came first in the race and my horse jumped into the mosque with me.\""
  },
  "1871": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1871b\nIn-book reference  : Book 33, Hadith 142\nUSC-MSA web (English) reference  : Book 20, Hadith 4613\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been handed down through a different chain of transmitters."
  },
  "1872": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1872b\nIn-book reference  : Book 33, Hadith 144\nUSC-MSA web (English) reference  : Book 20, Hadith 4615\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above tradition has also been narrated on the authority of Yunus through a different chain of transmitters."
  },
  "1873": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1873e\nIn-book reference  : Book 33, Hadith 149\nUSC-MSA web (English) reference  : Book 20, Hadith 4620\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A version of the tradition transmitted on the authority of 'Urwa b. al-ja'd does not mention\" reward and booty\"."
  },
  "1874": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1874b\nIn-book reference  : Book 33, Hadith 151\nUSC-MSA web (English) reference  : Book 20, Hadith 4622\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A hadith like this has been narrated on the authority of Anas through another chain of transmitters."
  },
  "1875": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1875c\nIn-book reference  : Book 33, Hadith 154\nUSC-MSA web (English) reference  : Book 20, Hadith 4625\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The tradition has been handed down through a different chain of transmitters."
  },
  "1876": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1876h\nIn-book reference  : Book 33, Hadith 162\nUSC-MSA web (English) reference  : Book 20, Hadith 4633\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version of the tradition narrated through a different chain of transmitters on the authority of Abu Huraira has the same wording as the previous tradition:\n\" Allah takes care of one who goes out in the way of Allah\" but ends in the words:\" I would not lag behind any expedition which is undertaken to fight in the way of Allah, the Exalted.\""
  },
  "1877": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1877b\nIn-book reference  : Book 33, Hadith 164\nUSC-MSA web (English) reference  : Book 20, Hadith 4635\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Anas b. Malik (through a different chain of transmitters) that the Messenger of Allah (ﷺ) said:\nNobody who enters Paradise will (ever like to) return to this world even if he were offered everything on the surface of the earth (as an inducement) except the martyr who will desire to return to this world and be killed ten times for the sake of the great honour that has been bestowed upon him."
  },
  "1878": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1878b\nIn-book reference  : Book 33, Hadith 166\nUSC-MSA web (English) reference  : Book 20, Hadith 4637\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down through a different chain of transmitters."
  },
  "1879": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1879b\nIn-book reference  : Book 33, Hadith 168\nUSC-MSA web (English) reference  : Book 20, Hadith 4638\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been narrated on the authority of Nu'man b. Bashir through another chain of transmitters."
  },
  "1880": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1880\nIn-book reference  : Book 33, Hadith 169\nUSC-MSA web (English) reference  : Book 20, Hadith 4639\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (ﷺ) said:\nLeaving (for Jihad) in the way of Allah in the morning or in the evening (will merit a reward) better than the world and all that is in it."
  },
  "1881": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1881b\nIn-book reference  : Book 33, Hadith 171\nUSC-MSA web (English) reference  : Book 20, Hadith 4641\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Sahl b. Sa'd as-Sa'idi that the Messenger of Allah (ﷺ) said:\nA journey undertaken in the morning or evening (fond Jihad) in the way of Allah (will merit a reward) better than the world and all that is in it."
  },
  "1882": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1882\nIn-book reference  : Book 33, Hadith 172\nUSC-MSA web (English) reference  : Book 20, Hadith 4642\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nIf some persons of my Umma (were not to undertake the hardships of Jihad), and he (Abu Huraira) then narrated the rest of the hadith and then said: A journey undertaken for jihad in the evening or morning merits a reward better than the world and all that is in it."
  },
  "1883": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1883b\nIn-book reference  : Book 33, Hadith 174\nUSC-MSA web (English) reference  : Book 20, Hadith 4644\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been narrated on the authority of Abu Ayyub through a different chain of transmitters having the same wording."
  },
  "1884": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1884\nIn-book reference  : Book 33, Hadith 175\nUSC-MSA web (English) reference  : Book 20, Hadith 4645\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Sa`id al-Khudri that the Messenger of Allah (ﷺ) said (to him):\nAbu Sa`id, whoever cheerfully accepts Allah as his Lord, Islam as his religion and Muhammad as his Apostle is necessarily entitled to enter Paradise. He (Abu Sa`id) wondered at it and said: Messenger of Allah, repeat it for me. He (the Messenger of Allah) did that and said: There is another act which elevates the position of a man in Paradise to a grade one hundred (higher), and the elevation between one grade and the other is equal to the height of the heaven from the earth. He (Abu Sa`id) said: What is that act? He replied: Jihad in the way of Allah! Jihad in the way of Allah!"
  },
  "1885": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1885c\nIn-book reference  : Book 33, Hadith 178\nUSC-MSA web (English) reference  : Book 20, Hadith 4648\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version of the tradition differently transmitted begins with the words:\n\" A man came to the Messenger of Allah (ﷺ) and he was sitting on the pulpit.... He said: What do you find if I strike with the sword?\" (The rest of the tradition is the same as the previous one.)"
  },
  "1886": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1886b\nIn-book reference  : Book 33, Hadith 180\nUSC-MSA web (English) reference  : Book 20, Hadith 4650\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Amr b. al-'As through a different chain of transmitters that the Messenger of Allah (ﷺ) said:\nDeath in the way of Allah blots out everything except debt."
  },
  "1887": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1887\nIn-book reference  : Book 33, Hadith 181\nUSC-MSA web (English) reference  : Book 20, Hadith 4651\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Masruq Who said:\nWe asked 'Abdullah about the Qur'anic verse:\" Think not of those who are slain in Allah's way as dead. Nay, they are alive, finding their sustenance in the presence of their Lord..\" (iii. 169). He said: We asked the meaning of the verse (from the Holy Prophet) who said: The souls, of the martyrs live in the bodies of green birds who have their nests in chandeliers hung from the throne of the Almighty. They eat the fruits of Paradise from wherever they like and then nestle in these chandeliers. Once their Lord cast a glance at them and said: Do ye want anything? They said: What more shall we desire? We eat the fruit of Paradise from wherever we like. Their Lord asked them the same question thrice. When they saw that they will continue to be asked and not left (without answering the question). they said: O Lord, we wish that Thou mayest return our souls to our bodies so that we may be slain in Thy way once again. When He (Allah) saw that they had no need, they were left (to their joy in heaven)."
  },
  "1888": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1888c\nIn-book reference  : Book 33, Hadith 184\nUSC-MSA web (English) reference  : Book 20, Hadith 4654\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A version of the tradition narrated on the authority of Ibn Shihab has a little differently worded ending. i. e.\" A man in a mountain valley.\" but did not mention\" next to him a man who....\""
  },
  "1889": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1889c\nIn-book reference  : Book 33, Hadith 187\nUSC-MSA web (English) reference  : Book 20, Hadith 4657\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Two more versions of the tradition narrated by 'Abdullah b. Badr and Abu Huraira, respectively, have been handed down through different chains of transmitters with negligible difference in the wording."
  },
  "1890": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1890c\nIn-book reference  : Book 33, Hadith 190\nUSC-MSA web (English) reference  : Book 20, Hadith 4660\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nGod laughs at the two men one of whom kills the other; both of them will enter Paradise. They (the Companions) said: How, Messenger of Allah? He said: One is slain (in the way of Allah) and enters Paradise. Then God forgives the other and guides him to Islam; then he fights in the way of Allah and dies a martyr."
  },
  "1891": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1891b\nIn-book reference  : Book 33, Hadith 192\nUSC-MSA web (English) reference  : Book 20, Hadith 4662\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nNo two such persons shall be together in Hell as if one of them is such that his presence hurts the other. It was asked: Messenger of Allah, who are they? He said: A believer who killed a disbeliever and (then) kept to the right path.\""
  },
  "1892": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1892b\nIn-book reference  : Book 33, Hadith 194\nUSC-MSA web (English) reference  : Book 20, Hadith 4664\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A similar tradition has been narrated on the authority of al-A'mash."
  },
  "1893": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1893b\nIn-book reference  : Book 33, Hadith 196\nUSC-MSA web (English) reference  : Book 20, Hadith 4666\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above tradition has been handed down through a different chain of transmitters."
  },
  "1894": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1894\nIn-book reference  : Book 33, Hadith 197\nUSC-MSA web (English) reference  : Book 20, Hadith 4667\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Anas b. Malik that a young man from Aslam tribe said:\nMessenger of Allah, I wish to fight (in the way of Allah) but I don't have anything to equip myself with for fighting. He (the Holy Prophet) said: Go to so and so, for he had equipped himself (for fighting) but he fell ill. So, he (the young man) went to him and said: The Messenger of Allah (ﷺ) sends you his greetings and says that you should give me the equipage that you have provided yourself with. The man said (to his wife or maidservant): So and so, give him the equipage I have collected for myself and do not withhold anything from him. Do not withhold anything from him so that you may be blessed therein."
  },
  "1895": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1895b\nIn-book reference  : Book 33, Hadith 199\nUSC-MSA web (English) reference  : Book 20, Hadith 4669\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The above tradition has been narrated on the authority of Khalid al- Juhani who said:\nThe Prophet of Allah (ﷺ) said: He who equips a warrior in the way of Allah (is like one who dctually fights) aud he who looks after the family of a warrior in the way of Allah in fact participated in the battle."
  },
  "1896": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1896d\nIn-book reference  : Book 33, Hadith 202\nUSC-MSA web (English) reference  : Book 20, Hadith 4672\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated (through a still different chain of transmitters) on the authority of Abu Sa'id Khudrl that the Messenger of Allah (ﷺ) despatched a force to Banu Lihyan. (and said:\n) One man from every two should join the force. Then he said to those who stayed behind: Those of you who will look well after the family and wealth of those who are going on the expedition will be getting half the reward of the warriors."
  },
  "1897": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1897c\nIn-book reference  : Book 33, Hadith 205\nUSC-MSA web (English) reference  : Book 20, Hadith 4675\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A version of the tradition narrated on the authority of 'Alqama b. Murthad has a differently worded end:\nIt will be said to the Mujahid: Take from his noble deeds whatever you like. Then the Messenger of Allah (ﷺ) turned to us and asked: What do you think (will he leave anything)? - (i. e. he will take away everything)."
  },
  "1898": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1898b\nIn-book reference  : Book 33, Hadith 207\nUSC-MSA web (English) reference  : Book 20, Hadith 4677\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Bara' who said:\nWhen the Qur'anic verse:\" Those who sit (at home) from among mu'min\" (iv. 94) was revealed, the son of Umm Maktum spoke to him (the Holy Prophet). (At this). the words:\" other than those who have a trouble (illness)\" were revealed."
  },
  "1899": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1899\nIn-book reference  : Book 33, Hadith 208\nUSC-MSA web (English) reference  : Book 20, Hadith 4678\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Jabir that a man said:\nMessenger of Allah, where shall I be if I am killed? He replied: In Paradise. The man threw away the dates he had in his hand and fought until he was killed (i. e. he did not wait until he could finish the dates). In the version of the tradition narrated by Suwaid we have the words:\" A man said to the Prophet (ﷺ). on the day of Uhud......\""
  },
  "1900": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1900\nIn-book reference  : Book 33, Hadith 209\nUSC-MSA web (English) reference  : Book 20, Hadith 4679\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Bara! ' who stated:\nA man from Banu Nabit (one of the Ansar tribes) came to the Prophet (ﷺ) and said: I testify that there is no god except Allah and that thou art His bondman and Messenger. Then he went forward and fought until he was killed. The Prophet (ﷺ) said: He has done a little but shall be given a great reward."
  },
  "1901": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1901\nIn-book reference  : Book 33, Hadith 210\nUSC-MSA web (English) reference  : Book 20, Hadith 4680\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Anas b. Malik who said:\nThe Messenger of Allah (ﷺ) sent Busaisah as a scout to see what the caravan of Abu Sufyan was doing. He came (back and met the Prophet in his house) where there was nobody except myself and the Messenger of Allah. I do not remember whether he (Hadrat Anas) made an exception of some wives of the Prophet (ﷺ) or not and told him the news of the caravan. (Having heard the news), the Messenger of Allah (ﷺ) came out (hurriedly), spoke to the people and said: We are in need (of men) ; whoever has an animal to ride upon ready with him should ride with us. People began to ask him permission for bringing their riding animals which were grazing on the hillocks near Medina. He said: No. (I want) only those who have their riding animals ready. So the Messenger of Allah (ﷺ) and his Companions proceeded towards Badr and reached there forestalling the polytheists (of Mecca). When the polytheists (also) reached there, the Messenger of Allah (ﷺ) said: None of you should step forward to (do) anything unless I am ahead of him. The polytheists (now) advanced (towards us), and the Messenger of Allah (ﷺ) said. Get up to enter Paradise which is equal in width to the heavens and the earth. 'Umair b. al- Humam al-Ansari said: Messenger of Allah, is Paradise equal in extent to the heavens and the earth? He said: Yes. 'Umair said: My goodness! The Messenger of Allah (ﷺ) asked him: What prompted you to utter these words (i. e. my goodness! ')? He said: Messenger of Allah, nothing but the desire that I be among its residents. He said: Thou art (surely) amona its residents. He took out dates from his bag and began to eat them. Then he said: If I were to live until I have eaten all these dates of mine, it would be a long life. (The narrator said): He threw away all the dates he had with him. Then he fought the enemies until he was killed."
  },
  "1902": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1902\nIn-book reference  : Book 33, Hadith 211\nUSC-MSA web (English) reference  : Book 20, Hadith 4681\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The tradition has been narrated on the authority of 'Abdullah b. Qais. He heard it from his father who, while facing the enemy, reported that the Messenger of Allah (ﷺ) said:\nSurely, the gates of Paradise are under the shadows of the swords. A man in a shabby condition got up and said; Abu Musa, did you hear the Messenger of Allah (ﷺ) say this? He said: Yes. (The narrator said): He returned to his friends and said: I greet you (a farewell greeting). Then he broke the sheath of his sword, threw it away, advanced with his (naked) sword towards the enemy and fought (them) with it until he was slain."
  },
  "677": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 677k\nIn-book reference  : Book 33, Hadith 212\nUSC-MSA web (English) reference  : Book 20, Hadith 4682\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Anas b. Malik that some people came to the Messenger of Allah (ﷺ) and said to him:\nSend with us some men who may teach us the Qur'an and the Sunnah. Accordingjy, he sent seventy men from the Ansar. They were called the Reciters and among them was my maternal uncle. Haram. They used to recite the Qur'an, discuss and ponder over its meaning at night. In the day they brought water and poured it (in pitchers) in the mosque, collected wood and sold it, and with the sale proceeds bought food for the people of the Suffa and the needy. The Prophet (ﷺ) sent the Reciters with these people, but these (treacherous people) fell upon them and killed thern before they reached their destination (While dying), they said: O Allah, convey from us the news to our Prophet that we have met Thee (in a way) that we are pleased with Thee and Thou art pleased with us. (The narrator said): A man attacked Haram (maternal uncle of Anas) ) from behind and smote him with a spear which pierced him. (While dying), Haram said: By the Lord of the Ka'ba, I have met with success. The Messenger of Allah (ﷺ) said to his Companions: Your brethren have been slain grid they were saying: O Allah, convey from us to our Prophet the news that we have met Thee in a way that we are pleased with Thee and Thou art pleased with us."
  },
  "1903": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1903\nIn-book reference  : Book 33, Hadith 213\nUSC-MSA web (English) reference  : Book 20, Hadith 4683\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been Deported on the authority of Anas who said:\nMy uncle and I have been named after him was not present with the Messenger of Allah (mav peace be upon him) on the Day of Badr. He felt distressed about it. He would say: I have missed the first battle fought by the Messenger of Allah (ﷺ), and if God now gives me an opportunity to see a battlefield with the Messenger of Allah (ﷺ), God will see what I do therein. He was afraid to say more than this (lest he be unable to keep his word with God). He was present with the Messenger of Allah (ﷺ) on the Day of Uhud. He met Sa'd b. Mu'adh (who was retreating). Anas said to him: O Abu 'Amr, where (are you going)? Woe (to thee)! I find the smell of Paradise beside the Uhud mountain. (Reprimanding Sa'd in these words) he went forward and fought thein (the enemy) until he was killed. (The narrator says). More than eighty wounds inflicted with swords, spears and arrows were found on his body. His sister, my aunt, ar-Rubayyi', daughter of Nadr, said: I could not recognise my brother's body (it was so badly mutilated) except from his finger-tips. (It was on this occasion that) the Qur'anic verse:\" Among the Believers are men who have been true to their covenant with God. Of them some have completed their vow (to the extreme), and some still wait: but they have never changed (their determination) in the least\" (xxxiii. 23). The narrator said that the verse had been revealed about him (Anas b. Nadr) and his Companions."
  },
  "1904": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1904d\nIn-book reference  : Book 33, Hadith 217\nUSC-MSA web (English) reference  : Book 20, Hadith 4687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated through a different chain of transmitters on the same authority, i. e. Abu Musa Ash'ari, that a man asked the Messenger of Allah (ﷺ) about fighting in the way of Allah, the Exalted and Majestic, a man who fights out of rage or out of family pride. He raised his head towards him-and he did so because the man was standing and said:\nWho fights that the word of Allah be exalted fights in the way of Allah."
  },
  "1905": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1905b\nIn-book reference  : Book 33, Hadith 219\nUSC-MSA web (English) reference  : Book 20, Hadith 4689\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down through a different chain of transmitters."
  },
  "1906": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1906b\nIn-book reference  : Book 33, Hadith 221\nUSC-MSA web (English) reference  : Book 20, Hadith 4691\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abdullah b. Amr (through a different chain of transmitters) that the Messenger of Allah (ﷺ) said:\nA troop of soldiers, large or small, who fight (in the way of Allah), get their share of the booty and return safe and sound, receive in advance two-thirds of their reward (only one-third remaining to their credit to be received in the Hereafter) ; and a troop of soldiers, large or small, who return empty-handed and are afflicted or wounded, will receive their full reward (in the Hereafter)."
  },
  "1907": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1907b\nIn-book reference  : Book 33, Hadith 223\nUSC-MSA web (English) reference  : Book 20, Hadith 4693\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated through a different chain of transmitters on the authority of Sufyan who said that he heard 'Umar b. al-Khattab relate (this tradition) from the Prophet (ﷺ) while he was delivering a sermon from the pulpit."
  },
  "1908": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1908\nIn-book reference  : Book 33, Hadith 224\nUSC-MSA web (English) reference  : Book 20, Hadith 4694\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Anas b. Malik that the Messenger of Allah (may peace he upon him) said:\nWho seeks martyrdom with sincerity shall get its reward, though he may not achieve it."
  },
  "1909": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1909\nIn-book reference  : Book 33, Hadith 225\nUSC-MSA web (English) reference  : Book 20, Hadith 4695\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported on the authority of Sahl b. Aba Umama b. Sahl b. Hunaif who learned the tradition from his father who (in turn) learned it from his grandfather-that the Messenger of Allah (ﷺ) said:\nWho sought martyrdom with sincerity will be ranked by Allah among the martyrs even if he died on his bed. In his version of the tradition Abd Tahir did not mention the words:\" with sincerity\"."
  },
  "1910": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1910\nIn-book reference  : Book 33, Hadith 226\nUSC-MSA web (English) reference  : Book 20, Hadith 4696\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nOne who died but did not fight in the way of Allah nor did he express any desire (or determination) for Jihad died the death of a hypocrite. 'Abdullah b. Mubarak said: We think the hadith pertained to the time of the Messenger of Allah (ﷺ)."
  },
  "1911": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1911b\nIn-book reference  : Book 33, Hadith 228\nUSC-MSA web (English) reference  : Book 20, Hadith 4698\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "In a version of the tradition narrated on the authority of A'mash, we have the words:\n\" They will share with you the reward (for Jihad).\""
  },
  "1912": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1912d\nIn-book reference  : Book 33, Hadith 232\nUSC-MSA web (English) reference  : Book 20, Hadith 4702\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported by 'Abdullah b. 'Abd al-Rahman that he heard Anas b. Malik say:\nThe Messenger of Allah (ﷺ) paid a visit to Milhan's daughter, maternal aunt of Anas (and the sister of the Holy Prophet's foster-mother). He placed his head near her (from this point onward, the narrator carried on the previous tradition to its end)."
  },
  "1913": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1913b\nIn-book reference  : Book 33, Hadith 234\nUSC-MSA web (English) reference  : Book 20, Hadith 4704\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has been handed down on the authority of Salman al-Khair through another chain of transmitters."
  },
  "1914": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1914\nIn-book reference  : Book 33, Hadith 235\nUSC-MSA web (English) reference  : Book 20, Hadith 4705\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Abu Huraira that the, Messenger of Allah (ﷺ) said:\nWhile a man walks along a path, finds a thorny twig lying on the way and puts it aside, Allah would appreciate it and forgive him The Prophet (ﷺ) said: The martyrs are of five kinds: one who dies of plague; one who dies of diarrhoea (or cholera) ; one who is drowned; one who is buried under debris and one who dies fighting in the way of Allah."
  },
  "1915": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1915c\nIn-book reference  : Book 33, Hadith 238\nUSC-MSA web (English) reference  : Book 20, Hadith 4708\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version of the tradition narrated on the authority of Suhail thouch a different chain of transmitters contains the additional words:\n\" A drowned person is a martyr.\""
  },
  "1916": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1916b\nIn-book reference  : Book 33, Hadith 240\nUSC-MSA web (English) reference  : Book 20, Hadith 4710\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This hadith has been narrated on the authority of 'Asim through the same chain of transmitters."
  },
  "1917": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1917\nIn-book reference  : Book 33, Hadith 241\nUSC-MSA web (English) reference  : Book 20, Hadith 4711\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Ibn Amir who said:\nI heard the Messenger of Allah (ﷺ) say-and he was delivering a sermon from the pulpit: Prepare to meet them with as much strength as you can afford. Beware, strength consists in archery. Beware, strength consists in archery. Beware, strength consists in archery."
  },
  "1918": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1918b\nIn-book reference  : Book 33, Hadith 243\nUSC-MSA web (English) reference  : Book 20, Hadith 4713\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "This tradition has also been narrated on the same authority through another chain of transmitters."
  },
  "1919": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1919\nIn-book reference  : Book 33, Hadith 244\nUSC-MSA web (English) reference  : Book 20, Hadith 4714\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been reported by 'Abd al-Rahman b. Shamasa that Fuqaim al- Lakhmi said to Uqba b. Amir:\nYou frequent between these two targets and you are an old man, so you will be finding it very hard. 'Uqba said: But for a thing I heard from the Prophet (ﷺ), I would not strain myself. Harith (one of the narrators in the chain of transmitters) said: I asked Ibn Shamasa: What was that? He said that he (the Holy Prophet) said: Who learnt archery and then gave it up is not from us. or he has been guilty of disobedience (to Allah's Apostle)."
  },
  "1920": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1920\nIn-book reference  : Book 33, Hadith 245\nUSC-MSA web (English) reference  : Book 20, Hadith 4715\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Thauban that the Messenger of Allah (ﷺ) said:\nA group of people from my Umma will always remain triumphant on the right path and continue to be triumphant (against their opponents). He who deserts them shall not be able to do them any harm. They will remain in this position until Allah's Command is executed (i.e. Qiyamah is established). In Qutaiba's version of the tradition, we do not have the words:\" They will remain in this position.\""
  },
  "1921": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1921b\nIn-book reference  : Book 33, Hadith 247\nUSC-MSA web (English) reference  : Book 20, Hadith 4716\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "The same tradition has been narrated through another chain of transmitters on the same authority."
  },
  "1922": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1922\nIn-book reference  : Book 33, Hadith 248\nUSC-MSA web (English) reference  : Book 20, Hadith 4717\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Jabir b. Samura that the Prophet (ﷺ) said:\nThis religion will continue to exist, and a group of people from the Muslims will continue to fight for its protection until the Hour is established."
  },
  "1923": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1923\nIn-book reference  : Book 33, Hadith 249\nUSC-MSA web (English) reference  : Book 20, Hadith 4718\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of Jabir b. 'Abdullah who said:\nI heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to fight In defence of truth and remain triumphant until the Day of judgment."
  },
  "1037": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1037d\nIn-book reference  : Book 33, Hadith 251\nUSC-MSA web (English) reference  : Book 20, Hadith 4720\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been related by, Yazid b. al-Asamm that he heard Mu'awiya b. Abu Sfyan quote a tradition from the Prophet (ﷺ) which he related from the Prophet (mail peace he upon him) -and he did not hear him quote from the Prophet (masy peace be upon him) any tradition other than this in the course of his sermon from the pulpit-that whom Allah wants to do a favour, He grants him an understanding of religion. A group of people from the Muslims will remain on the Right Path and continue until the Day of Judgment to triumph over those who oppose them."
  },
  "1924": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1924\nIn-book reference  : Book 33, Hadith 252\nUSC-MSA web (English) reference  : Book 20, Hadith 4721\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated on the authority of 'Abd al-Rahman b. Shamasa al- Mahri who said:\nI was in the company of Maslama b. Mukhallad, and 'Abdullah b. 'Amr b. 'As was with him. 'Abdullah said: The Hour shall some oniy when the worst type of people are left on the earth. They will be worse than the people of pre-Islamic days. They will get whatever they ask of Allah. While we were yet sitting when 'Uqba b. 'Amir came, and Maslama said to him: 'Uqba, listen to what 'Abdullah says. 'Uqba said: He knows better; so far as I am concerned, I heard the Messenger of Allah (ﷺ) say: A group of people from my Umma will continue to fight in obedience to the Command of Allah, remaining dominant over their enemies. Those who will oppose them shall not do them any harm. They will remain ill this condition until the Hour overtakes them. (At this) 'Abdullah said: Yes. Then Allah will raise a wild which will be fragrant like musk and whose touch will be like the touch of silk; (but) it will cause the death of all (faithful) persons, not leaving behind a single person with an iota of faith in his heart. Then only the worst of men will remain to be overwhelmed by the Hour."
  },
  "1925": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1925\nIn-book reference  : Book 33, Hadith 253\nUSC-MSA web (English) reference  : Book 20, Hadith 4722\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated by Sa'd b. Abu Waqqas that the Messenger of Allah (ﷺ) said:\nThe people of the West will continue to triumphantly follow the truth until the Hour is established."
  },
  "1926": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1926b\nIn-book reference  : Book 33, Hadith 255\nUSC-MSA web (English) reference  : Book 20, Hadith 4724\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "It has been narrated (through another chain of transmitters) on the authority of Abu Huraira that the Messenger of Allah (ﷺ) said:\nWhen you travel (through a land) where there is plenty of vegetation, you should (go slow and) give the camels a chance to enjoy the benefit of the earth. When you travel (through a land) where there is scarcity of vegetation, you should hasten with them (so that you may be able to cross that land while your animals ore still in a good condition of health). When you make a halt for the night, avoid (doing so on) the road, for the tracks are the pathways of wild beasts or the abode of noxious little animals."
  },
  "1927": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1927\nIn-book reference  : Book 33, Hadith 256\nUSC-MSA web (English) reference  : Book 20, Hadith 4725\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "On the authority of Abu Huraira that the Prophet (ﷺ) said:\nTravelling is a tortuous experience. It deprives a person of his sleep. his food and drink. When one of you has accomplished his purpose, he should hasten his return to his family."
  },
  "1928": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1928b\nIn-book reference  : Book 33, Hadith 258\nUSC-MSA web (English) reference  : Book 20, Hadith 4726\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "Another version of the tradition narrated on the same authority worded slightly differently. It says:\n(He) would not enter (upon his household at night)."
  },
  "715": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 715ad\nIn-book reference  : Book 33, Hadith 266\nUSC-MSA web (English) reference  : Book 20, Hadith 4731\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "A version of the tradition narrated on the authority of Jabir (but through a different chain of transmitters) mentions the undesirability of coining to one's house like a night visitor, but does not contain the words:\n\" Doubting their fidelity or spying into their lapses.\""
  }
}