{
  "1501": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1501b\nIn-book reference  : Book 20, Hadith 2\nUSC-MSA web (English) reference  : Book 9, Hadith 3579\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "This hadith has been reported on the authority of Ibn 'Umar through another chain of transmitters."
  },
  "1502": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1502\nIn-book reference  : Book 20, Hadith 3\nUSC-MSA web (English) reference  : Book 9, Hadith 3580\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nThe slave who is jointly owned by two persons, and is emancipated by one of them, (this one) has liability (upon him to secure complete freedom for that slave)."
  },
  "1503": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1503c\nIn-book reference  : Book 20, Hadith 6\nUSC-MSA web (English) reference  : Book 9, Hadith 3583\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "A hadith like this is reported on the authority of the same chain of transmitters but with a slight change of words."
  },
  "1504": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1504k\nIn-book reference  : Book 20, Hadith 17\nUSC-MSA web (English) reference  : Book 9, Hadith 3594\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "'A'isha (Allah be pleased with her). the wife of Allah's Apostle (may Peace be upon him) said:\nThree are the Sunan (usages) (that we came to know in case of Bairara). She was given option in regard to her husband when she was emancipated. Sbe was given meat as charity. Allah's Messenger (way peace be upon him) visited me when an earthen pot with meat in it was placed on the fire. He asked for food and be was given bread with ordinary meat (usually cooked in the) house. Thereupon he (Allah's Messenger) said: Don't I see the earthen pot on fire with meat in it? They said: Yes. Allah's Messenger, there is meat in it which was given as charity to Barira. We did not deem it advisable that we should give you that to eat, whereupon he said: It is charity for her, but it is gift for us. Allah's Apostle (ﷺ) also said: The right of inheritance vests with one who emancipates."
  },
  "1505": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1505\nIn-book reference  : Book 20, Hadith 18\nUSC-MSA web (English) reference  : Book 9, Hadith 3595\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Abu Huraira (Allah be pleased with him) reported:\n'A'isha (Allah be pleated with her) thought of buying a slave-girl and emancipating her, but her owners refused to (sell her but on the condition) that the right of inheritance would vest in them. She made a mention of that to Allah's Messenger (ﷺ). whereupon he said: Let this (condition) not stand in your way for the right of inheritance vests with one who emancipates."
  },
  "1506": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1506b\nIn-book reference  : Book 20, Hadith 20\nUSC-MSA web (English) reference  : Book 9, Hadith 3597\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "This hadith has been narrated on the authority of Ibn 'Umar (Allah be pleased with them) through another chain of transmitters but with this change that in tba hadith narrated by al-Thaqafi from Ubaidullah there is only a mention of selling (or right of inheritance, al-Wala' ) but not that of making a gift."
  },
  "1507": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1507\nIn-book reference  : Book 20, Hadith 21\nUSC-MSA web (English) reference  : Book 9, Hadith 3598\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Jabir b. Abdullah (Allah be pleased with them) reported that Allah's Apostle (ﷺ) made it obligatory for every tribe (the payment) of blood-wit; he then also made it explicit that it is not permissible for a Muslim to make himself the ally (of the slave emancipated by another) Muslim without his permission. He (the narrator further added):\nI was informed that he (the Holy Prophet) cursed the one who did that (and it was recorded) in his Sahifa (in a document)."
  },
  "1508": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1508b, 1508c\nIn-book reference  : Book 20, Hadith 23\nUSC-MSA web (English) reference  : Book 9, Hadith 3600\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Apostle (ﷺ) as saying:\nHe who took the freed slave as his ally without the consent of his previous master, there is upon him the curse of Allah and that of His angels and that of the whole mankind, and there will not be accepted from him his obligatory acts or supercrogatory acts on the Day of Resurrection. This hadith is narrated through the same chain of transmitters, but with a slight change of words."
  },
  "1370": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1370d\nIn-book reference  : Book 20, Hadith 24\nUSC-MSA web (English) reference  : Book 9, Hadith 3601\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Ibrahim al-Taimi reported on the authority of his father:\n'Ali b. Abu Talib (Allah be pleased with him) addressed us and said: He who thinks that we (the members of the Prophet's family) read anything else besides the Book of Allah and this Sahifa (and he said that Sahifa was tied to the scabbard of the sword) tells a lie. (This Sahifa) contains (problems) pertaining to the ages of the camels and (the recompense) of the injuries, and it also records the words of the Prophet (ﷺ): Medina is a sacred territory from 'Ayr to Thaur (it is most probably Uhud). He who innovates (an act or practice) or gives protection to an innovator, there is a curse of Allah and that of His angels and that of the whole humanity upon him. Allah will not accdpt from him (as a recompense) any obligatory act or supererogatory act, and the responsibility of the Muslims is a joint responsibility; even the lowest in rank can undertake the responsibility (on behalf of others), and he who claims anyone else as his father besides his own father or makes one his ally other than the one (who freed him), there is a curse of Allah. that of His angels and that of the wholemankind upon him. Allah will not accept the obligatory act of the supererogatery act (as a recompense) from him."
  },
  "1509": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1509d\nIn-book reference  : Book 20, Hadith 28\nUSC-MSA web (English) reference  : Book 9, Hadith 3605\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "Abu Huraira (Allah be pleased with him) reported Allah's Messenger (ﷺ) as saying:\nA Muslim who emancipates a Muslim (slave). Allah will save from Fire every limb of his for every limb (of the slave). Sa'id b. Marjana said: When I heard this hadith from Abu Huraira (Allah be pleased with him), I went away and made a mention of it to 'Ali b. Husain and he at once emancipated the slave for which Ibn ja'far was prepared to pay ten thousand dirhams or one thousand dinars."
  },
  "1510": {
    "collection": "Sahih Muslim",
    "book": "The Book of Emancipating Slaves",
    "book_num": "20",
    "reference": "Reference  : Sahih Muslim 1510b\nIn-book reference  : Book 20, Hadith 30\nUSC-MSA web (English) reference  : Book 9, Hadith 3607\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/20",
    "text": "A hadith like this has been narrated on the authority of Suhail with the same chain of transmitters."
  }
}