{
  "2772": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2772\nIn-book reference  : Book 51, Hadith 1\nUSC-MSA web (English) reference  : Book 38, Hadith 6677\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Zaid b. Arqam reported:\nWe set out on a journey along with Allah's Messenger (ﷺ) in which we faced many hardships. 'Abdullah b. Ubayy said to his friends: Do not give what you have in your possession to those who are with Allah's Messenger (ﷺ) until they desert him. Zubair said: That is the reciting of that person who recited as min haulahu (from around him) and the other reciting is man haulahia (who are around him). And in this case when we would return to Medina the honourable would drive out the meaner therefrom (lxiv. 8). I came to Allah's Apostle (ﷺ) and informed him about that and he sent someone to 'Abdullah b. Ubayy and he asked him whether he had said that or not. He took an oath to the fact that he had not done that and told that it was Zaid who had stated a lie to Allah's Messenger (ﷺ). Zaid said: I was much perturbed because of this until this verse was revealed attesting my truth:\" When the hypocrites come\" (lxiii. 1). Allah's Apostle (ﷺ) then called them in order to seek forgiveness for them, but they turned away their heads as if they were hooks of wood fixed in the wall (lxiii. 4), and they were in fact apparently good-looking persons."
  },
  "2773": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2773b\nIn-book reference  : Book 51, Hadith 3\nUSC-MSA web (English) reference  : Book 38, Hadith 6679\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Jabir b. 'Abdullah reported that Allah's Messenger (ﷺ) came to the grave of 'Abdullah b. Ubayy as he was placed in that. The rest of the hadith is the same."
  },
  "2774": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2774b\nIn-book reference  : Book 51, Hadith 5\nUSC-MSA web (English) reference  : Book 38, Hadith 6681\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "This hadith has been narrated on the authority of 'Abdullah with the same chain of transmitters but with this addition:\n\" He then abandoned offering (funeral) prayer for them.\""
  },
  "2775": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2775b\nIn-book reference  : Book 51, Hadith 7\nUSC-MSA web (English) reference  : Book 38, Hadith 6683\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "This hadith has been narrated on the authority of 'Abdullah through another chain of transmitters."
  },
  "2776": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2776b\nIn-book reference  : Book 51, Hadith 9\nUSC-MSA web (English) reference  : Book 38, Hadith 6685\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "This hadith has been narrated on the authority of Shu'ba with the same chain of transmitters."
  },
  "2777": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2777\nIn-book reference  : Book 51, Hadith 10\nUSC-MSA web (English) reference  : Book 38, Hadith 6686\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Abu Sa'id Khudri reported that during the lifetime of Allah's Messenger (ﷺ) the hypocrites behaved in this way that when Allah's Apostle (ﷺ) set out for a battle, they kept themselves behind, and they became happy that they had managed to sit in the house contrary to (the act of) Allah's Messenger (ﷺ), and when Allah's Apostle (may peace he upon him) came back, they put forward excuses and took oath and wished that people should laud them for the deeds which they had not done. It was on this occasion that this verse was revealed:\n\" Think not that those who exult in what they have done, and love to be praised for what they have not done-think not them to be safe from the chastisement; and for them is a painful chastisement\" (iii. 18)."
  },
  "2778": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2778\nIn-book reference  : Book 51, Hadith 11\nUSC-MSA web (English) reference  : Book 38, Hadith 6687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Humaid b. 'Abd al-Rahman b. 'Auf reported that Marwan said to Rafi', his chamberlain, that he should go to Ibn 'Abbas and ask him:\nIf every one of us be punished for his being happy upon his deed and for his being praised for what he has not done, nobody would be saved from the torment. Ibn 'Abbas said: What you have to do with this verse? It has been in fact revealed in connection with the people of the Book.\" Then Ibn Abbas recited this verse:\" When Allah took a covenant from those who had been given the Book: You shall explain it to people and shall not conceal this\" (iii. 186), and then Ibn 'Abbas recited this verse:\" Think not that those who exult in what they have done and love to be praised for what they have not done\" (iii. 186). Ibn 'Abbas (further) said: Allah's Apostle (ﷺ) asked them about something and then they concealed that and they told him something else and they went out and they thought that they had informed him as lie had asked them and they felt happy of what they had concealed."
  },
  "2779": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2779c\nIn-book reference  : Book 51, Hadith 14\nUSC-MSA web (English) reference  : Book 38, Hadith 6690\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Abu Tufail reported that there was a dispute between Hudhaifa and one from the people of Aqaba as it happens amongst people. He said:\nI adjure you by Allah to tell me as to how many people from Aqaba were. The people said to him (Hudhaifa) to inform him as he had asked. We have been informed that they were fourteen and If you are to be counted amongst them, then they would be fifteen and I state by Allah that twelve amongst them were the enemies of Allah and of His Messenger (ﷺ) in this world. The rest of the three put forward this excuse: We did not hear the announcement of Allah's Messenger (ﷺ) and we were not aware of the intention of the people as he (the Holy Prophet) had been in the hot atmosphere. He (the Holy Prophet) then said: The water is small in quantity (at the next station). So nobody should go ahead of me, but he found people who had gone ahead of him and he cursed them on that day."
  },
  "2780": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2780b\nIn-book reference  : Book 51, Hadith 16\nUSC-MSA web (English) reference  : Book 38, Hadith 6692\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Jabir b. Abdullah reported Allah's Messenger (ﷺ) as saying:\nHe who would climb this hill of Murar. The rest of the hadith is the same but with this variation that it was a desert Arab who was finding out his lost thing."
  },
  "2781": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2781\nIn-book reference  : Book 51, Hadith 17\nUSC-MSA web (English) reference  : Book 38, Hadith 6693\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Anas b. Malik reported:\nThere was a person amongst us who belonged to the tribe of Bani Najjar and he recited Sura al-Baqarah and Surat Al-i-'Imran and he used to transcribe for Allah's Messenger (ﷺ). He ran away as a rebel and joined the People of the Book. They gave it much importance and said: He is the person who used to transcribe for Muhammad and they were much pleased with him. Time rolled on that Allah caused his death. They dug the grave and buried him therein, but they found to their surprise that the earth had thrown him out over the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. They again dug the grave for him and buried him but the earth again threw him out upon the surface. At last they left him unburied."
  },
  "2782": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2782\nIn-book reference  : Book 51, Hadith 18\nUSC-MSA web (English) reference  : Book 38, Hadith 6694\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Jabir reported that Allah's Messenger (ﷺ) came back from a journey and as he was near Medina, there was such a violent gale that the mountain seemed to be pressed. Allah's Messenger (ﷺ) said:\nThis wind has perhaps been made to blow for the death of a hypocrite, and as he reached Medina a notorious hypocrite from amongst the hypocrites had died."
  },
  "2783": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2783\nIn-book reference  : Book 51, Hadith 19\nUSC-MSA web (English) reference  : Book 38, Hadith 6695\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Iyas reported on the authority of his father:\nWe went along with Allah's Messenger (ﷺ) to visit a person suffering from fever. When I placed my hand upon him, I said: By Allah, I have never seen, till this day, a person running higher temperature than he. Thereupon Allah's Apostle (ﷺ), turning his face to his companions, said: May I not inform you of a severer temperature than this which these two persons would run on the Day of Resurrection? And they were two hypocrites riding upon the camel turning their back towards (the Muslims)."
  },
  "2784": {
    "collection": "Sahih Muslim",
    "book": "Characteristics of The Hypocrites And Rulings Concerning Them",
    "book_num": "51",
    "reference": "Reference  : Sahih Muslim 2784b\nIn-book reference  : Book 51, Hadith 21\nUSC-MSA web (English) reference  : Book 38, Hadith 6697\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/51",
    "text": "Ibn Umar reported Allah's Apostle (ﷺ) saying like this but with this change of words:\n\" She sometimes finds a way in one flock and then in another flock.\""
  }
}