{
  "5300780": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300780\nIn-book reference  : Book 2, Hadith 001\nEnglish translation  : Vol. 1, Book 2, Hadith 001",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Harithah said:\nSome people from Syria came to ‘Umar and said: We have acquired wealth and horses and slaves,and we want to pay zakah on them as a purification. He said: I shall do what my two predecessors did. He consulted the Companions of Muhammad (ﷺ), among whom was ‘Ali, and ‘Ali said: It is good, provided it does not become a regular tax that is taken from them after you are gone."
  },
  "5300790": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300790\nIn-book reference  : Book 2, Hadith 002\nEnglish translation  : Vol. 1, Book 2, Hadith 002",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Wa'il that as-Subayy bin Ma'bad was a Bedouin Taghlibi Christian who became Muslim. He asked:\nWhich deed is best? He was told: Jihad for the sake of Allah, may He be glorified and exalted. He wanted to go for jihad, but it was said to him: Have you done Hajj? He said no. So it was said to him: Go for Haji and 'Umrah, then go for jihad. So he set out and when he was in al-Hawa'it, he entered ihram for both Haji and 'Umrah together, Zaid bin Soohan and Salman bin Rabee'ah saw him and said: He is more astray than his camel, or he is no more guided than his camel. He went to ‘Umar and told him what they had said. He said: You have been guided to the Sunnah of your Prophet (ﷺ) . Al-Hakam said: I said to Abu Wa'il. Did as-Subayy tell you that? He said: Yes"
  },
  "5300800": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300800\nIn-book reference  : Book 2, Hadith 003\nEnglish translation  : Vol. 1, Book 2, Hadith 003",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Amr bin Maimoon said:\n‘Umar led us in praying Fajr in Jam', then he stood up and said: The mushrikoon used not to depart until the sun rose, but the Messenger of Allah (ﷺ) differed from them and moved on before the sun rose."
  },
  "5300810": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300810\nIn-book reference  : Book 2, Hadith 004\nEnglish translation  : Vol. 1, Book 2, Hadith 004",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Asim bin Kulaib said:\nMy father said: I told Ibn 'Abbas and he said: What is so amazing about that? When ʼUmar called the prominent shaikhs among the Companions of Muhammad ﷺ, he would call me with them and say: Do not speak until they have spoken. He called us one day or one night and said: The Messenger of Allah ﷺ said about Lailatal-Qadr what you know, so seek it in the odd numbered nights of the last ten nights; on which odd-numbered night do you think it is?"
  },
  "5300820": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300820\nIn-book reference  : Book 2, Hadith 005\nEnglish translation  : Vol. 1, Book 2, Hadith 005",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Shu'bah said:\nI heard 'Asim bin 'Amr al-Bajali narrate from one of those who asked ‘Umar bin al-Khattab. We have come to you to ask you about three things: A man's nafl prayer in his house, Ghusl in the case of janabah, and what it is appropriate for a man to do with his wife when she is menstruating. He said: Are you magicians? You have asked me about something that no one has asked me about since I asked the Messenger of Allah (ﷺ) about it, and he said: `A man's nafl prayer in his house is light, so whoever wishes, let him illuminate his house.` And he said with regard to ghusl in the case of janabah: `Let him wash his private parts, then do wudoo', then pour water over his head three times.` And he said concerning the menstruating woman: `The [Husband may enjoy] whatever is above the izar (waist wrapper).`"
  },
  "5300830": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300830\nIn-book reference  : Book 2, Hadith 006\nEnglish translation  : Vol. 1, Book 2, Hadith 006",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Umar that he said:\nI saw Sa'd bin Abi Waqqas wiping over his khuffain in Iraq when he did wudoo’ and I objected to that When we met with 'Umar bin al-Khattab, he said to me. Ask your father about what you objected to me doing of wiping over my khuffain, I mentioned that to him and he said: If Sa'd tells you something, do not object to it, for the Messenger of Allah (ﷺ) used to wipe over his khuffain."
  },
  "5300840": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300840\nIn-book reference  : Book 2, Hadith 007\nEnglish translation  : Vol. 1, Book 2, Hadith 007",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Abdullah bin 'Umar, from Sa'd bin Abi Waqqas that the Messenger of Allah (ﷺ) used to wipe over his khuffain. 'Abdullah bin 'Umar asked 'Umar about that and he said:\nYes, if Sa'd narrates some-thing to you from the Messenger of Allah (ﷺ), do not ask anyone else about it."
  },
  "5300850": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300850\nIn-book reference  : Book 2, Hadith 008\nEnglish translation  : Vol. 1, Book 2, Hadith 008",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ma'dan bin Abi Talhah that 'Umar bin al Khattab delivered a khutbah on Friday, and he mentioned the Prophet of Allah ﷺ and Abu Bakr رضي الله عنه . He said:\nI saw a dream that I can only interpret as meaning that my death is near; I saw as if a rooster pecked me twice, and I was told that it was a red rooster. I told this dream to Asma’ bint 'Umais, the wife of Abu Bakr , and she said: You will be killed by a Persian man. The people are asking me to appoint a successor, but Allah will not cause His religion and His caliphate, with which He sent His Prophet ﷺ to be lost. If death comes to me soon, then the caliphate is to be decided by these six men with whom the Messenger of Allah (ﷺ) was pleased when he died. Whichever of them you swear allegiance to, then listen to him and obey. I know that some people will object to this matter. I have fought them with my own hands in the defence of Islam. \nThey are the enemies of Allah and misguided kafirs. By Allah, I am not leaving behind anything that my Lord instructed me to do and I came to the position of caliphate on that basis that is more important to me than kalalah. By Allah, the Prophet of Allah ﷺ never emphasised any issue to me since I accompanied him more than the issue of kalalah, until he poked me in the chest with his finger and said: `Is not ayatas-saif (the verse of summer, i.e., it was revealed in summer), which appears at the end of Sooratan Nisa', sufficient for you?` If I live I will issue a decree that will be so clear that those who read the Qur'an and those who do not read it will be able to make decisions concerning it. I call upon Allah to bear witness over the governors of the regions, for I only sent them to be just and to teach the people their religion and the Sunnah of the Prophet ﷺ and to refer to me concerning any difficult matter. O people, you eat two plants which I find to be nothing but repugnant, this onion and garlic. I remember the Messenger of Allah ﷺ, if he noticed their smell coming from a man in the mosque, he would issue orders that he taken out from the mosque to al-Baqee'. Whoever must eat them, let him cook them to death.” \n\nHe said: He addressed the people on Friday and was attacked on Wednesday."
  },
  "5300860": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300860\nIn-book reference  : Book 2, Hadith 009\nEnglish translation  : Vol. 1, Book 2, Hadith 009",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abdullah bin 'Umar said az-Zubair, al Miqdad bin al-Aswad and I went out to our property in Khaibar to take care of it. When we got there, we dispersed, each man going to his property. I was attacked under cover of night when I was sleeping on my bed and my arms were dislocated at the elbows. In the morning, my two companions were called and they came and asked me:\nWho did this to you? l said: I do not know. They treated my arms then they brought me to ‘Umar who said: This is the work of some Jews. Then he stood and addressed the people, and said: O people, the Messenger of Allah (ﷺ) made a deal with the Jews of Khaibar on the basis that we could expel them whenever we want. They have attacked 'Abdullah bin ‘Umar and dislocated his arms, as you heard about their attack on the Ansari before him. We do not doubt that they are the ones who did it, as we have no other enemy but them. Whoever has property in Khaibar, let him go there, for I am going to expel the Jews. Then he expelled them."
  },
  "5300870": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300870\nIn-book reference  : Book 2, Hadith 010\nEnglish translation  : Vol. 1, Book 2, Hadith 010",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Hurairah that whilst 'Umar bin al-Khattab was delivering the khutbah on Friday, a man came and ‘Umar said:\nWhy are you coming late to the prayer? The man said: As soon as I heard the call, I did wudoo’. He said: Did you not also hear that the Messenger of Allah ﷺ said: `Before one of you goes to Jumu'ah, let him do ghusl?`"
  },
  "5300880": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300880\nIn-book reference  : Book 2, Hadith 011\nEnglish translation  : Vol. 1, Book 2, Hadith 011",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu 'Uthman said:\nA letter came to us from ‘Umar when we were in Azerbaijan (in which it said): O 'Utbah bin Farqad, beware of luxury, the clothing of the mushrikeen and wearing silk, for the Messenger of Allah (ﷺ) forbade us to wear silk and said, “Except this much,` and the Messenger of Allah (ﷺ) held up two fingers to us."
  },
  "5300890": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300890\nIn-book reference  : Book 2, Hadith 012\nEnglish translation  : Vol. 1, Book 2, Hadith 012",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Sinan al-Du'ali that he entered upon 'Umar bin al-Khattab with whom there was a group of the earliest Muhajireen, 'Umar sent for a basket that had been brought to him from Iraq, in which there was a ring. One of his sons took it and put it in his mouth. ‘Umar took it from him, then 'Umar wept and those who were with him said:\nWhy are you weeping when Allah has granted victory to you and caused you to prevail over your enemies and granted you joy? 'Umar said: I heard the Messenger of Allah ﷺ say: `Accumulation of worldly luxuries does not become available to any people but Allah, may He Be glorified and exalted, stirs up among them enmity and hatred until the Day of Resurrection, and that concerns me.`"
  },
  "5300900": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300900\nIn-book reference  : Book 2, Hadith 013\nEnglish translation  : Vol. 1, Book 2, Hadith 013",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Abdullah bin 'Umar, that his father said:\nI asked the Messenger of Allah (ﷺ) what one of us should do if he becomes junub then wants to sleep before doing ghusl. The Messenger of Allah (ﷺ) said: “Let him do wudoo' as for prayer, then he may go to sleep.`"
  },
  "5300910": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300910\nIn-book reference  : Book 2, Hadith 014\nEnglish translation  : Vol. 1, Book 2, Hadith 014",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Abdullah bin 'Abbas said:\nI heard 'Umar bin al-Khattab say: When ‘Abdullah bin Ubayy died, the Messenger of Allah ﷺ was called to offer the funeral prayer for him, and when he stood by the deceased and was about to offer the prayer for him. I went and stood before him and said: O Messenger of Allah, (will you offer the funeral prayer) for the enemy of Allah who said such and such? and I listed what he had done. And the Messenger of Allah ﷺ was smiling until when I had said too much, he said: `Move away from me, O ‘Umar, for I was given the choice and I have chosen. It was said: `Whether you (O Muhammad) ask forgiveness for them (hypocrites) or ask not forgiveness for them- (and even) if you ask seventy times for their forgiveness-Allah will not forgive them' [at-Tawbah 9:80]. If I knew that by asking for forgiveness more than seventy times they would be forgiven, I would have done that.` He said: Then he offered the funeral prayer for him, and walked with him (his bier), and stood by his grave until the burial was completed. He said: I was astounded that I had spoken so audaciously to the Messenger of Allah ﷺ; Allah and His Messenger know best. By Allah, it was not long before these two verses were revealed: “And never (O Muhammad pray (funeral prayer) for any of them (hypocrites) who dies, nor stand at his grave. Certainly they disbelieved in Allah and His Messenger, and died while they were Fasiqoon (rebellious, - disobedient to AIlah and His Messenger).`[at-Tawbah9:84]. So after that the Messenger of Allah ﷺ did not offer the funeral prayer for any hypocrite or stand by his grave until he passed away."
  },
  "5300920": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300920\nIn-book reference  : Book 2, Hadith 015\nEnglish translation  : Vol. 1, Book 2, Hadith 015",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abdullah bin 'Umar used to say:\nIf a man has only one garment, let him wrap it around his waist and then pray, for I heard 'Umar bin al-Khattab say that, and he said: Do not wrap it around the whole body if it is only one garment, as the Jews do. Nati' said: If I tell you that he attributed that to the Messenger of Allah ﷺ, I hope that I would not be lying."
  },
  "5300930": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300930\nIn-book reference  : Book 2, Hadith 016\nEnglish translation  : Vol. 1, Book 2, Hadith 016",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Uqbah bin ‘Amir said:\nUmar told me that he heard the Messenger of Allah ﷺsay: “Whoever dies believing in Allah and the Last Day, it will said to him: ‘Enter Paradise from whichever of the eight gates of Paradise you wish.`"
  },
  "5300940": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300940\nIn-book reference  : Book 2, Hadith 017\nEnglish translation  : Vol. 1, Book 2, Hadith 017",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Mujahid said:\nA man struck a son of his with a sword and killed him. The matter was referred to 'Umar and he said. Were it not that I heard the Messenger of Allah ﷺ say, “No father should be executed in retaliation for killing his son.` I would have executed you before you left."
  },
  "5300950": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300950\nIn-book reference  : Book 2, Hadith 018\nEnglish translation  : Vol. 1, Book 2, Hadith 018",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Abis bin Rabee'ah said:\nI saw 'Umar look at the Black Stone and say: By Allah, were it not that I saw the Messenger of Allah ﷺ kiss you, I would not have kissed you. Then he kissed it."
  },
  "5300960": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300960\nIn-book reference  : Book 2, Hadith 019\nEnglish translation  : Vol. 1, Book 2, Hadith 019",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Abdullah bin as-Sa'di that he came to 'Umar bin al-Khattab during his caliphate and 'Umar said to him:\nWas I not told that you do work for people, then when you are given your wages you do not accept it? I said: Yes. `Umar said: Why do you do that? I said: I have horses and slaves, and I am well off. I want my work to be an act of charity towards the Muslims. 'Umar said: Do not do that, for I wanted to do the same as you want to do. The Prophet ﷺ would give me some payment and I would say: Give it to one who is more in need of it than me. One day he gave me something and I said: Give it to one who is more in need of it than me. The Prophet ﷺ said: `Take it, keep it, and give it in charity, Whatever of this wealth comes to you when you are not hoping for it or asking for it, accept it, but if it does not come to you, do not hope for it.”"
  },
  "5300970": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300970\nIn-book reference  : Book 2, Hadith 020\nEnglish translation  : Vol. 1, Book 2, Hadith 020",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Rabee'ah bin Darraj narrated that 'Ali bin Abi Talib prayed two naft rak'ahs after ‘Asr on the road to Makkah, and 'Umar saw him and got angry with him, then he said:\nBy Allah, I am certain that the Messenger of Allah ﷺ forbade that."
  },
  "5300980": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300980\nIn-book reference  : Book 2, Hadith 021\nEnglish translation  : Vol. 1, Book 2, Hadith 021",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from a man of Quraish from Banu Sahm, that a man among them who was called Majidah said:\nI had a fight with a slave and he bit my ear and took a piece out of it, or I bit his ear and took a piece out of it. When Abu Bakr came to us for Hajj, our case was referred to him, and he said: Take them to 'Umar bin al-Khattab, and if the one who caused the injury has reached puberty, let retaliation be taken. When we were brought to ‘Umar, he examined us and said: Yes, this one has reached the age where retaliation may be sought. Call a cupper for me. When he mentioned the cupper, he said: I heard the Messenger of Allah ﷺ say: `I gave a slave to my maternal aunt and I hope that Allah will bless him for her, and I told her not to let him be a cupper, a butcher or a goldsmith.”\nIt was narrated from a man from Banu Sahm, from Ibn Majidah as-Sahmi, that he said: Abu Bakr led us on Hajj, during his caliphate, and he mentioned the same hadeeth."
  },
  "5300990": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5300990\nIn-book reference  : Book 2, Hadith 022\nEnglish translation  : Vol. 1, Book 2, Hadith 022",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Sa'eed said:\n‘Umar addressed the people and said: Allah, may He be glorified and exalted, granted whatever concessions. He willed to His Prophet ﷺ, and the Prophet of Allah ﷺ has passed away, so complete Hajj and 'Umrah as Allah has commanded you, and guard the chastity of these women."
  },
  "5301000": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301000\nIn-book reference  : Book 2, Hadith 023\nEnglish translation  : Vol. 1, Book 2, Hadith 023",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Umar, that 'Umar bin al-Khattab رضي الله عنه said:\nThe Messenger of Allah ﷺ was asked: Can a man go to sleep when he is junub? He said: `Yes, if he does wudoo’.`"
  },
  "5301010": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301010\nIn-book reference  : Book 2, Hadith 024\nEnglish translation  : Vol. 1, Book 2, Hadith 024",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Rabee'ah bin Darraj, that 'Ali رضي الله عنه prayed two rakʼahs after ‘Asr, and ‘Umar got angry with him and said:\nDon't you know that the Messenger of Allah ﷺ used to forbid this?"
  },
  "5301020": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301020\nIn-book reference  : Book 2, Hadith 025\nEnglish translation  : Vol. 1, Book 2, Hadith 025",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Shuraih bin 'Ubaid narrated that 'Umar bin al-Khattab .رضي الله عنه said:\nI went out looking for the Messenger of Allah ﷺ before I became Muslim, and I found that he had reached the mosque before me. I stood behind him and he started to recite Sooratal-Haqqah, and I was amazed by the way in which the Qur'an was composed. I said: By Allah, this man is a poet as Quraish said. Then he recited: `That this is verily, the word of an honoured Messenger [i.e. Jibreel (Gabriel) or Muhammad which he has brought from Allah]. It is not the word of a poet, little is that you believe!” [al-Haqqah 69:40-41]. I said: (He is a) soothsayer. He said: “Nor is it the word of a soothsayer (or a foreteller), little is that you remember! This is the Revelation sent down from the Lord of the 'Alameen (mankind, jinn and all that exists). And if he (Muhammad ﷺ) had forged a false saying concerning Us (Allah). We surely would have seized him by his right hand (or with power and might), And then We certainly would have cut off his life artery (aorta), And none of you could have withheld Us from (punishing) him...” [al-Haqqah 69:42—47]. lle said: Then I felt an overwhelming attraction to Islam."
  },
  "5301030": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301030\nIn-book reference  : Book 2, Hadith 026\nEnglish translation  : Vol. 1, Book 2, Hadith 026",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Shuraih bin 'Ubaid and Rashid bin Saʼd and others that when ‘Umar bin al-Khattab reached Sargh, he was told that there was a widespread plague in Syria. He said:\nI have heard that there is a severe plague in Syria. I said: If my time comes, and Abu ‘Ubaidah bin al-Jarrah is still alive, I appoint him as my successor, And if Allah asks me why I appointed him as my successor to lead the ummah of Muhammad ﷺ , I will say: I heard Your Messenger ﷺ say: `Every Prophet has a close confidant and my close confidant is Abu 'Ubaidah bin al-Jarrah.` The people objected to that, and said: What about the prominent figures of Quraish? meaning Banu Fihr. Then he said: If my time comes, and Abu 'Ubaidah has died, then I appoint Mu'adh bin Jabal as my successor, and if my Lord, may He be glorified and exalted, asks me why I appointed him as my successor, I will say: I heard Your Messenger say:`He will be gathered on the Day of Resurrection as a leader of scholars.`"
  },
  "5301040": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301040\nIn-book reference  : Book 2, Hadith 027\nEnglish translation  : Vol. 1, Book 2, Hadith 027",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Sa'eed bin al-Musayyab that 'Umar bin al-Khattab said:\nA boy was born to the brother of Umm Salamah, the wife of the Prophet ﷺ and they called him al-Waleed. The Prophet ﷺ said: “You have called him by the name of your pharaoh, for there will be among this ummah a man who is called al-Waleed and he will be worse to them than Pharaoh was to his people.”"
  },
  "5301050": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301050\nIn-book reference  : Book 2, Hadith 028\nEnglish translation  : Vol. 1, Book 2, Hadith 028",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn ‘Abbas said:\nSome men of good character, among whom was ‘Umar, testified before me, and the best of them in my view was ‘Umar, that the Prophet of Allah ﷺ used to say: `There is no prayer after 'Asr prayer until the sun sets, and there is no prayer after Fajr prayer until the sun rises.`"
  },
  "5301060": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301060\nIn-book reference  : Book 2, Hadith 029\nEnglish translation  : Vol. 1, Book 2, Hadith 029",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from al-Harith bin Mu'awiyah al-Kindi, that he travelled to meet ‘Umar bin al-Khattab and ask him about three things. He came to Madinah and ‘Umar asked him:\nWhat brought you here? He said: (I came) to ask you about three things. He said: What are they? He said: A woman and I may be in a confined space and the time for prayer comes, but if we both pray she will be standing next to me, and if she prays behind me she will have to go out of the space, ‘Umar said: Put a cloth to serve as a screen between you and her, and let her pray alongside you if you wish. (And I asked) about the two rak'ahs after 'Asr and he said: The Messenger of Allah ﷺ told me not to do them. He said: (And I asked) about stories (for preaching), because they wanted me to tell them stories. He said: Whatever you want. It was as if he did not want to tell him not to do that. He said: I only wanted to follow what you say. He said: I am afraid that if you tell them stories (for preaching), you will think that you are better than them, then you will tell them stories and think that you are better than them, until you imagine that you are as far above them as the Pleiades, then Allah will put you that far beneath their feet on the Day of Resurrection."
  },
  "5301070": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301070\nIn-book reference  : Book 2, Hadith 030\nEnglish translation  : Vol. 1, Book 2, Hadith 030",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abdullah bin 'Umar narrated that 'Umar bin al-Khattab said:\nI heard the Messenger of Allah ﷺ say: “Allah, may He be glorified and exalted, forbids you to swear by your fathers,` 'Umar said: By Allah, I never swore by them since I heard the Messenger of Allah ﷺ forbid it, and I never uttered (such words) whether I was swearing an oath or describing someone else doing so."
  },
  "5301080": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301080\nIn-book reference  : Book 2, Hadith 031\nEnglish translation  : Vol. 1, Book 2, Hadith 031",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar bin al-Khattab رضي الله عنه and Hudhaifah bin al-Yaman رضي الله عنه that the Prophet ﷺ did not take zakah on horses or slaves."
  },
  "5301090": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301090\nIn-book reference  : Book 2, Hadith 032\nEnglish translation  : Vol. 1, Book 2, Hadith 032",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Umar that 'Umar bin al-Khattab addressed us in al-Jabiyah, and said:\nThe Messenger of Allah ﷺ stood before us as I am standing before you, and said: `I urge you to show respect to my Companions, then those who come after them, then those who come after them, then lying will become so widespread that a man will start to give testimony before he is asked to do so.Whoever among you wants to attain a spacious abode in Paradise, let him adhere to the jama'ah (main body of Muslims), for the Shaitan is with the one who is alone, but he is further away from two. And no one of you should be alone with a woman for the Shaitan will be the third one present. The one who is pleased with his good deeds and upset by his bad deeds is a believer.`"
  },
  "5301100": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301100\nIn-book reference  : Book 2, Hadith 033\nEnglish translation  : Vol. 1, Book 2, Hadith 033",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Hakeem bin 'Umair and Damrah bin Habeeb said:\nUmar bin al-Khattab said: Whoever would like to see the way of the Messenger of Allah ﷺ, let him look at the way of 'Amr bin al Aswad."
  },
  "5301110": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301110\nIn-book reference  : Book 2, Hadith 034\nEnglish translation  : Vol. 1, Book 2, Hadith 034",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn 'Abbas said:\n'Umar said: We were with the Messenger of Allah ﷺ on a journey and a man said: No, by my father. Another man said: “Do not swear by your fathers.` I turned and saw that it was the Messenger of Allah ﷺ."
  },
  "5301120": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301120\nIn-book reference  : Book 2, Hadith 035\nEnglish translation  : Vol. 1, Book 2, Hadith 035",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Ubaidullah bin ‘Abdullah bin 'Utbah bin Mas'ood told us that Abu Hurairah said:\nWhen the Messenger of Allah ﷺ died and Abu Bakr رضي الله عنه became (caliph) after him, and some of the Arabs apostatized,ʻUmar رضي الله عنه said: O Abu Bakr, how can you fight the people when the Messenger of Allah ﷺ said: `I have been ordered to fight the people until they bear witness that there is no god except Allah. Whoever bears witness that there is no god except Allah has protected his wealth and his life from me, except in cases dictated by Islamic law, and their reckoning will be with Allah`? Abu Bakr رضي الله عنه said: by Allah I shall certainly fight the one who separates prayer and zakah, for zakah is what is due from wealth. By Allah, whoever withholds from me a goat that they used to give (in zakah) to the Messenger of Allah ﷺ, I shall fight them for withholding it. 'Umar said: By Allah, as soon as I realized that Allah had opened the heart of Abu Bakr to fighting, I realized that it was the right thing to do."
  },
  "5301130": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301130\nIn-book reference  : Book 2, Hadith 036\nEnglish translation  : Vol. 1, Book 2, Hadith 036",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar bin al-Khattab that the Messenger of Allah ﷺ said:\n`There is no prayer after Fajr Prayer until the sun rises, or after 'Asr prayer until the sun sets.`"
  },
  "5301140": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301140\nIn-book reference  : Book 2, Hadith 037\nEnglish translation  : Vol. 1, Book 2, Hadith 037",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from `Urwah bin Mugheeth al-Ansari, that 'Umar bin al-Khattab رضي الله عنه said:\nThe Prophet ﷺ ruled that the owner of a mount is more entitled to ride on the front part of it."
  },
  "5301150": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301150\nIn-book reference  : Book 2, Hadith 038\nEnglish translation  : Vol. 1, Book 2, Hadith 038",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Humrah bin 'Abd Kulal said:\nUmar bin al-Khattab travelled to Syria for the second time and when he approached it, he and those who were with him heard that the plague was widespread therein. His companions said to him: Go back and do not enter it, for if you enter it when (the plague) is in it, we do not think that you should leave it. So he set off, heading back to Madinah, and he stopped to rest at the end of that night. I was the closest of the people to him, and when he woke up, I woke up with him and followed him, and I heard him say: They turned me away from Syria after I had got close to it because the plague was there. It would be a good idea to go to Madinah and finish some work that I have to do there, then I will go and enter Syria and stay in Homs, for I heard the Messenger of Allah ﷺ say: “On the Day of Resurrection, Allah will resurrect from it seventy thousand without any reckoning or punishment, and their place of resurrection will be between the olive trees and the garden at al-Barth al Ahmar near (Homs).`"
  },
  "5301160": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301160\nIn-book reference  : Book 2, Hadith 039\nEnglish translation  : Vol. 1, Book 2, Hadith 039",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Uqbah bin ‘Amir that he went out with the Messenger of Allah ﷺ on the campaign to Tabook, and one day the Messenger of Allah ﷺ sat talking to his companions and said:\n“Whoever gets up when the sun has risen and does wudoo’. and does it well, then stands and prays two rak'ahs, his sins will be forgiven him and he will be as his mother bore him.` 'Uqbah bin 'Amir said: I said: Praise be to Allah Who has blessed me by enabling me to hear this from the Messenger of Allah ﷺ. 'Umar bin al-Khattab رضي الله عنه, who was sitting in front of me, said to me: Are you surprised by this? The Messenger of Allah ﷺ said something even more amazing than this before you came. I said: What was it, may my father and mother be sacrificed for you? 'Umar said. The Messenger of Allah ﷺ said: `Whoever does wudoo’ and does it well, then lifts his gaze towards heaven and says, “I bear witness that there is no god but Allah alone, with no partner or associate, and I bear witness that Muhammad is His slave and Messenger,` the eight gates of Paradise will be opened for him and he may enter by whichever of them he wishes.`"
  },
  "5301170": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301170\nIn-book reference  : Book 2, Hadith 040\nEnglish translation  : Vol. 1, Book 2, Hadith 040",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that al-Ash'ath bin Qais said :\nI visited 'Umar and he reached out and hit his wife. He said : O: Ash'ath, learn from me three things that I learned from the Messenger of Allah ﷺ: Do not ask a man why he hit his wife, do not sleep until you pray Witr - and I forgot the third thing"
  },
  "5301180": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301180\nIn-book reference  : Book 2, Hadith 041\nEnglish translation  : Vol. 1, Book 2, Hadith 041",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abdullah bin az-Zubair said:\nI heard 'Umar bin al-Khattab رضي الله عنه say in his khutbah that he heard the Messenger of Allah ﷺ say: ` Whoever wears silk in this world will not be clothed with it in the Hereafter.`"
  },
  "5301190": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301190\nIn-book reference  : Book 2, Hadith 042\nEnglish translation  : Vol. 1, Book 2, Hadith 042",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Jabir said:\nUmar bin al-Khattab رضي الله عنه told me: he heard the Prophet ﷺ `A rider will travel through the streets of Madinah, then he will say: There used to be many believers here.`"
  },
  "5301200": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301200\nIn-book reference  : Book 2, Hadith 043\nEnglish translation  : Vol. 1, Book 2, Hadith 043",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Al-Qasim bin Abil-Qasim as-Saba'i narrated from a preacher who was addressing the troops in al-Qustanteeniyyah, that he heard him narrate that Umar bin al-Khattab رضي الله عنه said:\nO people, I heard the Messenger of Allah ﷺ say: `Whoever believes in Allah and the Last Day, let him not sit at a table where alcohol is being passed around; whoever believes in Allah and the Last Day, let him not enter a bathhouse unless he is wearing a waist wrapper; and whoever (among women) believes in Allah and the Last Day, let her not enter bathhouses (at all).”"
  },
  "5301210": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301210\nIn-book reference  : Book 2, Hadith 044\nEnglish translation  : Vol. 1, Book 2, Hadith 044",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Uthman bin ‘Abdullah, i.e. Ibn Suraqah, that Umar bin al-Khattab رضي الله عنه said:\nI heard the Messenger of Allah ﷺ say: “Whoever shades the head of a fighter (mujahid), Allah will shade him on the Day of Resurrection; whoever equips a fighter until he has all that he needs, will have a reward equal to his until he dies (Yoonus said: or returns); whoever builds a mosque in which the Name of Allah may He be exalted, is remembered,Allah will build for him a house in Paradise.` ,"
  },
  "5301220": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301220\nIn-book reference  : Book 2, Hadith 045\nEnglish translation  : Vol. 1, Book 2, Hadith 045",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Salman bin Rabee'ah said. I heard ‘Umar say:\nThe Messenger of Allah ﷺ shared out (some booty) and I said: O Messenger of Allah, others are more deserving of this than them: ahlus-suffah. The Messenger of Allah ﷺ said: `You are giving me the choice of having you ask importunately or regard me as a miser, and I am not a miser.`"
  },
  "5301230": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301230\nIn-book reference  : Book 2, Hadith 046\nEnglish translation  : Vol. 1, Book 2, Hadith 046",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar bin al-Khattab said:\nl saw the Messenger of Allah ﷺ do wudoo’after minor impurity and he wiped over the khuffain."
  },
  "5301240": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301240\nIn-book reference  : Book 2, Hadith 047\nEnglish translation  : Vol. 1, Book 2, Hadith 047",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Rafi’ that Umar bin al-Khattab was leaning on Ibn ‘Abbas, and Ibn 'Umar and Sa'eed bin Zaid were with him. He said:\nYou should note that I have not said anything about kalalah and I have not appointed anyone to succeed me. Whoever of Arab captives are present when I die, are to be freed although they are among the wealth of Allah, may He be glorified and exalted. Sa'eed bin Zaid said: Why don't you suggest a man among the Muslims so that the people may follow your advice? Abu Bakr did that and the people followed his advice and trusted him. ‘Umar said: I have noticed too much greed and ambition, and I will leave this matter to be decided by these six people with whom the Messenger of Allah ﷺ was pleased when he died. Then ‘Umar said: If one of the two men were still alive, I would have referred to this matter to him and I would have trusted him: Salim the freed slave of Abu Hudhaifah and Abu 'Ubaidah bin al-Jarrah."
  },
  "5301250": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301250\nIn-book reference  : Book 2, Hadith 048\nEnglish translation  : Vol. 1, Book 2, Hadith 048",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn 'Abbas said:\nSome righteous men, including ‘Umar - and the most righteous of them in my view was 'Umar - confirmed when I was present that the Messenger of Allah ﷺ said: `There is no prayer after Fajr until the sun rises and there is no prayer after 'Asr until the sun sets.`"
  },
  "5301260": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301260\nIn-book reference  : Book 2, Hadith 049\nEnglish translation  : Vol. 1, Book 2, Hadith 049",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Abbas that 'Umar bin al-Khattab رضي الله عنه held onto the corner of the Ka'bah and said:\nI know that you are only a stone; if I had not seen my Beloved kiss you or touch you, I would not have touched you or kissed you. “Indeed in the Messenger of Allah (Muhammad ﷺ) you have a good example to follow” (al-Ahzab 33:21]."
  },
  "5301270": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301270\nIn-book reference  : Book 2, Hadith 050\nEnglish translation  : Vol. 1, Book 2, Hadith 050",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Ammar bin Abi ‘Ammar told us that 'Umar bin al-Khattab رضي الله عنه said:\nThe Messenger of Allah ﷺ saw a ring of gold on a man's hand and he said: “Throw it away,” so he threw it away and acquired a ring of iron. He said: `This is even worse.` Then he acquired a ring of silver, and he did not say anything,"
  },
  "5301280": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301280\nIn-book reference  : Book 2, Hadith 051\nEnglish translation  : Vol. 1, Book 2, Hadith 051",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Zirr that 'Abdullah said:\nWhen the Messenger of Allah ﷺ died, the Ansar said: A leader from among us and a leader from among you. ‘Umar went to them and said: O Ansar, do you not know that the Messenger of Allah ﷺ ordered Abu Bakr to lead the people in prayer? Which of you would like himself to be given precedence over Abu Bakr? The Ansar said: We seek refuge with Allah from being given precedence over Abu Bakr."
  },
  "5301290": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301290\nIn-book reference  : Book 2, Hadith 052\nEnglish translation  : Vol. 1, Book 2, Hadith 052",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Jabir that 'Umar bin al-Khattab رضي الله عنه told him that he saw a man doing wudoo’ for prayer, and he missed an area the size of a fingernail on the top of his foot. The Prophet ﷺ saw him and said:\n`Go back and do your wudoo’ properly.” So he went back and did wudoo’ then he prayed."
  },
  "5301300": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301300\nIn-book reference  : Book 2, Hadith 053\nEnglish translation  : Vol. 1, Book 2, Hadith 053",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Farrookh the freed slave of 'Uthman that 'Umar - who at that time was the caliph - went out to the mosque and saw some food that had been put out. He said:\nWhat is this food? They said: It is food that has been brought to us. He said: May Allah bless it and the one who brought it. It was said:O Ameer al-Mu'mineen, it has been hoarded. He said: Who hoarded it? They said: Farrookh the freed slave of 'Uthman and So and so the freed slave of ‘Umar. He sent for them and summoned them and said: What made you hoard the food of the Muslims? They said: O Ameer al-Mu'mineen, we buy it with our own wealth and sell it. 'Umar said: I heard the Messenger of Allah ﷺ say: “Whoever hoards food from the Muslims, Allah will smite him with bankruptcy or leprosy.` At that Farrookh said: O Ameer al-Mu'mineen, I promise to Allah and to you that I will not hoard food again. As for the freed slave of 'Umar, he said: We buy it with our own wealth and sell it, Abu Yahya said: I saw the freed slave of ‘Umar with leprosy."
  },
  "5301310": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301310\nIn-book reference  : Book 2, Hadith 054\nEnglish translation  : Vol. 1, Book 2, Hadith 054",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abdullah bin 'Umar said:\nI heard 'Umar say: The Prophet ﷺ used to give me things and I would say: Give it to one who has more need of it than me. Then one time he gave me some wealth and I said: Give it to one who has more need of it than me. The Prophet ﷺ said: `Take it and keep it or give it in charity. Whatever of this wealth comes to you when you are not hoping for it or asking for it, take it, otherwise do not hanker after it.”\nIt was narrated from Salim, that his father said: I heard ‘Umar say: The Messenger of Allah ﷺ used to give me things... and he mentioned a similar hadeeth."
  },
  "5301320": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301320\nIn-book reference  : Book 2, Hadith 055\nEnglish translation  : Vol. 1, Book 2, Hadith 055",
    "url": "https://sunnah.com/ahmad/2",
    "text": "it was narrated that Umar bin al-Khattab said:\nI was in good spirits one day and kissed (my wife) when I was fasting. I came to the Prophet ﷺ and said: I have done something serious. I kissed (my wife) when I was fasting. The Messenger of Allah ﷺ said: “What do you think if you rinse your mouth with water when you are fasting?` I said: There is nothing wrong with it. The Messenger of Allah ﷺ said: “Then why (are you worried)?`"
  },
  "5301330": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301330\nIn-book reference  : Book 2, Hadith 056\nEnglish translation  : Vol. 1, Book 2, Hadith 056",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abul Aswad said:\nI came to Madinah and found that sickness was occurring in it and death was widespread. I sat with 'Umar bin al-Khattab and a funeral passed by him. People spoke well of the deceased and ‘Umar said: It is guaranteed. Then another funeral passed by and people spoke well of the deceased and ‘Umar said: It is guaranteed. Then a third funeral passed by and people spoke badly of the deceased and ‘Umar said: It is guaranteed. Abul-Aswad said: What is guaranteed, O Ameer al-Mu'mineen? He said: I am saying what the Messenger of Allah ﷺ said: `Any Muslim in whose favour four people testify, Allah will admit him to Paradise.` We said: And three? He said: `And three.` We said: And two? He said: `And two ` Then we did not ask him about one."
  },
  "5301340": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301340\nIn-book reference  : Book 2, Hadith 057\nEnglish translation  : Vol. 1, Book 2, Hadith 057",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar said:\nWe went on a campaign with the Messenger of Allah ﷺ during Ramadan and the conquest took place in Ramadan, and we broke the fast in both cases."
  },
  "5301350": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301350\nIn-book reference  : Book 2, Hadith 058\nEnglish translation  : Vol. 1, Book 2, Hadith 058",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Al-Ghadban bin Hanzalah said that His Father Hanzalah bin Nu'aim came in a delegation to 'Umar, and when a member of the delegation passed by him, Umar would ask him where he was from. Then my father passed by him and asked him:\nWhere are you from? He said from 'Anazah. He said: I heard the Messenger of Allah ﷺ: `A tribe from there will be wronged but they will prevail`"
  },
  "5301360": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301360\nIn-book reference  : Book 2, Hadith 059\nEnglish translation  : Vol. 1, Book 2, Hadith 059",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar bin al-Khattab رضي الله عنه that he said:\nWe went out on two campaigns with the Messenger of Allah ﷺ during the month of Ramadan, the day of Badr and the conquest (of Makkah), and we broke the fast in both cases."
  },
  "5301370": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301370\nIn-book reference  : Book 2, Hadith 060\nEnglish translation  : Vol. 1, Book 2, Hadith 060",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Umar bin al Khattab رضي الله عنه that the Messenger of Allah ﷺ said:\n`The thing I fear most for my Ummah is every hypocrite who speaks with knowledge`"
  },
  "5301380": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301380\nIn-book reference  : Book 2, Hadith 061\nEnglish translation  : Vol. 1, Book 2, Hadith 061",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Salim bin 'Abdullah that he was with Maslamah bin 'Abdul-­Malik in the land of the Byzantines, and they found some stolen booty with a man's goods. He asked Salim bin ‘Abdullah and he said:\n`Abdullah bin 'Umar toid me from ‘Umar that the Messenger of Allah ﷺ said:\n\n“If you find stolen booty with a man, then burn it ­ and I think he said: and beat him.” So he took his property out to the market and found a Mushaf among his goods. He asked Salim, who said: Sell it, and gave its price in charity,"
  },
  "5301390": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301390\nIn-book reference  : Book 2, Hadith 062\nEnglish translation  : Vol. 1, Book 2, Hadith 062",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar that the Prophet ﷺ used to seek refuge with Allah from five things:\nfrom miserliness, cowardice, the tribulations of the heart (grudges, envy, bad attitude and bad beliefs), the torment of the grave and old age."
  },
  "5301400": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301400\nIn-book reference  : Book 2, Hadith 063\nEnglish translation  : Vol. 1, Book 2, Hadith 063",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Faddalah bin 'Ubaid said:\nI heard 'Umar bin al-Khattab say that he heard the Messenger of Allah ﷺ say: `The martyrs are three; a man who believes and has good faith, who meets the enemy and shows sincerity to Allah until he is killed ­ he is the one to whom people will raise their heads on the Day of Resurrection` ­ and the ­­Messenger of Allah ﷺ raised his head until his hat or Umar's hat fell off - ; `and a man who is a believer and has good faith, who meets the enemy and it is as if his skin was beaten with the thorns of an acacia tree, then a stray arrow comes and kills him - he will be in the second rank; and a man who is a believer and has good faith, but he mixes good and bad deeds, and he meets the enemy and shows sincerity to Allah until he is killed - he will be in the third rank.`"
  },
  "5301410": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301410\nIn-book reference  : Book 2, Hadith 064\nEnglish translation  : Vol. 1, Book 2, Hadith 064",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Umar that the Messenger of Allah ﷺ said:\n`No father is to be killed in retaliatory punishment for his son` And the Messenger of Allah ﷺ said: `The one who inherits loyalty (wala - loyalty of a free slave) also inherits his wealth"
  },
  "5301430": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301430\nIn-book reference  : Book 2, Hadith 065\nEnglish translation  : Vol. 1, Book 2, Hadith 065",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Umar bin Al Khattab رضي الله عنه said:\nI heard the Messenger of Allah ﷺ say `No father is to be killed in retaliatory punishment for killing his son`"
  },
  "5301440": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301440\nIn-book reference  : Book 2, Hadith 066\nEnglish translation  : Vol. 1, Book 2, Hadith 066",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Umar bin al khattab رضي الله عنه that he said I saw the Messenger of Allah ﷺ do wudoo' , washing each part once."
  },
  "5301450": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301450\nIn-book reference  : Book 2, Hadith 067\nEnglish translation  : Vol. 1, Book 2, Hadith 067",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Fadalah bin 'Ubaid said:\nI heard 'Umar bin al Khattab رضي الله عنه say: I heard the Messenger of Allah ﷺ say: ` The martyrs are four: a man who believes and has good faith, who meets the enemy and shows sincerity to Allah until he is killed - he is the one at whom people will look like this`- and he raised his head until the hat of the Messenger of Allah ﷺ or 'Umar's hat fell of. ` The second is a man who is a believer and has good faith, who meets the enemy and it is as if his back was beaten with the thorns of an acacia tree, then a stray arrow comes and kills him- he will be in a the second rank. The third is a man who is a believer, but he mixes good and bad deeds, and he meets the enemy and shows sincerity to Allah until he is killed- he will be in the third rank. The fourth is a believing man who transgresses against himself by committing a great deal of evil deeds and sins, who meets the enemy and shows sincerity to Allah until he is killed- he will be in the fourth rank.`"
  },
  "5301460": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301460\nIn-book reference  : Book 2, Hadith 068\nEnglish translation  : Vol. 1, Book 2, Hadith 068",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Umar bin al Khattab رضي الله عنه from the Prophet ﷺ that he did wudoo' in the year of tabook, washing each part once."
  },
  "5301470": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301470\nIn-book reference  : Book 2, Hadith 069\nEnglish translation  : Vol. 1, Book 2, Hadith 069",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Jabir that Umar bin al-Khattab رضي الله عنه told him that he heard the Messenger of Allah ﷺ say:\n` The people of Makkah will leave and no one will come to it-or no one will come to it except a few-then it will be filled and built up, then they will leave it and never return to it.`"
  },
  "5301480": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301480\nIn-book reference  : Book 2, Hadith 070\nEnglish translation  : Vol. 1, Book 2, Hadith 070",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Jabir that 'Umar bin al-Khattab رضي الله عنه told him that the Messenger of Allah ﷺ saw a man doing wudoo' to pray Zuhr, and he missed a spot the size of a toenail. The Messenger of Allah ﷺ saw him and said:\n`Go back and do your wudoo' properly` So he went back and did wudoo', then he prayed."
  },
  "5301490": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301490\nIn-book reference  : Book 2, Hadith 071\nEnglish translation  : Vol. 1, Book 2, Hadith 071",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Umar that the Messenger of Allah ﷺ said:\n`Do not praise me as the Christians praised 'Eesa bin Maryam عليه السلام. I am no more than the slave of Allah and His Messenger.`"
  },
  "5301500": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301500\nIn-book reference  : Book 2, Hadith 072\nEnglish translation  : Vol. 1, Book 2, Hadith 072",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn 'Abbas said:\nThis verse was revealed when the Messenger of Allah ﷺ was preaching secretly in Makkah: ` And offer your Salah neither aloud nor in a low voice` [Al Isra' 17:110]. He said: When he led the companions in prayer, he raised his voice reciting the Qur'an, and when the mushrikeen heard that, they reviled the Qur'an, the one who revealed it and the one to whom it was sent. Then Allah said to his Prophet: ` And offer your Salah (prayer) neither aloud` i.e, when reciting, lest the mushrikeen hear and revile the Qur'an,`nor in a low voice` that your companions cannot hear the Qur'an, so that they can learn it from you; `but follow a way between`"
  },
  "5301510": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301510\nIn-book reference  : Book 2, Hadith 073\nEnglish translation  : Vol. 1, Book 2, Hadith 073",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Abbas That 'Umar bin al-Khattab delivered a speech- on one ocassion, Hushaim said:\naddressed us. - He praised and glorified Allah, then he mentioned stoning and said: Do not be diverted away from it, for it is one of the hadd punishments of Allah. The Messenger of Allah ﷺ stoned [adulterers], and we stoned [them] after he was gone. Were it not that some may say that 'Umar added something to the Book of Allah, may He be glorified and exalted, that is not part of it, I would have written it in some place in the Mushaf. 'Umar bin al-Khattab testified - and on one occasion Hushaim said: and 'Abdur-Rahman bin 'Awf and so and so and so and so[also testified] that the Messenger of Allah ﷺ stoned [adulterers] and we stoned [them] after he was gone. But there will come people after you who do not believe in stoning, or in the Dajjal, or intercession, or the torment of the grave, or that people will be brought out of Hell after they have been burned in it."
  },
  "5301520": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301520\nIn-book reference  : Book 2, Hadith 074\nEnglish translation  : Vol. 1, Book 2, Hadith 074",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Anas said:\nUmar said: I agreed with my Lord on three matters, I said: O Messenger of Allah (ﷺ) , why don't we take the Maqam of Ibraheem as a place of prayer? Then the verse was revealed: ` And take you(people) the Maqam (place) of Ibraheem (Abraham) [ or the stone on which Ibraheem (Abraham) stood while he was building the Kabah]as a place of prayer` [al Baqarah 2:125]. And I said: O Messenger of Allah (ﷺ) , both righteous and evil doers enter your wives, so why don't you tell them to observe the hijab? Then the verse of hijab was revealed. And the wives of the Messenger of Allah ﷺ got together as a result of the jealousy between them, and I said to them. ` It may be if he divorced you(all) that his lord will give him instead of you, wives better than you`[at Tahreem 66:5], and it was revealed like that."
  },
  "5301530": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301530\nIn-book reference  : Book 2, Hadith 075\nEnglish translation  : Vol. 1, Book 2, Hadith 075",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from al Miswar bin Makhramah that 'Umar bin al Khattab said:\nI heard Hisham bin Hakeem bin Hizam reciting Sooratal-Furqan and he recited some words differently from how the Prophet of Allah had taught it to me. I wanted to argue with him, but I was praying. When I finished, I said: Who taught you this recitation? He said: The Messenger of Allah ﷺ. I said: You are lying; by Allah, this is not how the Messenger of Allah ﷺ taught it to you. I took him by the hand and brought him to the Messenger of Allah ﷺ, and said: O Messenger of Allah (ﷺ) , you taught me how to recite Soorat al Furqaan, and I heard this man reciting some words in a way that was not the way you taught them to me. The Messenger of Allah ﷺ said: `Recite it, O. Hisham.” He recited it as he recited it before. The Messenger of Allah ﷺ said: `Thus it was revealed.” Then he said: `Recite it, O Umar.” So I recited it and he said: “Thus it was revealed.” Then the Messenger of Allah ﷺ said: “The Qur'an has been revealed in seven different ways.`"
  },
  "5301540": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301540\nIn-book reference  : Book 2, Hadith 076\nEnglish translation  : Vol. 1, Book 2, Hadith 076",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar said:\nI saw the Messenger of Allah ﷺ feeling the pain of hunger and not being able to find enough to fill his stomach of inferior quality dates."
  },
  "5301550": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301550\nIn-book reference  : Book 2, Hadith 077\nEnglish translation  : Vol. 1, Book 2, Hadith 077",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Anas said, 'Umar said:\nI agreed with my Lord, may He be glorified and exalted, in three matters - or my Lord agreed with me in three matters, I said: O Messenger of Allah, why don't you take the Maqarn of Ibraheem as a place of prayer? Then Allah revealed the verse: `And take you (people) the Maqam (place) of Ibraheem (Abraham) [or the stone on which \nIbraheem (Abraham) stood while he was building the Ka'bah) as a place of prayer` (al Baqarah 2:125). And I said: Why don't you tell the Mothers of the Believers to observe hijab, for both righteous people and evildoers enter upon you? Then the verse of hijab was revealed. And I heard something about the Mothers of the Believers, so I talked to them and told them: You should stop bothering the Messenger of Allah ﷺ , or Allah will replace you with wives who are better than you and are Muslims. Then I came to one of the Mothers of the Believers and she said: O 'Umar, is it the case that the Messenger of Allah ﷺ cannot admonish his wives so that you come and admonish them? So I stopped, then Allah, may He be glorified and exalted, revealed the verse: “It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you Muslims (who submit to Allah), believers, obedient (to Allah)...` [at­-Tahreerm 66:5)"
  },
  "5301560": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301560\nIn-book reference  : Book 2, Hadith 078\nEnglish translation  : Vol. 1, Book 2, Hadith 078",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Ibn 'Abbas said:\nI heard 'Umar bin al Khattab رضي الله عنه say: l heard the Messenger of Allah ﷺ say, when he was in al­'Aqeeq: `Last night someone came to me from my Lord and said: Pray in this blessed valley and say, 'I intend to do 'umrah with Hajj.` Al-Waleed said: i.e., in Dhul­-Hulaifah."
  },
  "5301570": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301570\nIn-book reference  : Book 2, Hadith 079\nEnglish translation  : Vol. 1, Book 2, Hadith 079",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Malik bin 'Aws bin al-Hadathan heard 'Umar bin al Khattab رضي الله عنه say:\nThe Messenger of Allah ﷺ said ­- and on one occasion Sufyan said: ['Umar] heard the Messenger of Allah ﷺ say ­ “Gold for silver is riba unless it is exchanged on the spot [lit. ‘this for that'), wheat for wheat is riba unless it is exchanged on the spot, barley for barley is riba unless it is exchanged on the spot, dates for dates is riba unless it is exchanged on the spot.”"
  },
  "5301580": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301580\nIn-book reference  : Book 2, Hadith 080\nEnglish translation  : Vol. 1, Book 2, Hadith 080",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abu ‘Ubaid said:\nI was present at Eid with ‘Umar, and he started with the prayer before the khutbah. He said: The Messenger of Allah ﷺ forbade fasting on \n\nthese two days. The day of al-Fitr is the day when you break your fast, and on the day of al-Adha, \n\neat the meat of your sacrifices."
  },
  "5301590": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301590\nIn-book reference  : Book 2, Hadith 081\nEnglish translation  : Vol. 1, Book 2, Hadith 081",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar said:\nThe Messenger of Allah ﷺ said: “Do not praise me as the Christians praised 'Eesa ibn Maryam عليه السلام. I am no more than a slave, so say: His slave and His Messenger.”"
  },
  "5301600": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301600\nIn-book reference  : Book 2, Hadith 082\nEnglish translation  : Vol. 1, Book 2, Hadith 082",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Umar, from ʼUmar رضي الله عنه that he asked the Prophet ﷺ:\nCan one of us sleep when he is junub? He said: “He may do wudoo’ and sleep if he wishes.” On one occasion \n\nSufyan said: `Let him do wudoo’ and sleep.`"
  },
  "5301610": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301610\nIn-book reference  : Book 2, Hadith 083\nEnglish translation  : Vol. 1, Book 2, Hadith 083",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Zaid bin Aslarn, from his father that ‘Umar gave a horse (to a man for jihad) for the sake of Allah, then he saw it or one of its foals being offered for sale, and he wanted to buy it. He asked the Prophet ﷺ about it and he said:\n`Leave it, and it (its reward) will come to you or you will have them all (i.e., the reward of all of them).` On one occasion he said: He told him not to (buy it) and he said: \n\n“Do not buy it and do not take back your charity.`"
  },
  "5301620": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301620\nIn-book reference  : Book 2, Hadith 084\nEnglish translation  : Vol. 1, Book 2, Hadith 084",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Umar رضي الله عنه , conveyed from the Prophet ﷺ ­on one occasion, Sufyan said:\nfrom the Prophet ﷺ- that he said: `Follow Hajj with ‘Umrah and 'Umrah with Hajj, for doing that will eliminate poverty and sin as the bellows eliminate dross.`"
  },
  "5301630": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301630\nIn-book reference  : Book 2, Hadith 085\nEnglish translation  : Vol. 1, Book 2, Hadith 085",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Umar said:\nI heard the Messenger of Allah ﷺ say: `Deeds are but by intentions and each\n\nman will have but that which he intended. If a man's migration was for the sake of Allah, then his \n\nmigration was for that for which he migrated, but if his migration was to achieve some worldly aim \n\nor to take some woman in marriage, his migration was for that for which he migrated.`"
  },
  "5301640": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301640\nIn-book reference  : Book 2, Hadith 086\nEnglish translation  : Vol. 1, Book 2, Hadith 086",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Wa'il said:\nas­-Subayy bin Ma'bad said: I was a Christian man and I became Muslim, and I entered ihram for both Hajj and 'Umrah (together). Zaid bin Soohan and Salman bin Rabee'ah heard me ­­­when I was entering ihram for both and said. He is more astray than his people's camel. Their words wounded me greatly, so I went to ‘Umar and told him. He turned to them and criticised them, then he turned to me and said: You have been guided to the Sunnah of your Prophet ﷺ, you have been guided to the Sunnah of your Prophet ﷺ."
  },
  "5301650": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301650\nIn-book reference  : Book 2, Hadith 087\nEnglish translation  : Vol. 1, Book 2, Hadith 087",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Abbas:\n‘Umar was told ­and on one occasion he said: Umar heard that Samurah was selling alcohol and he said: May Allah destroy Samurah. The Messenger of Allah ﷺ said: `May Allah curse the Jews, \nHe forbade animal fat to them, so they rendered it and sold it.`"
  },
  "5301660": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301660\nIn-book reference  : Book 2, Hadith 088\nEnglish translation  : Vol. 1, Book 2, Hadith 088",
    "url": "https://sunnah.com/ahmad/2",
    "text": "!t was narrated that 'Umar bin al-Khattab رضي الله عنه said:\nThe wealth of Banu an-­Nadeer was among the fai' that Allah bestowed upon His Messenger ﷺ, for which the Muslims made no expedition with either cavalry or camelry (cf. al-Hashr 59:6). It was only for the Messenger of Allah ﷺ and he used to spend from it on his family's annual expenses-and on one occasion he said: his annual \nfood supply ­-and what was left he spent on horses and weapons in preparation for jihad for the sake of Allah, may He be glorified and exalted,"
  },
  "5301670": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301670\nIn-book reference  : Book 2, Hadith 089\nEnglish translation  : Vol. 1, Book 2, Hadith 089",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Malik bin Aws said:\nI heard 'Umar say to ‘Abdur­-Rahman bin ‘Awf,\n\nTalhah, az-­Zubair and Sa'd: We adjure you by Allah, by whom heaven and earth are sustained, \n\ndid you know that the Messenger of Allah (ﷺ) said: “Our (Prophets’) property is not to be inherited \n\nand whatever we leave behind is charity.` They said: By Allah, yes,"
  },
  "5301680": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301680\nIn-book reference  : Book 2, Hadith 090\nEnglish translation  : Vol. 1, Book 2, Hadith 090",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar bin al Khattab رضي الله عنه that the Messenger of Allah ﷺ said:\n`The child belongs to the (husband or master of the) woman.`"
  },
  "5301690": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301690\nIn-book reference  : Book 2, Hadith 091\nEnglish translation  : Vol. 1, Book 2, Hadith 091",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ya'la bin Umayyah said:\nI said to 'Umar bin al Khattab رضي الله عنه , `And when you (Muslims) travel in\n\nthe land, there is no sin on you if you shorten As­Salah (the prayer) if you fear that the disbelievers may put you in \n\ntrial (attack you)` (al Nisa' 4:101]. But now the people are safe. He said: I wondered the same thing as you are \n\nwondering, and I asked the Messenger of Allah ﷺ about that. He said: “It is a charity that Allah has bestowed upon \n\nyou, so accept His charity.`"
  },
  "5301700": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301700\nIn-book reference  : Book 2, Hadith 092\nEnglish translation  : Vol. 1, Book 2, Hadith 092",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Qais bin Marwan that he came to 'Umar and said:\nI have come from Koofah, O Ameer al-­Mu'mineen, and I left behind in it a man who dictates the Mushaf From memory. ‘Umar got exceedingly angry and said: Who is he, woe to you? He said: 'Abdullah bin Mas'ood. ‘Umar began to calm down, and went back to normal, then he said: Woe to you, I do not know of anyone who is more qualified to do that than him, and I will tell you about that. The Messenger of Allah ﷺ used to stay up at night talking with Abu Bakr رضي الله عنه discussing some affairs of the Muslims. He stayed up talking with him one night, and I was with him. The Messenger of Allah ﷺ went out, and we went out with him, and we saw a man standing and praying in the mosque. The Messenger of Allah ﷺ listened to his recitation, and as soon as we recognised him the Messenger of Allah ﷺ said: `Whoever would like to recite the Qur'an fresh as it was revealed, let him recite it according to the recitation of Ibn Umm 'Abd.` Then the same man sat and offered supplication (du'a') and the Messenger of Allah ﷺ started saying to him: `Ask, you will be given;ask, you will be given.” ‘Umar said: By Allah, I shall go to him tomorrow and tell hirm the glad tidings. I went to him the next morning to tell him the glad tidings, and I found that Abu Bakr had beaten me to it and given him the glad tidings. By Allah, I never competed with him to do good but he beat me to it."
  },
  "5301710": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301710\nIn-book reference  : Book 2, Hadith 093\nEnglish translation  : Vol. 1, Book 2, Hadith 093",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Abis bin Rabee'ah said:\nI saw 'Umar kissing the Black Stone and saying; I am kissing you and I know that you are just a stone; if I had not seen the Messenger of Allah ﷺ kissing you, I would not have kissed you."
  },
  "5301720": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301720\nIn-book reference  : Book 2, Hadith 094\nEnglish translation  : Vol. 1, Book 2, Hadith 094",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Jabir bin Samurah said:\nUmar addressed the people in al­-Jabiyah, and said: The Messenger of Allah ﷺ stood as I am standing and said: `Treat my Companions kindly, then those who come after them, then those who come after them. Then there will come people who will swear oaths before being asked to swear and will give testimony before being asked to \ngive testimony. Whoever among you would like to attain the best place in Paradise, let him adhere to the jama'ah (the main body of Muslims), for the Shaitan is with one and he is further away from two. No man should be alone with a woman because the Shaitan will be the third one present. Whoever feels pleased when he does a good deed and feels bad when he does an evil deed is a believer.”"
  },
  "5301730": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301730\nIn-book reference  : Book 2, Hadith 095\nEnglish translation  : Vol. 1, Book 2, Hadith 095",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar said:\nThe Messenger of Allah ﷺ used to stay up at night talking with Abu Bakr رضي الله عنه, discussing some affairs of the Muslims, and I was with him."
  },
  "5301740": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301740\nIn-book reference  : Book 2, Hadith 096\nEnglish translation  : Vol. 1, Book 2, Hadith 096",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ma'dan bin Abi Talhah said:\n'Umar said: I never asked the Messenger of Allah ﷺ about anything more than I asked him about kalalah, until he poked me in the chest with his finger and said: `Is not ayatus-saif (the verse of summer, i.e., it was revealed in summer), which appears at the end of Sooratan-Nisa', sufficient for you?”"
  },
  "5301750": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301750\nIn-book reference  : Book 2, Hadith 097\nEnglish translation  : Vol. 1, Book 2, Hadith 097",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated from ‘Umar that the Prophet ﷺ said:\n“The deceased is tormented in his grave because of the wailing over him.`"
  },
  "5301760": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301760\nIn-book reference  : Book 2, Hadith 098\nEnglish translation  : Vol. 1, Book 2, Hadith 098",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abdullah, the freed slave of Asma’ bint Abi Bakr, said:\nAsma’ sent me to 'Abdullah bin 'Umar, and she said: I have heard that you regard three things as haram: borders on garments, saddle cloths made of bright red cloth, and fasting the whole of Rajab. 'Abdullah said to me: As for what you have mentioned about Rajab, what about one who fasts continually? As for what you said about borders on garments, I heard 'Umar bin al-Khattab say: I heard the Messenger of Allah ﷺ say: “Whoever wears silk in this world will not wear it in the Hereafter.`"
  },
  "5301770": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301770\nIn-book reference  : Book 2, Hadith 099\nEnglish translation  : Vol. 1, Book 2, Hadith 099",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Anas said:\nWe were with 'Umar between Makkah and Madinah, and we looked for the new crescent moon. I was sharp sighted and I saw it, and I started saying to ‘Umar, Don't you see it? He said: I will see it when I am lying in my bed. Then he started telling us about the people of Badr. He said: the Messenger of Allah ﷺ was showing us the places where they would fall (in battle), saying: “This is where So and so will fall in battle tomorrow, if Allah wills; this is where So and so will fall in battle tomorrow, if Allah wills.” And they started to fall in those places, I said: By the One who sent you with the truth, they did not miss those places; they fell in those places. Then he ordered that they be thrown into a well, and he went to them and said: `O So and so, O So and so, did you find what Allah promised you to be true? For I found what Allah promised me to be true.` 'Umar said: O Messenger of Allah (ﷺ) , are you speaking to people who are now dead? He said: `You do not hear what I am saying any better than they do, but they cannot answer.`"
  },
  "5301780": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301780\nIn-book reference  : Book 2, Hadith 100\nEnglish translation  : Vol. 1, Book 2, Hadith 100",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Amr bin Shu'aib narrated, from his father, that his grandfather said:\nWhen 'Amr came back, Banu Ma'mar came to him and they referred their dispute with him concerning the wala' of their sister to 'Umar. 'Umar ­رضي الله عنه said, I will judge between you according to what I heard from the Messenger of Allah ﷺ . I heard him say: “What the son or father acquires goes to his agnates, no matter who they are.” So he ruled in our favour,"
  },
  "5301790": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301790\nIn-book reference  : Book 2, Hadith 101\nEnglish translation  : Vol. 1, Book 2, Hadith 101",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Yahya bin Ya'mar and Humaid bin ‘Abdur­-Rahman al­-Himyari said:\nWe met 'Abdullah bin 'Umar and discussed the divine decree (al qadar) and what others said concerning it. He said: When you go back to them, say; Ibn ‘Umar has nothing to do with you and you have nothing to do with him - three times. Then he said: ‘Umar bin al Khattab رضي الله عنه ­­ told me that whilst they were sitting with the Prophet ﷺ ­, a man came to him walking, with a handsome face and hair, wearing white clothes. The people looked at one another (as if to say): We do not know this man and he does not look like a traveller. Then he said: O Messenger of Allah (ﷺ) , shall I come to you? He said: `Yes.` So he came and put his knees against his knees and his hands on his thighs and said: What is Islam? He said: `To testify that there is no god but Allah and that Muhammad is the Messenger of Allah (ﷺ) , to establish regular prayer, to give zakah, to fast Ramadan and to go on pilgrimage to the House.` He said: What is faith (eeman)? He said: “To believe in Allah, His angels, Paradise and Hell, resurrection \nafter death and the divine decree, all of it.” He said: What is ihsan? He said: `To strive for the sake of Allah as if you see Him, and even though you do not see Him, He sees you.` He said: When will the Hour come? He said: `The one who is asked about it does not know more than the one who is asking.” He \nsaid: What are its portents? He said: `When the destitute, barefoot, naked shepherds compete in constructing lofty buildings, and the slave women give birth to their masters.” Then he said: `Call the man to me.” They looked for him but they saw no trace of him. Two or three days passed, then he said: “O Ibn al­ Khattab, do you know who that was who asked about such and such?” He said: Allah and His Messenger know best. He said: `That was Jibreel who came to teach you your religion.` A man from Juhainah or Muzainah asked him: O Messenger of Allah (ﷺ) , what are we striving for? Is it something that is already decided or is it something that is evolving right now? He said:`For some-­thing that is already decided.` The man or one of the people said: O Messenger of Allah (ﷺ) , then why should we strive? He said: “The people of Paradise will be enabled to do the deeds of the people of Paradise and the people of Hell will be enabled to do the deeds of the people of Hell.` Yahya said: And that is how it is."
  },
  "5301800": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301800\nIn-book reference  : Book 2, Hadith 102\nEnglish translation  : Vol. 1, Book 2, Hadith 102",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abul­-Hakam said:\nI asked Ibn 'Abbas about nabeedh made in earthenware jars. He said: The Messenger of Allah ﷺ forbade nabeedh made in earthenware jars or gourds, and he said: Whoever would like to regard as haram that which Allah, may He be exalted, and His Messenger forbade, let him regard nabeedh as haram, He said. and I asked Ibn az-­Zubair and he said: The Messenger of Allah ﷺ forbade gourds and earthenware jars. He said: I asked Ibn 'Umar and he narrated from 'Umar that the Prophet ﷺ forbade gourds and varnished jars. My brother narrated to me from Abu Sa'eed that the Messenger of Allah ﷺ forbade earthenware jars, gourds, varnished jars, unripe dates, and dried dates,"
  },
  "5301810": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301810\nIn-book reference  : Book 2, Hadith 103\nEnglish translation  : Vol. 1, Book 2, Hadith 103",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ma'dan bin Abi Talhah that 'Umar bin al Khattab رضي الله عنه delivered a khutbah one Friday, and he mentioned the Prophet of Allah ﷺ and Abu Bakr رضي الله عنه, He said:\nI dreamt that a rooster pecked me twice, and I can only interpret it as meaning that my death is near, and there are \npeople who are telling me I should appoint someone to be my successor, but Allah will not cause His religion and the caliphate, with which He sent His Prophet ﷺ, to be lost. If death comes to me soon, then the caliphate is to be decided by these six men with whom the Messenger of Allah ﷺ was pleased when he died. Whichever of them you swear allegiance to, then listen to him and obey. I know that some people will object to this matter. I have fought them with my own hands in the defence of Islam. If they do that, then they are the enemies of Allah and misguided kafirs. I am not leaving behind anything more important to me than kalalah. The Messenger of Allah ﷺ never emphasised any issue to me since I accompanied him more than the issue of kalalah, and I did not ask him about anything more than I asked him about kalalah, until he poked me in the chest with his finger and said: “O 'Umar, is not ayatus­-saif (the verse of summer, i.e. it was revealed in summer), which appears at the end of Soorat an-Nisa', sufficient for you?` If I live I will issue a decree that will be so clear that those who read the Qur'an and those who do not read it will be able to make decisions concerning it. Then he said. O Allah, I call upon You to bear witness over the governors of the regions, for I only sent them to teach the people their religion and the Sunnah of their Prophet and to the divide the fai' among them and to be just to them and to refer to me concerning any difficult matter, O people, you eat two plants which I find to be nothing but repugnant. I remember the Messenger of Allah ﷺ, if he noticed their smell coming from a man in the mosque, he would issue orders \nthat he taken by the hand and led out to al­-Baqee', Whoever must eat them, let him cook them to death.`"
  },
  "5301820": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301820\nIn-book reference  : Book 2, Hadith 104\nEnglish translation  : Vol. 1, Book 2, Hadith 104",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Jabir bin ‘Abdullah said:\nI heard 'Umar bin al-Khattab say to Talhah bin‘Ubaidullah: Why do I see you looking unkempt and dusty since the Messenger of Allah ﷺ died? Perhaps you were upset about your cousin becoming caliph? He said: Allah forbid! I am the most unlikely among you to feel like that, I heard the Messenger of Allah (ﷺ) say: `I know a word which, if a man says it when dying his soul will find rest and provision when it comes out from his body and it will be light for him on the Day of Resurrection.” I did not ask the Messenger of Allah ﷺ about it and he did not tell me it. This is what has been upsetting me. 'Umar said: I know what it is. He said: To Allah be praise! What is it? He said: It is the word that he said to his uncle: La ilaha illallah. Talhah said: You are right."
  },
  "5301830": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301830\nIn-book reference  : Book 2, Hadith 105\nEnglish translation  : Vol. 1, Book 2, Hadith 105",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Tariq bin Shihab said:\nA Jewish man came to 'Umar and said: O Ameer al-Mu'mineen, you read a verse in your Book which, if it had been revealed to us Jews, we would have taken that day as a festival. He said: Which verse is it? He said: The verse: `This day, I have perfected your religion for you, completed My Favour upon you” (al Ma'idah 5:3]. 'Umar said: By Allah, I know the day on which this was revealed to the Messenger of Allah ﷺ and the hour at which it was revealed to the Messenger of Allah ﷺ, on the afternoon of 'Arafah on a Friday."
  },
  "5301840": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301840\nIn-book reference  : Book 2, Hadith 106\nEnglish translation  : Vol. 1, Book 2, Hadith 106",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Umamah bin Sahl bin Hunaif that a man shot an arrow at another man and killed him, and he had no heir except a maternal uncle. Abu 'Ubaidah bin al-Jarrah wrote to ‘Umar concerning that and he wrote back saying that the Prophet ﷺ said:\n`Allah and His Messenger are the guardians of the one who has no guardian, and the maternal uncle is the heir of the one who has no heir.”"
  },
  "5301850": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301850\nIn-book reference  : Book 2, Hadith 107\nEnglish translation  : Vol. 1, Book 2, Hadith 107",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar bin al Khattab رضي الله عنه that the Prophet ﷺ said:\n“O ‘Umar, you are a strong man. Do not crowd others to touch the Black Stone, lest you harm the weak. If you find a gap, then touch it, otherwise turn to face it and say Lailaha illallah, and Allahu akbar.`"
  },
  "5301860": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301860\nIn-book reference  : Book 2, Hadith 108\nEnglish translation  : Vol. 1, Book 2, Hadith 108",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ’Umar that Jibreel عليه السلام said to the Prophet ﷺ:\nWhat is faith (eeman)? He said:“To believe in Allah, His Angels, His Books, His Messengers, the Last Day and the divine decree, both good and bad,” Jibreel said to him: You have spoken the truth. He said: We were amazed that he asked him and then confirmed his answers as being correct. The Prophet ﷺ said: “That was Jībreel, who came to teach you your religion.`"
  },
  "5301870": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301870\nIn-book reference  : Book 2, Hadith 109\nEnglish translation  : Vol. 1, Book 2, Hadith 109",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Asim bin 'Umar that his father said:\nThe Messenger of Allah ﷺ said: “When the night comes from here and the day departs from here, it is time for the fasting person to break his fast,” meaning the east and the west,"
  },
  "5301880": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301880\nIn-book reference  : Book 2, Hadith 110\nEnglish translation  : Vol. 1, Book 2, Hadith 110",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abdur-Rahman bin Abi Laila said:\nI was with ‘Umar and a man came to him and said:I have seen the new moon, the new moon of Shawwal. 'Umar said: O people, break the fast. Then he went to a vessel in which there was water and did wudoo’, and he wiped over his khuffain. A man said: By Allah, O. Ameer al-Mu'mineen, I only came to you to ask about this. Did you see any one else do this? He said: Yes, one who was better than me and the best of the ummah. I saw Abul­-Qasim ﷺ do the same as I have done, when he was wearing a Syrian jubbah with tight sleeves, he put his hand under the jubbah. Then 'Umar prayed Maghrib."
  },
  "5301890": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301890\nIn-book reference  : Book 2, Hadith 111\nEnglish translation  : Vol. 1, Book 2, Hadith 111",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Jabir bin 'Abdullah that 'Umar bin al-Khattab رضي الله عنه said:\nThe Prophet of Allah ﷺ did not prohibit lizard (meat), but he found it off-­putting."
  },
  "5301900": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301900\nIn-book reference  : Book 2, Hadith 112\nEnglish translation  : Vol. 1, Book 2, Hadith 112",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar that he asked the Prophet ﷺ for permission to do 'Umrah and he gave him permission and said:\n`O my brother, do not forget us in your supplication.` And he said later in Madinah: `O my brother, include us in your supplication.` ʼUmar said: I would not like to have instead of that everything on which the sun rises, because of him saying: `O my brother.”"
  },
  "5301910": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301910\nIn-book reference  : Book 2, Hadith 113\nEnglish translation  : Vol. 1, Book 2, Hadith 113",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from 'Umar that he said to the Prophet ﷺ:\nWhat do you think about what we are striving for is it something already decided or something that is evolving now or something new? He said: “It is something already decided,` `Umar said: Then why don't we rely on what is already decided? He said: `Strive, O son of al-Khattab, for everyone will be helped; whoever is one of the people of bliss will strive for that bliss and whoever is one of the people of doom will strive for that doom.”"
  },
  "5301920": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301920\nIn-book reference  : Book 2, Hadith 114\nEnglish translation  : Vol. 1, Book 2, Hadith 114",
    "url": "https://sunnah.com/ahmad/2",
    "text": "‘Abdur-­Rahman bin ‘Awf narrated that 'Umar bin al Khattab رضي الله عنه addressed the people and he heard him say:\nSome people say: what is this stoning? ín the Book of Allah it mentions flogging.But the Messenger of Allah ﷺ stoned [adulterers] and we stoned [them] after him. Were it not that some people would say that 'Umar added something to the Book of Allah that is not part of it, I would have written it the way it was revealed."
  },
  "5301930": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301930\nIn-book reference  : Book 2, Hadith 115\nEnglish translation  : Vol. 1, Book 2, Hadith 115",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn as-Simt that he came to some land called Doomeen, eighteen miles from Homs, and prayed two rak'ahs. I [the narrator] said to him. Are you praying two rak'ahs? He said:\nI saw 'Umar bin al-Khattab in Dhul­-Hulaifah praying two rak'ahs and I asked him (about that). He said: I am only doing what I saw the Messenger of Allah ﷺ do."
  },
  "5301940": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301940\nIn-book reference  : Book 2, Hadith 116\nEnglish translation  : Vol. 1, Book 2, Hadith 116",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn ‘Umar said:\nOne of the Companions of the Messenger of Allah ﷺ entered the mosque on a Friday, when 'Umar bin al Khattab رضي الله عنه ­ was addressing the people. 'Umar said: What time is this? He said: 'O Ameer al-Mu'mineen, I have just come from the marketplace. I heard the call and I did not do anything more than wudoo', 'Umar رضي الله عنه said: Wudoo’ too! You know that the Messenger of Allah ﷺ used to enjoin ghusl!"
  },
  "5301950": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301950\nIn-book reference  : Book 2, Hadith 117\nEnglish translation  : Vol. 1, Book 2, Hadith 117",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar bin al-­Khattab said:\nThe mushrikeen used not to move on from Jam' (Muzdalifah) until the sun rose over (the mountain of) Thabeer, The Prophet ﷺ differed from them and moved on before the sun rose."
  },
  "5301960": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301960\nIn-book reference  : Book 2, Hadith 118\nEnglish translation  : Vol. 1, Book 2, Hadith 118",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Jabir bin ‘Abdullah said:\nUmar bin al-Khattab told me that he heard the Messenger of Allah ﷺ say: “I shall certainly expel the Jews and Christians from the Arabian Peninsula so that I will not leave anyone but Muslims.`"
  },
  "5301970": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301970\nIn-book reference  : Book 2, Hadith 119\nEnglish translation  : Vol. 1, Book 2, Hadith 119",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Salim from his father that whilst ‘Umar bin al Khattab was addressing the people on a Friday, one of the companions of the Messenger of Allah ﷺ came in, 'Umar called out to him:\nWhat time is this? He said: I was busy today and I did not go back to my family when I heard the call to prayer, so I did no more than doing wudoo’. ʼUmar said: Just wudooʼ, when you know that the Messenger of Allah (ﷺ) used to enjoin ghus!?"
  },
  "5301980": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301980\nIn-book reference  : Book 2, Hadith 120\nEnglish translation  : Vol. 1, Book 2, Hadith 120",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abdullah bin ‘Abbas said:\nUmar bin al-Khattab told me: On the day of Khaibar, a group of the companions of the Prophet ﷺ came and said: So and so has been martyred. So and so has been martyred, until they came to a man and said, So and so has been martyred, but the Messenger of Allah (ﷺ) said: “No, I saw him in the Fire because of a cloak or 'aba'ah that he stole from the war booty.” Then the Messenger of Allah ﷺ said: “O son of al-Khattab, go and call out to the people that no one will enter Paradise except the believers.” So I went out and called to them, saying: `No one will enter Paradise except the believers.”"
  },
  "5301990": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5301990\nIn-book reference  : Book 2, Hadith 121\nEnglish translation  : Vol. 1, Book 2, Hadith 121",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abul-Aswad ad-­Deeli said:\nWhen I came to Madinah, sickness was occurring in the city and they were dying quickly. I sat with 'Umar bin al Khattab (رضي الله عنه) and a funeral passed by, Good things were said about (the deceased) and ‘Umar (رضي الله عنه) said: It is due. Then another (funeral) passed by; good things were said about (the deceased) and he said: It is due. Then a third funeral passed by: bad things were said about the deceased and ‘Umar said: It is due. I said: What is due, O Ameer al Mu'mineen? He said: I said what the Messenger of Allah (ﷺ) said: `Any Muslim in whose favour four people testify, Allah will admit him to Paradise.` We said: Or three? He said: “Or three.` We said: Or two? He said: `Or two.” Then we did not ask him about one,"
  },
  "5302000": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302000\nIn-book reference  : Book 2, Hadith 122\nEnglish translation  : Vol. 1, Book 2, Hadith 122",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abu Tameem al­-Jaishani said:\nUmar bin al Khattab heard the Messenger of Allah (ﷺ) say: `If you were to put your trust in Allah as you should, you would be given provision like the birds: they go out hungry in the morning and come back with full bellies in the evening.”"
  },
  "5302010": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302010\nIn-book reference  : Book 2, Hadith 123\nEnglish translation  : Vol. 1, Book 2, Hadith 123",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Hurairah from 'Umar bin al-Khattab that the Messenger of Allah (ﷺ) said:\n“Do not sit with the people who deny al-­qadar, or initiate any discussion with them.` 'AbdurRahman said on one occasion: I heard the Messenger of Allah (ﷺ) say....."
  },
  "5302020": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302020\nIn-book reference  : Book 2, Hadith 124\nEnglish translation  : Vol. 1, Book 2, Hadith 124",
    "url": "https://sunnah.com/ahmad/2",
    "text": "ft was narrated from Ibn as-Simt that he went out with ‘Umar to Dhul­-Hulaifah and he prayed two rak'ahs. I [the narrator] asked hirm about that and he said:\nI am only doing what I saw the Messenger of Allah (ﷺ) do."
  },
  "5302030": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302030\nIn-book reference  : Book 2, Hadith 125\nEnglish translation  : Vol. 1, Book 2, Hadith 125",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Ibn 'Abbas narrated that 'Umar bin al-Khattab said:\nOn the day of Badr, the Messenger of Allah (ﷺ) looked at his companions and they were three hundred and some, then he looked at the mushrikeen and saw that they were one thousand or more. The Prophet of Allah(ﷺ) turned to face the qiblah, then he stretched forth his hands, wearing his upper and lower garment, and he said: “O Allah, where is Your promise to me? O Allah, accomplish for me what You have promised me! O Allah, if this small band of Muslims is destroyed, You will never be worshipped on earth.” He kept beseeching his Lord, calling out to Him, until his upper garment fell from his shoulders. Abu Bakr came to him, picked up his upper garment and put it on him. Then he embraced him from behind and said: O Prophet of Allah, this prayer of yours to your Lord will suffice, for He will accomplish for you what He has promised to you. Then Allah revealed the words: `(Remember) when you sought help of your Lord and He answered you (saying): ‘I will help you with a thousand of the angels each behind the other (following one another) in succession` [al Anfal 8:9). On that day when the armies met (in battle), Allah, may He be glorified and exalted, defeated the mushrikeen; seventy of their men were killed and seventy were taken captive. The Messenger of Allah (ﷺ) consulted Abu Bakr, 'Ali and 'Umar رضي الله عنهم (concerning the prisoners). Abu Bakr said: O Prophet of Allah, they are our cousins, kinsmen and brothers, I think that you should accept a ransom for them, which will strengthen us against the kuffar, and perhaps Allah will guide them to Islam and they will become a support to us. The Messenger of Allah (ﷺ) said: “What do you think, O son of al-Khattab?` I said: No, by Allah. I do not think as Abu Bakr thinks. I think that you should hand. So and so ­ a relative of ʼUmar's- ­ over \nto me so that I may strike his neck. You should hand ‘Aqeel over to ‘Ali so that he may strike his neck, and you should hand over So and so to Hamzah (his brother) so that he may strike his neck, so that Allah will know that we have no mercy in our hearts towards the mushrikeen; these are \ntheir prominent figures and leaders. But the Messenger of Allah (ﷺ) inclined towards the view of Abu Bakr, and he did not incline towards what I said, and accepted ransoms from them. The next day, I came to the Prophet (ﷺ) and found him with Abu Bakr, and they were both weeping I said: O Messenger of Allah , tell me why you and your companion are weeping. If I find it is a cause for weeping, I will weep too, and is it is not, then I will make myself weep with you. The Messenger of Allah (ﷺ) said: `I am weeping because of what your companions suggested about accepting a ransom for the prisoners. I have been shown your punishment as close as this tree` ­ a tree that was close to the Prophet of Allah (ﷺ) Then Allah revealed the words:`It is not for a Prophet that he should have prisoners of war (and free them with ransom) until he had made a great slaughter (among his enemies) in the land. You desire the good of this world (i.e. the money of ransom for freeing the captives), but Allah desires (for you) the Hereafter. And Allah is Almighty, All Wise. Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took `[al Anfal 8:67­-68] ­ i.e., referring to the ransom. Then booty was permitted to them, and when the day of Uhud came the following year, they were punished for what they had done of taking the \nransom on the day of Badr. Seventy of them were killed and the Companions of the Prophet deserted him, his front tooth was broken and the helmet on his head was broken, and blood flowed down his face, and Allah revealed the words: “When a single disaster smites you, although you smote (your enemies) with one twice as great, you say: 'From where does this come to us?`Say (to them), ‘It is from yourselves (because of your evil deeds).' And Allah has power over all things” [Al 'Imran 3:165]"
  },
  "5302040": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302040\nIn-book reference  : Book 2, Hadith 126\nEnglish translation  : Vol. 1, Book 2, Hadith 126",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar bin al­-Khattab (رضي الله عنه ­) said:\nWe were with the Messenger of Allah (ﷺ) on a journey, and I asked him about something three times but he did not answer me. I said to myself, May \nyour mother be bereft of you. O son of al-Khattab, you spoke to the Messenger of Allah (ﷺ) three times and he did not answer you. So I got on my mount and went on ahead, fearing that something had been revealed concerning me. Then I heard someone calling out: O 'Umar! Where is ‘Umar? I went back, thinking that something had been revealed concerning me, and the Prophet (ﷺ) said: `Yesterday a soorah was revealed to me that is dearer to me than this world and everything in it: ‘Verily, We have given you (O Muhammad ﷺ) a manifest victory. That Atlah may forgive you your sins of the past and the future' (al­-Fath 48:1–2]."
  },
  "5302050": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302050\nIn-book reference  : Book 2, Hadith 127\nEnglish translation  : Vol. 1, Book 2, Hadith 127",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn al-Hawtakiyyah said:\nSome food was brought to 'Umar bin al-Khattab and he called a man to join him, but he said, I am fasting. ['Umar] said: What fast are you observing? Were it not for fear of adding or subtracting something, I would have narrated to you a hadeeth, from the Prophet (ﷺ), when the Bedouin brought him a rabbit; rather send for 'Ammar. When 'Ammar came, he said: Were you there on the day when the Bedouin brought the rabbit to the Messenger of Allah (ﷺ)? ('Ammar) said: Yes. ('Umar] said: I saw blood on it, but he (the Prophet (ﷺ) said: `Eat it.` (The Bedouin) said: I am fasting. (The Prophet (ﷺ) said: `What fast are you observing?” He said: The beginning and end of the month. He said: “If you want to fast, then fast the thirteenth, fourteenth and fifteenth (of the month).`"
  },
  "5302060": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302060\nIn-book reference  : Book 2, Hadith 128\nEnglish translation  : Vol. 1, Book 2, Hadith 128",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Masrooq bin al-­Ajda' said:\nI met 'Umar bin al­-Khattab and he said: Who are you? I said: Masrooq bin al­-Ajda'. 'Umar said: I heard the Messenger of Allah (ﷺ) saying, `Al-\nAjda' is a devil [i.e. the word Al-­Ajda' has a bad meaning]; rather you are Masrooq bin ‘Abdur-Rahman. 'Amir said: I saw his name written in the Deewan; Masrooq bin ‘Abdur-­Rahman. I said: What is this? He said. This is what ‘Umar رضي الله عنه called me."
  },
  "5302070": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302070\nIn-book reference  : Book 2, Hadith 129\nEnglish translation  : Vol. 1, Book 2, Hadith 129",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar bin al-Khattab that the Prophet (ﷺ) forbade 'azl (coitus interruptus) with a free woman, except with her permission."
  },
  "5302080": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302080\nIn-book reference  : Book 2, Hadith 130\nEnglish translation  : Vol. 1, Book 2, Hadith 130",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Zaid bin Aslam that his father said:\nI heard ‘Umar say: If I live until next year, no city will be conquered but I shall divide it among them (the troops) as the Messenger of Allah (ﷺ) divided Khaibar."
  },
  "5302090": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302090\nIn-book reference  : Book 2, Hadith 131\nEnglish translation  : Vol. 1, Book 2, Hadith 131",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Abbas that 'Umar رضي الله عنه said:\nI was with the Prophet (ﷺ) on a campaign, and I swore (an oath), No, by my father! A man called out from behind me: “Do not swear by your fathers.” And I saw that it was the Prophet (ﷺ)."
  },
  "5302100": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302100\nIn-book reference  : Book 2, Hadith 132\nEnglish translation  : Vol. 1, Book 2, Hadith 132",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar said:\nIf I live, in sha Allah, I shall certainly expel the Jews and Christians from the Arabian Peninsula."
  },
  "5302110": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302110\nIn-book reference  : Book 2, Hadith 133\nEnglish translation  : Vol. 1, Book 2, Hadith 133",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar said:\nI saw the Messenger of Allah (ﷺ) wiping over his leather slippers (when doing wudoo’)."
  },
  "5302120": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302120\nIn-book reference  : Book 2, Hadith 134\nEnglish translation  : Vol. 1, Book 2, Hadith 134",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Sayyar bin al-Ma'roor said:\nI heard 'Umar giving a khutbah, and he said: The Messenger of Allah (ﷺ) built this mosque and we, the Muhajireen and Ansar, were with him. If it gets too crowded, then let one of you prostrate on his brother's back. And he saw people (on one occasion) praying in the street and said: Pray in the mosque,"
  },
  "5302130": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302130\nIn-book reference  : Book 2, Hadith 135\nEnglish translation  : Vol. 1, Book 2, Hadith 135",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Harithah bin Mudarrib that he did Hajj with ‘Umar bin al Khattab (رضي الله عنه). The nobles of Syria came to him ['Umar) and said:\nO Ameer al-Mu'mineen, we have acquired slaves and mounts, so take charity from our wealth in order to purify us thereby, and it will be zakah for us. He said: This is something that the two who came before me did not do; I shall wait until I ask the Muslims."
  },
  "5302140": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302140\nIn-book reference  : Book 2, Hadith 136\nEnglish translation  : Vol. 1, Book 2, Hadith 136",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Jabir bin 'Abdullah that 'Umar bin al Khattab said:\nThe Messenger of Allah (ﷺ) said: “If I live, I shall certainly expel the Jews and Christians from the Arabian Peninsula, until I leave only Muslims there.”"
  },
  "5302150": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302150\nIn-book reference  : Book 2, Hadith 137\nEnglish translation  : Vol. 1, Book 2, Hadith 137",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated from 'Umar bin al-Khattab (رضي الله عنه) and ʻAbdullah said:\nMy father attributed it to the Prophet (ﷺ) - that he said: `Whoever misses any part of his regular portion of Qur'an or prayer at night, and recites it between Fajr and Zuhr, it will be as if he recited it that night.”"
  },
  "5302160": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302160\nIn-book reference  : Book 2, Hadith 138\nEnglish translation  : Vol. 1, Book 2, Hadith 138",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lbn 'Abbas narrated that 'Umar bin al-Khattab said:\nOn the day of Badr, the Messenger of Allah (ﷺ) looked at his companions and they were three hundred and some, then he looked at the mushrikeen and saw that they were one thousand or more. The Prophet of Allah (ﷺ) turned to face the qiblah, then he stretched forth his hands, wearing his upper and lower garment, and he said: “O Allah, where is Your promise to me? O Allah, accomplish for me what You have promised me! O Allah, if this small band of Muslims is destroyed, You will never be worshiped on earth.” He kept beseeching his Lord, calling out to Him, until his upper garment fell from his shoulders. Abu Bakr came to him, picked up his upper garment and put it back on him. Then he embraced him from behind and said, “O Prophet of Allah, this prayer of yours to your Lord will suffice, for He will accomplish for you what He has promised to you.” Then Allah revealed the words: “(Remember) when you sought help of your Lord and He answered you (saying): ‘I will help you with a thousand of the angels each behind the other (following one another) in succession’” (al-Anfal 8:9). On that day when the armies met (in battle), Allah, may He be glorified and exalted, caused the mushrikeen to be defeated, seventy of their men were killed and seventy were taken captive. The Messenger of Allah (ﷺ) consulted Abu Bakr, ‘Ali and ʼUmar (concerning the prisoners). Abu Bakr said, “O Prophet of Allah, they are our cousins, kinsmen and brothers. I think that you should accept a ransom for them, which will strengthen us against the kuffar, and perhaps Allah will guide them to Islam and they will become a support to us.” The Messenger of Allah (ﷺ) said, “What do you think, O son of al-Khattab?” I said: No, by Allah. I do not think as Abu Bakr thinks. I think that you should hand so and so—a relative of ‘Umar's—to me so that I may strike his neck, You should hand ‘Aqeel over to ‘Ali so that he may strike his neck, and you should hand over so and so to Hamzah (his brother) so that he may strike his neck, so that Allah will know that we have no mercy in our hearts towards the mushrikeen; these are their prominent figures and leaders. But the Messenger of Allah (ﷺ) inclined towards the view of Abu Bakr, and he did not incline towards what I said, and accepted ransoms from them. The next day. I came to the Prophet (ﷺ) and found him with Abu Bakr, and they were both weeping. I said, “O Messenger of Allah, tell me why you and your companion are weeping. If I find it is a cause for weeping. I will weep too, and if it is not, then I will make myself weep with you.” The Messenger of Allah (ﷺ) said, “I am weeping because of what your companions suggested about accepting a ransom for the prisoners. I have been shown your punishment as close as this tree”—a tree that was close to the Prophet of Allah (ﷺ). Then Allah revealed the words: “It is not for a Prophet that he should have prisoners of war (and free them with ransom) until he had made a great slaughter (among his enemies) in the land. You desire the good of this world (i.e. the money of ransom for freeing the captives), but Allah desires (for you) the Hereafter, And Allah is All-Mighty, All-Wise. Were it not a previous ordainment from Allah, a severe torment would have touched you for what you took.” [al-Anfal 8:67-68] i.e., referring to the ransom. Then booty was permitted to them, and when the day of Uhud came the following year, they were punished for what they had done for taking the ransom on the day of Badr. Seventy of them were killed and the Companions of the Prophet deserted him; his front tooth was broken and the helmet on his head was broken, and blood flowed down his face, and Allah revealed the words: “When a single disaster smites you, although you smote (your enemies) with one twice as great, you say: ‘From where does this come to us?’ Say (to them), ‘It is from yourselves (because of your evil deeds).’ And Allah has power over all things” [Al ‘Imran 3:165]"
  },
  "5302170": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302170\nIn-book reference  : Book 2, Hadith 139\nEnglish translation  : Vol. 1, Book 2, Hadith 139",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ibn 'Abbas said:\nI was eager to ask 'Umar about the two wives of the Prophet (ﷺ) concerning whom Allah said, “If you two (wives of the Prophet (ﷺ) turn in repentance\nto Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes)” [at-Tahreem 66:4], until 'Umar went for Hajj and I went with him. When we were partway there, 'Umar turned aside and I turned aside with him, bringing the jug. He relieved himself, then he came to me and I poured water onto his hands, and he did wudoo’. I said: “O Ameer al -Mu'mineen, who are the two wives of the Prophet (ﷺ) of whom Allah said: ‘If you two (wives of the Prophet (ﷺ)) turn in repentance to Allah, (it will be better for you), your hearts are indeed so inclined (to oppose what the Prophet (ﷺ) likes)’?” [at-Tahreem 66:4] 'Umar said, “How strange of you, O Ibn 'Abbas”, (az-Zuhri said: By Allah, he did not like the question, but he did not conceal anything.) He said, “They were Hafsah and 'A'ishah.” Then he started to narrate the hadeeth and said: We people of Quraish were a people who dominated women, but when we came to Madinah we found a people who were dominated by their women, and our women started to learn from their women. My house was among Banu Umayyah bin Zaid in al-'Awali. One day I got angry with my wife, and she argued with me. I did not like her to argue with me, but she said: Do you not like me to argue with you? By Allah, the wives of the Prophet (ﷺ) argue with him, and one of them will forsake him all day until night comes, I went and entered upon Hafsah, and I said: Do\nyou argue with the Messenger of Allah (ﷺ)? She said: Yes. I said: Does one of you forsake him all day until night comes? She said: Yes. I said: Any one of you who does that is doomed and lost. Does any one of you feel assured that Allah will not be angry with her because of the anger of His\nMessenger (ﷺ), for then she will be doomed? Do not argue with the Messenger of Allah (ﷺ) and do not ask him for anything. Ask me for whatever you want. And do not be misled by the fact that your neighbour is more beautiful than you and more beloved to the Messenger of Allah (ﷺ) than\nyou – referring to 'A'ishah. And ‘Umar said: I had a neighbour among the Ansar. We used to take turns to go down to the Messenger of Allah (ﷺ). He would go down one day and I would go down the next. He would bring me the news of the Revelation and other things, and I would do likewise.\nWe were saying that Ghassan were shoeing their horses to attack us. My friend went down, then he came to me at night and knocked on my door, then he called out to me. I went out to him and he said: Something terrible has happened! I said: What? Have Ghassan come? He said: No, it is more terrible than that and worse. The Prophet (ﷺ) has divorced his wives! I said: Hafsah is doomed and lost! I thought that this would happen. Then when I had prayed Fajr, I got dressed, then I went down and entered upon Hafsah, who was weeping. I said: Has the Messenger of Allah (ﷺ)divorced you? She said: I do not know. He has secluded himself in this loft. I went to a black slave of his and said: Ask for permission for ‘Umar to enter. He went in, then he came out to me and said: I mentioned you to him but he did not say anything, I went away and came to the minbar, where I sat down. By it was a group of people, some of whom were weeping. I sat for a little while, then I could not bear it any longer, so I went to the slave and said: Ask for permission for ‘Umar to enter. He went in, then he came out to me and said: I mentioned you to him but he did not say anything. I turned to leave, then the slave called me and said: Go in, he has given you permission. So I went in and greeted the Messenger of Allah (ﷺ) with salam. He was resting on a reed mat that had left marks on his side. I said: O Messenger of Allah, have you divorced your wives? He looked up at me and said, “No.” I said: Allah Akbar! if you had seen us, O Messenger of Allah, we Quraish were a people who dominated women, but when we came to Madinah we found a people who were dominated by their women, and our women started to learn from their women. I got angry with my wife one day, and she started to argue with me. I did not like her to argue with me, but she said: Do you not like me to argue with you? By Allah, the wives of the Prophet (ﷺ) argue with him, and one of them will forsake him all day until night comes. I said: Any one of them who does that is doomed and lost. Does one of them feel assured that Allah will not be angry with her because of the anger of His Messenger (ﷺ),then she will be doomed? The Messenger of Allah (ﷺ) smiled. I said: O Messenger of Allah, I entered upon Hafsah and I said: Do not be misled by the fact that your neighbour (i.e. ‘Aa'ishah) is more beautiful than you and more beloved to the Messenger of Allah (ﷺ) than you. The Messenger of Allah (ﷺ) smiled again. I said: O Messenger of Allah, may I speak to you freely? He said: “Yes.” So I sat down and looked around the room, and by Allah, I did not see anything in it to please the eye except three hides. I said: Pray to Allah, O Messenger of Allah, to make life prosperous for your ummah, for He has made life prosperous for the Persians and Romans, but they do not worship Allah, may He be glorified and exalted. He sat up straight and said: “Are you doubting. O son of al-Khattab? They are people whose good things have been hastened for them in this world.” I said: Pray for forgiveness for me, O Messenger of Allah. He had sworn that he would not enter upon them for a month, because he was so annoyed with them until Allah rebuked him."
  },
  "5302180": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302180\nIn-book reference  : Book 2, Hadith 140\nEnglish translation  : Vol. 1, Book 2, Hadith 140",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abdur-Rahman bin 'Abdul-Qari said:\nl heard 'Umar bin al-Khattab say: When the Revelation came down to the Messenger of Allah (ﷺ), a sound could be heard near his face like the buzzing of bees. We waited a while, then he turned to face the qiblah and raised his hands, then he said: “O Allah, give us more (blessing) and do not give us less; honour us and do not humiliate us, give to us and do not deprive us, give precedence to us and do not give others precedence over us; be pleased with us and make us pleased.” Then he said: “Ten verses have been revealed to me; whoever adheres to thern will enter Paradise.” Then he recited to us: “Successful indeed are the believers” [al-Mu'minoon 23:1] until he completed the ten verses."
  },
  "5302190": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302190\nIn-book reference  : Book 2, Hadith 141\nEnglish translation  : Vol. 1, Book 2, Hadith 141",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu 'Ubaid the freed slave of ‘Abdur-Rahman bin 'Awf that he was present on Eid with 'Umar bin al Khattab. He ['Umar] prayed before delivering the khutbah, with no adhan or Iqamah. Then he gave the khutbah and said:\nO people, the Messenger of Allah (ﷺ) forbade fasting on these two days (i.e., the two Eids). On the first of them you break your fast and celebrate your festival, and on the second you eat from the meat of your sacrifices.\nIt was narrated that Sa'd Abu 'Ubaid, the freed slave of ‘Abdur-Rahman bin Azhar, said: I was present at Eid with 'Umar bin al Khattab... and he mentioned a similar hadeeth."
  },
  "5302200": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302200\nIn-book reference  : Book 2, Hadith 142\nEnglish translation  : Vol. 1, Book 2, Hadith 142",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn ‘Umar that ‘Umar رضي الله عنه kissed the Black Stone, then he said:\nI know that you are only a stone. Were it not that I saw the Messenger of Allah (ﷺ) kiss you, I would not have kissed you."
  },
  "5302210": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302210\nIn-book reference  : Book 2, Hadith 143\nEnglish translation  : Vol. 1, Book 2, Hadith 143",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated frorn Abu Wa'il that a man who was a Christian and was known as as-Subayy bin Ma'bad became Muslim and wanted to go for jihad. It was said to him:\nStart with Hajj. So he went to al-Ash'ari, who told him to enter ihram for Hajj and ‘Umrah together. So he did that, and whilst he was reciting the Talbiyah,Zaid bin Soohan and Salman bin Rabee'ah passed by him, and one of them said to the other. This one is more misguided than his family's camel. As-Subayy heard them and that upset him. When he arrived he went to 'Umar and told him about that, 'Umar رضي الله عنه said to him: You have been guided to the Sunnah of your Prophet (ﷺ). He [the narrator] said: On another occasion I heard him say: You have been helped to follow the Sunnah of the Prophet."
  },
  "5302220": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302220\nIn-book reference  : Book 2, Hadith 144\nEnglish translation  : Vol. 1, Book 2, Hadith 144",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Alqamah that ‘Umar (رضي الله عنه) said:\nThe Messenger of Allah (ﷺ) was staying up late one night with Abu Bakr, discussing some issue of the Muslims, and I was with him."
  },
  "5302230": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302230\nIn-book reference  : Book 2, Hadith 145\nEnglish translation  : Vol. 1, Book 2, Hadith 145",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Abdullah bin Sarjis said:\nI saw the bald one, meaning 'Umar (رضي الله عنه), kiss the [Black) Stone and say: I am kissing you and I know that you are only a stone and cannot bring any\nbenefit or ward off any harm, were it not that I saw the Messenger of Allah رضي الله عنه kiss you, I would not have kissed you,"
  },
  "5302240": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302240\nIn-book reference  : Book 2, Hadith 146\nEnglish translation  : Vol. 1, Book 2, Hadith 146",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn 'Umar, from ‘Umar [that he said:\n] I said: O Messenger of Allah, can one of us go to sleep when he is junub? He said: “Yes, if he does wudoo'.”"
  },
  "5302250": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302250\nIn-book reference  : Book 2, Hadith 147\nEnglish translation  : Vol. 1, Book 2, Hadith 147",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar bin al­-Khattab (رضي الله عنه) said:\nThe Messenger of Allah (ﷺ) said:“When night comes and day departs, and the sun sets, then (it is time to) break your fast.`"
  },
  "5302260": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302260\nIn-book reference  : Book 2, Hadith 148\nEnglish translation  : Vol. 1, Book 2, Hadith 148",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Nafi’ bin 'Abdul­-Harith met 'Umar bin al-Khattab in ‘Usfan, when he was his governor in Makkah. Umar asked:\nWhom have you appointed as your deputy over the people of the valley? He said: I have appointed Ibn Abza over them, ‘Umar said: Who is Ibn Abza? Nafiʼ said: One of our freed slaves. ‘Umar said: Have you appointed a freed slave over them? Nafi’ said: He has great knowledge of the Book of Allah, is well versed in the rules of inheritance (al­-fara'id) and is a (good) qadi (judge). 'Umar said. Indeed your Prophet (ﷺ) said, “Allah raises some people (in status) by means of this Book and brings others low by means of it.”"
  },
  "5302270": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302270\nIn-book reference  : Book 2, Hadith 149\nEnglish translation  : Vol. 1, Book 2, Hadith 149",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abul-Bakhtari said:\n‘Umar said to Abu ‘Ubaidah bin al­-Jarrah: Stretch out your hand so that I may give my allegiance to you, for I heard the Messenger of Allah (ﷺ) say: “You are the trustee of this ummah.” Abu ‘Ubaidah said: I will not put myself ahead of someone whom the Messenger of Allah (ﷺ) told to lead us in prayer and he led us in prayer until he [the Messenger of Allah (ﷺ)] died."
  },
  "5302280": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302280\nIn-book reference  : Book 2, Hadith 150\nEnglish translation  : Vol. 1, Book 2, Hadith 150",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that 'Umar bin al-­Khattab (رضي الله عنه) said:\nThe Messenger of Allah (ﷺ) shared out (some wealth) and I said, \"By Allah, O Messenger of Allah, others deserved to have it more than these people.\" He said: \"They gave me the choice of having them ask importunately or regard me as a miser, and I am not a\nmiser.\""
  },
  "5302290": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302290\nIn-book reference  : Book 2, Hadith 151\nEnglish translation  : Vol. 1, Book 2, Hadith 151",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn `Umar that `Umar رضي الله عنه asked the Prophet (ﷺ):\nCan one of us sleep if he is junub? He said: `Yes, if he does wudoo’ as for prayer.`\nIt was narrated from Ibn `Umar that `Umar asked the Prophet (ﷺ)... a similar hadeeth."
  },
  "5302300": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302300\nIn-book reference  : Book 2, Hadith 152\nEnglish translation  : Vol. 1, Book 2, Hadith 152",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Nafiʼ said:\nIbn `Umar saw Sa`d bin Malik wiping over his leather slippers. Ibn ʼUmar said: Is it you doing this? Sa`d said: Yes. They both went to ‘Umar and Sa`d said to ‘Umar, Give my brother`s son a fatwa with regard to wiping over leather slippers. `Umar said, When we were with our Prophet (ﷺ) we used to wipe over our leather slippers. Ibn `Umar said: Even if that is after one has defecated and urinated? He said: Yes, even if that is after one has defecated and urinated. Nafiʼ said: After that, Ibn ‘Umar would wipe over them and not take them off, and he did not give a time limit for that. I told that to Ma`mar and he said: Ayyoob told me something similar from Nafi`."
  },
  "5302310": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302310\nIn-book reference  : Book 2, Hadith 153\nEnglish translation  : Vol. 1, Book 2, Hadith 153",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Malik bin Aws bin al-Hadathan said:\nI exchanged some silver for gold with Talhah bin ‘Ubaidullah, and he said: Wait for me until our storekeeper comes from al-Ghabah, `Umar bin al-Khattab heard that and said: No, by Allah! Do not leave him until you take your exchange from him, for I heard the Messenger of Allah (ﷺ) say: `Gold for silver is riba unless it is `here, take this` and `here, take this` [i.e., exchanged on the spot].”"
  },
  "5302320": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302320\nIn-book reference  : Book 2, Hadith 154\nEnglish translation  : Vol. 1, Book 2, Hadith 154",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Ubaidullah bin `Abdullah bin `Utbah said:\nWhen the apostates apostatised at the time of Abu Bakr, ‘Umar said: How can you fight the people, O Abu Bakr, when the Messenger of Allah (ﷺ) said: “I have been commanded to fight the people until they say La ilaha illallah (There is no god but Allah), and whoever says La ilaha illallah, his wealth and his life are protected from me except in cases dictated by Islamic law, and his reckoning will be with Allah`? Abu Bakr said: By Allah, I will most certainly fight those who separate prayer and zakah, for zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ), I will certainly fight them for withholding it. `Umar bin al-Khattab said. By Allah, as soon as I saw that Allah had opened Abu Bakr`s heart to the idea of fighting, I knew that he was right."
  },
  "5302330": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302330\nIn-book reference  : Book 2, Hadith 155\nEnglish translation  : Vol. 1, Book 2, Hadith 155",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn ‘Abbas said; ‘Umar said:\nI was walking with a group of people during a campaign I went on with the Messenger of Allah (ﷺ) and I swore an oath, saying, No, by my father. A man behind me rebuked me for that and said: “Do not swear by your fathers,” I turned around and saw that it was the Messenger of Allah (ﷺ)."
  },
  "5302340": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302340\nIn-book reference  : Book 2, Hadith 156\nEnglish translation  : Vol. 1, Book 2, Hadith 156",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar رضي الله عنه said:\nThe Messenger of Allah (ﷺ) heard me swearing an oath by my father and said: “Allah forbids you to swear by your fathers.” ‘Umar said: By Allah, I never swore by my father after that, whether saying it myself or narrating what someone else had said."
  },
  "5302350": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302350\nIn-book reference  : Book 2, Hadith 157\nEnglish translation  : Vol. 1, Book 2, Hadith 157",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar رضي الله عنه that:\nThe Messenger of Allah (ﷺ) granted a concession allowing silk the width of two fingers."
  },
  "5302360": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302360\nIn-book reference  : Book 2, Hadith 158\nEnglish translation  : Vol. 1, Book 2, Hadith 158",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu `Uthman said:\nWe were with `Utbah bin Farqad and `Umar رضي الله عنه wrote to him about things he narrated from the Prophet (ﷺ). Among the things he wrote was that the Messenger of Allah (ﷺ) said: `No one wears silk in this world except one who will not wear it in the Hereafter, except this much,` and he gestured with his two fingers, the forefinger and the middle finger. Abu `Uthman said: I thought this referred to the edging of the tayalisah (a shawl-like garment) when we first saw the tayalisah."
  },
  "5302370": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302370\nIn-book reference  : Book 2, Hadith 159\nEnglish translation  : Vol. 1, Book 2, Hadith 159",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ya`la bin Umayyah said:\nI said to `Umar bin al-Khattab. People are shortening the prayer today, and Allah says: “If you fear that the disbelievers may put you in trial (attack you)` [an-Nisa` 4:101). But that time [i.e., time of fear] has gone, He said: I wondered the same thing as you are wondering, and I asked the Messenger of Allah (ﷺ) about that. He said: `It is a charity that Allah has bestowed upon you, so accept His charity.”\n`Abdur-Razzaq told us, Ibn Juraij told us I heard `Abdur-Rahman bin ‘Abdullah bin Abi ‘Ammar narrate... and he mentioned [the same report]."
  },
  "5302380": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302380\nIn-book reference  : Book 2, Hadith 160\nEnglish translation  : Vol. 1, Book 2, Hadith 160",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar bin al-Khattab said:\nThe last thing to be revealed was the verse on riba, but the Messenger of Allah (ﷺ) passed away and did not discuss it with us. So give up riba and doubtful things."
  },
  "5302390": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302390\nIn-book reference  : Book 2, Hadith 161\nEnglish translation  : Vol. 1, Book 2, Hadith 161",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar that:\nThe Prophet (ﷺ) said: `The deceased is tormented in his grave because of the wailing for him.`"
  },
  "5302400": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302400\nIn-book reference  : Book 2, Hadith 162\nEnglish translation  : Vol. 1, Book 2, Hadith 162",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar that:\nThe Prophet (ﷺ) said: “The deceased is tormented because of his family`s crying for him.”"
  },
  "5302410": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302410\nIn-book reference  : Book 2, Hadith 163\nEnglish translation  : Vol. 1, Book 2, Hadith 163",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Yahya said:\nI heard Sa`eed bin al-Musayyab (say) that `Umar (رضي الله عنه ) said: Beware of neglecting the verse of stoning, lest someone say, We do not find two hadd punishments in the Book of Allah, for I saw the Prophet (ﷺ) stone [adulterers] and we stoned [adulterers] too."
  },
  "5302420": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302420\nIn-book reference  : Book 2, Hadith 164\nEnglish translation  : Vol. 1, Book 2, Hadith 164",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Anas said:\n`Umar said: My opinion coincided with that of my Lord in three matters and my Lord confirmed my opinion in three matters. I said: O Messenger of Allah (ﷺ), why don`t you take Maqam Ibraheem as a place of prayer? Then Allah revealed the words: “And take you (people) the Maqam (place) of Ibraheem (Abraham) [or the stone on which Ibraheem (Abraham) to stood while he was building the Ka`bah] as a place of prayer” [al-Baqarah 2:125]. And I said: O Messenger of Allah (ﷺ), both righteous and immoral people enter upon you; why don`t you tell the Mothers of the Believers to observe hijab? Then Allah revealed the verse of hijab. And I heard that the Prophet (ﷺ) had rebuked some of his wives, so I sought permission to speak to the Mothers of the Believers, then I entered upon them and said to each one of them: By Allah, either you stop, or Allah will give His Messenger (wives) who are better than you. I went to one of his wives and she said: O ‘Umar, don`t you think that the Messenger of Allah (ﷺ) is able to exhort his wives? Why are you exhorting them? Then Allah revealed the words. It may be if he divorced you (all) that his Lord will give him instead of you, wives better than you` [at-Tahreem 66:5]"
  },
  "5302430": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302430\nIn-book reference  : Book 2, Hadith 165\nEnglish translation  : Vol. 1, Book 2, Hadith 165",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abu Dhibyan told us:\nI heard ‘Abdullah bin az-Zubair say: Do not let your women wear silk, for I heard `Umar narrate from the Prophet (ﷺ) that he said: `Whoever wears silk in this world will not wear it in the Hereafter.` And `Abdullah bin az-Zubair added his own words: And whoever does not wear it in the Hereafter will not enter Paradise. Allah says: “and their garments therein will be of silk` [Fatir 35:33]."
  },
  "5302440": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302440\nIn-book reference  : Book 2, Hadith 166\nEnglish translation  : Vol. 1, Book 2, Hadith 166",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ash-Sha`bi said:\n`Umar passed by Talhah, and he narrated a similar report. He said: ‘Umar passed by Talhah and saw him looking worried. He said: Perhaps you are upset because your cousin was appointed (as caliph)? - referring to Abu Bakr. He said: No, but by Allah, I heard the Messenger of Allah (ﷺ) say: `I know a word which, if a man says it when he is dying, it will be light in the record of his deeds, or he will find comfort in it at the time of death.` ‘Umar said: I will tell you of it; it is the word that he wanted his paternal uncle to say, the testimony that there is no god but Allah. He said: It is as if a great burden has been lifted from me. He said: You are right. If he had known anything better that it, he would have instructed him to say it."
  },
  "5302450": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302450\nIn-book reference  : Book 2, Hadith 167\nEnglish translation  : Vol. 1, Book 2, Hadith 167",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated that Ya`la bin Umayyah said:\nl did tawaf with `Umar bin al-Khattab, and when he was at the corner which is next to the door after the [Black] Stone, I took his hand in order to touch (the corner). He said. Didn`t you do tawaf with the Messenger of Allah (ﷺ)? I said: Yes. He said: Did you see him touch it? I said: No. He said: Then forget about it, for in the Messenger of Allah (ﷺ) you have a good example."
  },
  "5302460": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302460\nIn-book reference  : Book 2, Hadith 168\nEnglish translation  : Vol. 1, Book 2, Hadith 168",
    "url": "https://sunnah.com/ahmad/2",
    "text": "As-Subayy bin Ma`bad was a man from (the tribe of) Banu Taghlib, He said:\nI was a Christian, then I became Muslim. I thought long and hard, and decided to enter ihram for Hajj and `Umrah. I passed by Salman bin Rabee`ah and Zaid bin Soohan in al-`Udhaib, and one of them said: Are you doing both of them? His companion said to him. Let him be; he is more misguided than his came! He [as-Subayy] said: It was as if my camel was on my shoulders [i.e., because he was so upset by their words]. I went to ‘Umar and told him about that. ‘Umar said to me: They did not say anything (that matters); you have been guided to the Sunnah of your Prophet (ﷺ)."
  },
  "5302471": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302471\nIn-book reference  : Book 2, Hadith 169\nEnglish translation  : Vol. 1, Book 2, Hadith 169",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar that he said:\nO Messenger of Allah (ﷺ), I vowed during the jahiliyyah to observe i’tikaf for one night in al-Masjid al-Haram. He said to him: “Fulfil your vow.”"
  },
  "5302472": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302472\nIn-book reference  : Book 2, Hadith 170\nEnglish translation  : Vol. 1, Book 2, Hadith 170",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Subayy bin Ma`bad al-Taghlibi said:\nI had recently converted from Christianity and I wanted to go for jihad or for Hajj, I went to a man of my people whose name was Hudaim, and asked him, and he told me to do Hajj, So I did qiran (Hajj and `Umrah together)."
  },
  "5302480": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302480\nIn-book reference  : Book 2, Hadith 171\nEnglish translation  : Vol. 1, Book 2, Hadith 171",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar said:\nThe prayer when travelling is two rak`ahs, the prayer of [Eid] ul-Adha is two rak`ahs, the prayer of [Eid] ul-Fitr is two rak`ahs and the prayer of Jumu`ah is two rak`ahs, complete not shortened, as stated by Muhammad (ﷺ), Sufyan said: On one occasion Zubaid said: I think he was narrating it from ʼUmar. ‘Abdur-Rahman said: Without a doubt. Yazeed - i.e., bin Haroon bin Abi Laila - said: l heard `Umar."
  },
  "5302490": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302490\nIn-book reference  : Book 2, Hadith 172\nEnglish translation  : Vol. 1, Book 2, Hadith 172",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Zaid bin Aslam from his father from `Umar that:\nHe found a horse that he had given to someone (for jihad) for the sake of Allah being offered for sale in the marketplace, and he wanted to buy it. He asked the Prophet (ﷺ) [about that] and he told him not to do that and said: “Do not take back your charity.`"
  },
  "5302500": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302500\nIn-book reference  : Book 2, Hadith 173\nEnglish translation  : Vol. 1, Book 2, Hadith 173",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Qais said:\nI saw `Umar with a leafless palm branch in his hand, and he was telling the people to sit down, saying: Listen to the words of the successor of the Messenger of Allah (ﷺ). A freed slave of Abu Bakr, whose name was Shadeed, brought the document and read it to the people, He said: Abu Bakr says: Listen to and obey what is in this document, for by Allah I am very sincere towards you, Qais said: And I saw `Umar after that on the minbar."
  },
  "5302510": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302510\nIn-book reference  : Book 2, Hadith 174\nEnglish translation  : Vol. 1, Book 2, Hadith 174",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Imran as-Sulami said:\nI asked Ibn `Abbas about nabeedh, and he said: The Messenger of Allah (ﷺ) forbade nabeedh made in earthenware jars and gourds, Then I met Ibn `Umar and asked him, and he told me - I think it was from ‘Umar - that the Prophet (ﷺ) forbade nabeedh made in earthenware jars and gourds. Sufyan was not sure, Then I met Ibn az-Zubair and asked him, and he said: The Messenger of Allah (ﷺ) forbade nabeedh made in earthenware jars and gourds."
  },
  "5302520": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302520\nIn-book reference  : Book 2, Hadith 175\nEnglish translation  : Vol. 1, Book 2, Hadith 175",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ubaid bin Adam, Abu Maryam and Abu Shu`aib that:\n`Umar bin al-Khattab was in al-Jabiyah and he mentioned the conquest of Baitul-Maqdis (Jerusalem). Then Abu Salamah said: Abu Sinan told me, from `Ubaid bin Adam that he said: I heard `Umar bin al-Khattab say to Ka`b: Where do you think I should pray? He said: It you listen to me, you will pray behind the rock and all of al-Quds (Jerusalem) will be in front of you. `Umar said: You are suggesting something similar to the Jewish way; rather I shall pray where the Messenger of Allah (ﷺ) prayed. He went forward to the qiblah and prayed, then he came and spread his upper garment and swept the place, collecting garbage in his upper garment, and the people swept it too."
  },
  "5302530": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302530\nIn-book reference  : Book 2, Hadith 176\nEnglish translation  : Vol. 1, Book 2, Hadith 176",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated that ‘Umar said:\nI asked the Messenger of Allah (ﷺ) about kalalah and he said: “The verse that was revealed in summer is sufficient for you.` He said: Had I asked the Messenger of Allah (ﷺ) about it, that would have been dearer to me than having red camels."
  },
  "5302540": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302540\nIn-book reference  : Book 2, Hadith 177\nEnglish translation  : Vol. 1, Book 2, Hadith 177",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar that:\nHe went to the Prophet (ﷺ) and said: Sometimes I become junub. He told him to wash his private parts and do wudoo’ as for prayer (i.e., then go to sleep, and do ghusl before Fajr)."
  },
  "5302550": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302550\nIn-book reference  : Book 2, Hadith 178\nEnglish translation  : Vol. 1, Book 2, Hadith 178",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Qaza`ah said:\nI said to Ibn ‘Umar: is the deceased tormented because of the weeping of this living one? He said: ‘Umar narrated to me from the Messenger of Allah (ﷺ), and I did not lie when narrating from `Umar, and `Umar did not lie when narrating from the Messenger of Allah (ﷺ)."
  },
  "5302560": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302560\nIn-book reference  : Book 2, Hadith 179\nEnglish translation  : Vol. 1, Book 2, Hadith 179",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar bin al-Khattab said:\nWhen Abu Bakr and I were with him, the Messenger of Allah (ﷺ) passed by `Abdullah bin Mas`ood, when he was reciting [in prayer]. He stood and listened to his recitation, then ‘Abdullah bowed and prostrated, and the Messenger of Allah (ﷺ) said: `Ask, you will be given; ask, you will be given.` Then the Messenger of Allah (ﷺ) went away and said: “Whoever would like to recite the Qur`an fresh as it was revealed, let him learn it from Ibn Umm `Abd,` Then I went at night to ‘Abdullah bin Mas`ood to tell him the good news of what the Messenger of Allah (ﷺ) had said, and when I knocked on the door - or he said: when he heard my voice - he said: What brings you here at this time? I said: I have come to tell you the glad tidings of what the Messenger of Allah (ﷺ) said. He said: Abu Bakr beat you to it. I said: If he did that, he is always ahead in doing righteous deeds. We never competed in doing good deeds but Abu Bakr beat us to it."
  },
  "5302570": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302570\nIn-book reference  : Book 2, Hadith 180\nEnglish translation  : Vol. 1, Book 2, Hadith 180",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Usair bin Jabir said:\nWhen the people of Yemen came, ‘Umar started asking people in the group, Is there anyone among you from Qaran, until he came to [the tribe of Qaran] and said: Who are you? They said: Qaran. Umar’s reins - or Uwais`s reins - fell and one of them picked them up and gave them to the other. ‘Umar recognized him and said: What is your name? He said: I am Uwais, [ʼUmar] said: Do you have a mother? [Uwais] said: Yes. [ʻUmar] said: Did you have any whiteness [leprosy]? He said: Yes, but I prayed to Allah, may He be glorified and exalted, and He took it away, except for an area the size of a dirham near my navel, so that I would remember my Lord. ‘Umar said to him: Pray for forgiveness for me. He said: Rather you should pray for forgiveness for me; you are the Companion of the Messenger of Allah (ﷺ). ʼUmar (e.) said: I heard the Messenger of Allah (ﷺ) say: `The best of the Tabi`een will be a man called Uwais who has a mother, and he has some whiteness, then he prayed to Allah, may He be glorified and exalted, and He took it away, except for an area the size of a dirham near his navel.” So he prayed for forgiveness for him, then he disappeared in a group of people and no one knew where he ended up. Then he (Uwais) came to Koofah. We used to gather in a circle, remembering Allah, and he would sit with us, and when he spoke of Allah, his words would have an impact on us like that of no one else. And he quoted the hadeeth...\nIt was narrated from Qais or Ibn Qais, a man from Ju`fi, from `Umar bin al-Khattab and he mentioned a Hadeeth similar to that of Affan."
  },
  "5302580": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302580\nIn-book reference  : Book 2, Hadith 181\nEnglish translation  : Vol. 1, Book 2, Hadith 181",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Anas that:\n‘Umar bin al-Khattab said, when Hafsah lamented for him: O Hafsah did you not hear the Messenger of Allah (ﷺ) say: “The one who is lamented for will be tormented`? And Suhaib lamented for him, and `Umar said: O Suhaib, do you not know that `the one who is lamented for will be tormented`?"
  },
  "5302590": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302590\nIn-book reference  : Book 2, Hadith 182\nEnglish translation  : Vol. 1, Book 2, Hadith 182",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Umm ‘Amr the daughter of `Abdullah that she heard `Abdullah bin azZubair narrate that:\nHe heard `Umar bin al-Khattab delivering a khutbah, He [ʼUmar] said: The Messenger of Allah (ﷺ) said: “Whoever wears silk in this world will not wear it in the Hereafter.”"
  },
  "5302600": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302600\nIn-book reference  : Book 2, Hadith 183\nEnglish translation  : Vol. 1, Book 2, Hadith 183",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Abbas said:\nGood men, among whom was `Umar bin al-Khattab, and the best of thern in my view is `Umar, testified before me that the Messenger of Allah (ﷺ) said: `There is no Prayer after two prayers: after Fajr until the sun has risen, and after ‘Asr until the sun has set.`\nQatadah narrated a similar report from Abul-`Aliyah from Ibn `Abbas: Good men testified..."
  },
  "5302610": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302610\nIn-book reference  : Book 2, Hadith 184\nEnglish translation  : Vol. 1, Book 2, Hadith 184",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Tariq bin Shihab that:\nThe Jews said to `Umar. You recite a verse which, is it had been revealed among us, we would have taken that day as a festiva!. ʻUmar said: I know where it was revealed, on what day it was revealed and where the Messenger of Allah (ﷺ) was when it was revealed. It was revealed on the day of `Arafah, when the Messenger of Allah (ﷺ) was standing in `Arafah, Sufyan said: I am not sure whether it was a Friday or not, i.e., `This day, I have perfected your religion for you, completed My Favour upon you, and have chosen for you Islam as your religion.” (al-Ma’idah 5:3)."
  },
  "5302620": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302620\nIn-book reference  : Book 2, Hadith 185\nEnglish translation  : Vol. 1, Book 2, Hadith 185",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Moosa said:\nI came to the Messenger of Allah (ﷺ) when he was in al-Batha` and he said: `What did you enter ihram for?` I said: I have entered ihram for the same as the Prophet (ﷺ) did. He said: `Have you brought a sacrificial animal?` I said: No. He said: “Circumambulate the House and go between as-Safa and al-Marwah, then exit ihraam.” So I circumambulated the House and went between as-Safa and al-Marwah, then I went to a woman of my people and she combed my hair and washed my head. I used to give fatwas on that basis during the caliphate of Abu Bakr and ‘Umar. During one season when I was performing Hajj, a man came to me and said: You do not know the latest fatwa of Ameer al-Mu`mineen concerning the Hajj. I said: O people, if we gave a fatwa, Ameer al-Mu`mineen is coming to you, so follow him in performing Hajj. When he came I said: What is this thing that you have introduced to the rituals [of Hajj]? He said: We see in the Book of Allah that Allah, may He be exalted, says: `And perform properly (i.e. all the ceremonies according to the ways of Prophet Muhammad (ﷺ), the Hajj and ‘Umrah (i.e. the pilgrimage to Makkah) for Allah` [al-Baqarah 2:196], and if we follow the Sunnah of our Prophet (ﷺ), he did not exit ihraam until he offered the sacrifice."
  },
  "5302630": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302630\nIn-book reference  : Book 2, Hadith 186\nEnglish translation  : Vol. 1, Book 2, Hadith 186",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Suwaid bin Ghafalah said:\nI saw `Umar kiss the Black Stone and say: I know that you are a stone and cannot cause harm or bring benefit, but I saw Abul-Qasim (ﷺ) show respect to you."
  },
  "5302640": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302640\nIn-book reference  : Book 2, Hadith 187\nEnglish translation  : Vol. 1, Book 2, Hadith 187",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Amr bin Maimoon said:\n`Umar said [and ‘Abdur-Razzaq said: I heard `Umar]: The mushrikeen used not to depart from Jam` until the sun had risen on (the mountain of) Thabeer [Abdur Razzaq said:], and they used to say, Shine, Thabeer, so that we may leave quickly. So the Prophet (ﷺ) differed from them and departed before the sun rose."
  },
  "5302650": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302650\nIn-book reference  : Book 2, Hadith 188\nEnglish translation  : Vol. 1, Book 2, Hadith 188",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Abbas said:\n`Umar said: Allah, may He be exalted, sent Muhammad (ﷺ) and sent down the Book to him. Among that which was revealed to him was the verse of stoning. We recited it and understood it. But I fear that with the passage of time, some people will say: We do not find the verse of stoning in the Book of Allah, and as a result an obligation that Allah revealed will be forsaken. Stoning is the due punishment in the Book of Allah for those who commit zina, both men and women, if they have been married and if proof is established, or there is a pregnancy or a confession."
  },
  "5302660": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302660\nIn-book reference  : Book 2, Hadith 189\nEnglish translation  : Vol. 1, Book 2, Hadith 189",
    "url": "https://sunnah.com/ahmad/2",
    "text": "`Umar bin al-Khattab said:\nI heard Hisham bin Hakeem reciting Sooratul-Furqan in prayer in a manner other than I recited it, and the Messenger of Allah (ﷺ) had taught it to me. I caught him by his garment and brought him to the Messenger of Allah (ﷺ) , and said: O Messenger of Allah (ﷺ), I heard this man reciting Sooratul Furqan in a manner other than you taught it to me. The Messenger of Allah (ﷺ) said: `Recite it.” He recited it in the manner in which I had heard him recite, and the Messenger of Allah (ﷺ) said: `Thus it was revealed.” Then he said to me: `Recite it.” So I recited it and he said: “Thus it was revealed. This Qur`an has been revealed in seven modes of recitation, so recite whatever is easy for you.`\nIt was narrated that al Miswar bin Makhramah and `Abdur-Rahman bin Abdul-Qari heard ‘Umar say: I passed by Hisham bin Hakeem bin Hizam when he was reciting Sooratul Furqan... and he mentioned a similar hadeeth."
  },
  "5302670": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302670\nIn-book reference  : Book 2, Hadith 190\nEnglish translation  : Vol. 1, Book 2, Hadith 190",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ` Abdullah bin as-Sa`di said:\n‘Umar said to me: Haven`t I been told that you do certain tasks for the state, then when you are given payment you do not accept it? He said: Yes. He said: Why do you do that? He said: I am well off and I have slaves and horses; I want my work to be a charity to the Muslims. He said: Do not do that, for I used to do what you are doing, and the Messenger of Allah (ﷺ) would give me payment, and I would say: Give it someone who is more in need of it than me, And he said: Whatever of this wealth comes to you when you are not hoping for it or asking for it, take it, otherwise do not hanker after it.”\nIt was narrated that as-Sa`ib bin Yazeed said: `Umar met `Abdullah bin as-Sa`di... and he mentioned a similar report, but he said: “Give it in charity,” and he said: “Do not hanker after it.`"
  },
  "5302680": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302680\nIn-book reference  : Book 2, Hadith 191\nEnglish translation  : Vol. 1, Book 2, Hadith 191",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar bin al-Khattab said:\nI gave a horse for the sake of Allah, but its owner neglected it. I thought that he would sell it for a cheap price, but I said to myself, not until I ask the Messenger of Allah (ﷺ) about that. He said: “Do not buy it even if he gives it to you for a dirham, for the one who takes back his charity is like the dog that goes back to its vomit.”"
  },
  "5302690": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302690\nIn-book reference  : Book 2, Hadith 192\nEnglish translation  : Vol. 1, Book 2, Hadith 192",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated that Abu `Ubaid, the freed slave of Ibn Azhar, said:\nI attended Eid with `Umar bin al-Khattab, He came and prayed, then he stood and addressed the people saying: These are two days when the Messenger of Allah (ﷺ) forbade fasting, the day when you break your fast and the other day, when you eat from your sacrifices."
  },
  "5302700": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302700\nIn-book reference  : Book 2, Hadith 193\nEnglish translation  : Vol. 1, Book 2, Hadith 193",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Salim bin ‘Abdullah said:\nʼUmar was a man of protective jealousy, and when he went out to pray, `Atikah bint Zaid would follow him, although he did not like her going out, but he did not like to stop her. He used to narrate that the Messenger of Allah (ﷺ) said: `if your womenfolk ask you for permission to pray in the mosque, do not prevent them.`"
  },
  "5302710": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302710\nIn-book reference  : Book 2, Hadith 194\nEnglish translation  : Vol. 1, Book 2, Hadith 194",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar said:\nWere it not for the coming generations of the Muslims, I would not have conquered any town but I would have divided it as the Messenger of Allah (ﷺ) divided Khaibar."
  },
  "5302720": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302720\nIn-book reference  : Book 2, Hadith 195\nEnglish translation  : Vol. 1, Book 2, Hadith 195",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abul-`Ajfa` as-Sulami said:\nI heard ‘Umar say: Do not make women`s dowries expensive, do not make women`s dowries expensive, for had this been a sign of honour in this world or piety before Allah, the first one of you to do it would have been the Prophet (ﷺ). The Messenger of Allah (ﷺ) did not give any of his wives, and none of his daughters were given, any more than twelve Oasiyyahs [as a dowry. And a man will go to great trouble in order to offer a high dowry to his wife.\nOn one occasion he said: A man would pay his wife a high dowry until he feels resentment towards her and says: You cost me everything I own, even the string to tie a waterskin and hang it up. He [the narrator] said: I was a young Arab boy with a non-Arab mother, and I did not know what a `string` was. `Umar said: And another thing you say of one who is killed in your campaigns and dies that so and so was killed as a martyr, and o and so died as a martyr. But perhaps he loaded the back of his mount with gold and silver for the purpose of trading. So do not say that, rather say what the Prophet (ﷺ) (or what Muhammad) (ﷺ) said: “Whoever is killed or dies for the sake of Allah will be in Paradise.`"
  },
  "5302730": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302730\nIn-book reference  : Book 2, Hadith 196\nEnglish translation  : Vol. 1, Book 2, Hadith 196",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Firas suid:\n`Umar bin al-Khattab gave a speech and said: O people, we used to know you when the Prophet (ﷺ) was among us and revelation was coming down to him; Allah would tell us about you. But now the Prophet (ﷺ) has passed away and revelation has ceased, and now the way to judge you is this whoever among you shows us good conduct, we will think well of him and love him; whoever among you shows us bad conduct, we will think badly of him and hate him for that, and whatever is in your hearts is between you and your Lord. There was a time when I used to think that whoever learned the Qur`an, seeking thereby Allah and (the reward that) is with Him, would be rewarded in the Hereafter, but some men learned Qur`an seeking that which is with people. So seek Allah by learning Qur`an and by your good deeds. By Allah, I do not send my workers to strike you or seize your wealth; rather I send them to you to teach you your religion and Sunnah, whoever has done to him something other than that, let him refer it to me, for by the One in Whose hand is my soul, I shall surely grant him retaliation. `Amr bin al-`As stood up and said: O Ameer al Mu`mineen, do you think if one of the Muslims was in charge of some people and he disciplined one of them, would you allow that one to settle the score with him? He said: Yes, by the One in Whose hand is the soul of `Umar, I would not certainly allow him to settle the score with him. I saw the Messenger of Allah (ﷺ) do that with regard to himself. But do not strike the Muslims and thus humiliate them, and do not keep them away from their wives on campaign for too long and thus expose them to temptation. Do not withhold from them their due rights and cause them to rebel; and do not make them camp in an area with a lot of trees, because that will cause them to be scattered.\nIt was narrated that ‘Abul-`Ajfa` as-Sulami said: I heard ‘Umar say: Do not make women`s dowries expensive,... and he mentioned the same hadeeth."
  },
  "5302741": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302741\nIn-book reference  : Book 2, Hadith 197\nEnglish translation  : Vol. 1, Book 2, Hadith 197",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Abdullah bin Abi Mulaikah said:\nI was sitting beside Ibn ‘Umar, and we were waiting for the funeral of Umm Aban bint `Uthman bin `Affan. `Amr bin `Uthman was also present. Ibn ‘Abbas came, led by a guide, who told him where Ibn ‘Umar was. He came and sat beside me, so I was between them, and we heard a voice from inside the house, Ibn `Umar said: I heard the Messenger of Allah (ﷺ) say: `The deceased is tormented because of the crying of his family.` He said: And `Abdullah understood it as general in meaning. Ibn `Abbas said: We were with Ameer al-Muʼmineen ‘Umar until we came to some arid land, where we found a man who had halted in the shade of a tree. He said to me: Go and find out for me who that man is, I went and found that it was Suhaib. I came back to him and said: You told me to find out for you who that man is; it is Suhaib. He said: Tell him to join us. I said: He has his family with him. He said: Even if he has his family with him [and perhaps Ayyoob said on one occasion:Tell him to join us). When we came to Madinah, it was not long before Ameer al Muʼmineen [ʼUmar} was attacked. Suhaib came, saying O my brother, O my friend! `Umar said: Do you not know, or have you not heard, that the Messenger of Allah (ﷺ) said: `The deceased is tormented because of some of his family`s crying.” “Abdullah understood it as general in meaning, but ‘Umar said: some of [their] weeping. I went to `A`ishah, and I told her what Ibn `Umar had said. She said: No, by Allah, the Messenger of Allah (ﷺ) did not say, “The deceased is tormented because of the weeping of anyone.” Rather he said: “Allah increases the torment of the kafir because of his family`s weeping, and that it is He (Allah) Who makes (whom He wills) laugh, and makes (whom He wills) weep, “And no bearer of burdens shall bear another`s burden` [Al Anʼam 6:164].” Ayyoob said: Ibn Abu Mulaikah said: al-Qasim bin Muhammad told me: When `Aʼishah heard what ʼUmar and Ibn `Umar had said, she said. You are narrating to me from two who are not liars and are not to be suspected of being liars, but one may mishear.\n`Abdullah bin Abi Mulaikah narrated… and he mentioned a hadeeth similar to that of Ayyoob, except that he said: ibn `Umar said to `Amr bin `Uthman, when he was facing him: Why don`t you tell them not to weep? For the Messenger of Allah (ﷺ) said: `The deceased is tormented because of his family`s weeping for him.`"
  },
  "5302742": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302742\nIn-book reference  : Book 2, Hadith 198\nEnglish translation  : Vol. 1, Book 2, Hadith 198",
    "url": "https://sunnah.com/ahmad/2",
    "text": "`Abdullah bin Abi Mulaikah said:\nA daughter of `Uthman bin `Affan died in Makkah and Ibn `Umar and Ibn `Abbas attended her funeral. I was sitting between them and ibn `Umar said to ‘Amr bin `Uthman, who was facing him: why don`t you tell them not to weep? For I heard the Messenger of Allah (ﷺ) say: `The deceased is tormented because of his family`s weeping for him.` And he mentioned a hadeeth similar to that of Isma`eel from Ayyoob from Ibn Abu Mulaikah."
  },
  "5302750": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302750\nIn-book reference  : Book 2, Hadith 199\nEnglish translation  : Vol. 1, Book 2, Hadith 199",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Abbas said:\n`Umar (رضي الله عنه) said: I was marching with a group of people on a campaign with the Messenger of Allah (ﷺ), and I swore, saying: No, by my father. A man behind me called out: “Do not swear by your fathers.` I turned around and saw it was the Messenger of Allah (ﷺ)."
  },
  "5302760": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302760\nIn-book reference  : Book 2, Hadith 200\nEnglish translation  : Vol. 1, Book 2, Hadith 200",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Malik bin Aws bin al-Hadathan said:\n`Umar would swear an oath three times, saying: By Allah, no one has more right to this wealth than anyone else, I have no more right to it than anyone else; there is no Muslim who does not have a share in this wealth, except a slave, but it is to be divided according to our categories in the light of the Book of Allah and our closeness to the Messenger of Allah (ﷺ). Thus it is to be given on the basis of a man`s efforts for the sake of lslam, his seniority in Islam, his support for Islam, and his need. By Allah, if I live, a shepherd in the mountains of San‘a’ will get his share of that wealth when he is tending his flock."
  },
  "5302770": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302770\nIn-book reference  : Book 2, Hadith 201\nEnglish translation  : Vol. 1, Book 2, Hadith 201",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abul-Mukhariq Zuhair bin Salim narrated that `Umair bin Sa`d al-Ansari was appointed by `Umar as governor of Hims... and he mentioned the hadeeth `Umar said to Ka`b:\nI am going to ask you about something, so do not hide it from me. [Ka`b said: By Allah I will not hide anything I know. ‘Umar said: What do you fear most for the ummah of Muhammad (ﷺ)? He said: Misleading leaders. `Umar said: The Messenger of Allah (ﷺ) told me about that in private and informed me of it."
  },
  "5302780": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302780\nIn-book reference  : Book 2, Hadith 202\nEnglish translation  : Vol. 1, Book 2, Hadith 202",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Salim said:\nI heard `Abdullah bin `Umar say: `Umar said: Send me a doctor to examine this wound of mine. So they sent for an Arab doctor who gave ʼUmar nabeedh, and the nabeedh was mixed with blood when it came out of the stab wound that was beneath his navel. I [Ibn ‘Umar) called another doctor from among the Ansar, from the tribe of Banu Mu`awiyah. He gave him milk to drink and it came out of the wound solid and white, The doctor said to him: O Ameer al Mu’mineen, give your final instructions, `Umar said: The man from Banu Mu`awiyah has spoken the truth. If you had said anything else I would not have believed you. The people wept for him when they heard that, but he said: Do not weep for us; whoever wants to weep, let him leave. Did you not hear what the Messenger of Allah (ﷺ) said? He said: `The deceased is tormented by his family`s weeping for him.` Because of that, `Abdullah did not approve of any weeping if one of his sons or anyone else died."
  },
  "5302790": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302790\nIn-book reference  : Book 2, Hadith 203\nEnglish translation  : Vol. 1, Book 2, Hadith 203",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Amr bin Maimoon said:\nl heard `Umar bin al Khattab say: The people of Jahiliyyah used not to move on from Jam` until they saw the sun shining on (the mountain of) Thabeer, and they would say: Shine Thabeer, then we will move on swiftly. So the Messenger of Allah (ﷺ) moved on before the sun rose."
  },
  "5302800": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302800\nIn-book reference  : Book 2, Hadith 204\nEnglish translation  : Vol. 1, Book 2, Hadith 204",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from al Miswar bin Makhrarnah and `Abdur-Rahman bin Abdul-Qari that they heard Umar bin al Khattab say:\nI passed by Hisham bin Hakeem bin Hizam when he was reciting Sooratal-Furqan during the lifetime of the Messenger of Allah (ﷺ), I listened to his recitation and he was reciting in a manner different from the way in which the Messenger of Allah (ﷺ) had taught me to recite it. I was about to interrupt him whilst he was praying, but I waited until he finished his prayer, and then I tied his garment around his neck. I said to him: Who taught you this soorah that you are reciting? He said: The Messenger of Allah (ﷺ) taught it to me. I said to him: You are lying by Allah! He taught me this soorah that you recited. I brought him to the Messenger of Allah (ﷺ) and said, `O Messenger of Allah (ﷺ), I heard this man reciting Sooratal-Furqan in a way different to the way you taught it to me, and you taught me Sooratal-Furqan, The Prophet (ﷺ) said: Let him go, O `Umar: Recite it, O Hisham. So he recited it to him as I had heard him recite it. The Messenger of Allah (ﷺ) said, `Thus it was revealed.` Then he said to me, `Recite it,” so I recited it and he said, “Thus it was revealed.` Then the Messenger of Allah (ﷺ) is said: `This Qur`an has been revealed in seven different ways, so recite it in the way that is easiest for you.”\nIt was narrated from al Miswar bin Makhramah and `Abdur-Rahman bin Abdul-Qari that they heard Umar bin al Khattab say: I passed by Hisham bin Hakeem bin Hizam when he was reciting Sooratal-Furqan during the lifetime of the Messenger of Allah (ﷺ). I listened to his recitation and he was reciting in a way different from the way in which the Messenger of Allah (ﷺ) had taught me to recite it. I was about to interrupt him whilst he was praying, but I waited until he said the tasleem, and when he had said the tasleem,... and he narrated a similar report."
  },
  "5302810": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302810\nIn-book reference  : Book 2, Hadith 205\nEnglish translation  : Vol. 1, Book 2, Hadith 205",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Abbas said:\n`Umar said: The Messenger of Allah (ﷺ) said: “Whoever among you is seeking Lailatul Qadr, let him seek it in the odd-numbered nights of the last ten days of Ramadan.`"
  },
  "5302820": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302820\nIn-book reference  : Book 2, Hadith 206\nEnglish translation  : Vol. 1, Book 2, Hadith 206",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn ʻUrmar that It was said to `Umar:\nWhy don`t you appoint a successor? He said: If I do not do that, one who is better than me did not do it either, namely the Messenger of Allah (ﷺ); if I do that, one who is better than me did it too, namely Abu Bakr."
  },
  "5302830": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302830\nIn-book reference  : Book 2, Hadith 207\nEnglish translation  : Vol. 1, Book 2, Hadith 207",
    "url": "https://sunnah.com/ahmad/2",
    "text": "`Alqamah bin Waqqas al Laithi said that he heard `Umar bin al-Khattab addressing the people, and he said:\nI heard the Messenger of Allah (ﷺ) say: “Action is but by intention and each person will have but that which he intended. So whoever migrated for the sake of Allah and His Messenger, then his migration was for the sake of Allah and His Messenger, whoever migrated for some worldly purpose or for the sake of a woman whom he could marry, his migration was for the purpose for which he migrated.”"
  },
  "5302840": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302840\nIn-book reference  : Book 2, Hadith 208\nEnglish translation  : Vol. 1, Book 2, Hadith 208",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from `Umar bin al-Khattab that he said:\nWear izars and rida`s and wear shoes, but take off boots and pants; throw away the stirrups and jump onto your mounts. You should wear rough clothes and practise archery, and keep away from luxury and the dress of the non-Arabs, Beware of silk, for the Messenger of Allah (ﷺ) forbade it and said: `Do not wear silk except this much` - and the Messenger of Allah (ﷺ) gestured with two fingers."
  },
  "5302850": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302850\nIn-book reference  : Book 2, Hadith 209\nEnglish translation  : Vol. 1, Book 2, Hadith 209",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Sa’eed bin al-Musayyab that `Umar bin al-Khattab رضي الله عنه said:\nBeware of overlooking the verse of stoning and (do not let) anyone say: “We do not find two hadd punishments in the Book of Allah, for I saw the Messenger of Allah (ﷺ) stone [adulterers] and we stoned [them] after he was gone."
  },
  "5302860": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302860\nIn-book reference  : Book 2, Hadith 210\nEnglish translation  : Vol. 1, Book 2, Hadith 210",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Al-`Awwam narrated:\nan old man who was guarding the coast told me: I met Abu Salih, the freed slave of `Umar bin al-Khattab (رضي الله عنه) and he said, `Umar bin al-Khattab (رضي الله عنه) told us that the Messenger of Allah (ﷺ) said: “There is no night in which the sea does not approach the land three times and ask Allah for permission to flood it, but Allah, may He be glorified and exalted, restrains it.`"
  },
  "5302870": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302870\nIn-book reference  : Book 2, Hadith 211\nEnglish translation  : Vol. 1, Book 2, Hadith 211",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Anas bin Seereen said:\nI asked Ibn `Umar about his wife whom he divorced. He said: I divorced her when she was menstruating, and I told ‘Umar about that, and he told the Prophet (ﷺ) , who said: `Tell him to take her back, then when she becomes pure, he may divorce her when she is pure.” He said: So I took her back, then I divorced her when she was pure. I said: Was that divorce that you gave her when she was menstruating counted as such?` He said: Why wouldn`t I count it? It must be counted even if I failed and acted foolishly."
  },
  "5302880": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302880\nIn-book reference  : Book 2, Hadith 212\nEnglish translation  : Vol. 1, Book 2, Hadith 212",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abul’Ala’ ash-Shami said:\nAbu Umamah put on a new garment, and when it reached his collarbone he said: Praise be to Allah Who has clothed me with that which conceals my `awrah and with which I may beautify myself in my life. Then he said: I heard `Umar bin al-Khattab (رضي الله عنه) say: The Messenger of Allah (ﷺ) said: `Whoever gets a new garment, and puts it on and says, when it reaches his collarbone, `Praise be to Allah Who has clothed me with that which conceals my ‘awrah and with which I may beautify myself in my life,` then takes the garment that is worn out or that he took off - and gives it in charity, will be in the care of Allah, may He be exalted, and under the protection of Allah in life and in death, in life and in death, in life and in death.`"
  },
  "5302890": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302890\nIn-book reference  : Book 2, Hadith 213\nEnglish translation  : Vol. 1, Book 2, Hadith 213",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn `Umar that `Umar bin al-Khattab (رضي الله عنه) said:\nI asked the Messenger of Allah (ﷺ) : O Messenger of Allah (ﷺ), if one of us wants to sleep before doing ghusl when he is junub, what should he do? He said: `Let him do wudoo’ as for prayer, then sleep.”"
  },
  "5302900": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302900\nIn-book reference  : Book 2, Hadith 214\nEnglish translation  : Vol. 1, Book 2, Hadith 214",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘AbdurRahman bin Abi Laila said:\nI was with al-Bara` bin `Azib and `Umar bin al-Khattab (رضي الله عنه) in al-Baqee, looking for the new moon, when a rider came and was met by `Umar (رضي الله عنه), who said: Where have you come from? He said: From the Bedouins. He said: Have you sighted the moon? He said: Yes. ‘Umar said: Allah Akbar! Verily one man`s (testimony) is enough for the Muslims. Then ‘Umar got up and did wudoo`, and he wiped over his leather slippers, then he prayed Maghrib. Then he said. This is what I saw the Messenger of Allah (ﷺ) do. Abun-Nadr said. He was wearing a jubbah with tight sleeves, and he brought his arm out from beneath it and wiped over his leather slippers."
  },
  "5302910": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302910\nIn-book reference  : Book 2, Hadith 215\nEnglish translation  : Vol. 1, Book 2, Hadith 215",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Labeed said:\nA man called Bairah bin Asad went out from Tahiyah, migrating [Hijrah], and he reached Madinah a few days after the Messenger of Allah (ﷺ) died ‘Umar (رضي الله عنه) saw him and realized he was a stranger, so he said to him. Who are you? Are you from Oman? He said: Yes. He took him by the hand and brought him to Abu Bakr (رضي الله عنه) and said: This man is from the land of which heard the Messenger of Allah (ﷺ) saying: `I know a land called Oman at the edge of the sea, in it is a tribe of the Arabs who, if my envoy goes to them, they will not shoot arrows or throw stones at him.”"
  },
  "5302920": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302920\nIn-book reference  : Book 2, Hadith 216\nEnglish translation  : Vol. 1, Book 2, Hadith 216",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn ʼUmar that ‘Umar (رضي الله عنه) - and I think he attributed it to the Prophet (ﷺ) said:\n`Allah, may He be blessed and exalted - says: `Whoever humbles himself before Me like that” – and he turned his palm down towards the ground like that, very close to the ground - ` I will raise him in status like this` - and he turned his palm up towards the heaven and raised his hand like that."
  },
  "5302930": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302930\nIn-book reference  : Book 2, Hadith 217\nEnglish translation  : Vol. 1, Book 2, Hadith 217",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu `Uthman an-Nahdi said:\nl was sitting beneath the minbar of `Umar (رضي الله عنه) when he was addressing the people, and he said in his khutbah:I heard the Messenger of Allah (ﷺ) say: “What I fear the most for this ummah is every knowledgeable hypocrite with a smooth tongue.”"
  },
  "5302940": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302940\nIn-book reference  : Book 2, Hadith 218\nEnglish translation  : Vol. 1, Book 2, Hadith 218",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Muslim bin Yasar al-Juhani that `Umar bin al-Khattab was asked about this verse:\n`And (remember) when your Lord brought forth from the Children of Adam, from their loins` [al-A`raf 7:172], `Umar (رضي الله عنه) said: I heard the Messenger of Allah (ﷺ) being asked about it and the Messenger of Allah (ﷺ) said: `Allah created Adam, then He passed His right hand over his loins and brought forth from him his offspring and said: I have created these for Paradise and they will do the deeds of the people of Paradise. Then He passed (His hand) over his loins and brought forth from him his offspring and said: I have created these for Hell and they will do the deeds of the people of Hell.” A man said: O Messenger of Allah (ﷺ), why then should we strive? The Messenger of Allah (ﷺ) said: `When Allah creates a person for Paradise, He causes him to do the deeds of the people of Paradise until he dies doing one of the deeds of the people of Paradise and is admitted to Paradise thereby. And when He creates a person for Hell, He causes him to do the deeds of the people of Hell until he dies doing one of the deeds of the people of Hell and is admitted to Hell thereby.”"
  },
  "5302950": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302950\nIn-book reference  : Book 2, Hadith 219\nEnglish translation  : Vol. 1, Book 2, Hadith 219",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Salim bin `Abdullah bin `Umar (رضي الله عنه)l from his father that one of the companions of the Messenger of Allah (ﷺ) entered the mosque one Friday when `Umar bin al-Khattab was standing and addressing the people, `Umar said:\nWhat time is this? He said:O Ameer al-Mu’mineen, I came back from the market and as soon as I heard the call to prayer, I did no more than wudoo,’ and came here. ‘Umar said: Just wudooʻ. when you know that the Messenger of Allah (ﷺ) used to enjoin us to do ghusl?"
  },
  "5302960": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302960\nIn-book reference  : Book 2, Hadith 220\nEnglish translation  : Vol. 1, Book 2, Hadith 220",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ya`la bin Umayyah said:\nI circumambulated (the Ka’bah] with `Umar bin al-Khattab (رضي الله عنه) and he touched the corner, Ya`la said: I was next to the House and when I reached the western corner which is next to the Black Stone, I took his hand to touch it and he said: What is the matter with you? I said. Aren`t you going to touch it? He said: Did you not do tawaf with the Messenger of Allah (ﷺ) ? I said: Yes indeed. He said: Did you see him touch these two western corners? I said: No. He said: Don`t you have a good example in him? I said: Yes indeed. He said: Then stop bothering about that."
  },
  "5302970": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302970\nIn-book reference  : Book 2, Hadith 221\nEnglish translation  : Vol. 1, Book 2, Hadith 221",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Malik bin Aws bin al-Hadathan said:\nl brought some dinars of mine and wanted to exchange them. Talhah bin ‘Ubaidullah met me and we agreed to an exchange. Then he took them and said: Wait until my storekeeper comes - Abu `Amir said. From al-Ghalal (a place). And he said concerning it. All of it should be ‘Take this’ and `take this` [i.e., exchanged on the spot]. - I asked ‘Umar bin al-Khattab (رضي الله عنه) about that and he said: I heard the Messenger of Allah (ﷺ) say: `Silver for gold is riba, unless it is exchanged on the spot, wheat for wheat is riba, unless it is exchanged on the spot; barley for barley is riba, unless it is exchanged on the spot dates for dates is ribu unless it is exchanged on the spot.”"
  },
  "5302980": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302980\nIn-book reference  : Book 2, Hadith 222\nEnglish translation  : Vol. 1, Book 2, Hadith 222",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Sa’eed bin al-Musayyab that `Umar (رضي الله عنه) said:\nThe Messenger of Allah (ﷺ) said: `The deceased is tormented because of the weeping of his family over him.”"
  },
  "5302990": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5302990\nIn-book reference  : Book 2, Hadith 223\nEnglish translation  : Vol. 1, Book 2, Hadith 223",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Adi bin Hatim said:\nI came to Umar bin al Khattab with some of my people and he starting giving to each man of Tayy two thousand, and he ignored me, I tried to come in front of him and he turned away from me, then I came from the direction he was facing and he turned away from me. Then I said: O Ameer al-Mu`mineen, do you recognize me? He smiled and leaned backwards, then he said: Yes, by Allah! I know that you believed when they disbelieved, and you came when they turned away, and you remained loyal when they betrayed. The first sadaqah (zakah) that brightened the face of the Messenger of Allah (ﷺ) and the faces of his Companions was the sadaqah of Tayy that you brought to the Messenger of Allah (ﷺ)\nThen he began to apologize, then he said: I am only giving to people who are extremely poor and they are the leaders of their tribes and have responsibilities."
  },
  "5303000": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303000\nIn-book reference  : Book 2, Hadith 224\nEnglish translation  : Vol. 1, Book 2, Hadith 224",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Zaid bin Aslam, from his father who said:\nI heard `Umar bin al-Khattab say: Why are we running now and uncovering our shoulders (in tawaf) when Allah has caused Islam to prevail and has eliminated kufr and its people? Whatever the case, we will never give up something that we did at the time of the Messenger of Allah (ﷺ)."
  },
  "5303010": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303010\nIn-book reference  : Book 2, Hadith 225\nEnglish translation  : Vol. 1, Book 2, Hadith 225",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated that Abul Aswad al-Deeli said:\nWhen I came to Madinah, sickness was occurring in the city. `Abdus-Samad said: They were dying quickly. I sat with `Umar bin al-Khattab and a funeral passed by. Good things were said about (the deceased) and ‘Umar said: It is due. Then another (funeral) passed by: good things were said about (the deceased) and he said: It is due, Then another funeral passed by: bad things were said about the deceased and ‘Umar said: It is due, I said: What is due, O Ameer al Mu`mineen? He said: I say what the Messenger of Allah (ﷺ) said: “Any Muslim in whose favour four people testify, Allah will admit him to Paradise.` We said: Or three? He said: “Or three.` We said: Or two? He said: “Or two.` Then we did not ask him about one."
  },
  "5303020": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303020\nIn-book reference  : Book 2, Hadith 226\nEnglish translation  : Vol. 1, Book 2, Hadith 226",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Abu Hurairah said:\nWhilst `Umar bin al-Khattab was delivering a khutbah, a man came and sat down, `Umar said: Why are you coming late to Jumu’ah? The man said: O Ameer al-Mu`mineen, as soon as I heard the call I did wudoo`, then I came. `Umar said: Only wudoo? Didn`t you hear the Messenger of Allah (ﷺ) say: `When one of you goes to Jumu’ah, let him do ghusl`?\nAbu Salamah narrated that Abu Hurairah (...) told him that whilst ‘Umar was delivering the khutbah... and he narrated a similar report."
  },
  "5303030": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303030\nIn-book reference  : Book 2, Hadith 227\nEnglish translation  : Vol. 1, Book 2, Hadith 227",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from `Imran bin Hittan, according to what Harb thinks, who asked Ibn `Abbas about silk garments. He said:\nAsk `A`ishah about that. So he asked `A`ishah and she said: Ask Ibn `Umar (...). So he asked Ibn `Umar, and he said: Abu Hafs told me that the Messenger of Allah (ﷺ) said: `Whoever wears silk in this world will have no share of it in the Hereafter.”"
  },
  "5303040": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303040\nIn-book reference  : Book 2, Hadith 228\nEnglish translation  : Vol. 1, Book 2, Hadith 228",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Humaid bin Abdur-Rahman al-Himyari that Ibn `Abbas said in Basrah; I was the first one to come to ‘Umar when he was stabbed. He said:\nLearn from me three things, for I fear that the people will not come to me (before I die). As for me, I did not pass any judgement regarding kalalah and I did not appoint any successor to be in charge of the people after me, and every slave of his [Umar`s] will be free. The people said to him: Appoint a successor. He said: Whatever I do, it was done by someone better than me. If I leave the people to decide their affairs, the Prophet (ﷺ) of Allah did that, and if I appoint someone, one who is better than me did that, namely Abu Bakr, I said to him: Receive the glad tidings of Paradise; you accompanied the Messenger of Allah (ﷺ), your companionship with him was long; you were appointed in charge of the believers and you showed strength and fulfilled the trust. He said. As for your glad tidings to me of Paradise - `Affan [another narrator] said: No by Allah besides Whom there is no god- if I had the entire world and all that is in it, I would give it as a ransom from the terror of what lies before me, even before knowing the outcome. As for what you say about me being in charge of the believers` affairs, by Allah I wish that I could get out of it without gaining or losing anything. As for what you said about me accompanying the Prophet (ﷺ) of Allah, that is true."
  },
  "5303050": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303050\nIn-book reference  : Book 2, Hadith 229\nEnglish translation  : Vol. 1, Book 2, Hadith 229",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Unma mah bin Sahl said:\n‘Umar wrote to AbuʼUbaidah bin al-Jarrah [saying]: Teach your children swimming and teach your fighters archery. After that they used to practise archery frequently, then a stray arrow came and killed a boy, and no one knew where it came from; he was under the care of his maternal uncle. Abu `Ubaidah wrote to `Umar about that [asking]: To whom should I pay his diyah? ‘Umar wrote back telling him that the Messenger of Allah (ﷺ) used to say: “Allah and His Messenger are the mawla (guardian) of the one who has no mawla, and the maternal uncle is the heir of the one who has no heir.”"
  },
  "5303060": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303060\nIn-book reference  : Book 2, Hadith 230\nEnglish translation  : Vol. 1, Book 2, Hadith 230",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar bin al-Khattab said:\nI heard the Messenger of Allah (ﷺ) say: `The loyalty (wala`) of a freed slave (to his former master) is passed on to the one who inherits his wealth, father or son.”"
  },
  "5303070": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303070\nIn-book reference  : Book 2, Hadith 231\nEnglish translation  : Vol. 1, Book 2, Hadith 231",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Abis bin Rabee’ah said:\nI saw `Umar go to the Black Stone and say: By Allah, I know that you are a stone and cannot cause harm or bring benefit. Were it not that I saw the Messenger of Allah (ﷺ) kiss you, I would not have kissed you. Then he leant down and kissed it."
  },
  "5303080": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303080\nIn-book reference  : Book 2, Hadith 232\nEnglish translation  : Vol. 1, Book 2, Hadith 232",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Dujain Abul-Ghusn, who was from Basrah, said:\nI came to Madinah and met Aslam, the freed slave of `Umar bin al-Khattab. I said. Tell me(a report)from `Umar. He said: I cannot, I am afraid that I will add or subtract something. If we said to ‘Umar, Tell us something from the Messenger of Allah (ﷺ), he would say: I am afraid that I may add or subtract a letter. The Messenger of Allah (ﷺ) said: “Whoever tells a lie about me will be in Hell.`"
  },
  "5303090": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303090\nIn-book reference  : Book 2, Hadith 233\nEnglish translation  : Vol. 1, Book 2, Hadith 233",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Umar said:\nThe Messenger of Allah (ﷺ) said: “Whoever says in a marketplace, There is no God but Allah alone, with no partner or associate, His is the dominion, to Him all praise is due, all goodness is in His hand, He grants life and death and He has power overall things,` Allah will record for him one thousand thousand good deeds and will erase from him one thousand thousand bad deeds, and will build a house for him in Paradise.`"
  },
  "5303100": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303100\nIn-book reference  : Book 2, Hadith 234\nEnglish translation  : Vol. 1, Book 2, Hadith 234",
    "url": "https://sunnah.com/ahmad/2",
    "text": "`Umar bin al-Khattab (s) said:\nOn the day of Khaibar, a group of the companions of the Messenger of Allah (ﷺ) said: So and so is a martyr, So and so is a martyr, until they passed by a man and said: So and so is a martyr. The Messenger of Allah (ﷺ) said: `No, I saw him being dragged to Hell because of a cloak that he stole from the booty. Go out and call out to the people, “No one will enter Paradise except the believers.` So I went out and called out: No one will enter Paradise except the believers."
  },
  "5303110": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303110\nIn-book reference  : Book 2, Hadith 235\nEnglish translation  : Vol. 1, Book 2, Hadith 235",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Sa`d bin ʼUbaidah, from Ibn ‘Umar, that `Umar said:\nNo, by my father. The Messenger of Allah (ﷺ) said: “Stop it! whoever swears by anything other than Allah has committed an act of shirk.`"
  },
  "5303120": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303120\nIn-book reference  : Book 2, Hadith 236\nEnglish translation  : Vol. 1, Book 2, Hadith 236",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Nafi’ that ‘Umar added to the mosque the area between the pillar and the enclosure, and ‘Uthman added[|something to the mosque], `Umar said:\nWere it not for the fact that I heard the Messenger of Allah (ﷺ) say. `We want to extend our mosque,” I would not have added anything to it."
  },
  "5303130": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303130\nIn-book reference  : Book 2, Hadith 237\nEnglish translation  : Vol. 1, Book 2, Hadith 237",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar that he said:\nAllah, may He be glorified and exalted, sent Muhammad (ﷺ) with the truth, and He sent down with him the Book. One of the things that were revealed to him was the verse of stoning. The Messenger of Allah (ﷺ) stoned [adulterers] and we stoned [them] after him. Then he said: We used to recite, `Do not forsake your real father (and attribute yourself to someone else), for this is an act of kufr, if you do that, or it is an act of kufr to forsake your real father (and attribute yourself to someone else).` And the Messenger of Allah (ﷺ) said: `Do not praise me as the son of Maryam was praised; rather I am a slave, so say: His slave and His Messenger.` Perhaps Ma`mar said: `As the Christians praised the son of Maryam.”"
  },
  "5303140": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303140\nIn-book reference  : Book 2, Hadith 238\nEnglish translation  : Vol. 1, Book 2, Hadith 238",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Salim from Ibn ‘Umar that he said to `Umar:\nI heard the people saying something so I decided that I should talk to you. They are saying that you are not going to appoint a successor. He lowered his head for a while, then he looked up and said: Allah, may He be glorified and exalted, will protect His religion. If I do not appoint a successor, the Messenger of Allah (ﷺ) did not appoint a successor either; if I do appoint a successor, Abu Bakr appointed a successor. By Allah, once he mentioned the Messenger of Allah (ﷺ) and Abu Bakr, I realized that he was not going to regard anyone else as equal to the Messenger of Allah (ﷺ) and that he was not going to appoint a successor."
  },
  "5303150": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303150\nIn-book reference  : Book 2, Hadith 239\nEnglish translation  : Vol. 1, Book 2, Hadith 239",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Malik bin Aws that al-Hadathan said:\n‘Umar sent word to me... and he mentioned the hadeeth. I said to you both]: The Messenger of Allah (ﷺ) said: `We are not to be inherited from and what we leave behind is charity.`"
  },
  "5303160": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303160\nIn-book reference  : Book 2, Hadith 240\nEnglish translation  : Vol. 1, Book 2, Hadith 240",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn al Musayyab said:\nWhen Abu Bakr died, people wept for him. `Umar said: The Messenger of Allah (ﷺ) said: `The deceased is tormented because of the weeping of the living.”"
  },
  "5303170": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303170\nIn-book reference  : Book 2, Hadith 241\nEnglish translation  : Vol. 1, Book 2, Hadith 241",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Abu Hurairah said:\nWhen the Messenger of Allah (ﷺ) died and some people apostatised, ‘Umar bin al-Khattab said: O Abu Bakr, how can you fight the people, when the Messenger of Allah (ﷺ) said: “I have been commanded to fight the people until they say La ilaha illallah (There is no god but Allah), and whoever says La ilaha illallah, his wealth and his life are protected from me, and his reckoning will be with Allah`? Abu Bakr said: I will most certainly fight those who separate prayer and zakah, for zakah is what is due on wealth. By Allah, if they withhold from me a small she-goat that they used to give to the Messenger of Allah (ﷺ), I will certainly fight them for withholding it. ʻUmar said: By Allah, as soon as I saw that Allah had opened Abu Bakr`s heart to the idea of fighting I knew that he was right."
  },
  "5303180": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303180\nIn-book reference  : Book 2, Hadith 242\nEnglish translation  : Vol. 1, Book 2, Hadith 242",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar said:\nThe Messenger of Allah (ﷺ) said: `We are not to be inherited from; what we leave behind is charity.`"
  },
  "5303190": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303190\nIn-book reference  : Book 2, Hadith 243\nEnglish translation  : Vol. 1, Book 2, Hadith 243",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Malik bin Aws said:\n‘Umar sent for me... and he mentioned a similar hadeeth. He said: The wealth of Banun-Nadeer was among the fai` that Allah granted to His Messenger for which the Muslims made no expedition with either cavalry or camelry (cf. al-Hashr 59:6). He allocated some of it for his family`s maintenance for one year, and what was left he spent on horses and weapons in preparation for jihad for the sake of Allah, may He be glorified and exalted."
  },
  "5303200": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303200\nIn-book reference  : Book 2, Hadith 244\nEnglish translation  : Vol. 1, Book 2, Hadith 244",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from `Asim bin ‘Umar from his father that the Prophet (ﷺ) said:\n`When night comes and day departs and the sun sets, the fasting person may break his fast.”"
  },
  "5303210": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303210\nIn-book reference  : Book 2, Hadith 245\nEnglish translation  : Vol. 1, Book 2, Hadith 245",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Abbas said:\nI wanted to ask `Umar something but I did not find a chance, so I waited for two years. Then when we were in Marraz-Zahran, he went to relieve himself, then he came after relieving himself and I poured water for him, I said: O Ameer al-Mu`mineen, who are the two women who helped one another against the Messenger of Allah (ﷺ)`? He said: `A`ishah and Hafsah.\n` As mentioned in the Qur`an: `If you two (wives of the Prophet (ﷺ)) turn in repentance to Allâh. (it will be better for you), your hearts are indeed so inclined to oppose what the Prophet (ﷺ) likes); but if you help one another against him (Muhammad (ﷺ)). then verily, Allâh is his Maula (Lord, or Master, or Protector), and Jibril (Gabriel). and the righteous among the believers, and furthermore, the angels are his helpers`\n(surah at-Tahreem 66:3)"
  },
  "5303220": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303220\nIn-book reference  : Book 2, Hadith 246\nEnglish translation  : Vol. 1, Book 2, Hadith 246",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn Seereen, who heard it from Abul-`Ajifa` who said:\nI heard `Umar say: Do not make women`s dowries too expensive, for if it were a sign of honour in this world or a sign of piety in the Hereafter, the most likely of you to do it would have been the Prophet (ﷺ). But he did not give any of his daughters in marriage or marry any of his wives for more than twelve Ooqiyyah, Furthermore, you say during your campaigns. So and so was killed as a martyr, So and so died as a martyr, but perhaps he loaded his mount`s back with gold and silver, hoping to do trade. So do not say that; rather say as Muhammad said: “Whoever died for the sake of Allah is in Paradise.”"
  },
  "5303230": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303230\nIn-book reference  : Book 2, Hadith 247\nEnglish translation  : Vol. 1, Book 2, Hadith 247",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ma`dari bin Abi Talhah al-Ya`rnari that `Umar stood up to deliver a khutbah. He praised and glorified Allah, then he mentioned the Prophet (ﷺ) of Allah and Abu Bakr, then he said:\n`I have seen a dream, in which I saw myself being pecked by a rooster twice, and I think it signals my death. The people are telling me to appoint a caliph after me. Allah will not cause His caliphate or His religion to be lost, or that with which He sent His Prophet (ﷺ). If I die, then the caliphate is to be decided by a council of these six men with whom the Messenger of Allah (ﷺ) was pleased when he died, then whichever of them you swear allegiance to, listen to him and obey. I know that there are some men then who will seek to undermine this matter, and I have sought them with these two hands of mine in support of Islam. It they do that, then those are the enemies of Allah, the misguided disbelievers. By Allah, I am not leaving behind anything of more concern to me than kalalah. I asked the Prophet (ﷺ) of Allah about it and he never spoke to me in such a harsh manner as he did with regard to that, to such an extent that he poked me in the chest or side with his hand or his finger and said: `O `Umar: The verse at the end of Soorah an Nisa’ that was revealed in summer is sufficient for you.” If I live, I will pass a judgement concerning it that no one who reads Qur`an or who does not read Qur`an will dispute. Then `Umar said: O Allah, bear witness concerning the governors of the regions; I sent them to teach the people their religion and the Sunnah of their Prophet (ﷺ), and to divide the sai` among them, and to judge between them on a fair basis, and whatever they found difficult they were to refer to me. Then he said: O people, you eat two plants that I think are nothing but distasteful, this garlic and onion. At the time of the Messenger of Allah (ﷺ), I would see that is the smell of these things was found on a man, he would be taken by the hand and led out to al-Baqee`. Whoever must eat them, let him cook them to death.ʻUmar said this in a khutbah on Friday, and was stabbed on Wednesday 26 Dhul Hijjah."
  },
  "5303240": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303240\nIn-book reference  : Book 2, Hadith 248\nEnglish translation  : Vol. 1, Book 2, Hadith 248",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Moosa that `Umar said:\nIt was the Sunnah of the Messenger of Allah (ﷺ), i.e., tamattu` (in Hajj), but I am afraid that they will have intimate relations with them (their wives) beneath the Arak trees, then they will bring them for Hajj."
  },
  "5303250": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303250\nIn-book reference  : Book 2, Hadith 249\nEnglish translation  : Vol. 1, Book 2, Hadith 249",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ʼUmar said:\nI saw the Messenger of Allah (ﷺ) doing wudoo after relieving himself, and wiping over his leather slippers (khuff), then praying."
  },
  "5303260": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303260\nIn-book reference  : Book 2, Hadith 250\nEnglish translation  : Vol. 1, Book 2, Hadith 250",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Simak said:\nI heard ‘Iyad al-Ash`ari say: i was present at al-Yarmouk and we had five commanders over us: Abu `Ubaidah bin al-Jarrah, Yazeed bin Abi Sufyan, Ibn Hasanah, Khalid bin al-Waleed and `Iyad - and this `Iyad was not the one who narrated reports to Simak. - `Umar (رضي الله عنه) said: If fighting occurs, then your commander is Abu `Ubaidah. So we wrote to him, saying: We are facing death; and we asked him for reinforcements. He wrote to us, saying: I have received your letter asking for reinforcements and I can tell you about who has the greatest support and the most ready troops.\nAllah, may He be glorified and exalted, ask Him for support, for Muhammad (ﷺ) was caused to prevail on the day of Badr with fewer than your numbers. When this letter of mine reaches you, fight them without referring back to me. So we fought them, and we defeated them, pursuing and killing them for four parasangs, and we acquired wealth (booly). They discussed the issue (of booty) and ‘Iyad suggested to us that we should give ten for every head. And Abu ʼUbaidah said: Who will compete with me (in a horse race)? A young man said: I will, if you don`t get angry. Then he beat him, and I saw the two braids of Abu ‘Ubaidah flying as he raced behind him on an Arabian horse."
  },
  "5303270": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303270\nIn-book reference  : Book 2, Hadith 251\nEnglish translation  : Vol. 1, Book 2, Hadith 251",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Ali bin Zaid said:\nI came to Madinah and entered upon Salim bin ‘Abdullah, and i was wearing a silk jubbah. Salim said to me: What are you doing with this garment? I heard my father narrate from `Umar bin al-Khattab (c.) that the Messenger of Allah (ﷺ) said: `Silk is only worn by one who has no share [in the Hereafter!"
  },
  "5303280": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303280\nIn-book reference  : Book 2, Hadith 252\nEnglish translation  : Vol. 1, Book 2, Hadith 252",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Amr bin Shu`aib from his father that his grandfather said:\nA man killed his (own) son deliberately and the\ncase was referred to `Umar bin al Khattab (رضي الله عنه), who ruled that the murderer should pay one hundred camels (as diyah): thirty three-year-old she-camels, thirty four-year-old she-camels and forty five-year-old she camels. He said: And the killer does not inherit anything. Were it not that I heard the Messenger of Allah (ﷺ) say, `No father is to be killed in retaliation for his son,” I would have executed you."
  },
  "5303290": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303290\nIn-book reference  : Book 2, Hadith 253\nEnglish translation  : Vol. 1, Book 2, Hadith 253",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Amr bin Shu`aib said:\n`Umar (رضي الله عنه) said. Were it not that I heard the Messenger of Allah (ﷺ) say, “The killer gets nothing (from the estate of the one he murdered),` I would have included you among the heirs. And he called the maternal uncle of the one who had been killed and gave the camels to him.\nIt was narrated from Mujahid bin Jabr... and he mentioned the same Hadeeth. He said: `Umar (4) took thirty three year-old she-camels, thirty four year-old she-camels and forty she camels between the ages of five and eight years, all of which were pregnant, then he called the brother of the one who had been killed and gave them to him, not to his father. And he said: I heard the Messenger of Allah (ﷺ) say: “The killer gets nothing.`"
  },
  "5303300": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303300\nIn-book reference  : Book 2, Hadith 254\nEnglish translation  : Vol. 1, Book 2, Hadith 254",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Malik bin Aws bin al-Hadathan said:\nal`Abbas and `Ali came to `Umar (رضي الله عنه) with a dispute. Al-`Abbas said: Judge between me and this one, And the people said: Judge between them, judge between them. He said: I shall not judge between them; they know that the Messenger of Allah (ﷺ) said: `We are not to be inherited from; what we leave behind is charity.`"
  },
  "5303310": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303310\nIn-book reference  : Book 2, Hadith 255\nEnglish translation  : Vol. 1, Book 2, Hadith 255",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn al Musayyab that `Umar (رضي الله عنه) said:\nOne of the last verses to be revealed was the verse on riba, and when the Messenger of Allah (ﷺ) died, he had not explained it. So avoid riba and any dubious matter."
  },
  "5303320": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303320\nIn-book reference  : Book 2, Hadith 256\nEnglish translation  : Vol. 1, Book 2, Hadith 256",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Abu Moosa that he used to advise people to do Tamattu` (in Hajj). A man said to him:\nDo not rush in giving fatwas, for you do not know what Ameer al-Mu`mineen has decided with regard to Haji. When he met him later on, he asked him and ‘Umar said: I know that the Prophet (ﷺ) did it and his Companions did it, but I do not like [the people] to have intercourse with [their wives] beneath the arak trees and go out to Hajj with their heads dripping(from ghusl)."
  },
  "5303330": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303330\nIn-book reference  : Book 2, Hadith 257\nEnglish translation  : Vol. 1, Book 2, Hadith 257",
    "url": "https://sunnah.com/ahmad/2",
    "text": "it was narrated that `AbdurRahman bin `Awf said:\n`Umar bin al-Khattab (رضي الله عنه) did Haji and wanted to deliver a speech to the people. ‘Abdur-Rahman bin ‘Awf said: The uneducated people are gathered around you, so delay it until you come to Madinah. When he came to Madinah, I got close to him when he was on the minbar and I heard him saying. Some people are saying, Why should we stone [adulterers]? In the book of Allah it only mentions flogging But the Messenger of Allah (ﷺ) stoned adulterers] and we stoned [them] after him. Were it not that people would say, You have inserted something into the Book of Allah that is not part of it, I would have inserted it as it was revealed."
  },
  "5303340": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303340\nIn-book reference  : Book 2, Hadith 258\nEnglish translation  : Vol. 1, Book 2, Hadith 258",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Simak bin Harb said:\nI heard an-Nu`man - i.e., bin Basheer - say: `Umar (رضي الله عنه) mentioned what the people had acquired of worldly gains and said: I saw the Messenger of Allah (ﷺ) remaining curled up [with hunger pangs] all day, unable to find even the worst type of dates with which to fill his stomach."
  },
  "5303350": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303350\nIn-book reference  : Book 2, Hadith 259\nEnglish translation  : Vol. 1, Book 2, Hadith 259",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn ‘Umar, from his father, that the Prophet said:\n`The deceased is tormented in his grave because of being wailed over.` Al-Hajjaj said: `...because of the wailing over him.`"
  },
  "5303360": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303360\nIn-book reference  : Book 2, Hadith 260\nEnglish translation  : Vol. 1, Book 2, Hadith 260",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Qatadah said:\nI heard Rufai` Abul-`Aliyah narrate from Ibn ‘Abbas: A man told me - Shu’bah said: I think he said: one of the Companions of the Prophet (ﷺ) - The most admired of therm to me is Umar bin al Khattab (رضي الله عنه): The Messenger of Allah (ﷺ) forbade praying at two times: after `Asr until the sun sets and after Fajr until the sun rises."
  },
  "5303370": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303370\nIn-book reference  : Book 2, Hadith 261\nEnglish translation  : Vol. 1, Book 2, Hadith 261",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Qatadah said:\nI heard Abu `Uthman an-Nahdi say: the letter of ‘Umar came to us when we were in Adhrabeejan with `Utbah bin Farqad, or in Syria, (saying). The Messenger of Allah (ﷺ) forbade silk except so much - two fingers. Abu `Uthman said: We had no doubt that he meant silk borders.\nIt was narrated that Qatadah said: I heard Abu `Uthman an-Nahdi say: The letter of ‘Umar came to us..."
  },
  "5303380": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303380\nIn-book reference  : Book 2, Hadith 262\nEnglish translation  : Vol. 1, Book 2, Hadith 262",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Amr bin Maimoon said:\n`Umar (رضي الله عنه) prayed Fajr when he was in Jam`. Abu Dawood said: We were with `Umar in Jamo, and he said: The mustrikoort used not to move on until the sun rose, and they would say: Shine, (Mount) Thabeer. The Prophet (ﷺ) of Allah differed from them and moved on before the sun rose."
  },
  "5303390": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303390\nIn-book reference  : Book 2, Hadith 263\nEnglish translation  : Vol. 1, Book 2, Hadith 263",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Abdullah bin Deenar said:\nI heard Ibn `Umar say: `Umar (...) asked the Messenger of Allah (ﷺ) : If I become junub at night; what should I do? He said: `Wash your private part then do wudoo’ then go to sleep.”"
  },
  "5303400": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303400\nIn-book reference  : Book 2, Hadith 264\nEnglish translation  : Vol. 1, Book 2, Hadith 264",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Salamah bin Kuhail said:\nI heard Abul-Hakam said: I asked Ibn ʻUmar about earthenware jars and he narrated to us from ‘Umar (رضي الله عنه) that the Messenger of Allah (ﷺ) forbade (making nabeedh in) earthenware jars, gourds, and varnished jars,"
  },
  "5303410": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303410\nIn-book reference  : Book 2, Hadith 265\nEnglish translation  : Vol. 1, Book 2, Hadith 265",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that `Abdullah bin Sarjis said:\nI saw the bald one - meaning `Umar bin al-Khattab (رضي الله عنه)-kissing the Black Stone and saying. I know that you are only a stone, but I saw the Messenger of Allah (ﷺ) kiss you"
  },
  "5303420": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303420\nIn-book reference  : Book 2, Hadith 266\nEnglish translation  : Vol. 1, Book 2, Hadith 266",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Juwairiyyah bin Qudamah said:\nI did Haji and I came to Madinah the year ‘Umar was stabbed. He gave a speech and said: I dreamt that a red rooster pecked me once or twice-Shu`bah was riot certain - and what happened was that he was stabbed. The people were given permission to enter upon him. The first ones to enter upon him were the Companions of the Prophet (ﷺ), then the people of Madinah, then the people of Syria. Then permission was given to the people of Iraq, and I was among those who entered upon him. Every time people entered upon him, they praised him and wept. When we entered upon him, he had wrapped his stomach with a black turban cloth, and blood was flowing. We said: Give us some advice; and no one asked him for advice except us. Ile said: You have to adhere to the Book of Allah, for you will never go astray so long as you follow it. We said: Advise u5. He said: I urge you to be kind to the Muhajireen, for the people will increase in number and they will decrease. And I advise you to be kind to the Ansar, for they are the people of Islam with whom Islam sought refuge. And I advise you to be kind to the Bedouin, for they are your origin and your strength. And I advise you be kind to the non-Muslim people under your rule (ahludh-dhimmah), for they have a covenant with your Prophet (ﷺ) and they give you a source of income. You may leave now. And he did not say any more to us than these words. Muhammad bin Ja`far said: Shu’bah said: Then after that I asked him and he said concerning the Bedouin. I advise you to be kind to the Bedouin, for they are your brothers and the enemy of your enemy.\nIt was narrated that Juwairiyyah bin Qudamah said: I did Haji and I came to Madinah the year ‘Umar was stabbed. He gave a speech and said: I dreamt that a red rooster pecked me once or twice - Shu`bah was not certain - and only a week later, he was stabbed. And he mentioned a similar report, except that he said: And l advise you be kind to the non-Muslim people under your rule (ahludh-dhimmah), and honour the covenant of your Prophet (ﷺ). Then I asked him after that and he said concerning the Bedouin: I advise you to be kind to the Bedouin, for they are your brothers and the enemy of your enemy,"
  },
  "5303430": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303430\nIn-book reference  : Book 2, Hadith 267\nEnglish translation  : Vol. 1, Book 2, Hadith 267",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn `Abbas (رضي الله عنه) that he said:\nSome men of good character, among whom was ‘Umar, who is the best of them in my view, testified in my presence that the Messenger of Allah (ﷺ) forbade praying after Fajr prayer until the sun rose, and after Asr prayer until it (the sun) set."
  },
  "5303440": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303440\nIn-book reference  : Book 2, Hadith 268\nEnglish translation  : Vol. 1, Book 2, Hadith 268",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Suwaid bin Ghafalah that `Umar addressed the people in al-Jabiyah and said:\nThe Messenger of Allah (ﷺ) forbade wearing silk except the width of two fingers or three or four - and he gestured with his hand."
  },
  "5303450": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303450\nIn-book reference  : Book 2, Hadith 269\nEnglish translation  : Vol. 1, Book 2, Hadith 269",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn ʼUmar, from `Umar, that the Prophet (ﷺ) said:\n`The deceased is tormented in his grave because of the wailing over him.”"
  },
  "5303460": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303460\nIn-book reference  : Book 2, Hadith 270\nEnglish translation  : Vol. 1, Book 2, Hadith 270",
    "url": "https://sunnah.com/ahmad/2",
    "text": "Ibn ‘Umar said:\nʼUmar bin al-Khattab (رضي الله عنه) told me: Whilst we were with the Messenger of Allah (ﷺ) one day, a man came to us whose garment was exceedingly white and whose hair was exceedingly black, and we did not see any signs of travel on him, and none of us knew who he was. He came and sat before the Prophet (ﷺ), resting his knees against his and placing his hands on his thighs. He said: O Muhammad, tell me about Islam: what is Islam? The Messenger of Allah (ﷺ) said: `Islam means to bear witness that there is no god except Allah and that Muhammad is the Messenger of Allah (ﷺ), to establish regular prayer, to pay zakali, to fast Ramadan and to perform pilgrimage to the House (the Ka`bah), if you have the means.` He said: You have spoken the truth. He (‘Umar) said: It amazed us, how he questioned him and said that he had spoken the truth. He said: Tell me about faith (Eeman). He said: `Faith is to believe in Allah, His angels, His Books, His Messengers, the Last Day, and to believe in al-qadar (the divine will and decree), both good and bad.` He said: You have spoken the truth. He said: Tell me about ihsan: what is ilisan? - Yazeed said: - `It is to worship Allah as if you can see Him, for although you cannot see Ilim, He sees you.` He said: Tell me about the Hour. He said: “The one who is asked about it does not know more than the one who is asking.” He said: Then tell me about its signs. Ise said: `When the slave woman gives birth to her mistress, and when you see the barefoot, naked, destitute shepherds competing in the construction of lofty buildings.” He [Umar] said: Then he went away. He sumar waited for a while - Yazeed said: three (days). Then he (the Prophet (ﷺ) said to me: `O`Umar, do you know who that questioner was?` I said: Allah and His Messenger know best. He said: “That was Jibreel, who came to you to teach you your religion.`\nIbn ‘Umar said. `Umar (رضي الله عنه) told us: We were sitting with the Messenger of Allah (ﷺ) and he mentioned the same hadeeth, except that he said: No signs of travel were to be seen on him. And he- said: `Umar said: 1 waited for three (days), then the Messenger of Allah (ﷺ) said: “oʻUmar...”"
  },
  "5303470": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303470\nIn-book reference  : Book 2, Hadith 271\nEnglish translation  : Vol. 1, Book 2, Hadith 271",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated that Abu Nadrah said:\nI said to Jabir bin ‘Abdullah: Ibn az-Zubair (رضي الله عنه) forbids tamattu` (in hajj) and Ibn `Abbas enjoins it. He said to me: I knew about this issue. We did tamattu` with the Messenger of Allah (ﷺ) - `Affan said: And with Abu Bakr - then when `Umar (رضي الله عنه) became Caliph, he addressed the people and said: The Qur`an is still the Qur`an and the Messenger of Allah (ﷺ) is the Messenger. There were two mut’ahs at the time of the Messenger of Allah (ﷺ): one of them was the mut`ah of Hajj (i.e., tannaffit`) and the other was mut`ah with women."
  },
  "5303480": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303480\nIn-book reference  : Book 2, Hadith 272\nEnglish translation  : Vol. 1, Book 2, Hadith 272",
    "url": "https://sunnah.com/ahmad/2",
    "text": "lt was narrated from Abu Tameem that he heard `Umar bin al-Khattab (رضي الله عنه) say:\nI heard the Prophet (ﷺ) say: “If you truly put your trust in Allah, He would provide for you as He provides for the birds: they go out with empty stomachs and come back with full stomachs.`"
  },
  "5303490": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303490\nIn-book reference  : Book 2, Hadith 273\nEnglish translation  : Vol. 1, Book 2, Hadith 273",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn as Sa`idi al-Maliki said:\n`Umar bin al Khattab (رضي الله عنه) appointed me in charge of the zakah, and when had finished with it and handed it over to him, he ordered that I be given some remuneration. I said: I only did it for the sake of Allah and my reward is with Allah. He said: Take what is given to you. I was appointed to do some work at the time of the Messenger of Allah (ﷺ) and he gave me some remuneration, and I said the same as you have said, but the Messenger of Allah (ﷺ) said to me: `If you are given something without asking for it, then take it and give some in charity.”"
  },
  "5303500": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303500\nIn-book reference  : Book 2, Hadith 274\nEnglish translation  : Vol. 1, Book 2, Hadith 274",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ʼUmar bin al-Khattab (رضي الله عنه) that he said:\nI got excited one day and kissed [my wife] when I was fasting I came to the Messenger of Allah (ﷺ) and said: Today I have done a horrible thing: I kissed [my wife) when I was fasting. The Messenger of Allah (ﷺ) said: `What do you think if you rinse your mouth with water when you are fasting?` I said: There is nothing wrong with that. The Messenger of Allah (ﷺ) said: `Then why [are you worried]?”"
  },
  "5303510": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303510\nIn-book reference  : Book 2, Hadith 275\nEnglish translation  : Vol. 1, Book 2, Hadith 275",
    "url": "https://sunnah.com/ahmad/2",
    "text": "`Abdullah bin Hubairah said:\nI heard Abu Tameem al-Jaishani say: I heard `Umar bin al Khattab (رضي الله عنه) say: I heard the Messenger of Allah (ﷺ) say: “If you really put your trust in Allah, He would provide for you as He provides for the birds. Do you not see that they go out with empty stomachs and come back with full stomachs?“"
  },
  "5303520": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303520\nIn-book reference  : Book 2, Hadith 276\nEnglish translation  : Vol. 1, Book 2, Hadith 276",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn Ya`mar said:\nl said to Ibn `Umar. We travel to different countries and we meet people who say there is no qadar (divine decree), Ibn `Umar said: If you meet them, tell them that `Abdullah bin `Umar has nothing to do with them and they have nothing to do with him-three times. Then he started narrating Whilst we were with the Messenger of Allah (ﷺ) , there came a man... and he described his appearance, The Messenger of Allah (ﷺ) said: Come closer, so he came closer. He said: Come closer, so he came closer. He said: Come closer, so he came closer, until his knees were nearly touching [the Prophet (ﷺ)`s] knees. Then he said: O Messenger of Allah (ﷺ), tell me what is faith [or about faith]. He said: “To believe in Allah. His Angels, His Books, His Messengers, the Last Day, and to believe in al-qadar.` - Sufyan said: I think he said: `... both good and bad.` He said: What is Islam? He said: “To establish prayer, pay zakah, perform pilgrimage to the House, to fast Ramadan and to do ghusl in the case of janabah.` For all of that, he [the stranger] said: You are right, you are right. The people said: We never saw any man show more respect to the Messenger of Allah (ﷺ) than this man did. It was as if he was teaching the Messenger of Allah (ﷺ) . Then he said: O Messenger of Allah, tell me about ihsan.He said: “It is to worship Allah as if you see Him, for even if you do not see Him. He sees you.` For all of that we said: We never saw any man show more respect to the Messenger of Allah (ﷺ) than this man did, he said: You are right, you are right. He said: Tell me about the Hour. He said: “The one who is asked about it does not know more about it than one who is asking.` He said: You are right. He said it several times, and we never saw any man show more respect to the Messenger of Allah (ﷺ) than this man did. Then he left. Sufyan said: I heard that the Messenger of Allah (ﷺ) said: “Look for him,” but they did not find him. IIe said: `That was Jihree who came to you to teach you your religion. He never came to me in any form but I recognised him, except for this form.”\nIt was narrated that Ibn Ya’mar said: I asked Ibn `Umar-or a man asked him: We travel in this land and we meet people who say, There is no qadar (divine decree), Ibn `Umar said: If you meet those people, tell them that ‘Abdullah bin `Umar has nothing to do with them and they have nothing to do with him - he said it three times. Then he told us. Whilst we were with the Messenger of Allah (ﷺ), a man came and said: O Messenger of Allah (ﷺ), may I draw closer? He said: `Come closer.` So he came a little closer, then he said: O Messenger of Allah (ﷺ), may I come closer? He said: `Come closer.” So he came a little closer, then he said: O Messenger of Allah (ﷺ), may I come closer? He said: `Come closer.” So he came a little closer until his knees were almost touching the knees of the Messenger of Allah (ﷺ) . Then he said: O Messenger of Allah (ﷺ), what is faith? - and he mentioned a similar report."
  },
  "5303530": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303530\nIn-book reference  : Book 2, Hadith 277\nEnglish translation  : Vol. 1, Book 2, Hadith 277",
    "url": "https://sunnah.com/ahmad/2",
    "text": "I:\nwas narrated that ‘Umar bin al-Khattab (رضي الله عنه) said: The Messenger of Allah (ﷺ) said: “Whoever shades the head of a warrior, Allah will shade him on the Day of Resurrection; whoever equips a warrior until he is fully equipped, will have a reward like his; whoever builds a mosque in which the Name of Allah is mentioned. Allah will build for him a house in Paradise.”"
  },
  "5303540": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303540\nIn-book reference  : Book 2, Hadith 278\nEnglish translation  : Vol. 1, Book 2, Hadith 278",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Umar bin al-Khattab (رضي الله عنه) - `Abdullah said:\nMy father attributed it to the Prophet (ﷺ) - said: “Whoever misses any part of his word or portion (of Prayer or Qur`an) at night and reads it between Fair prayer and Zuhr, it will be as if he read it at night.`"
  },
  "5303550": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303550\nIn-book reference  : Book 2, Hadith 279\nEnglish translation  : Vol. 1, Book 2, Hadith 279",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar bin al-Khattab said:\nBefore the prohibition of khamr was revealed, ‘Umar said: O Allah, give us a clear ruling on khamr. Then the verse which is in Soorat al Baqarah was revealed: `They ask you (O Muhammad (ﷺ) concerning alcoholic drink and gambling. Say: “In them is a great sin...” [al-Baqarah 2:219]. `Umar was summoned and it was recited to him. He said: O Allah, give us a clear ruling on khamr, and the verse which is in Soorat an-Nisa` was revealed: “O you who believe Approach not As-Salah (the prayer) when you are in a drunken state.` [an-Nisa 4:43). When the Iqamah for prayer was given, the caller of the Messenger of Allah (ﷺ) would call out: Do not approach the prayer drunk, ‘Umar was summoned and it was recited to him. He said: O Allah, give us a clear ruling on khamr, and this verse was revealed then Umar was summoned and recited to hirn when he reached `So, will you not then abstain?` |al-Ma`idah 5:91]. Then `Umar said: We abstain, we abstain."
  },
  "5303560": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303560\nIn-book reference  : Book 2, Hadith 280\nEnglish translation  : Vol. 1, Book 2, Hadith 280",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Subayy bin Ma`bad that he was a Taghlibi Christian, then he became Muslim and asked which deed is best? He was told:\nJihad for the sake of Allah, may He be glorified and exalted. He wanted to go for jihad. but he was asked: Have you done Hajj? He said. No. It was said to him: Do Hajj and `Umrah, then go for jihad. So he entered ihram for both of them together, then he met Zaid bin Soohan and Salman bin Rabee`ah who said: He is more misguided than his camel, or he is no more guided than his camel, He went to `Umar (رضي الله عنه) and told him what they had said, and he said: You have been guided to the Sunnah of your Prophet (ﷺ) , or to the Sunnah of the Messenger of Allah (ﷺ) ."
  },
  "5303570": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303570\nIn-book reference  : Book 2, Hadith 281\nEnglish translation  : Vol. 1, Book 2, Hadith 281",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Hisham said:\nMy father told me that ‘Umar bin al-Khattab (رضي الله عنه) said to the [Black] Stone; You are only a stone; were it not that I saw the Messenger of Allah (ﷺ) kiss you, I would not have kissed you. Then he kissed it."
  },
  "5303580": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303580\nIn-book reference  : Book 2, Hadith 282\nEnglish translation  : Vol. 1, Book 2, Hadith 282",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Hisham, from his father, that `Umar (رضي الله عنه) came to the [Black] Stone and said:\nI know that you are only a stone and you cannot cause harm or bring benefit. Were it not that I saw the Messenger of Allah(ﷺ )kiss you, I would not have kissed you. Then he kissed it."
  },
  "5303590": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303590\nIn-book reference  : Book 2, Hadith 283\nEnglish translation  : Vol. 1, Book 2, Hadith 283",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Suwaid bin Ghafalah that `Umar (رضي الله عنه) kissed it and touched it, then he said:\nI saw Abul-Qasim (ﷺ) show respect to you - meaning the Black Stone."
  },
  "5303600": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303600\nIn-book reference  : Book 2, Hadith 284\nEnglish translation  : Vol. 1, Book 2, Hadith 284",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from `Asim bin `Umar that his father said:\nThe Messenger of Allah (ﷺ) said: “When night Comes from here and day departs from here, the fasting person may break his fast.`"
  },
  "5303610": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303610\nIn-book reference  : Book 2, Hadith 285\nEnglish translation  : Vol. 1, Book 2, Hadith 285",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Umar. (رضي الله عنه) said:\nThe Messenger of Allah (ﷺ) said. “The likeness of the one who goes back his charity is that of one who goes back to his vomit.”"
  },
  "5303620": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303620\nIn-book reference  : Book 2, Hadith 286\nEnglish translation  : Vol. 1, Book 2, Hadith 286",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Umar (رضي الله عنه) said:\nThe people of Jahiliyyah used not to move on from Jam’ until they said: Shine, Thabeer, so that we may move on quickly. When the Messenger of Allah (ﷺ) came, he differed from them and he used to move on from Jam’ before sunrise, like the time when people who delay Fajr usually pray."
  },
  "5303630": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303630\nIn-book reference  : Book 2, Hadith 287\nEnglish translation  : Vol. 1, Book 2, Hadith 287",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from Ibn Abu Mulaikah, who heard Ibn `Abbas (رضي الله عنه) say:\n`Umar (رضي الله عنه) said to me: I heard the Messenger of Allah (ﷺ) say: “The deceased is tormented because of the weeping of his family over him.`"
  },
  "5303640": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303640\nIn-book reference  : Book 2, Hadith 288\nEnglish translation  : Vol. 1, Book 2, Hadith 288",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that Ibn `Umar said, `Umar (رضي الله عنه) said:\nl saw the Messenger of Allah (ﷺ) wipe over his leather slippers (khuff, whilst travelling."
  },
  "5303650": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303650\nIn-book reference  : Book 2, Hadith 289\nEnglish translation  : Vol. 1, Book 2, Hadith 289",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated from ‘Umar (رضي الله عنه) that The Prophet(ﷺ) used to seek refuge with Allah from miserliness, cowardice, the torment of the grave, the feebleness of old age and diseases of the heart (such as envy, hatred, and wrong ‘aqeedah). Wakee` said:\nAnd diseases of the heart means dying. Wakee said: And turmoil (fitnah) from which he has not repented."
  },
  "5303660": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303660\nIn-book reference  : Book 2, Hadith 290\nEnglish translation  : Vol. 1, Book 2, Hadith 290",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abdullah bin Buraidah said:\n`Umar (رضي الله عنه) sat where the Messenger of Allah (ﷺ) used to sit, in a place where funerals passed by. A funeral passed by and they said good things (about the deceased). He said:lt is due, Then another funeral passed by and they said good things (about the deceased). He said: It is due. Then another funeral passed by and they said good things (about the deceased). He said: It is due, Then another funeral passed by and they said: This man was the most dishonest of people. He said: The most dishonest of people is the one who tells the most lies about Allah, and the next worst is the one who is dishonest with his soul in his body. They said: What do you think if four people testify? He said: It is due. They said: Or three? He said: If they are three, it is due. They said: Or two? He said: It is due, and if I had asked about one, that would have been dearer to me than red camels. It was said to ‘Umar: Is this something that you are saying on the basis of your own opinion or is it something that you heard from the Messenger of Allah (ﷺ) He said: No, rather it is something that I heard from the Messenger of Allah (ﷺ)"
  },
  "5303670": {
    "collection": "Musnad Ahmad",
    "book": "Musnad `Umar b. al-Khattab (ra)",
    "book_num": "2",
    "reference": "Reference  : Musnad Ahmad 5303670\nIn-book reference  : Book 2, Hadith 291\nEnglish translation  : Vol. 1, Book 2, Hadith 291",
    "url": "https://sunnah.com/ahmad/2",
    "text": "It was narrated that ‘Abayah bin Rifa`ah said:\n`Umar (رضي الله عنه) heard that when Sa`d built the palace, he said. Now there will be no more noise. ‘Umar sent Muhammad bin Maslamah to him, and when he arrived he took out some kindling and lit a fire, and he bought some wood for a dirham. It was said to Sa`d: A man has done such and such. He said: That is Muhammad bin Maslamah. He went out to him and swore by Allah that he never said that. He said: We will convey from you what you have said and we will do as we were instructed. So he burned the door. Then he [Sa`d] offered some supplies (to the envoy) but he refused. He left at midday and went to ‘Umar(رضي الله عنه), and he went and came back within nineteen days. He said: Were it not that I think well of you, I would have thought that you did not convey my message. He said: Yes I did convey it, he conveys his salam and apologises, and he swore by Allah that he did not say that. He said: Did he give you any provisions? He said: No. He said: What prevented you from supplying (sufficient, provisions to me yourself? He said: I did not want to instruct that you be given the cold whilst I had the hot [i.e., I could not have given you what you wanted of food and enjoyed plentiful food myself, when around me are the people of Madinah who are starving, for I heard the Messenger of Allah (ﷺ) say: `No man should eat his fill when his neighbour is going without.”"
  }
}