{
  "2309500": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309500\nIn-book reference  : Book 41, Hadith 001\nEnglish translation  : Vol. 1, Book 41, Hadith 001",
    "url": "https://sunnah.com/adab/41",
    "text": "Anas ibn Malik said, \"The Prophet, may Allah bless him and grant him peace, used to visit Umm Hiram, the daughter of Milhan who was married to 'Ubada ibn as-Samit, and she would give him food and delouse his head. Then he slept and woke up laughing.\""
  },
  "2309510": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309510\nIn-book reference  : Book 41, Hadith 002\nEnglish translation  : Vol. 1, Book 41, Hadith 002",
    "url": "https://sunnah.com/adab/41",
    "text": "Qays ibn 'Asim as-Sa'idi said, \"I came to the Messenger of Allah, may Allah bless him and grant him peace, and he said, 'This is the master of the people of the desert.' I said, 'Messenger of Allah, how much property can I have without owning anything to someone who comes with a request or a guest?' The Messenger of Allah, may Allah bless him and grant him peace, said, 'The best property is forty. A lot of property is sixty. Woe to those who have hundreds except for he who gives away something precious, lends an animal with abundant milk or sacrifices a fat animal to eat and feeds beggars and the poor.' I asked, 'Messenger of Allah, which is the noblest of these qualities?' The valley where I am does not support many flocks.' The Prophet replied, 'So what do you give as a gift?' I replied, 'I give virgin camels and she-camels.' The Prophet asked, 'How much do you give as a loan?' I said, 'I lend a hundred.' He asked, 'What do you do with she-camels that are ready to be mated?' He replied, 'People bring their ropes (to use as halters for the male camels) and no man is prevented from taking a camel on which he puts a halter. He takes the male camel he thinks is the proper one (for mating and keeps it) until he returns it.' The Prophet, may Allah bless him and grant him peace, said, 'Which do you love more ? your property or your mawali (i.e. your heirs).' ('My property,' he replied.) The Prophet said, 'Your share is what you eat of your property and consume or what you give away and spend. The rest of it belongs to your heirs.' I said, 'When I go back, I must lessen it.'\""
  },
  "2309520": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309520\nIn-book reference  : Book 41, Hadith 003\nEnglish translation  : Vol. 1, Book 41, Hadith 003",
    "url": "https://sunnah.com/adab/41",
    "text": "'Abdullah ibn as-Samit said, \"I questioned my close friend Abu Dharr who said, 'I brought some water for wudu' to the Prophet, may Allah bless him and grant him peace. He shook his head and bit his lip. I said, \"May my father and mother be your ransom, have I injured you?\" \"No,\" he replied, \"but you will meet amirs ? or imams ? who will delay the prayer until it is past its time.\" \"So what do you command me to do?\" I asked. He replied, \"Pray the prayer at the proper time. If you come across them, then pray with them and do not say, 'I have already prayed, so I will not pray again.'\"'\""
  },
  "2309530": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309530\nIn-book reference  : Book 41, Hadith 004\nEnglish translation  : Vol. 1, Book 41, Hadith 004",
    "url": "https://sunnah.com/adab/41",
    "text": "'Ali reported that the Messenger of Allah, may Allah bless him and grant him peace, knocked at the door of 'Ali and Fatima, the daughter of the Prophet, may Allah bless him and grant him peace, and said, \"Don't you pray?\" 'Ali said, \"I said, 'Messenger of Allah, our spirits are with Allah. When He wishes to wake us up, we will make up.' The Prophet, may Allah bless him and grant him peace, left without saying anything to me. Then I heard him strike him thigh after his back was turned. He said, 'More than anything else, man is argumentative.' (18:54)\""
  },
  "2309540": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309540\nIn-book reference  : Book 41, Hadith 005\nEnglish translation  : Vol. 1, Book 41, Hadith 005",
    "url": "https://sunnah.com/adab/41",
    "text": "Abu Razin said about Abu Hurayra, \"I saw him striking his brow with his hand whole saying, 'People of Iraq, do you claim that I lie against the Messenger of Allah, may Allah bless him and grant him peace? Do you have enjoyment while I have the wrong action? I testify that I heard the , Messenger of Allah, may Allah bless him and grant him peace, say, \"When one of you breaks his sandal-strap, he should not walk in his other sandal until it is mended.\"'\""
  },
  "2309550": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309550\nIn-book reference  : Book 41, Hadith 006\nEnglish translation  : Vol. 1, Book 41, Hadith 006",
    "url": "https://sunnah.com/adab/41",
    "text": "Abu'l-'Aliyya al-Bara' said, \"'Abdullah ibn as-Samit passed by me and I gave him a chair. He sat down. I told him, 'Ibn Ziyad has delayed the prayer. What do you command?' He hit my thigh (and I think he said, 'So that it left a mark on me') and then he said, 'I asked Abu Dharr as you asked me and he hit my thigh as I have hit yours. He said, \"Pray the prayer at the proper time, but if you come across some of them, pray with them and do not say, 'I have already prayed,' and then not pray.\"'\""
  },
  "2309560": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309560\nIn-book reference  : Book 41, Hadith 007\nEnglish translation  : Vol. 1, Book 41, Hadith 007",
    "url": "https://sunnah.com/adab/41",
    "text": "It is related that 'Abdullah ibn 'Umar reported that 'Umar went with the Messenger of Allah, may Allah bless him and grant him peace, with a group to visit Ibn Sayyad. They found him playing with some children in the hills of Banu Maghala. Ibn Sayyad, who was approaching puberty, did not notice them until the Prophet, may Allah bless him and grant him peace, patted him with his hand and then said to him, 'Do you testify that I am the Messenger of Allah?' Ibn Sayyad looked at him and said, 'I testify that you are the Messenger of the unlettered.' Ibn Sayyad said to the Prophet, 'Do you testify that I am the Messenger of Allah?' He refuted it and said, 'I have believed in Allah and His Messengers.' Then he said to him, 'What dreams do you have?' Ibn Sayyad replied, 'Both truthful people and liars come to me.' The Prophet, may Allah bless him and grant him peace, said, 'You are in a state of confusion.' Then the Prophet, may Allah bless him and grant him peace, said to him, 'I am concealing something from you.' Ibn Sayyad said, 'It is just smoke.' He said, 'Shame on you! You will not go too far.' 'Umar said, 'Messenger of Allah, let me cut his head off?' The Prophet, may Allah bless him and grant him peace, said, 'If it is him (i.e. the Dajjal), you will not be able to get the better of him. If it is not him, there is no point in killing him.'\""
  },
  "2309570": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309570\nIn-book reference  : Book 41, Hadith 008\nEnglish translation  : Vol. 1, Book 41, Hadith 008",
    "url": "https://sunnah.com/adab/41",
    "text": "Jabir said, \"When the Prophet, may Allah bless him and grant him peace, was in janaba, he would pour three cupfuls of water over his head.\""
  },
  "2309580": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309580\nIn-book reference  : Book 41, Hadith 009\nEnglish translation  : Vol. 1, Book 41, Hadith 009",
    "url": "https://sunnah.com/adab/41",
    "text": "Jabir said, \"In Madina, the Messenger of Allah, may Allah bless him and grant him peace, was thrown from a horse onto a palm trunk and dislocated his foot. We used to visit him in the room of 'A'isha. We came upon him while he was praying sitting down and we prayed standing behind him. He indicates to us that we should sit down. When he finished the prayer, he said, 'When the Imam prays sitting, then pray sitting. When he prays standing, then pray standing. Do not stand while the imam is sitting as the Persians do with their great men.'\""
  },
  "2309590": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309590\nIn-book reference  : Book 41, Hadith 010\nEnglish translation  : Vol. 1, Book 41, Hadith 010",
    "url": "https://sunnah.com/adab/41",
    "text": "He also said, \"One of the slaves of the Ansar had a son whom he named Muhammad, The Ansar said, 'We will not give you the kunya of the Messenger of Allah until we have sat in the road and asked the Prophet about the Final Hour.' The Prophet said, 'You have come to me to ask me about the Hour?' 'Yes,' we replied. He said, 'There is no one alive now who will see it, even if he lives a hundred years.' We said, 'A slave of the Ansar has had a son and named him Muhammad. The Ansar said, \"We will not call you by the kunya of the Messenger of Allah.\"' The Prophet said, 'You have done well. Call yourselves with my name, but do not use my kunya.'\""
  },
  "2309600": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309600\nIn-book reference  : Book 41, Hadith 011\nEnglish translation  : Vol. 1, Book 41, Hadith 011",
    "url": "https://sunnah.com/adab/41",
    "text": "Jabir ibn 'Abdullah reported that the Messenger of Allah, may Allah bless him and grant him peace, passed through the market, entering from part of the high part of the city and the people were on both sides of him. He passed by a dead one-eared goat and reached out and took its ear. Then he said, \"Who would like to buy this for a dirham?\" They said, \"Why would we want it when it is worthless? What would we do with it?\" He said, \"Would you like to have it?\" \"No,\" they replied. He asked them that three times and they said, \"No, by Allah! If it were alive, it would have a defect as it only has one ear. Why would we want it when it is dead?\" The Prophet said, \"By Allah, this world is less in the sight of Allah than this goat is to you.\""
  },
  "2309610": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309610\nIn-book reference  : Book 41, Hadith 012\nEnglish translation  : Vol. 1, Book 41, Hadith 012",
    "url": "https://sunnah.com/adab/41",
    "text": "'Utayy ibn Damura said, \"I saw with Ubay a man who was attributing himself (in lineage) with an attribution of Jahiliyyah, so Ubay told him to bite his father's male organ and did not speak figuratively (i.e. was explicit). So his companions looked at him. He said, 'It appears that you disapprove of it.' Then he said, 'I will never show apprehension to anyone with regards to this. Verily, I heard the Prophet, may Allah bless him and grant him peace, say, \"Whomever attributes himself (in lineage) with an attribution of Jahiliyyah, then tell him to bite his father's male organ and do not speak figuratively (i.e. be explicit).\" ' \""
  },
  "2309620": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gestures",
    "book_num": "41",
    "reference": "Reference  : Al-Adab Al-Mufrad 2309620\nIn-book reference  : Book 41, Hadith 013\nEnglish translation  : Vol. 1, Book 41, Hadith 013",
    "url": "https://sunnah.com/adab/41",
    "text": "'Abdu'r-Rahman ibn Sa'd said, \"Ibn 'Umar's foot went to sleep and a man said to him, 'Mention the person you love most.' He said, 'Muhammad.'\""
  }
}