{
  "2311330": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311330\nIn-book reference  : Book 46, Hadith 001\nEnglish translation  : Vol. 1, Book 46, Hadith 001",
    "url": "https://sunnah.com/adab/46",
    "text": "'Abdu'r-Rahman ibn Abi 'Amra al-Ansari related to him, \"Abu Sa'id al-Khudri was told of a funeral.\" He continued, \"It seemed that he was hanging back until people had taken their seats. Then he came. When the people saw him, they quickly made room for him. One of them stood up for him to let him sit in his place. He said, 'Don't. I heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"The best gathering is the most expansive one.\" 'Then he went to the side and sat in an expansive gathering.\""
  },
  "2311340": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311340\nIn-book reference  : Book 46, Hadith 002\nEnglish translation  : Vol. 1, Book 46, Hadith 002",
    "url": "https://sunnah.com/adab/46",
    "text": "Munqidh said, \"In most of the gatherings of 'Abdullah ibn 'Umar, he would face qibla. Once Yazid ibn 'Abdullah ibn Fusayt recited Sajda after sunrise. He prostrated and the people there prostrated with the exception of 'Abdullah ibn 'Umar. When the sun rose, 'Abdullah uncurled his legs and then prostrated. He said, 'Did you see the prostration of your companions? They prostrated at a time when the prayer should not be done.\""
  },
  "2311350": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311350\nIn-book reference  : Book 46, Hadith 003\nEnglish translation  : Vol. 1, Book 46, Hadith 003",
    "url": "https://sunnah.com/adab/46",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"When one of you gets up from his place and then returns to it, he is more entitled to.\""
  },
  "2311360": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311360\nIn-book reference  : Book 46, Hadith 004\nEnglish translation  : Vol. 1, Book 46, Hadith 004",
    "url": "https://sunnah.com/adab/46",
    "text": "Anas said, \"The Messenger of Allah, may Allah bless him and grant him peace, came to us when we were children. He greeted us and sent me to get something he needed. He sat in the road waiting for me until I came back to him.\""
  },
  "2311370": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311370\nIn-book reference  : Book 46, Hadith 005\nEnglish translation  : Vol. 1, Book 46, Hadith 005",
    "url": "https://sunnah.com/adab/46",
    "text": "Ibn 'Umar reported that the Prophet, may Allah bless him and grant him peace, said, \"None of you should make a man rise from his seat and then sit in it. Rather make room and spread out.\""
  },
  "2311380": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311380\nIn-book reference  : Book 46, Hadith 006\nEnglish translation  : Vol. 1, Book 46, Hadith 006",
    "url": "https://sunnah.com/adab/46",
    "text": "Jabir ibn Samura said, \"When we came to the Prophet, may Allah bless him and grant him peace, we would sit at the edge of the group.\""
  },
  "2311390": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311390\nIn-book reference  : Book 46, Hadith 007\nEnglish translation  : Vol. 1, Book 46, Hadith 007",
    "url": "https://sunnah.com/adab/46",
    "text": "'Abdullah ibn 'Amr reported that the Prophet, may Allah bless him and grant him peace, said, \"It is not lawful for a man to separate two people except with the permission of both of them.\""
  },
  "2311400": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311400\nIn-book reference  : Book 46, Hadith 008\nEnglish translation  : Vol. 1, Book 46, Hadith 008",
    "url": "https://sunnah.com/adab/46",
    "text": "Ibn 'Abbas said, \"When 'Umar, may Allah be pleased with him, was attacked, I was one of those who carried him into his house. He said to me, 'Nephew, go see who wounded me and who was wounded with me.' I went and returned to tell him, but the room was full at that time. I did not want to step over people's necks because I was young, and so I sat down. 'Umar's rule when he sent someone for a need was that he commanded him not to tell about it. 'Umar had a cover over him. Ka'b came and said, 'By Allah, if the Amir al-Mu'minin makes supplication, Allah will let him remain alive and restore him to this community until he does such-and-such and such-and-such for them' until Ka'b mentioned the hypocrites. He actually named them and used their kunyas. I said, 'Shall I convey to him what you have said?' Ka'b said, 'I only said it because I intended that it be done.' I plucked up courage and stood up, I stepped over people's necks until I sat by 'Umar's head. I said, 'You sent me to find out such-and-such. Thirteen people were wounded with you. Kulayb ibn al-Jazzar was wounded while he was doing wudu' from the cistern. Ka'b swore such-and-such by Allah.' He said, 'Summon Ka'b.' He was summoned and 'Umar asked, 'What did you say?' He replied, 'I said such-and-such.' He said, 'No, by Prophet, I will not make supplication. 'Umar will be wretched if Allah does not forgive him.'\""
  },
  "2311410": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311410\nIn-book reference  : Book 46, Hadith 009\nEnglish translation  : Vol. 1, Book 46, Hadith 009",
    "url": "https://sunnah.com/adab/46",
    "text": "Ash-Sha'bi said, \"A man came to 'Abdullah ibn 'Amr when there were some people sitting with him. He stepped over them in order to reach him. They stopped him and 'Abdullah said, 'Leave the man.' He approached until he sat with him and then said, 'Tell me something which you heard from the Messenger of Allah, may Allah bless him and grant him peace.' 'Abdullah said, 'I heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"A Muslim is the one from whose tongue and hand the Muslims are safe. An emigrant (muhajir) is someone who abandons what Allah has forbidden.\"'\""
  },
  "2311420": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311420\nIn-book reference  : Book 46, Hadith 010\nEnglish translation  : Vol. 1, Book 46, Hadith 010",
    "url": "https://sunnah.com/adab/46",
    "text": "Ibn 'Abbas said, \"The most precious of people in my opinion is my sitting companion.\""
  },
  "2311430": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311430\nIn-book reference  : Book 46, Hadith 011\nEnglish translation  : Vol. 1, Book 46, Hadith 011",
    "url": "https://sunnah.com/adab/46",
    "text": "Ibn 'Abbas said, \"The most precious of people in my opinion is my sitting companion. This is so much the case that he can step over the shoulders of people until he sits with me.\""
  },
  "2311440": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311440\nIn-book reference  : Book 46, Hadith 012\nEnglish translation  : Vol. 1, Book 46, Hadith 012",
    "url": "https://sunnah.com/adab/46",
    "text": "Kathir ibn Murra related, \"I entered the mosque on Friday and found 'Awf ibn Malik al-Ashja'i sitting in a circle of men. He stretched out his feet in front of him. When he saw me, he pulled his feet back in. Then he said to me, 'Do you know why I put my foot out? So that a righteous man might come and sit down.'\""
  },
  "2311450": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311450\nIn-book reference  : Book 46, Hadith 013\nEnglish translation  : Vol. 1, Book 46, Hadith 013",
    "url": "https://sunnah.com/adab/46",
    "text": "Al-Harith ibn 'Amr as-Sahmi related, \"I came to the Prophet, may Allah bless him and grant him peace, when he was at Mina or at 'Arafa. People crowded around him and some Bedouins arrived. When they saw his face, they said, 'This is a blessed face.' I said, 'Messenger of Allah, pray for forgiveness for me.' He said, 'O Allah, forgive us!' I said, 'Ask forgiveness for me.' He said, 'O Allah, forgive us!' I turned and said, Ask forgiveness for me.' He said, 'O Allah, forgive us!' He spat on his hand and wiped it on his sandal. He did not want it to get on anyone around him.\""
  },
  "2311460": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311460\nIn-book reference  : Book 46, Hadith 014\nEnglish translation  : Vol. 1, Book 46, Hadith 014",
    "url": "https://sunnah.com/adab/46",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, forbade gatherings in the road. They said, \"Messenger of Allah, it is hard for us to sit in our houses.\" He said, \"If you must sit there, then fulfil the rights of the gathering.\" They asked, 'What is their right, Messenger of Allah?\" He replied, \"Guiding anyone who asks for directions, returning the greeting, lowering the eye, commanding the correct and forbidding the bad.\""
  },
  "2311470": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311470\nIn-book reference  : Book 46, Hadith 015\nEnglish translation  : Vol. 1, Book 46, Hadith 015",
    "url": "https://sunnah.com/adab/46",
    "text": "Abu Sa'id al-Khudri reported that the Prophet, may Allah bless him and grant him peace, said, \"Beware of sitting in the road.\" They said, \"Messenger of Allah, we must meet where we can sit to talk.\" The Messenger of Allah, may Allah bless him and grant him peace, said, \"If you must do it, then give the road its due. \"What is the due of the road, Messenger of Allah,\" they asked. He replied, \"Lowering the eye, avoiding doing anything harmful, commanding the correct and forbidding the bad.\""
  },
  "2311480": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311480\nIn-book reference  : Book 46, Hadith 016\nEnglish translation  : Vol. 1, Book 46, Hadith 016",
    "url": "https://sunnah.com/adab/46",
    "text": "Abu Musa al-Ash'ari said, \"The Messenger of Allah, may Allah bless him and grant him peace, went out one day to one of the walled gardens of Madina, and I went out after him. When he entered the garden, I sat at the gate and said, I will be the doorkeeper of the Messenger of Allah today even if he has not commanded me to do it.' The Prophet went and answered a call of nature and then sat on the edge of the well. He uncovered his legs and dangled them in the well. Abu Bakr came and asked for permission to enter.' I said, 'Stay where you are until I ask permission for you.' He waited and I went to the Prophet, may Allah bless him and grant him peace, and said, 'Messenger of Allah, it is Abu Bakr asking permission to come in.' He said, 'Let him in and give him the good news of the Garden.' He entered and sat at the right side of the Prophet, may Allah bless him and grant him peace. uncovered his legs and dangled them in the water. Then 'Umar came. I said, 'Stay where you are until I ask permission for you.' The Prophet, may Allah bless him and grant him peace, said, 'Let him in and give him the good news of the Garden.' 'Umar went in and sat at the left side of the Prophet, may Allah bless him and grant him peace, uncovered his legs and dangled his feet in the well. The rim of the well was then full and there was no place left to sit. Then 'Uthman came. I said, 'Stay where you are until I ask permission for you.' The Prophet, may Allah bless him and grant him peace, said, 'Let him in and give him the good news of the Garden as well as an affliction which will befall him.' 'Uthman came in and could not find a place with them. He moved around until he was facing them on the other side of the well, uncovered his legs and dangled them in the well. I began to wish that a brother of mine would come and I asked Allah to make him come, but he did not come before they had got up.\""
  },
  "2311490": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Gatherings",
    "book_num": "46",
    "reference": "Reference  : Al-Adab Al-Mufrad 2311490\nIn-book reference  : Book 46, Hadith 017\nEnglish translation  : Vol. 1, Book 46, Hadith 017",
    "url": "https://sunnah.com/adab/46",
    "text": "Abu Hurayra said, \"The Prophet, may Allah bless him and grant him peace, went out in the heat of the day. He did not speak to me nor did I speak to him until he came to the market of Qaynuqa'. He sat in the courtyard of Fatima's house and asked, 'Is the little one here? Is the little one here?' Fatima held her son back for a short time. I think that she was putting a necklace on him or washing him. Then he came running and he hugged him and kissed him. He said, 'O Allah, love him and love those who love him.'\""
  }
}