{
  "2304890": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304890\nIn-book reference  : Book 29, Hadith 001\nEnglish translation  : Vol. 1, Book 29, Hadith 001",
    "url": "https://sunnah.com/adab/29",
    "text": "Ghatif ibn al-Harith said that a man came to Abu 'Ubayda ibn al-Jarrah while he was in pain and asked, \"What is the reward of the amir?\" Abu 'Ubayda said, \"Do you know that for which you will be rewarded?\" The man replied, \"We will be rewarded for things which happen to us which we dislike.\" Abu 'Ubayda said, \"Rather you will be rewarded for what you spend in the Cause of Allah and what is spent on you. Then there is a reckoning for all parts of the saddle, even the horse's bridle. Allah will remove your errors from you for the sake of this fatigue which has afflicted your bodies.\""
  },
  "2304900": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304900\nIn-book reference  : Book 29, Hadith 002\nEnglish translation  : Vol. 1, Book 29, Hadith 002",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"A Muslim does not encounter fatigue, tiredness, concern, sorrow, injury or grief, or even a thorn which pricks him without Allah expiating his errors for him by that.\""
  },
  "2304910": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304910\nIn-book reference  : Book 29, Hadith 003\nEnglish translation  : Vol. 1, Book 29, Hadith 003",
    "url": "https://sunnah.com/adab/29",
    "text": "'Abdu'r-Rahman ibn Sa'id reported that his father said, \"I waswith Salman when he visited a sick person in Kinda. When he went in, he said, 'Good news! Allah makes the illness of the believer an expiation for him and a restoration, whereas the illness of the corrupt person is like a camel whose people hobble it and the let it go. It does not know why it was hobbled or released.'\""
  },
  "2304920": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304920\nIn-book reference  : Book 29, Hadith 004\nEnglish translation  : Vol. 1, Book 29, Hadith 004",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"Affliction will continue to trouble the believers, men and women, in their bodies, their families, and their property until they meet Allah Almighty purified of every wrong action.\""
  },
  "2304930": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304930\nIn-book reference  : Book 29, Hadith 005\nEnglish translation  : Vol. 1, Book 29, Hadith 005",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayra said, \"A bedouin came and the Prophet, may Allah bless him and grant him peace, asked, 'Has Umm Mildam (fever) got hold of you?' 'What is Umm Mildam?' he asked. He said, 'The heat between the skin and the flesh.' The bedouin said, 'No.' He asked, 'Have you got a headache?' 'What is headache?' the man asked. He replied, 'A wind which appears in the head and beats the veins.' 'No,' he said, When he stood up, he said, 'Whoever wants to look at a man who is one of the people of the Fire,' i.e. 'let them look at that man.'\""
  },
  "2304940": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304940\nIn-book reference  : Book 29, Hadith 006\nEnglish translation  : Vol. 1, Book 29, Hadith 006",
    "url": "https://sunnah.com/adab/29",
    "text": "Khalid bin al-Rabi, reported that when the illness of Huzayfah became serious his group and the Ansar heard of it. They visited him at night or in the (early) morning. Sayyidina Huzayfah asked, \"What time is it?\" They said, \"It is midnight or nearing morning.\" He said, \"I seek refuge in Allah from the morning which heralds admittance to Hell.\" He then asked, \"Have you brought the cloth? Do no shroud me in costly (cloth), for if there is good for me with Allah then I will be given a better replacement but if it is the other way then even this will be taken away quickly\"."
  },
  "2304950": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304950\nIn-book reference  : Book 29, Hadith 007\nEnglish translation  : Vol. 1, Book 29, Hadith 007",
    "url": "https://sunnah.com/adab/29",
    "text": "It is reported by Ayeshah that the Prophet said, \"When a Believer falls ill, Allah cleans him of sin as a kiln removes the rust from iron\"."
  },
  "2304960": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304960\nIn-book reference  : Book 29, Hadith 008\nEnglish translation  : Vol. 1, Book 29, Hadith 008",
    "url": "https://sunnah.com/adab/29",
    "text": "It is narrated by Ayeshah (ra) that the Prophet (ﷺ) said, \"when a Muslim is afflicted by an anxiety, pain or sickness then, because of that, his sins are atoned. So much, so that if a thorn pricks him or he suffers a simple, minor injury (His sins are forgiven)”."
  },
  "2304970": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304970\nIn-book reference  : Book 29, Hadith 009\nEnglish translation  : Vol. 1, Book 29, Hadith 009",
    "url": "https://sunnah.com/adab/29",
    "text": "I was seriously ill at Makkah and the Prophet visited me. I said to him \"Messenger of Allah, I shall leave behind me a good fortune and I have only a daughter (as my heir). Shall I bequeath two-thirds of my property to be spent in charity and leave one-third (for the heir)?\" He said, \"No!\" Then I asked, \"Shall I bequeath half and leave her half?\" He again said, \"No\". Then I asked, \"Shall I Bequeath one-third and leave two- third (for her)?\" the Prophet said,\"(You may bequeath) one-third, but even one-third is much\".\nHe then placed his hand on my forehead and passed it over my face and stomach and made this supplication. \"O Allah, cure sad and completed his emigration.\" Ever since I have not ceased to sense the pleasant cool of his hand on my liver.\""
  },
  "2304980": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304980\nIn-book reference  : Book 29, Hadith 010\nEnglish translation  : Vol. 1, Book 29, Hadith 010",
    "url": "https://sunnah.com/adab/29",
    "text": "It is narrated by Abdullah bin Amr that Prophet (ﷺ) said, \"When a person falls ill then the reward of those deeds is also recorded for him which he used to perform when he was healthy."
  },
  "2304990": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304990\nIn-book reference  : Book 29, Hadith 011\nEnglish translation  : Vol. 1, Book 29, Hadith 011",
    "url": "https://sunnah.com/adab/29",
    "text": "Anas bin Maalik has reported that the Prophet (ﷺ) said, \"When Allah involves a Muslim in bodily [pain then he is credited with a reward for those deeds which he was used to do when he was healthy as long as he is ill. Thus, if Allah gives him healing, He washes him (clean of sins). But, if he causes him to die then he forgives him."
  },
  "2305000": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305000\nIn-book reference  : Book 29, Hadith 012\nEnglish translation  : Vol. 1, Book 29, Hadith 012",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayrah said that fever presented itself before the Holy Prophet (ﷺ). It said to him, ’’Send me to those people with whom you have a very deep connection. The Prophet (ﷺ) sent it to the Ansar. So, fever gripped them for six days and six nights. Their feverish condition became very serious and the Prophet visited them at their homes. Thy complained of fever and the Holy Prophet (ﷺ) went to each house and prayed for their health. When he was returning, one of their women followed behind him and said, \"By Him who has sent you with the truth, I am of the Ansar and my father is also one of the Ansar. Just as you have prayed for the Ansar, pray for me too.\" The Prophet sg asked her, \"What is it that you wish? If you wish, I will pray to Allah that he grant you health but if you are patient then paradise is for you.\" She said, \"I will endure (fever) patiently and will not risk (my chance of) admission to paradise.\""
  },
  "2305010": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305010\nIn-book reference  : Book 29, Hadith 013\nEnglish translation  : Vol. 1, Book 29, Hadith 013",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayrah said that he did not like any illness more than fever because it went into each of his limbs. And, Allah grants each limb its share of reward."
  },
  "2305020": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305020\nIn-book reference  : Book 29, Hadith 014\nEnglish translation  : Vol. 1, Book 29, Hadith 014",
    "url": "https://sunnah.com/adab/29",
    "text": "It is reported by Abu wail that someone said to Abu Nuhaylah (when he was ill), \"Pray to Allah.\" So, he made this supplication, \"Oh Allah, lessen the illness but do not diminish the reward.\" He was again asked to supplicate Allah and he said, \"O Allah, let me be among the near ones and make my mother among the hoor (maids of Paradise)”."
  },
  "2305030": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305030\nIn-book reference  : Book 29, Hadith 015\nEnglish translation  : Vol. 1, Book 29, Hadith 015",
    "url": "https://sunnah.com/adab/29",
    "text": "Ata bin Abu Rabah said that Ibn Abbas asked him if he would like him to show him a woman who would go to paradise. So, he said that he would certainly like (him to show him the woman). Ibn Abbas said to him. \"This is a black woman who came to the Prophet and said to him, \"Messenger of Allah, I am subject to fits and become uncovered, so make a supplication to Allah to cure me, \"The Prophet (ﷺ) said to her, \"If you endure it patiently, you will be rewarded with paradise, but if you wish I will make a supplication to Allah to cure you.\" The woman said, ’I shall endure it. But, (when I get fits) I become uncovered, make supplication to Allah that I may not become uncovered. So, he made a supplication for her.\""
  },
  "2305040": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305040\nIn-book reference  : Book 29, Hadith 016\nEnglish translation  : Vol. 1, Book 29, Hadith 016",
    "url": "https://sunnah.com/adab/29",
    "text": "It is reported by Ibn Jurayj that Ata said to him, \"I saw the woman, Umm Zufar, on the steps of the Kabah. (She was) a black woman, tall in height\".\n\nAyeshah, said that the Prophet said, \"If a thorn pricks a Believer or he is hurt more than that then that is an expiation for his sins.\""
  },
  "2305050": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305050\nIn-book reference  : Book 29, Hadith 017\nEnglish translation  : Vol. 1, Book 29, Hadith 017",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayrah reported the Messenger of Allah (ﷺ) as saying, \"if a thorn pricks a Muslim in this world and he hopes for the reward against it then Allah forgives him his sins on the day of Resurrection\"."
  },
  "2305060": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305060\nIn-book reference  : Book 29, Hadith 018\nEnglish translation  : Vol. 1, Book 29, Hadith 018",
    "url": "https://sunnah.com/adab/29",
    "text": "It is narrated by Jabir that he heard the Messenger of Allah (ﷺ) say, \"If a believing man or a believing woman or a Muslim man or Muslim woman falls ill then Allah, the exalted, forgives them their sins (because of their illness).\""
  },
  "2305070": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305070\nIn-book reference  : Book 29, Hadith 019\nEnglish translation  : Vol. 1, Book 29, Hadith 019",
    "url": "https://sunnah.com/adab/29",
    "text": "either you will be killed and I will leave you to Allah or you will win and I will be content. Beware of having your portion presented to you and then you do not agree with it. Accept it, even though you dislike death.\""
  },
  "2305080": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305080\nIn-book reference  : Book 29, Hadith 020\nEnglish translation  : Vol. 1, Book 29, Hadith 020",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Sa'id al-Khudri reported that he came to the Messenger of Allah, may Allah bless him and grant him peace, while he had a fever. He had a covering over him. He placed his hand on him and discovered that it was hot above the covering. Abu Sa'id exclaimed, 'How hot your fever is, Messenger of Allah!' He said, 'We are like that. The affliction is hard on us, but the reward is doubled for us.' He said, 'Messenger of Allah, which people have the greatest affliction?' He replied, 'The Prophets, and then the righteous. One of them was tested by poverty to such an extent that he could only find a robe to cover himself with and he wore it. Another was tested by fleas until they killed him. They have greater joy in affliction than one of you has in gifts.\""
  },
  "2305090": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305090\nIn-book reference  : Book 29, Hadith 021\nEnglish translation  : Vol. 1, Book 29, Hadith 021",
    "url": "https://sunnah.com/adab/29",
    "text": "Jabir ibn 'Abdullah said, \"I was ill, and the Prophet, may Allah bless him and grant him peace, came with Abu Bakr to visit me. They came on foot. They found that I had fainted, so the Prophet, may Allah bless him and grant him peace, did wudu' and then poured his wudu' water on me. I came to and the Prophet, may Allah bless him and grant him peace, was there. I asked, 'Messenger of Allah, what should I do with my property? Give me a judgement regarding my property.' He did not give me any answer until the ayat of inheritance was revealed.\""
  },
  "2305100": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305100\nIn-book reference  : Book 29, Hadith 022\nEnglish translation  : Vol. 1, Book 29, Hadith 022",
    "url": "https://sunnah.com/adab/29",
    "text": "Usama ibn Zayd reported that a child of one of the daughters of the Messenger of Allah, may Allah bless him and grant him peace, was very ill. His mother sent word to the Prophet, may Allah bless him and grant him peace, to say that her child was dying. He told the messenger, \"Go and tell her that to Allah belongs what He takes and what He gives. Everything is with Him until a stated term. She should be patient and leave him to Allah.\" The messenger went back and told her. She sent to him again to plead with him to come. The Prophet, may Allah bless him and grant him peace, got up with a group of his Companions, including Sa'd ibn 'Ubada. The Prophet, may Allah bless him and grant him peace, took the child and put him on his breast. The child was shaking like a leaf against his chest. The Messenger of Allah, may Allah bless him and grant him peace, wept and Sa'd said, \"Do you weep, Messenger of Allah?\" He replied, \"I weep out of compassion for the child. Allah only shows mercy to those of His slaves who are merciful.\""
  },
  "2305110": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305110\nIn-book reference  : Book 29, Hadith 023\nEnglish translation  : Vol. 1, Book 29, Hadith 023",
    "url": "https://sunnah.com/adab/29",
    "text": "Ibrahim ibn Abi 'Abla said, \"My wife was ill and I used to go to Umm ad-Darda'. She asked me, 'How's your family?' 'Ill,' I replied. She called for some food for me and I ate. Then I went back and she did the same thing again. I visited her yet again and she asked, 'How are they?' 'They are almost well,' I replied. She said, 'I called for good for you when you told me that your family were ill. Since they are almost well know, we will not call for anything for you.'\""
  },
  "2305120": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305120\nIn-book reference  : Book 29, Hadith 024\nEnglish translation  : Vol. 1, Book 29, Hadith 024",
    "url": "https://sunnah.com/adab/29",
    "text": "Ibn 'Abbas reported that the Messenger of Allah, may Allah bless him and grant him peace, went to visit a bedouin when he was ill and said, \"Do not worry. It is a purification if Allah so wills.\" He said that the bedouin said, \"It is a fever which boils in an old man and will cause him to visit the graves.\" \"It is a blessing then,\" he concluded."
  },
  "2305130": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305130\nIn-book reference  : Book 29, Hadith 025\nEnglish translation  : Vol. 1, Book 29, Hadith 025",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Hurayra reported that the Messenger of Allah, may Allah bless him and grant him peace, asked, \"Which of you is fasting today?\" Abu Bakr said, \"I am.\" He asked, \"Which of you has visited a sick person today? \"I have,\" Abu Bakr stated. Then he asked, \"Who has attended a funeral today?\" \"I have,\" Abu Bakr said. He asked, \"Who has fed a poor person today?\" Abu Bakr said, \"I have.\""
  },
  "2305140": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305140\nIn-book reference  : Book 29, Hadith 026\nEnglish translation  : Vol. 1, Book 29, Hadith 026",
    "url": "https://sunnah.com/adab/29",
    "text": "Jabir said, \"The Prophet, may Allah bless him and grant him peace, visited Umm as-Sa'ib while she was sighing. He asked, 'What is wrong with you?' 'The fever,' she replied, \"May Allah debase it!' The Prophet, may Allah bless him and grant him peace, said, 'Gently! Do not curse it. It removes the errors of the believer as the bellows remove the dross of iron.'\""
  },
  "2305150": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305150\nIn-book reference  : Book 29, Hadith 027\nEnglish translation  : Vol. 1, Book 29, Hadith 027",
    "url": "https://sunnah.com/adab/29",
    "text": "'I asked you for food and you did not feed Me. He (His slave) will say, 'Lord, how could I feed You when You did not ask me for food and You are the Lord of the universe?' He will say, 'Do you not know that My slave so-and-so asked you for food and you did not feed him? Do you not know that if you had fed him, you would have found that action with Me? Son of Adam, I asked you for water and you did not give Me water.' The slave will reply, 'O Lord, how could I give you water when You are the Lord of the universe?' He will say, 'My slave so-and-so asked you for water and you did not give him water. Do you not know that if you had given him water, you would have found that action with Me? Son of Adam, I was ill and you did not visit Me.' He will say, 'O Lord, how could I visit You when You are the Lord of the universe?' He will say, 'Do you not know that My slave so-and-so was ill. If you had visited him you would have found that action with Me (or you would have found Me with him).\""
  },
  "2305160": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305160\nIn-book reference  : Book 29, Hadith 028\nEnglish translation  : Vol. 1, Book 29, Hadith 028",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Sa'id reported that the Prophet, may Allah bless him and grant him peace, said, \"Visit the sick. Follow funeral processions. Remind yourselves of the Next World.\""
  },
  "2305170": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305170\nIn-book reference  : Book 29, Hadith 029\nEnglish translation  : Vol. 1, Book 29, Hadith 029",
    "url": "https://sunnah.com/adab/29",
    "text": "to visit the sick, to attend funerals, and to say, 'may Allah have mercy on you' when someone sneezes if he praises Allah Almighty.\""
  },
  "2305180": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305180\nIn-book reference  : Book 29, Hadith 030\nEnglish translation  : Vol. 1, Book 29, Hadith 030",
    "url": "https://sunnah.com/adab/29",
    "text": "Three of the Banu Sa'd related from their father that the Messenger of Allah, may Allah bless him and grant him peace, visited Sa'd (ibn Abi Waqqas) in Makka and Sa'd wept. He asked, \"Why are your weeping?\" Sa'd replied, \"I fear that I will die in the land from which I have emigrated as Sa'd (ibn Khawla) died.\" The Prophet said, \"O Allah, heal Sa'd!\" three times. Sa'd said, \"I have a lot of property which my daughter will inherit. Shall I will all of it away?\" \"No,\" he replied. Sa'd asked, \"Two-thirds?\" \"No,\" he replied. \"A half then?\" Sa'd asked. \"No,\" he answered. Sa'd asked, \"A third?\" \"A third,\" he said, \"but a third is a lot. What you give as sadaqa from your property is sadaqa. What you spend on your family is sadaqa. What your wife eats of your food is sadaqa for you. It is better for you to leave your family in a state of plenty (or he said \"livelihood\") than to leave them where they have to importune people.\""
  },
  "2305190": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305190\nIn-book reference  : Book 29, Hadith 031\nEnglish translation  : Vol. 1, Book 29, Hadith 031",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Qilaba reported from Abu'l-Ash'ath as-San'ani that Abu Asma' said, \"Whoever visits his brother is in a tent of the Garden.\" I (the transmitter) asked Abu Qilaba, \"What is the tent of the Garden?\" \"Its fruits,\" he replied. I said to Abu Qilaba, \"From whom did Asma' transmit?\" \"From Thawban from the Messenger of Allah, may Allah bless him and grant him peace,\" he replied."
  },
  "2305200": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305200\nIn-book reference  : Book 29, Hadith 032\nEnglish translation  : Vol. 1, Book 29, Hadith 032",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Bakr ibn Hazm and Muhammad ibn al-Munkadir were some people from the mosque who visited 'Umar ibn al-Hakam ibn Rafi' al-Ansari. They said, \"Abu Hafs! Relate to us!\" He said, \"I heard 'Abdullah say that he heard the Prophet, may Allah bless him and grant him peace, say, \"When someone visits a sick person, he dives into mercy to such an extent that when he sits with him, he settles in it.\""
  },
  "2305210": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305210\nIn-book reference  : Book 29, Hadith 033\nEnglish translation  : Vol. 1, Book 29, Hadith 033",
    "url": "https://sunnah.com/adab/29",
    "text": "'Ata' said, \"Ibn 'Umar visited Ibn Safwan and the time came for the prayer. So Ibn 'Umar prayed two rak'ats with them and then observed, 'I am travelling.'\""
  },
  "2305220": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305220\nIn-book reference  : Book 29, Hadith 034\nEnglish translation  : Vol. 1, Book 29, Hadith 034",
    "url": "https://sunnah.com/adab/29",
    "text": "Anas reported that a Jewish boy used to serve the Prophet, may Allah bless him and grant him peace. The boy became ill and the Prophet, may Allah bless him and grant him peace, went to visit him. He sat by his head and said, \"Become a Muslim.\" The boy looked at his father who was also sitting by his head. His father said to him, \"Obey Abu'l-Qasim (may Allah bless him and grant him peace).\" So the boy became a Muslim. The Prophet, may Allah bless him and grant him peace, left saying, \"Praise be to Allah who has saved him from the Fire!\""
  },
  "2305230": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305230\nIn-book reference  : Book 29, Hadith 035\nEnglish translation  : Vol. 1, Book 29, Hadith 035",
    "url": "https://sunnah.com/adab/29",
    "text": "\"Every body is given the prayer to arise healthy among his people, yet death is nearer to him than his shoe-laces.\" And whenever Bilal’s (ra) fever subsided, he would recite, \"Would that I know that I will ever spend a night in a valley surrounded by Izkhir and Jaleel (two kinds of sweet smelling grass). And that I will arrive one day to the waters of Majannah and observe (the mountains) Shamah and Tafeel\" Ayshah (ra) went to the Prophet M, and informed him of what transpired with these two men. Thereupon, he made this supplication: \"O Allah, make us love Madinah as dearly as we love Makkah, or more than that. O Allah! Make it healthy for us and bless for us it sa' and mudd. And remove its fever putting it in al-Juhfah\""
  },
  "2305240": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305240\nIn-book reference  : Book 29, Hadith 036\nEnglish translation  : Vol. 1, Book 29, Hadith 036",
    "url": "https://sunnah.com/adab/29",
    "text": "Ibn 'Abbas reported that the Prophet, may Allah bless him and grant him peace, went to visit a bedouin who was ill. When the Prophet, may Allah bless him and grant him peace, visited someone who was ill, he would say, 'There is no harm in it. It is a purification, Allah willing.\" That man then said, \"A purification! No, rather it is a fever which boils (or appears) in an old man and will cause him to visit the graces.\" The Prophet, may Allah bless him and grant him peace, said, \"Then yes (it is)\"."
  },
  "2305250": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305250\nIn-book reference  : Book 29, Hadith 037\nEnglish translation  : Vol. 1, Book 29, Hadith 037",
    "url": "https://sunnah.com/adab/29",
    "text": "Nafi' reported that when Ibn 'Umar visited someone who was ill, he would ask him how he was. When he left him, he would say, \"May Allah choose what is best for you.\" He did not say more than that."
  },
  "2305260": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305260\nIn-book reference  : Book 29, Hadith 038\nEnglish translation  : Vol. 1, Book 29, Hadith 038",
    "url": "https://sunnah.com/adab/29",
    "text": "'Amr ibn Sa'id said, \"Al-Hajjaj visited Ibn 'Umar while I was with him, He asked, 'How are you?' 'Sound,' he replied. He asked, 'What is wrong with you?' He replied, \"I have been afflicted by the business of carrying arms on a day when it is not lawful to carry them.' He was referring to al-Hajjaj.*\""
  },
  "2305270": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305270\nIn-book reference  : Book 29, Hadith 039\nEnglish translation  : Vol. 1, Book 29, Hadith 039",
    "url": "https://sunnah.com/adab/29",
    "text": "'Abdullah ibn 'Amr ibn al-'As said, \"Do not visit wine-drinkers when they are ill.\""
  },
  "2305280": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305280\nIn-book reference  : Book 29, Hadith 040\nEnglish translation  : Vol. 1, Book 29, Hadith 040",
    "url": "https://sunnah.com/adab/29",
    "text": "Al-Harith ibn 'Abdullah al-Ansari said, \"I saw Umm ad-Darda' going to visit (a sick) Ansari man from the mosque and she was on her mount in an uncovered howdah.\""
  },
  "2305290": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305290\nIn-book reference  : Book 29, Hadith 041\nEnglish translation  : Vol. 1, Book 29, Hadith 041",
    "url": "https://sunnah.com/adab/29",
    "text": "'Abdullah ibn Abi'l-Hudhayl said, \"'Abdullah ibn Mas'ud went to visit a sick person with some other people. There was a woman in the room and one of the men began to look at her, 'Abdullah said to him, 'It would have been better for you if your eyes had been gouged out.'\""
  },
  "2305300": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305300\nIn-book reference  : Book 29, Hadith 042\nEnglish translation  : Vol. 1, Book 29, Hadith 042",
    "url": "https://sunnah.com/adab/29",
    "text": "Zayd ibn Arqam said, \"I had a pain in my eyes and the Prophet, may Allah bless him and grant him peace, visited me and said, 'Zayd, if tour eyes were to go blind because of their illness, what would you do?' He said, 'I would be steadfast and reckon my reward to be with Allah.' He said, 'If that happens to your eyes and you are steadfast and reckon your reward to be with Allah, then your reward will be the Garden.'\""
  },
  "2305310": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305310\nIn-book reference  : Book 29, Hadith 043\nEnglish translation  : Vol. 1, Book 29, Hadith 043",
    "url": "https://sunnah.com/adab/29",
    "text": "Al-Qasim ibn Muhammad reported that one of the Companions of Muhammad lost his eyesight and people visited him. He said, \"I used to look at the Prophet, may Allah bless him and grant him peace, but now that the Prophet, may Allah bless him and grant him peace, has died, by Allah, what has happened to my eyes is as easy for me to bear as one of the gazelles of Tibala (in Yemen).\""
  },
  "2305320": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305320\nIn-book reference  : Book 29, Hadith 044\nEnglish translation  : Vol. 1, Book 29, Hadith 044",
    "url": "https://sunnah.com/adab/29",
    "text": "Anas said, \"I heard the Prophet, may Allah bless him and grant him peace, say that Allah Almighty said, 'When I test him in his two precious ones (i.e. his eyes) and he is steadfast, I will repay him with the Garden.'\""
  },
  "2305330": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305330\nIn-book reference  : Book 29, Hadith 045\nEnglish translation  : Vol. 1, Book 29, Hadith 045",
    "url": "https://sunnah.com/adab/29",
    "text": "Abu Umama reported that the Prophet, may Allah bless him and grant him peace, said, \"Allah says, 'O son of Adam, when I take what is precious from you and you are steadfast in the face of the blow and reckon that your reward is with Allah, the only reward which I am content for you to have is the Garden.\""
  },
  "2305340": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305340\nIn-book reference  : Book 29, Hadith 046\nEnglish translation  : Vol. 1, Book 29, Hadith 046",
    "url": "https://sunnah.com/adab/29",
    "text": "Ibn 'Abbas said, \"When the Prophet, may Allah bless him and grant him peace, visited a sick person, he would sit by his head and then say seven times, 'I ask Allah the Immense, the Lord of the Immense Throne, to cure you.' If the time of the invalid had not yet come, he would be cured of his pain.\""
  },
  "2305350": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Visiting the Ill",
    "book_num": "29",
    "reference": "Reference  : Al-Adab Al-Mufrad 2305350\nIn-book reference  : Book 29, Hadith 047\nEnglish translation  : Vol. 1, Book 29, Hadith 047",
    "url": "https://sunnah.com/adab/29",
    "text": "Ar-Rabi' ibn al-Hasan said, \"I went with al-Hasan to visit Qatada. He sat by his head and asked after him and made supplication for him. He said, 'O Allah, heal his heart and cure him of his illness!\""
  }
}