{
  "2303310": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303310\nIn-book reference  : Book 16, Hadith 001\nEnglish translation  : Vol. 1, Book 16, Hadith 001",
    "url": "https://sunnah.com/adab/16",
    "text": "Abu Bakr reported that a man was mentioned in the presence of the Prophet, may Allah bless him and grant him peace, and someone praised him. The Prophet, may Allah bless him and grant him peace, said, \"Woe to you! You have cut off the head of your companion!\" and he repeated that several times. He went on, \"If one of you must praise someone, he should say, 'I consider that so-and-so is such-and-such.' Allah is the One who will take account of him if he thinks that he is indeed like that, No one can appropriate Allah's right to attest to someone's character.\""
  },
  "2303320": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303320\nIn-book reference  : Book 16, Hadith 002\nEnglish translation  : Vol. 1, Book 16, Hadith 002",
    "url": "https://sunnah.com/adab/16",
    "text": "Abu Musa reported that the Prophet, may Allah bless him and grant him peace, heard a man praise another man and he was using exaggeration in his praise of him. The Prophet, may Allah bless him and grant him peace, said, \"You have destroyed - or broken - the man's back.\""
  },
  "2303330": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303330\nIn-book reference  : Book 16, Hadith 003\nEnglish translation  : Vol. 1, Book 16, Hadith 003",
    "url": "https://sunnah.com/adab/16",
    "text": "Ibrahim at-Taymi reported that his father said, \"We were sitting with 'Umar and one man praised another man to his face.\" He said, \"You have wounded the man. May Allah wound you.\""
  },
  "2303340": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303340\nIn-book reference  : Book 16, Hadith 004\nEnglish translation  : Vol. 1, Book 16, Hadith 004",
    "url": "https://sunnah.com/adab/16",
    "text": "Zayd ibn Aslam reported that his father heard 'Umar state, \"Praise is slaughter.\" The transmitter added, \"He meant when it is accepted.\""
  },
  "2303350": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303350\nIn-book reference  : Book 16, Hadith 005\nEnglish translation  : Vol. 1, Book 16, Hadith 005",
    "url": "https://sunnah.com/adab/16",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"The best of men is Abu Bakr. The best of men is 'Umar. The best of men is Abu 'Ubayda. The best of men is Usayd ibn Hudayr. The best of men is Thabit ibn Qays ibn Shammas. The best of men is Mu'adh ibn 'Amr ibn al-Jamuh. The best of men is Mu'adh ibn Jabal.\" Then he said, \"The worst of men is so-and-so. The worst of men is so-and-so,\" until he had named seven men."
  },
  "2303360": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303360\nIn-book reference  : Book 16, Hadith 006\nEnglish translation  : Vol. 1, Book 16, Hadith 006",
    "url": "https://sunnah.com/adab/16",
    "text": "'A'isha said, \"A man asked permission to come to the Messenger of Allah, may Allah bless him and grant him peace, and the Messenger of Allah said, 'He is an evil son of his tribe.' When the man came in, the Prophet was courteous and cheerful towards him. When that man left, another man asked permission to come in. He said, 'He is an excellent son of his tribe.' When he came in, he was not cheerful towards him as he had been cheerful towards the other man. When he left, I said, 'Messenger of Allah, you said what you said about so-and-so and yet you were courteous to him. You said what you said about so-and-so and I did not see you do the same.' He said, ''A'isha, the worst of people are those who are feared on account of their bad language.'\""
  },
  "2303370": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303370\nIn-book reference  : Book 16, Hadith 007\nEnglish translation  : Vol. 1, Book 16, Hadith 007",
    "url": "https://sunnah.com/adab/16",
    "text": "Abu Ma'mar said, \"A man began to praise one of the amirs. Al-Miqdad began to throw dirt in his face and said, 'The Messenger of Allah, may Allah bless him and grant him peace, commanded us to throw dust into the faces of those who praise people.'\""
  },
  "2303380": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303380\nIn-book reference  : Book 16, Hadith 008\nEnglish translation  : Vol. 1, Book 16, Hadith 008",
    "url": "https://sunnah.com/adab/16",
    "text": "'Ata' ibn Abi Rabah reported that a man was praising another man in the presence of Ibn 'Umar. Ibn 'Umar began to throw dust towards his mouth. He said, \"The Messenger of Allah, may Allah bless him and grant him peace, said, 'When you see those who praise people, throw dust in their faces.'\""
  },
  "2303390": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303390\nIn-book reference  : Book 16, Hadith 009\nEnglish translation  : Vol. 1, Book 16, Hadith 009",
    "url": "https://sunnah.com/adab/16",
    "text": "Raja' said. \"One day Mihjan and I went to the mosque of the people of Basra. Burayda al-Aslami was sitting there by one of the mosque doors. Inside the mosque there was a man called Sabka who used to make the prayers long. We came to the mosque door which had a fringed woollen cloth over it. Now Burayda was someone who made jokes. He said, 'Mihjan, don't you pray as Sabka prays?' Mihjan did not answer and went back. Mihjan said, 'The Messenger of Allah, may Allah bless him and grant him peace, once took me by the hand and we went together to the top of Uhud. He looked down on Madina and said, \"Woe to a town whose people will abandon it when it becomes very prosperous. Then the Dajjal will come to it and find two angels at each of its gates, so he will not enter it.\" Then he went down until we reached the mosque and the Messenger of Allah, may Allah bless him and grant him peace, saw a man praying, prostrating and bowing. The Messenger of Allah, may Allah bless him and grant him peace, asked me, \"Who is this?\" and I began to praise him, saying, \"Messenger of Allah, this is so-and-so and so-and-so.\" \"Stop!\" he said, \"Do not let him hear or you will destroy him.\"'\""
  },
  "2303400": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303400\nIn-book reference  : Book 16, Hadith 010\nEnglish translation  : Vol. 1, Book 16, Hadith 010",
    "url": "https://sunnah.com/adab/16",
    "text": "Al-Aswad ibn Suray' said, \"I came to the Prophet, may Allah bless him and grant him peace, and said, 'Messenger of Allah, I have praised Allah and you in poems of praise and eulogies.' He said, 'As far as your Lord is concerned, He must be praised,' and so I began to recite them. Then a tall bald man asked for permission to enter. The Prophet, may Allah bless him and grant him peace, told me, 'Be silent.' The man came in and spoke for a time and then left. Then I recited again. Then the other man came back and he made be silent again. Then the man left again. That happened two or three times. I asked, 'Who is this man for whom I must be silent?' He replied, 'This is a man who does not like vain things.'\""
  },
  "2303410": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Praise",
    "book_num": "16",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303410\nIn-book reference  : Book 16, Hadith 011\nEnglish translation  : Vol. 1, Book 16, Hadith 011",
    "url": "https://sunnah.com/adab/16",
    "text": "Abu Nujayd said, \"A poet came to 'Imran ibn Husayn and 'Imran gave him something. 'Imran was asked, 'You give to a poet?' He said, 'I am preserving my reputation (from his satire).'\""
  }
}