{
  "2304810": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304810\nIn-book reference  : Book 28, Hadith 001\nEnglish translation  : Vol. 1, Book 28, Hadith 001",
    "url": "https://sunnah.com/adab/28",
    "text": "Jabir ibn 'Abdullah reported that the Prophet, may Allah bless him and grant him peace, said, \"Fear injustice. Injustice will appear as darkness on the Day of Rising. Fear avarice. Avarice destroyed people before you and led them to shed one another's blood and to make lawful what was unlawful for them.\""
  },
  "2304820": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304820\nIn-book reference  : Book 28, Hadith 002\nEnglish translation  : Vol. 1, Book 28, Hadith 002",
    "url": "https://sunnah.com/adab/28",
    "text": "Jabir reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"During the final days of my community there will be distortion, slander and tyranny, and it will begin with people who commit injustices.\""
  },
  "2304830": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304830\nIn-book reference  : Book 28, Hadith 003\nEnglish translation  : Vol. 1, Book 28, Hadith 003",
    "url": "https://sunnah.com/adab/28",
    "text": "Ibn 'Umar reported that the Prophet, may Allah bless him and grant him peace, said, \"Injustice will appear as darkness on the Day of Rising.\""
  },
  "2304840": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304840\nIn-book reference  : Book 28, Hadith 004\nEnglish translation  : Vol. 1, Book 28, Hadith 004",
    "url": "https://sunnah.com/adab/28",
    "text": "Abu Sa'id reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"When the believers are saved from the Fire, they will be stopped on a bridge between the Garden and the Fire. They were be interrogated concerning the injustices which occurred between them in this world. When they have been cleansed and they have been disciplined, then they will be given permission to enter the Garden. By the One who holds the soul of Muhammad in His hand, one of them is better guided in his position than he was in this world.\""
  },
  "2304850": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304850\nIn-book reference  : Book 28, Hadith 005\nEnglish translation  : Vol. 1, Book 28, Hadith 005",
    "url": "https://sunnah.com/adab/28",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"Beware of injustice. Injustice will appear as darkness on the Day of Rising. Beware of coarseness. Allah does not love those who are coarse and foul mouthed. Beware of avarice for it destroyed those before you. They cut off their relatives. Allah summoned them and they made lawful what was unlawful.\""
  },
  "2304860": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304860\nIn-book reference  : Book 28, Hadith 006\nEnglish translation  : Vol. 1, Book 28, Hadith 006",
    "url": "https://sunnah.com/adab/28",
    "text": "Jabir reported that the Prophet, may Allah bless him and grant him peace, said, \"Beware of injustice. Injustice will appear as darkness on the Day of Rising. Fear avarice. It destroyed those before you and caused them to shed one another's blood and to make lawful what was unlawful.\""
  },
  "2304870": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304870\nIn-book reference  : Book 28, Hadith 007\nEnglish translation  : Vol. 1, Book 28, Hadith 007",
    "url": "https://sunnah.com/adab/28",
    "text": "\"Masruq and Shutayr ibn Shakal met in the mosque. The people sitting in circles in the mosque moved towards them. Masruq said, 'I can only think that these people are gathering around us in order to hear good from us. If you relate from 'Abdullah, I will confirm you. If I relate from 'Abdullah, you can confirm me.' He said, 'Abu 'A'isha, relate!' He said, 'Did you hear 'Abdullah say, \"The eyes commit fornication. The hands commit fornication. The feet commit fornication, and then the genitals either confirm or deny that?\"' 'Yes,' he replied, 'I have heard it.' He said, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an which is greater in combining the halal and the haram and the command and the prohibition than this ayat: 'Indeed Allah commands to justice and doing good and giving to relatives' (16.90)?\"' 'Yes,' he replied, 'I have heard it.' He said, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an swifter in bringing relief than His words, \"Whoever has taqwa of Allah - He will give him a way out\" (65:2)?' 'Yes,' he replied, 'I have heard it.' He said, 'Did you hear 'Abdullah say, \"There is no ayat in the Qur'an stronger in entrusting things to Allah than His words, \"My slaves, you have transgressed against yourselves, do not despair of the mercy of Allah\" (39:53)?' 'Yes,' he replied, 'I heard that.'\""
  },
  "2304880": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Injustice",
    "book_num": "28",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304880\nIn-book reference  : Book 28, Hadith 008\nEnglish translation  : Vol. 1, Book 28, Hadith 008",
    "url": "https://sunnah.com/adab/28",
    "text": "\"My slaves! I have forbidden injustice for Myself and I have made it forbidden among you, so do not wrong one another. \"My slaves! You err by night and day and I forgive wrong actions and do not care. Ask me for forgiveness and I will forgive you. \"My slaves! All of you are hungry unless I have fed you, so ask Me to feed you, and I will feed you. All of you are naked unless I have clothed you, so ask Me to clothe you and I will clothe you. \"My slaves! If all of you, the first of you and the last of you, the jinn among you and the men among you, were to be as godfearing as the most godfearing heart of any one of you, that would not add anything to My kingdom. If they were to be as corrupt as the most corrupt heart of any one of you, that would not decrease anything in My kingdom. If they were to join together in one place and then ask of Me, and I gave every man among them what he asked for that, that would not reduce My kingdom at all, except as the sea is decreased if a needle is dipped into it. \"My slaves! It is only your actions which I have appointed for you. Whoever finds good should praise Allah. Whoever finds other than that should only blame himself.'\""
  }
}