{
  "2303950": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303950\nIn-book reference  : Book 22, Hadith 001\nEnglish translation  : Vol. 1, Book 22, Hadith 001",
    "url": "https://sunnah.com/adab/22",
    "text": "\"By Allah I will not ever accept the intercession of anyone for him, and I will not ever break my vow that I have vowed.\" When it went on long for Ibn Az-Zubair, he spoke to Al-Miswar bin Makhramah and 'Abdur-Rahman bin Al-Aswad bin Yaghut and they were from Bani Zuhrah. So he said to them: \"I beseech you in the Name of Allah that you enter me upon (the place of) 'Aishah because it is unlawful for her to vow to sever relations with me.\" So Al-Miswar and 'Abdur-Rahman approached with him under their upper garments until they sought her permission, saying: \"As-salamu 'alaiki wa rahmatullahi wa barakatuhu! Shall we come in?\" 'Aishah (May Allah be pleased with her) said: \"Come in,\" They asked: \"All of us, o mother of the believers?\" She said: \"Yes all of you,\" and she did know that Ibn Az-Zubair was with them. So, when they entered, Ibn Az-Zubair entered the screened place and hugged 'Aishah (May Allah be pleased with her) and began beseeching her and wept. And Al-Miswar and 'Abdur-Rahman began to plead her to but speak to him and to accept from him, also saying to her: \"You know that the Messenger Allah ﷺ forbade what you know of abandonment and that it is not permissible for a man to abandon his brother over three nights.\" He said: So when they did a great deal of reminding and urging, she began remind them and weep, saying: \"I have made a vow which is a matter of very serious nature.\" They persisted in their appeal till she spoke with 'Abdullah bin Az-Zubair. Then she freed forty slaves as an expiation for breaking her vow. Later on she would remember, after freeing forty slaves, then she would weep so much that her veil would become wet with tears."
  },
  "2303960": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303960\nIn-book reference  : Book 22, Hadith 002\nEnglish translation  : Vol. 1, Book 22, Hadith 002",
    "url": "https://sunnah.com/adab/22",
    "text": "Anas ibn Malik reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not hate one another nor envy one another nor shun one another. Slaves of Allah, be brothers! It is not lawful for a Muslim to refuse to speak to his brother (Muslim) for more than three nights.\""
  },
  "2303970": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303970\nIn-book reference  : Book 22, Hadith 003\nEnglish translation  : Vol. 1, Book 22, Hadith 003",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Ayyub, the Companion of the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is not lawful for anyone to cut himself off from his Muslim brother for more than three nights so that when they meet, one of them turns his face away in avoidance and the other one turns his face away as well. The better of them is the one who initiates the greeting.\""
  },
  "2303980": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303980\nIn-book reference  : Book 22, Hadith 004\nEnglish translation  : Vol. 1, Book 22, Hadith 004",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not hate one another nor contend with one another. Slaves of Allah, be brothers.\""
  },
  "2303990": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2303990\nIn-book reference  : Book 22, Hadith 005\nEnglish translation  : Vol. 1, Book 22, Hadith 005",
    "url": "https://sunnah.com/adab/22",
    "text": "Anas reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Two people do not love each other in Allah Almighty or in Islam if the first wrong action that one of them does creates a split between them.\""
  },
  "2304000": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304000\nIn-book reference  : Book 22, Hadith 006\nEnglish translation  : Vol. 1, Book 22, Hadith 006",
    "url": "https://sunnah.com/adab/22",
    "text": "Hisham ibn 'Amir al-Ansari, the cousin of Anas ibn Malik whose father was killed in the Battle of Uhud, that he heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"It is not lawful for a Muslim to snub another Muslim for more than three nights. As long as they are cut off from each other, they are turning away from the Truth. The first of them to return to a proper state has his expiation for that inasmuch as he was the first to return to a proper state. If they die while they are cut off from each other, neither of them will ever enter the Garden. If one of them greets the other and he refuses to return the greeting or accept his greeting, then an angel returns the greeting to him and Shaytan answers the other.\""
  },
  "2304010": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304010\nIn-book reference  : Book 22, Hadith 007\nEnglish translation  : Vol. 1, Book 22, Hadith 007",
    "url": "https://sunnah.com/adab/22",
    "text": "'A'isha mentioned that the Messenger of Allah, may Allah bless him and grant him peace, told her, \"I can see you when you are angry or pleased.\" She asked, \"How do you see that, Messenger of Allah?\" He replied, \"When you are pleased, you say, 'Yes, by the Lord of Muhammad.' But when you are angry, you say, 'No, by the Lord of Ibrahim.'\" She said that she replied, \"Yes, I only cut out your name.\""
  },
  "2304020": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304020\nIn-book reference  : Book 22, Hadith 008\nEnglish translation  : Vol. 1, Book 22, Hadith 008",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Khirash al-Aslami reported that he heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"Whoever snubs his brother for a year has split his blood.\""
  },
  "2304030": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304030\nIn-book reference  : Book 22, Hadith 009\nEnglish translation  : Vol. 1, Book 22, Hadith 009",
    "url": "https://sunnah.com/adab/22",
    "text": "'Imran ibn Abi Anas reported from a man of Aslam who was one of the Companions of the Prophet, may Allah bless him and grant him peace, that the Prophet, may Allah bless him and grant him peace, said, \"Snubbing a believer for a year is like spilling his blood.\""
  },
  "2304040": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304040\nIn-book reference  : Book 22, Hadith 010\nEnglish translation  : Vol. 1, Book 22, Hadith 010",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Ayyub al-Ansari reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"It is not lawful for a Muslim to refuse to speak to his (Muslim) brother for more than three days so that when they meet, one goes this way and the goes that way. The better of the two is the one who initiates the greeting.\""
  },
  "2304050": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304050\nIn-book reference  : Book 22, Hadith 011\nEnglish translation  : Vol. 1, Book 22, Hadith 011",
    "url": "https://sunnah.com/adab/22",
    "text": "Hisham ibn 'Amir heard the Messenger of Allah, may Allah bless him and grant him peace, say, \"It is not lawful for a Muslim to snub another Muslim for more than three nights. As long as they are cut off from each other, they are turning away from the Truth. The first of them to return to a proper state has his expiation for that inasmuch as he was the first to return to a proper state. If they die while they are cut off from one another, neither of them will ever enter the Garden.\""
  },
  "2304060": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304060\nIn-book reference  : Book 22, Hadith 012\nEnglish translation  : Vol. 1, Book 22, Hadith 012",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Do not hate one another and do not envy one another. Let the slaves of Allah be brothers.\""
  },
  "2304070": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304070\nIn-book reference  : Book 22, Hadith 013\nEnglish translation  : Vol. 1, Book 22, Hadith 013",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that the Prophet, may Allah bless him and grant him peace, said, \"You will find that the worst of people in the sight of Allah on the Day of Rising will be the two-faced person who presents one face to a group of people and another face to a different group of people.\""
  },
  "2304080": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304080\nIn-book reference  : Book 22, Hadith 014\nEnglish translation  : Vol. 1, Book 22, Hadith 014",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"Beware of opinion. Opinion is the most lying form of speech. Do not try to ensnare one another (in sales) nor envy one another nor hate one another nor shun one another. Rather be the slaves of Allah and brothers.\""
  },
  "2304090": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304090\nIn-book reference  : Book 22, Hadith 015\nEnglish translation  : Vol. 1, Book 22, Hadith 015",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that the Messenger of Allah, may Allah bless him and grant him peace, said, \"The gates of the Garden are opened on Mondays and Thursdays. Every person who does not associate anything with Allah is forgiven except for someone who has enmity between existing between him and another man. It is said, 'Leave these two until they make peace.'\""
  },
  "2304100": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304100\nIn-book reference  : Book 22, Hadith 016\nEnglish translation  : Vol. 1, Book 22, Hadith 016",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu'd-Darda' said, \"Shall I tell you about something better for you than sadaqa and fasting? Improving the state of friendship. Hatred is what shaves things away.\""
  },
  "2304110": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304110\nIn-book reference  : Book 22, Hadith 017\nEnglish translation  : Vol. 1, Book 22, Hadith 017",
    "url": "https://sunnah.com/adab/22",
    "text": "the one who dies and has not associated anything with Allah, the one who was not a sorcerer nor a follower of the sorcerers, and the one who did not have rancour towards his brother.\""
  },
  "2304120": {
    "collection": "Al-Adab Al-Mufrad",
    "book": "Abandonment",
    "book_num": "22",
    "reference": "Reference  : Al-Adab Al-Mufrad 2304120\nIn-book reference  : Book 22, Hadith 018\nEnglish translation  : Vol. 1, Book 22, Hadith 018",
    "url": "https://sunnah.com/adab/22",
    "text": "Abu Hurayra reported that he heard the Prophet, may Allah bless him and grant him peace, say, \"It is not lawful for a Muslim man to refuse to speak to a believer for more than three days. When three days have passed, he should meet him and greet him. If he returns the greeting, they share in the reward. If he does not return the greeting, the one who gives the greeting is innocent of having severed relations.\""
  }
}