{
  "2261": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2261g\nIn-book reference  : Book 42, Hadith 7\nUSC-MSA web (English) reference  : Book 29, Hadith 5619\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، وَأَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ الْحَكَمِ، قَالاَ حَدَّثَنَا مُحَمَّدُ، بْنُ جَعْفَرٍ حَدَّثَنَا شُعْبَةُ، عَنْ عَبْدِ رَبِّهِ بْنِ سَعِيدٍ، عَنْ أَبِي سَلَمَةَ، قَالَ إِنْ كُنْتُ لأَرَى الرُّؤْيَا تُمْرِضُنِي - قَالَ - فَلَقِيتُ أَبَا قَتَادَةَ فَقَالَ وَأَنَا كُنْتُ لأَرَى الرُّؤْيَا فَتُمْرِضُنِي حَتَّى سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" الرُّؤْيَا الصَّالِحَةُ مِنَ اللَّهِ فَإِذَا رَأَى أَحَدُكُمْ مَا يُحِبُّ فَلاَ يُحَدِّثُ بِهَا إِلاَّ مَنْ يُحِبُّ وَإِنْ رَأَى مَا يَكْرَهُ فَلْيَتْفِلْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَتَعَوَّذْ بِاللَّهِ مِنْ شَرِّ الشَّيْطَانِ وَشَرِّهَا وَلاَ يُحَدِّثْ بِهَا أَحَدًا فَإِنَّهَا لَنْ تَضُرَّهُ \" ."
  },
  "2262": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2262\nIn-book reference  : Book 42, Hadith 8\nUSC-MSA web (English) reference  : Book 29, Hadith 5620\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا لَيْثٌ، ح وَحَدَّثَنَا ابْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، عَنْ أَبِي، الزُّبَيْرِ عَنْ جَابِرٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم أَنَّهُ قَالَ \" إِذَا رَأَى أَحَدُكُمُ الرُّؤْيَا يَكْرَهُهَا فَلْيَبْصُقْ عَنْ يَسَارِهِ ثَلاَثًا وَلْيَسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ ثَلاَثًا وَلْيَتَحَوَّلْ عَنْ جَنْبِهِ الَّذِي كَانَ عَلَيْهِ \" ."
  },
  "2263": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2263i\nIn-book reference  : Book 42, Hadith 19\nUSC-MSA web (English) reference  : Book 29, Hadith 5631\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ عَبْدِ اللَّهِ بْنِ يَحْيَى بْنِ أَبِي كَثِيرٍ عَنْ أَبِيهِ ."
  },
  "2264": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2264b\nIn-book reference  : Book 42, Hadith 14\nUSC-MSA web (English) reference  : Book 29, Hadith 5626\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ، بْنِ مَالِكٍ عَنِ النَّبِيِّ صلى الله عليه وسلم مِثْلَ ذَلِكَ ."
  },
  "2265": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2265c\nIn-book reference  : Book 42, Hadith 22\nUSC-MSA web (English) reference  : Book 29, Hadith 5634\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ، أَبِي فُدَيْكٍ أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - كِلاَهُمَا عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِ اللَّيْثِ قَالَ نَافِعٌ حَسِبْتُ أَنَّ ابْنَ عُمَرَ قَالَ \" جُزْءٌ مِنْ سَبْعِينَ جُزْءًا مِنَ النُّبُوَّةِ \" ."
  },
  "2266": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2266b\nIn-book reference  : Book 42, Hadith 24\nUSC-MSA web (English) reference  : Book 29, Hadith 5636\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ، شِهَابٍ حَدَّثَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ رَآنِي فِي الْمَنَامِ فَسَيَرَانِي فِي الْيَقَظَةِ أَوْ لَكَأَنَّمَا رَآنِي فِي الْيَقَظَةِ لاَ يَتَمَثَّلُ الشَّيْطَانُ بِي \" ."
  },
  "2267": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2267b\nIn-book reference  : Book 42, Hadith 26\nUSC-MSA web (English) reference  : Book 29, Hadith 5637\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا ابْنُ أَخِي الزُّهْرِيِّ، حَدَّثَنَا عَمِّي، . فَذَكَرَ الْحَدِيثَيْنِ جَمِيعًا بِإِسْنَادَيْهِمَا سَوَاءً مِثْلَ حَدِيثِ يُونُسَ ."
  },
  "2268": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2268e\nIn-book reference  : Book 42, Hadith 31\nUSC-MSA web (English) reference  : Book 29, Hadith 5642\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ فِي الْمَنَامِ كَأَنَّ رَأْسِي قُطِعَ . قَالَ فَضَحِكَ النَّبِيُّ صلى الله عليه وسلم وَقَالَ \" إِذَا لَعِبَ الشَّيْطَانُ بِأَحَدِكُمْ فِي مَنَامِهِ فَلاَ يُحَدِّثْ بِهِ النَّاسَ \" . وَفِي رِوَايَةِ أَبِي بَكْرٍ \" إِذَا لُعِبَ بِأَحَدِكُمْ \" . وَلَمْ يَذْكُرِ الشَّيْطَانَ ."
  },
  "2269": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2269d\nIn-book reference  : Book 42, Hadith 35\nUSC-MSA web (English) reference  : Book 29, Hadith 5646\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ كَثِيرٍ - عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ مِمَّا يَقُولُ لأَصْحَابِهِ \" مَنْ رَأَى مِنْكُمْ رُؤْيَا فَلْيَقُصَّهَا أَعْبُرْهَا لَهُ \" . قَالَ فَجَاءَ رَجُلٌ فَقَالَ يَا رَسُولَ اللَّهِ رَأَيْتُ ظُلَّةً . بِنَحْوِ حَدِيثِهِمْ ."
  },
  "2270": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2270\nIn-book reference  : Book 42, Hadith 36\nUSC-MSA web (English) reference  : Book 29, Hadith 5647\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" رَأَيْتُ ذَاتَ لَيْلَةٍ فِيمَا يَرَى النَّائِمُ كَأَنَّا فِي دَارِ عُقْبَةَ بْنِ رَافِعٍ فَأُتِينَا بِرُطَبٍ مِنْ رُطَبِ ابْنِ طَابٍ فَأَوَّلْتُ الرِّفْعَةَ لَنَا فِي الدُّنْيَا وَالْعَاقِبَةَ فِي الآخِرَةِ وَأَنَّ دِينَنَا قَدْ طَابَ \" ."
  },
  "2271": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2271\nIn-book reference  : Book 42, Hadith 37\nUSC-MSA web (English) reference  : Book 29, Hadith 5648\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، أَخْبَرَنِي أَبِي، حَدَّثَنَا صَخْرُ بْنُ جُوَيْرِيَةَ، عَنْ نَافِعٍ، أَنَّ عَبْدَ اللَّهِ بْنَ عُمَرَ، حَدَّثَهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" أَرَانِي فِي الْمَنَامِ أَتَسَوَّكُ بِسِوَاكٍ فَجَذَبَنِي رَجُلاَنِ أَحَدُهُمَا أَكْبَرُ مِنَ الآخَرِ فَنَاوَلْتُ السِّوَاكَ الأَصْغَرَ مِنْهُمَا فَقِيلَ لِي كَبِّرْ . فَدَفَعْتُهُ إِلَى الأَكْبَرِ \" ."
  },
  "2272": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2272\nIn-book reference  : Book 42, Hadith 38\nUSC-MSA web (English) reference  : Book 29, Hadith 5649\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنَا أَبُو عَامِرٍ عَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، وَأَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلاَءِ - وَتَقَارَبَا فِي اللَّفْظِ - قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ أَبِي بُرْدَةَ، جَدِّهِ عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" رَأَيْتُ فِي الْمَنَامِ أَنِّي أُهَاجِرُ مِنْ مَكَّةَ إِلَى أَرْضٍ بِهَا نَخْلٌ فَذَهَبَ وَهَلِي إِلَى أَنَّهَا الْيَمَامَةُ أَوْ هَجَرُ فَإِذَا هِيَ الْمَدِينَةُ يَثْرِبُ وَرَأَيْتُ فِي رُؤْيَاىَ هَذِهِ أَنِّي هَزَزْتُ سَيْفًا فَانْقَطَعَ صَدْرُهُ فَإِذَا هُوَ مَا أُصِيبَ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ ثُمَّ هَزَزْتُهُ أُخْرَى فَعَادَ أَحْسَنَ مَا كَانَ فَإِذَا هُوَ مَا جَاءَ اللَّهُ بِهِ مِنَ الْفَتْحِ وَاجْتِمَاعِ الْمُؤْمِنِينَ وَرَأَيْتُ فِيهَا أَيْضًا بَقَرًا وَاللَّهُ خَيْرٌ فَإِذَا هُمُ النَّفَرُ مِنَ الْمُؤْمِنِينَ يَوْمَ أُحُدٍ وَإِذَا الْخَيْرُ مَا جَاءَ اللَّهُ بِهِ مِنَ الْخَيْرِ بَعْدُ وَثَوَابُ الصِّدْقِ الَّذِي آتَانَا اللَّهُ بَعْدُ يَوْمَ بَدْرٍ \" ."
  },
  "2273": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2273, 2274a\nIn-book reference  : Book 42, Hadith 39\nUSC-MSA web (English) reference  : Book 29, Hadith 5650\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا أَبُو الْيَمَانِ، أَخْبَرَنَا شُعَيْبٌ، عَنْ عَبْدِ اللَّهِ، بْنِ أَبِي حُسَيْنٍ حَدَّثَنَا نَافِعُ بْنُ جُبَيْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَدِمَ مُسَيْلِمَةُ الْكَذَّابُ عَلَى عَهْدِ النَّبِيِّ صلى الله عليه وسلم الْمَدِينَةَ فَجَعَلَ يَقُولُ إِنْ جَعَلَ لِي مُحَمَّدٌ الأَمْرَ مِنْ بَعْدِهِ تَبِعْتُهُ . فَقَدِمَهَا فِي بَشَرٍ كَثِيرٍ مِنْ قَوْمِهِ فَأَقْبَلَ إِلَيْهِ النَّبِيُّ صلى الله عليه وسلم وَمَعَهُ ثَابِتُ بْنُ قَيْسِ بْنِ شَمَّاسٍ وَفِي يَدِ النَّبِيِّ صلى الله عليه وسلم قِطْعَةُ جَرِيدَةٍ حَتَّى وَقَفَ عَلَى مُسَيْلِمَةَ فِي أَصْحَابِهِ قَالَ \" لَوْ سَأَلْتَنِي هَذِهِ الْقِطْعَةَ مَا أَعْطَيْتُكَهَا وَلَنْ أَتَعَدَّى أَمْرَ اللَّهِ فِيكَ وَلَئِنْ أَدْبَرْتَ لَيَعْقِرَنَّكَ اللَّهُ وَإِنِّي لأُرَاكَ الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ وَهَذَا ثَابِتٌ يُجِيبُكَ عَنِّي \" . ثُمَّ انْصَرَفَ عَنْهُ .\nفَقَالَ ابْنُ عَبَّاسٍ فَسَأَلْتُ عَنْ قَوْلِ النَّبِيِّ، صلى الله عليه وسلم \" إِنَّكَ أَرَى الَّذِي أُرِيتُ فِيكَ مَا أُرِيتُ \" . فَأَخْبَرَنِي أَبُو هُرَيْرَةَ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" بَيْنَا أَنَا نَائِمٌ رَأَيْتُ فِي يَدَىَّ سِوَارَيْنِ مِنْ ذَهَبٍ فَأَهَمَّنِي شَأْنُهُمَا فَأُوحِيَ إِلَىَّ فِي الْمَنَامِ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَطَارَا فَأَوَّلْتُهُمَا كَذَّابَيْنِ يَخْرُجَانِ مِنْ بَعْدِي فَكَانَ أَحَدُهُمَا الْعَنْسِيَّ صَاحِبَ صَنْعَاءَ وَالآخَرُ مُسَيْلِمَةَ صَاحِبَ الْيَمَامَةِ \" ."
  },
  "2274": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2274b\nIn-book reference  : Book 42, Hadith 40\nUSC-MSA web (English) reference  : Book 29, Hadith 5651\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" بَيْنَا أَنَا نَائِمٌ أُتِيتُ خَزَائِنَ الأَرْضِ فَوَضَعَ فِي يَدَىَّ أُسْوَارَيْنِ مِنْ ذَهَبٍ فَكَبُرَا عَلَىَّ وَأَهَمَّانِي فَأُوحِيَ إِلَىَّ أَنِ انْفُخْهُمَا فَنَفَخْتُهُمَا فَذَهَبَا فَأَوَّلْتُهُمَا الْكَذَّابَيْنِ اللَّذَيْنِ أَنَا بَيْنَهُمَا صَاحِبَ صَنْعَاءَ وَصَاحِبَ الْيَمَامَةِ \" ."
  },
  "2275": {
    "collection": "Sahih Muslim",
    "book": "The Book of Dreams",
    "book_num": "42",
    "reference": "Reference  : Sahih Muslim 2275\nIn-book reference  : Book 42, Hadith 41\nUSC-MSA web (English) reference  : Book 29, Hadith 5652\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/42",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي، عَنْ أَبِي رَجَاءٍ الْعُطَارِدِيِّ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم إِذَا صَلَّى الصُّبْحَ أَقْبَلَ عَلَيْهِمْ بِوَجْهِهِ فَقَالَ \" هَلْ رَأَى أَحَدٌ مِنْكُمُ الْبَارِحَةَ رُؤْيَا \" ."
  }
}