{
  "1400": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1400e\nIn-book reference  : Book 16, Hadith 5\nUSC-MSA web (English) reference  : Book 8, Hadith 3235\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنِي عَبْدُ اللَّهِ بْنُ سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنْ عُمَارَةَ بْنِ، عُمَيْرٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَزِيدَ، عَنْ عَبْدِ اللَّهِ، قَالَ دَخَلْنَا عَلَيْهِ وَأَنَا أَحْدَثُ الْقَوْمِ، بِمِثْلِ حَدِيثِهِمْ وَلَمْ يَذْكُرْ فَلَمْ أَلْبَثْ حَتَّى تَزَوَّجْتُ ."
  },
  "1401": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1401\nIn-book reference  : Book 16, Hadith 6\nUSC-MSA web (English) reference  : Book 8, Hadith 3236\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ الْعَبْدِيُّ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسٍ، أَنَّ نَفَرًا، مِنْ أَصْحَابِ النَّبِيِّ صلى الله عليه وسلم سَأَلُوا أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم عَنْ عَمَلِهِ فِي السِّرِّ فَقَالَ بَعْضُهُمْ لاَ أَتَزَوَّجُ النِّسَاءَ . وَقَالَ بَعْضُهُمْ لاَ آكُلُ اللَّحْمَ . وَقَالَ بَعْضُهُمْ لاَ أَنَامُ عَلَى فِرَاشٍ . فَحَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ . فَقَالَ \" مَا بَالُ أَقْوَامٍ قَالُوا كَذَا وَكَذَا لَكِنِّي أُصَلِّي وَأَنَامُ وَأَصُومُ وَأُفْطِرُ وَأَتَزَوَّجُ النِّسَاءَ فَمَنْ رَغِبَ عَنْ سُنَّتِي فَلَيْسَ مِنِّي \" ."
  },
  "1402": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1402c\nIn-book reference  : Book 16, Hadith 9\nUSC-MSA web (English) reference  : Book 8, Hadith 3239\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا حُجَيْنُ بْنُ الْمُثَنَّى، حَدَّثَنَا لَيْثٌ، عَنْ عُقَيْلٍ، عَنِ ابْنِ، شِهَابٍ أَنَّهُ قَالَ أَخْبَرَنِي سَعِيدُ بْنُ الْمُسَيَّبِ، أَنَّهُ سَمِعَ سَعْدَ بْنَ أَبِي وَقَّاصٍ، يَقُولُ أَرَادَ عُثْمَانُ بْنُ مَظْعُونٍ أَنْ يَتَبَتَّلَ، فَنَهَاهُ رَسُولُ اللَّهِ صلى الله عليه وسلم وَلَوْ أَجَازَ لَهُ ذَلِكَ لاَخْتَصَيْنَا ."
  },
  "1403": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1403c\nIn-book reference  : Book 16, Hadith 12\nUSC-MSA web (English) reference  : Book 8, Hadith 3242\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ أَبِي الزُّبَيْرِ، قَالَ قَالَ جَابِرٌ سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" إِذَا أَحَدُكُمْ أَعْجَبَتْهُ الْمَرْأَةُ فَوَقَعَتْ فِي قَلْبِهِ فَلْيَعْمِدْ إِلَى امْرَأَتِهِ فَلْيُوَاقِعْهَا فَإِنَّ ذَلِكَ يَرُدُّ مَا فِي نَفْسِهِ \" ."
  },
  "1404": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1404c\nIn-book reference  : Book 16, Hadith 15\nUSC-MSA web (English) reference  : Book 8, Hadith 3245\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْمَاعِيلَ، بِهَذَا الإِسْنَادِ قَالَ كُنَّا وَنَحْنُ شَبَابٌ فَقُلْنَا يَا رَسُولَ اللَّهِ أَلاَ نَسْتَخْصِي وَلَمْ يَقُلْ نَغْزُو ."
  },
  "1405": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1405f\nIn-book reference  : Book 16, Hadith 21\nUSC-MSA web (English) reference  : Book 8, Hadith 3251\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، حَدَّثَنَا أَبُو عُمَيْسٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ، عَنْ أَبِيهِ، قَالَ رَخَّصَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَامَ أَوْطَاسٍ فِي الْمُتْعَةِ ثَلاَثًا ثُمَّ نَهَى عَنْهَا ."
  },
  "1406": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1406l\nIn-book reference  : Book 16, Hadith 33\nUSC-MSA web (English) reference  : Book 8, Hadith 3262\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي سَلَمَةَ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنِ ابْنِ أَبِي عَبْلَةَ، عَنْ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، قَالَ حَدَّثَنَا الرَّبِيعُ بْنُ سَبْرَةَ الْجُهَنِيُّ، عَنْ أَبِيهِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم نَهَى عَنِ الْمُتْعَةِ وَقَالَ \" أَلاَ إِنَّهَا حَرَامٌ مِنْ يَوْمِكُمْ هَذَا إِلَى يَوْمِ الْقِيَامَةِ وَمَنْ كَانَ أَعْطَى شَيْئًا فَلاَ يَأْخُذْهُ \" ."
  },
  "1407": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1407e\nIn-book reference  : Book 16, Hadith 38\nUSC-MSA web (English) reference  : Book 8, Hadith 3267\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، قَالاَ أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ، عَنِ ابْنِ شِهَابٍ، عَنِ الْحَسَنِ، وَعَبْدِ اللَّهِ، ابْنَىْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ أَبِي طَالِبٍ عَنْ أَبِيهِمَا، أَنَّهُ سَمِعَ عَلِيَّ بْنَ أَبِي طَالِبٍ، يَقُولُ لاِبْنِ عَبَّاسٍ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ مُتْعَةِ النِّسَاءِ يَوْمَ خَيْبَرَ وَعَنْ أَكْلِ لُحُومِ الْحُمُرِ الإِنْسِيَّةِ ."
  },
  "1408": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1408j\nIn-book reference  : Book 16, Hadith 48\nUSC-MSA web (English) reference  : Book 8, Hadith 3277\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا وَرْقَاءُ، عَنْ عَمْرِو بْنِ دِينَارٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1409": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1409e\nIn-book reference  : Book 16, Hadith 53\nUSC-MSA web (English) reference  : Book 8, Hadith 3282\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، حَدَّثَنِي خَالِدُ بْنُ يَزِيدَ، حَدَّثَنِي سَعِيدُ بْنُ أَبِي هِلاَلٍ، عَنْ نُبَيْهِ بْنِ وَهْبٍ، أَنَّ عُمَرَ بْنَ عُبَيْدِ اللَّهِ بْنِ مَعْمَرٍ، أَرَادَ أَنْ يُنْكِحَ، ابْنَهُ طَلْحَةَ بِنْتَ شَيْبَةَ بْنِ جُبَيْرٍ فِي الْحَجِّ وَأَبَانُ بْنُ عُثْمَانَ يَوْمَئِذٍ أَمِيرُ الْحَاجِّ فَأَرْسَلَ إِلَى أَبَانٍ إِنِّي قَدْ أَرَدْتُ أَنْ أُنْكِحَ، طَلْحَةَ بْنَ عُمَرَ فَأُحِبُّ أَنْ تَحْضُرَ، ذَلِكَ . فَقَالَ لَهُ أَبَانٌ أَلاَ أُرَاكَ عِرَاقِيًّا جَافِيًا إِنِّي سَمِعْتُ عُثْمَانَ بْنَ عَفَّانَ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَنْكِحُ الْمُحْرِمُ \" ."
  },
  "1410": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1410b\nIn-book reference  : Book 16, Hadith 55\nUSC-MSA web (English) reference  : Book 8, Hadith 3284\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا دَاوُدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ جَابِرِ بْنِ زَيْدٍ أَبِي الشَّعْثَاءِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّهُ قَالَ تَزَوَّجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَيْمُونَةَ وَهُوَ مُحْرِمٌ ."
  },
  "1411": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1411\nIn-book reference  : Book 16, Hadith 56\nUSC-MSA web (English) reference  : Book 8, Hadith 3285\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا أَبُو فَزَارَةَ، عَنْ يَزِيدَ بْنِ الأَصَمِّ، حَدَّثَتْنِي مَيْمُونَةُ بِنْتُ الْحَارِثِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم تَزَوَّجَهَا وَهُوَ حَلاَلٌ قَالَ وَكَانَتْ خَالَتِي وَخَالَةَ ابْنِ عَبَّاسٍ ."
  },
  "1412": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1412d\nIn-book reference  : Book 16, Hadith 60\nUSC-MSA web (English) reference  : Book 8, Hadith 3288\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِيهِ أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ نَافِعٍ، بِهَذَا الإِسْنَادِ."
  },
  "1413": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1413e\nIn-book reference  : Book 16, Hadith 65\nUSC-MSA web (English) reference  : Book 8, Hadith 3293\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ إِبْرَاهِيمَ الدَّوْرَقِيُّ، حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الْعَلاَءِ، وَسُهَيْلٍ عَنْ أَبِيهِمَا، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَاهُ مُحَمَّدُ، بْنُ الْمُثَنَّى حَدَّثَنَا عَبْدُ الصَّمَدِ، حَدَّثَنَا شُعْبَةُ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم إِلاَّ أَنَّهُمْ قَالُوا \" عَلَى سَوْمِ أَخِيهِ وَخِطْبَةِ أَخِيهِ \" ."
  },
  "1414": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1414\nIn-book reference  : Book 16, Hadith 66\nUSC-MSA web (English) reference  : Book 8, Hadith 3294\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، عَنِ اللَّيْثِ، وَغَيْرِهِ، عَنْ يَزِيدَ بْنِ، أَبِي حَبِيبٍ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، عَلَى الْمِنْبَرِ يَقُولُ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" الْمُؤْمِنُ أَخُو الْمُؤْمِنِ فَلاَ يَحِلُّ لِلْمُؤْمِنِ أَنْ يَبْتَاعَ عَلَى بَيْعِ أَخِيهِ وَلاَ يَخْطُبَ عَلَى خِطْبَةِ أَخِيهِ حَتَّى يَذَرَ \" ."
  },
  "1415": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1415d\nIn-book reference  : Book 16, Hadith 70\nUSC-MSA web (English) reference  : Book 8, Hadith 3298\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" لاَ شِغَارَ فِي الإِسْلاَمِ \" ."
  },
  "1416": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1416b\nIn-book reference  : Book 16, Hadith 72\nUSC-MSA web (English) reference  : Book 8, Hadith 3300\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدَةُ، عَنْ عُبَيْدِ اللَّهِ، - وَهُوَ ابْنُ عُمَرَ - بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ زِيَادَةَ ابْنِ نُمَيْرٍ ."
  },
  "1417": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1417\nIn-book reference  : Book 16, Hadith 73\nUSC-MSA web (English) reference  : Book 8, Hadith 3301\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، عَنْ عَبْدِ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ نَهَى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الشِّغَارِ ."
  },
  "1418": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1418\nIn-book reference  : Book 16, Hadith 74\nUSC-MSA web (English) reference  : Book 8, Hadith 3302\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، حَدَّثَنَا هُشَيْمٌ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - عَنْ عَبْدِ الْحَمِيدِ بْنِ جَعْفَرٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ، اللَّهِ الْيَزَنِيِّ عَنْ عُقْبَةَ بْنِ عَامِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَحَقَّ الشَّرْطِ أَنْ يُوفَى بِهِ مَا اسْتَحْلَلْتُمْ بِهِ الْفُرُوجَ \" . هَذَا لَفْظُ حَدِيثِ أَبِي بَكْرٍ وَابْنِ الْمُثَنَّى . غَيْرَ أَنَّ ابْنَ الْمُثَنَّى قَالَ \" الشُّرُوطِ \" ."
  },
  "1419": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1419b\nIn-book reference  : Book 16, Hadith 76\nUSC-MSA web (English) reference  : Book 8, Hadith 3304\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا الْحَجَّاجُ بْنُ أَبِي، عُثْمَانَ ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ مُوسَى، أَخْبَرَنَا عِيسَى، - يَعْنِي ابْنَ يُونُسَ - عَنِ الأَوْزَاعِيِّ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا حُسَيْنُ بْنُ مُحَمَّدٍ، حَدَّثَنَا شَيْبَانُ، ح وَحَدَّثَنِي عَمْرٌو النَّاقِدُ، وَمُحَمَّدُ بْنُ رَافِعٍ قَالاَ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، عَنْ مَعْمَرٍ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ، الدَّارِمِيُّ أَخْبَرَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، كُلُّهُمْ عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، . بِمِثْلِ مَعْنَى حَدِيثِ هِشَامٍ وَإِسْنَادِهِ . وَاتَّفَقَ لَفْظُ حَدِيثِ هِشَامٍ وَشَيْبَانَ وَمُعَاوِيَةَ بْنِ سَلاَّمٍ فِي هَذَا الْحَدِيثِ."
  },
  "1420": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1420\nIn-book reference  : Book 16, Hadith 77\nUSC-MSA web (English) reference  : Book 8, Hadith 3305\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَمُحَمَّدُ بْنُ رَافِعٍ، جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ، - وَاللَّفْظُ لاِبْنِ رَافِعٍ - حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، قَالَ سَمِعْتُ ابْنَ أَبِي مُلَيْكَةَ، يَقُولُ قَالَ ذَكْوَانُ مَوْلَى عَائِشَةَ سَمِعْتُ عَائِشَةَ، تَقُولُ سَأَلْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْجَارِيَةِ يُنْكِحُهَا أَهْلُهَا أَتُسْتَأْمَرُ أَمْ لاَ فَقَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم \" نَعَمْ تُسْتَأْمَرُ \" . فَقَالَتْ عَائِشَةُ فَقُلْتُ لَهُ فَإِنَّهَا تَسْتَحْيِي . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" فَذَلِكَ إِذْنُهَا إِذَا هِيَ سَكَتَتْ \" ."
  },
  "1421": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1421c\nIn-book reference  : Book 16, Hadith 80\nUSC-MSA web (English) reference  : Book 8, Hadith 3308\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ وَقَالَ \" الثَّيِّبُ أَحَقُّ بِنَفْسِهَا مِنْ وَلِيِّهَا وَالْبِكْرُ يَسْتَأْذِنُهَا أَبُوهَا فِي نَفْسِهَا وَإِذْنُهَا صُمَاتُهَا \" . وَرُبَّمَا قَالَ \" وَصَمْتُهَا إِقْرَارُهَا \" ."
  },
  "1422": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1422d\nIn-book reference  : Book 16, Hadith 84\nUSC-MSA web (English) reference  : Book 8, Hadith 3311\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَ يَحْيَى وَإِسْحَاقُ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، قَالَتْ تَزَوَّجَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم وَهْىَ بِنْتُ سِتٍّ وَبَنَى بِهَا وَهْىَ بِنْتُ تِسْعٍ وَمَاتَ عَنْهَا وَهْىَ بِنْتُ ثَمَانَ عَشْرَةَ ."
  },
  "1423": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1423b\nIn-book reference  : Book 16, Hadith 86\nUSC-MSA web (English) reference  : Book 8, Hadith 3313\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا سُفْيَانُ، بِهَذَا الإِسْنَادِ وَلَمْ يَذْكُرْ فِعْلَ عَائِشَةَ."
  },
  "1424": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1424b\nIn-book reference  : Book 16, Hadith 88\nUSC-MSA web (English) reference  : Book 8, Hadith 3315\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ مَعِينٍ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ الْفَزَارِيُّ، حَدَّثَنَا يَزِيدُ بْنُ كَيْسَانَ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالَ إِنِّي تَزَوَّجْتُ امْرَأَةً مِنَ الأَنْصَارِ . فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" هَلْ نَظَرْتَ إِلَيْهَا فَإِنَّ فِي عُيُونِ الأَنْصَارِ شَيْئًا \" . قَالَ قَدْ نَظَرْتُ إِلَيْهَا . قَالَ \" عَلَى كَمْ تَزَوَّجْتَهَا \" . قَالَ عَلَى أَرْبَعِ أَوَاقٍ . فَقَالَ لَهُ النَّبِيُّ صلى الله عليه وسلم \" عَلَى أَرْبَعِ أَوَاقٍ كَأَنَّمَا تَنْحِتُونَ الْفِضَّةَ مِنْ عُرْضِ هَذَا الْجَبَلِ مَا عِنْدَنَا مَا نُعْطِيكَ وَلَكِنْ عَسَى أَنْ نَبْعَثَكَ فِي بَعْثٍ تُصِيبُ مِنْهُ \" . قَالَ فَبَعَثَ بَعْثًا إِلَى بَنِي عَبْسٍ بَعَثَ ذَلِكَ الرَّجُلَ فِيهِمْ ."
  },
  "1425": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1425b\nIn-book reference  : Book 16, Hadith 90\nUSC-MSA web (English) reference  : Book 8, Hadith 3317\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ خَلَفُ بْنُ هِشَامٍ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، عَنِ الدَّرَاوَرْدِيِّ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا حُسَيْنُ بْنُ عَلِيٍّ، عَنْ زَائِدَةَ، كُلُّهُمْ عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ، بِهَذَا الْحَدِيثِ يَزِيدُ بَعْضُهُمْ عَلَى بَعْضٍ غَيْرَ أَنَّ فِي حَدِيثِ زَائِدَةَ قَالَ \" انْطَلِقْ فَقَدْ زَوَّجْتُكَهَا فَعَلِّمْهَا مِنَ الْقُرْآنِ \" ."
  },
  "1426": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1426\nIn-book reference  : Book 16, Hadith 91\nUSC-MSA web (English) reference  : Book 8, Hadith 3318\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عَبْدُ الْعَزِيزِ بْنُ مُحَمَّدٍ، حَدَّثَنِي يَزِيدُ بْنُ عَبْدِ، اللَّهِ بْنِ أُسَامَةَ بْنِ الْهَادِ ح وَحَدَّثَنِي مُحَمَّدُ بْنُ أَبِي عُمَرَ الْمَكِّيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا عَبْدُ، الْعَزِيزِ عَنْ يَزِيدَ، عَنْ مُحَمَّدِ بْنِ إِبْرَاهِيمَ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ قَالَ سَأَلْتُ عَائِشَةَ زَوْجَ النَّبِيِّ صلى الله عليه وسلم كَمْ كَانَ صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَتْ كَانَ صَدَاقُهُ لأَزْوَاجِهِ ثِنْتَىْ عَشْرَةَ أُوقِيَّةً وَنَشًّا . قَالَتْ أَتَدْرِي مَا النَّشُّ قَالَ قُلْتُ لاَ . قَالَتْ نِصْفُ أُوقِيَّةٍ . فَتِلْكَ خَمْسُمِائَةِ دِرْهَمٍ فَهَذَا صَدَاقُ رَسُولِ اللَّهِ صلى الله عليه وسلم لأَزْوَاجِهِ."
  },
  "1427": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1427g\nIn-book reference  : Book 16, Hadith 98\nUSC-MSA web (English) reference  : Book 8, Hadith 3324\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا وَهْبٌ، أَخْبَرَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّهُ قَالَ فَقَالَ رَجُلٌ مِنْ وَلَدِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ مِنْ ذَهَبٍ ."
  },
  "1365": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1365f\nIn-book reference  : Book 16, Hadith 104\nUSC-MSA web (English) reference  : Book 8, Hadith 3329\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا سُلَيْمَانُ، عَنْ ثَابِثٍ، عَنْ أَنَسٍ، ح وَحَدَّثَنِي بِهِ عَبْدُ اللَّهِ بْنُ هَاشِمِ بْنِ حَيَّانَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ، بْنُ الْمُغِيرَةِ عَنْ ثَابِتٍ، حَدَّثَنَا أَنَسٌ، قَالَ صَارَتْ صَفِيَّةُ لِدَحْيَةَ فِي مَقْسَمِهِ وَجَعَلُوا يَمْدَحُونَهَا عِنْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم - قَالَ - وَيَقُولُونَ مَا رَأَيْنَا فِي السَّبْىِ مِثْلَهَا - قَالَ - فَبَعَثَ إِلَى دِحْيَةَ فَأَعْطَاهُ بِهَا مَا أَرَادَ ثُمَّ دَفَعَهَا إِلَى أُمِّي فَقَالَ \" أَصْلِحِيهَا \" . قَالَ ثُمَّ خَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم مِنْ خَيْبَرَ حَتَّى إِذَا جَعَلَهَا فِي ظَهْرِهِ نَزَلَ ثُمَّ ضَرَبَ عَلَيْهَا الْقُبَّةَ فَلَمَّا أَصْبَحَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ كَانَ عِنْدَهُ فَضْلُ زَادٍ فَلْيَأْتِنَا بِهِ \" . قَالَ فَجَعَلَ الرَّجُلُ يَجِيءُ بِفَضْلِ التَّمْرِ وَفَضْلِ السَّوِيقِ حَتَّى جَعَلُوا مِنْ ذَلِكَ سَوَادًا حَيْسًا فَجَعَلُوا يَأْكُلُونَ مِنْ ذَلِكَ الْحَيْسِ وَيَشْرَبُونَ مِنْ حِيَاضٍ إِلَى جَنْبِهِمْ مِنْ مَاءِ السَّمَاءِ - قَالَ - فَقَالَ أَنَسٌ فَكَانَتْ تِلْكَ وَلِيمَةَ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَيْهَا - قَالَ - فَانْطَلَقْنَا حَتَّى إِذَا رَأَيْنَا جُدُرَ الْمَدِينَةِ هَشِشْنَا إِلَيْهَا فَرَفَعْنَا مَطِيَّنَا وَرَفَعَ رَسُولُ اللَّهِ صلى الله عليه وسلم مَطِيَّتَهُ - قَالَ - وَصَفِيَّةُ خَلْفَهُ قَدْ أَرْدَفَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم - قَالَ - فَعَثَرَتْ مَطِيَّةُ رَسُولِ اللَّهِ صلى الله عليه وسلم فَصُرِعَ وَصُرِعَتْ قَالَ فَلَيْسَ أَحَدٌ مِنَ النَّاسِ يَنْظُرُ إِلَيْهِ وَلاَ إِلَيْهَا حَتَّى قَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَسَتَرَهَا - قَالَ - فَأَتَيْنَاهُ فَقَالَ \" لَمْ نُضَرَّ \" . قَالَ فَدَخَلْنَا الْمَدِينَةَ فَخَرَجَ جَوَارِي نِسَائِهِ يَتَرَاءَيْنَهَا وَيَشْمَتْنَ بِصَرْعَتِهَا ."
  },
  "154": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 154b\nIn-book reference  : Book 16, Hadith 101\nUSC-MSA web (English) reference  : Book 8, Hadith 3327\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ مُطَرِّفٍ، عَنْ عَامِرٍ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم فِي الَّذِي يُعْتِقُ جَارِيَتَهُ ثُمَّ يَتَزَوَّجُهَا \" لَهُ أَجْرَانِ \" ."
  },
  "1428": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1428h\nIn-book reference  : Book 16, Hadith 111\nUSC-MSA web (English) reference  : Book 8, Hadith 3336\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ أَبِي عُثْمَانَ، عَنْ أَنَسٍ، قَالَ لَمَّا تَزَوَّجَ النَّبِيُّ صلى الله عليه وسلم زَيْنَبَ أَهْدَتْ لَهُ أُمُّ سُلَيْمٍ حَيْسًا فِي تَوْرٍ مِنْ حِجَارَةٍ فَقَالَ أَنَسٌ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اذْهَبْ فَادْعُ لِي مَنْ لَقِيتَ مِنَ الْمُسْلِمِينَ \" . فَدَعَوْتُ لَهُ مَنْ لَقِيتُ فَجَعَلُوا يَدْخُلُونَ عَلَيْهِ فَيَأْكُلُونَ وَيَخْرُجُونَ وَوَضَعَ النَّبِيُّ صلى الله عليه وسلم يَدَهُ عَلَى الطَّعَامِ فَدَعَا فِيهِ وَقَالَ فِيهِ مَا شَاءَ اللَّهُ أَنْ يَقُولَ وَلَمْ أَدَعْ أَحَدًا لَقِيتُهُ إِلاَّ دَعَوْتُهُ فَأَكَلُوا حَتَّى شَبِعُوا وَخَرَجُوا وَبَقِيَ طَائِفَةٌ مِنْهُمْ فَأَطَالُوا عَلَيْهِ الْحَدِيثَ فَجَعَلَ النَّبِيُّ صلى الله عليه وسلم يَسْتَحْيِي مِنْهُمْ أَنْ يَقُولَ لَهُمْ شَيْئًا فَخَرَجَ وَتَرَكَهُمْ فِي الْبَيْتِ فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ { يَا أَيُّهَا الَّذِينَ آمَنُوا لاَ تَدْخُلُوا بُيُوتَ النَّبِيِّ إِلاَّ أَنْ يُؤْذَنَ لَكُمْ إِلَى طَعَامٍ غَيْرَ نَاظِرِينَ إِنَاهُ} قَالَ قَتَادَةُ غَيْرَ مُتَحَيِّنِينَ طَعَامًا وَلَكِنْ إِذَا دُعِيتُمْ فَادْخُلُوا حَتَّى بَلَغَ { ذَلِكُمْ أَطْهَرُ لِقُلُوبِكُمْ وَقُلُوبِهِنَّ}"
  },
  "1429": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1429i\nIn-book reference  : Book 16, Hadith 120\nUSC-MSA web (English) reference  : Book 8, Hadith 3345\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى، أَخْبَرَنَا ابْنُ وَهْبٍ، حَدَّثَنِي عُمَرُ بْنُ مُحَمَّدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" إِذَا دُعِيتُمْ إِلَى كُرَاعٍ فَأَجِيبُوا \" ."
  },
  "1430": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1430b\nIn-book reference  : Book 16, Hadith 122\nUSC-MSA web (English) reference  : Book 8, Hadith 3347\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنِ ابْنِ جُرَيْجٍ، عَنْ أَبِي الزُّبَيْرِ، بِهَذَا الإِسْنَادِ بِمِثْلِهِ."
  },
  "1431": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1431\nIn-book reference  : Book 16, Hadith 123\nUSC-MSA web (English) reference  : Book 8, Hadith 3348\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، عَنْ هِشَامٍ، عَنِ ابْنِ سِيرِينَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا دُعِيَ أَحَدُكُمْ فَلْيُجِبْ فَإِنْ كَانَ صَائِمًا فَلْيُصَلِّ وَإِنْ كَانَ مُفْطِرًا فَلْيَطْعَمْ \"."
  },
  "1432": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1432d\nIn-book reference  : Book 16, Hadith 127\nUSC-MSA web (English) reference  : Book 8, Hadith 3353\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ زِيَادَ بْنَ سَعْدٍ، قَالَ سَمِعْتُ ثَابِتًا، الأَعْرَجَ يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" شَرُّ الطَّعَامِ طَعَامُ الْوَلِيمَةِ يُمْنَعُهَا مَنْ يَأْتِيهَا وَيُدْعَى إِلَيْهَا مَنْ يَأْبَاهَا وَمَنْ لَمْ يُجِبِ الدَّعْوَةَ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ \" ."
  },
  "1433": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1433g\nIn-book reference  : Book 16, Hadith 134\nUSC-MSA web (English) reference  : Book 8, Hadith 3360\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا يَحْيَى، - يَعْنِي ابْنَ سَعِيدٍ - جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ . مِثْلَهُ . وَفِي حَدِيثِ يَحْيَى عَنْ عُبَيْدِ اللَّهِ حَدَّثَنَا الْقَاسِمُ عَنْ عَائِشَةَ ."
  },
  "1434": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1434b\nIn-book reference  : Book 16, Hadith 136\nUSC-MSA web (English) reference  : Book 8, Hadith 3362\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، جَمِيعًا عَنِ الثَّوْرِيِّ، كِلاَهُمَا عَنْ مَنْصُورٍ، بِمَعْنَى حَدِيثِ جَرِيرٍ غَيْرَ أَنَّ شُعْبَةَ لَيْسَ فِي حَدِيثِهِ ذِكْرُ \" بِاسْمِ اللَّهِ \" . وَفِي رِوَايَةِ عَبْدِ الرَّزَّاقِ عَنِ الثَّوْرِيِّ \" بِاسْمِ اللَّهِ \" . وَفِي رِوَايَةِ ابْنِ نُمَيْرٍ قَالَ مَنْصُورٌ أُرَاهُ قَالَ \" بِاسْمِ اللَّهِ \" ."
  },
  "1435": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1435c\nIn-book reference  : Book 16, Hadith 139\nUSC-MSA web (English) reference  : Book 8, Hadith 3365\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ عَبْدِ الصَّمَدِ، حَدَّثَنِي أَبِي، عَنْ جَدِّي، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا شُعْبَةُ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الرَّحْمَنِ، حَدَّثَنَا سُفْيَانُ، ح وَحَدَّثَنِي عُبَيْدُ اللَّهِ، بْنُ سَعِيدٍ وَهَارُونُ بْنُ عَبْدِ اللَّهِ وَأَبُو مَعْنٍ الرَّقَاشِيُّ قَالُوا حَدَّثَنَا وَهْبُ بْنُ جَرِيرٍ، حَدَّثَنَا أَبِي قَالَ، سَمِعْتُ النُّعْمَانَ بْنَ رَاشِدٍ، يُحَدِّثُ عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنِي سُلَيْمَانُ بْنُ مَعْبَدٍ، حَدَّثَنَا مُعَلَّى بْنُ أَسَدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - وَهُوَ ابْنُ الْمُخْتَارِ - عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، كُلُّ هَؤُلاَءِ عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، بِهَذَا الْحَدِيثِ وَزَادَ فِي حَدِيثِ النُّعْمَانِ عَنِ الزُّهْرِيِّ إِنْ شَاءَ مُجَبِّيَةً وَإِنْ شَاءَ غَيْرَ مُجَبِّيَةٍ غَيْرَ أَنَّ ذَلِكَ فِي صِمَامٍ وَاحِدٍ ."
  },
  "1436": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1436d\nIn-book reference  : Book 16, Hadith 143\nUSC-MSA web (English) reference  : Book 8, Hadith 3368\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ الأَشَجُّ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا جَرِيرٌ، كُلُّهُمْ عَنِ الأَعْمَشِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا دَعَا الرَّجُلُ امْرَأَتَهُ إِلَى فِرَاشِهِ فَلَمْ تَأْتِهِ فَبَاتَ غَضْبَانَ عَلَيْهَا لَعَنَتْهَا الْمَلاَئِكَةُ حَتَّى تُصْبِحَ \" ."
  },
  "1437": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1437b\nIn-book reference  : Book 16, Hadith 145\nUSC-MSA web (English) reference  : Book 8, Hadith 3370\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ عُمَرَ، بْنِ حَمْزَةَ عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَعْدٍ، قَالَ سَمِعْتُ أَبَا سَعِيدٍ الْخُدْرِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ مِنْ أَعْظَمِ الأَمَانَةِ عِنْدَ اللَّهِ يَوْمَ الْقِيَامَةِ الرَّجُلَ يُفْضِي إِلَى امْرَأَتِهِ وَتُفْضِي إِلَيْهِ ثُمَّ يَنْشُرُ سِرَّهَا \" . وَقَالَ ابْنُ نُمَيْرٍ \" إِنَّ أَعْظَمَ \" ."
  },
  "1438": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1438l\nIn-book reference  : Book 16, Hadith 157\nUSC-MSA web (English) reference  : Book 8, Hadith 3382\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ الْمُنْذِرِ الْبَصْرِيُّ، حَدَّثَنَا زَيْدُ بْنُ حُبَابٍ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي عَلِيُّ بْنُ أَبِي طَلْحَةَ الْهَاشِمِيُّ، عَنْ أَبِي الْوَدَّاكِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1439": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1439c\nIn-book reference  : Book 16, Hadith 160\nUSC-MSA web (English) reference  : Book 8, Hadith 3385\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَا حَجَّاجُ بْنُ الشَّاعِرِ، حَدَّثَنَا أَبُو أَحْمَدَ الزُّبَيْرِيُّ، حَدَّثَنَا سَعِيدُ بْنُ حَسَّانَ، قَاصُّ أَهْلِ مَكَّةَ أَخْبَرَنِي عُرْوَةُ بْنُ عِيَاضِ بْنِ عَدِيِّ بْنِ الْخِيَارِ النَّوْفَلِيُّ، عَنْ جَابِرِ بْنِ عَبْدِ، اللَّهِ قَالَ جَاءَ رَجُلٌ إِلَى النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ سُفْيَانَ ."
  },
  "1440": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1440c\nIn-book reference  : Book 16, Hadith 163\nUSC-MSA web (English) reference  : Book 8, Hadith 3388\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنِي أَبُو غَسَّانَ الْمِسْمَعِيُّ، حَدَّثَنَا مُعَاذٌ، - يَعْنِي ابْنَ هِشَامٍ - حَدَّثَنِي أَبِي، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ كُنَّا نَعْزِلُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم فَبَلَغَ ذَلِكَ نَبِيَّ اللَّهِ صلى الله عليه وسلم فَلَمْ يَنْهَنَا ."
  },
  "1441": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1441b\nIn-book reference  : Book 16, Hadith 165\nUSC-MSA web (English) reference  : Book 8, Hadith 3390\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، جَمِيعًا عَنْ شُعْبَةَ، فِي هَذَا الإِسْنَادِ ."
  },
  "1442": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1442c\nIn-book reference  : Book 16, Hadith 168\nUSC-MSA web (English) reference  : Book 8, Hadith 3393\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ إِسْحَاقَ، حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، عَنْ مُحَمَّدِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ نَوْفَلٍ الْقُرَشِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنْ جُدَامَةَ بِنْتِ وَهْبٍ، الأَسَدِيَّةِ أَنَّهَا قَالَتْ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ بِمِثْلِ حَدِيثِ سَعِيدِ بْنِ أَبِي أَيُّوبَ فِي الْعَزْلِ وَالْغِيلَةِ . غَيْرَ أَنَّهُ قَالَ \" الْغِيَالِ \" ."
  },
  "1443": {
    "collection": "Sahih Muslim",
    "book": "The Book of Marriage",
    "book_num": "16",
    "reference": "Reference  : Sahih Muslim 1443\nIn-book reference  : Book 16, Hadith 169\nUSC-MSA web (English) reference  : Book 8, Hadith 3394\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/16",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَزُهَيْرُ بْنُ حَرْبٍ، - وَاللَّفْظُ لاِبْنِ نُمَيْرٍ - قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمَقْبُرِيُّ، حَدَّثَنَا حَيْوَةُ، حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ، أَنَّ أَبَا النَّضْرِ، حَدَّثَهُ عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّ أُسَامَةَ بْنَ زَيْدٍ، أَخْبَرَ وَالِدَهُ، سَعْدَ بْنَ أَبِي وَقَّاصٍ أَنَّ رَجُلاً، جَاءَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ إِنِّي أَعْزِلُ عَنِ امْرَأَتِي . فَقَالَ لَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لِمَ تَفْعَلُ ذَلِكَ \" . فَقَالَ الرَّجُلُ أُشْفِقُ عَلَى وَلَدِهَا أَوْ عَلَى أَوْلاَدِهَا . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَوْ كَانَ ذَلِكَ ضَارًّا ضَرَّ فَارِسَ وَالرُّومَ \" . وَقَالَ زُهَيْرٌ فِي رِوَايَتِهِ \" إِنْ كَانَ لِذَلِكَ فَلاَ مَا ضَارَ ذَلِكَ فَارِسَ وَلاَ الرُّومَ \"."
  }
}