{
  "1471": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1471u\nIn-book reference  : Book 18, Hadith 21\nUSC-MSA web (English) reference  : Book 9, Hadith 3490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ عَبْدَ الرَّحْمَنِ بْنَ أَيْمَنَ، مَوْلَى عُرْوَةَ يَسْأَلُ ابْنَ عُمَرَ وَأَبُو الزُّبَيْرِ يَسْمَعُ بِمِثْلِ حَدِيثِ حَجَّاجٍ وَفِيهِ بَعْضُ الزِّيَادَةِ . قَالَ مُسْلِمٌ أَخْطَأَ حَيْثُ قَالَ عُرْوَةَ إِنَّمَا هُوَ مَوْلَى عَزَّةَ ."
  },
  "1472": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1472c\nIn-book reference  : Book 18, Hadith 24\nUSC-MSA web (English) reference  : Book 9, Hadith 3493\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا سُلَيْمَانُ بْنُ حَرْبٍ، عَنْ حَمَّادِ بْنِ زَيْدٍ، عَنْ أَيُّوبَ السَّخْتِيَانِيِّ، عَنْ إِبْرَاهِيمَ بْنِ مَيْسَرَةَ، عَنْ طَاوُسٍ، أَنَّ أَبَا الصَّهْبَاءِ، قَالَ لاِبْنِ عَبَّاسٍ هَاتِ مِنْ هَنَاتِكَ أَلَمْ يَكُنِ الطَّلاَقُ الثَّلاَثُ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم وَأَبِي بَكْرٍ وَاحِدَةً فَقَالَ قَدْ كَانَ ذَلِكَ فَلَمَّا كَانَ فِي عَهْدِ عُمَرَ تَتَايَعَ النَّاسُ فِي الطَّلاَقِ فَأَجَازَهُ عَلَيْهِمْ ."
  },
  "1473": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1473b\nIn-book reference  : Book 18, Hadith 26\nUSC-MSA web (English) reference  : Book 9, Hadith 3495\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "حَدَّثَنَا يَحْيَى بْنُ بِشْرٍ الْحَرِيرِيُّ، حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - عَنْ يَحْيَى، بْنِ أَبِي كَثِيرٍ أَنَّ يَعْلَى بْنَ حَكِيمٍ، أَخْبَرَهُ أَنَّ سَعِيدَ بْنَ جُبَيْرٍ أَخْبَرَهُ أَنَّهُ، سَمِعَ ابْنَ عَبَّاسٍ، قَالَ إِذَا حَرَّمَ الرَّجُلُ عَلَيْهِ امْرَأَتَهُ فَهْىَ يَمِينٌ يُكَفِّرُهَا وَقَالَ { لَقَدْ كَانَ لَكُمْ فِي رَسُولِ اللَّهِ أُسْوَةٌ حَسَنَةٌ}"
  },
  "1474": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1474c\nIn-book reference  : Book 18, Hadith 29\nUSC-MSA web (English) reference  : Book 9, Hadith 3497\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "قَالَ أَبُو إِسْحَاقَ إِبْرَاهِيمُ حَدَّثَنَا الْحَسَنُ بْنُ بِشْرِ بْنِ الْقَاسِمِ، حَدَّثَنَا أَبُو أُسَامَةَ، بِهَذَا سَوَاءً وَحَدَّثَنِيهِ سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ هِشَامِ بْنِ عُرْوَةَ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "1475": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1475\nIn-book reference  : Book 18, Hadith 30\nUSC-MSA web (English) reference  : Book 9, Hadith 3498\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، حَدَّثَنَا ابْنُ وَهْبٍ، ح وَحَدَّثَنِي حَرْمَلَةُ بْنُ يَحْيَى التُّجِيبِيُّ، - وَاللَّفْظُ لَهُ - أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، أَنَّ عَائِشَةَ، قَالَتْ لَمَّا أُمِرَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِتَخْيِيرِ أَزْوَاجِهِ بَدَأَ بِي فَقَالَ \" إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ \" . قَالَتْ قَدْ عَلِمَ أَنَّ أَبَوَىَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ قَالَتْ ثُمَّ قَالَ \" إِنَّ اللَّهَ عَزَّ وَجَلَّ قَالَ { يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ إِنْ كُنْتُنَّ تُرِدْنَ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا فَتَعَالَيْنَ أُمَتِّعْكُنَّ وَأُسَرِّحْكُنَّ سَرَاحًا جَمِيلاً * وَإِنْ كُنْتُنَّ تُرِدْنَ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ فَإِنَّ اللَّهَ أَعَدَّ لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا} قَالَتْ فَقُلْتُ فِي أَىِّ هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ . قَالَتْ ثُمَّ فَعَلَ أَزْوَاجُ رَسُولِ اللَّهِ صلى الله عليه وسلم مِثْلَ مَا فَعَلْتُ ."
  },
  "1476": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1476b\nIn-book reference  : Book 18, Hadith 32\nUSC-MSA web (English) reference  : Book 9, Hadith 3499\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَاهُ الْحَسَنُ بْنُ عِيسَى، أَخْبَرَنَا ابْنُ الْمُبَارَكِ، أَخْبَرَنَا عَاصِمٌ، بِهَذَا الإِسْنَادِ . نَحْوَهُ ."
  },
  "1477": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1477f\nIn-book reference  : Book 18, Hadith 38\nUSC-MSA web (English) reference  : Book 9, Hadith 3505\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ زَكَرِيَّاءَ، حَدَّثَنَا الأَعْمَشُ، عَنْ إِبْرَاهِيمَ، عَنِ الأَسْوَدِ، عَنْ عَائِشَةَ، وَعَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، بِمِثْلِهِ."
  },
  "1478": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1478\nIn-book reference  : Book 18, Hadith 39\nUSC-MSA web (English) reference  : Book 9, Hadith 3506\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا رَوْحُ بْنُ عُبَادَةَ، حَدَّثَنَا زَكَرِيَّاءُ بْنُ إِسْحَاقَ، حَدَّثَنَا أَبُو الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ دَخَلَ أَبُو بَكْرٍ يَسْتَأْذِنُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَوَجَدَ النَّاسَ جُلُوسًا بِبَابِهِ لَمْ يُؤْذَنْ لأَحَدٍ مِنْهُمْ - قَالَ - فَأُذِنَ لأَبِي بَكْرٍ فَدَخَلَ ثُمَّ أَقْبَلَ عُمَرُ فَاسْتَأْذَنَ فَأُذِنَ لَهُ فَوَجَدَ النَّبِيَّ صلى الله عليه وسلم جَالِسًا حَوْلَهُ نِسَاؤُهُ وَاجِمًا سَاكِتًا - قَالَ - فَقَالَ لأَقُولَنَّ شَيْئًا أُضْحِكُ النَّبِيَّ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ لَوْ رَأَيْتَ بِنْتَ خَارِجَةَ سَأَلَتْنِي النَّفَقَةَ فَقُمْتُ إِلَيْهَا فَوَجَأْتُ عُنُقَهَا . فَضَحِكَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَقَالَ \" هُنَّ حَوْلِي كَمَا تَرَى يَسْأَلْنَنِي النَّفَقَةَ \" . فَقَامَ أَبُو بَكْرٍ إِلَى عَائِشَةَ يَجَأُ عُنُقَهَا فَقَامَ عُمَرُ إِلَى حَفْصَةَ يَجَأُ عُنُقَهَا كِلاَهُمَا يَقُولُ تَسْأَلْنَ رَسُولَ اللَّهِ صلى الله عليه وسلم مَا لَيْسَ عِنْدَهُ . فَقُلْنَ وَاللَّهِ لاَ نَسْأَلُ رَسُولَ اللَّهِ صلى الله عليه وسلم شَيْئًا أَبَدًا لَيْسَ عِنْدَهُ ثُمَّ اعْتَزَلَهُنَّ شَهْرًا أَوْ تِسْعًا وَعِشْرِينَ ثُمَّ نَزَلَتْ عَلَيْهِ هَذِهِ الآيَةُ { يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ} حَتَّى بَلَغَ { لِلْمُحْسِنَاتِ مِنْكُنَّ أَجْرًا عَظِيمًا} قَالَ فَبَدَأَ بِعَائِشَةَ فَقَالَ \" يَا عَائِشَةُ إِنِّي أُرِيدُ أَنْ أَعْرِضَ عَلَيْكَ أَمْرًا أُحِبُّ أَنْ لاَ تَعْجَلِي فِيهِ حَتَّى تَسْتَشِيرِي أَبَوَيْكِ \" . قَالَتْ وَمَا هُوَ يَا رَسُولَ اللَّهِ فَتَلاَ عَلَيْهَا الآيَةَ قَالَتْ أَفِيكَ يَا رَسُولَ اللَّهِ أَسْتَشِيرُ أَبَوَىَّ بَلْ أَخْتَارُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ وَأَسْأَلُكَ أَنْ لاَ تُخْبِرَ امْرَأَةً مِنْ نِسَائِكَ بِالَّذِي قُلْتُ . قَالَ \" لاَ تَسْأَلُنِي امْرَأَةٌ مِنْهُنَّ إِلاَّ أَخْبَرْتُهَا إِنَّ اللَّهَ لَمْ يَبْعَثْنِي مُعَنِّتًا وَلاَ مُتَعَنِّتًا وَلَكِنْ بَعَثَنِي مُعَلِّمًا مُيَسِّرًا \" ."
  },
  "1479": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1479e, 1475b\nIn-book reference  : Book 18, Hadith 44\nUSC-MSA web (English) reference  : Book 9, Hadith 3511\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، وَمُحَمَّدُ بْنُ أَبِي عُمَرَ، - وَتَقَارَبَا فِي لَفْظِ الْحَدِيثِ - قَالَ ابْنُ أَبِي عُمَرَ حَدَّثَنَا وَقَالَ، إِسْحَاقُ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ أَبِي ثَوْرٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ أَزَلْ حَرِيصًا أَنْأَسْأَلَ عُمَرَ عَنِ الْمَرْأَتَيْنِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَيْنِ قَالَ اللَّهُ تَعَالَى {إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا} حَتَّى حَجَّ عُمَرُ وَحَجَجْتُ مَعَهُ فَلَمَّا كُنَّا بِبَعْضِ الطَّرِيقِ عَدَلَ عُمَرُ وَعَدَلْتُ مَعَهُ بِالإِدَاوَةِ فَتَبَرَّزَ ثُمَّ أَتَانِي فَسَكَبْتُ عَلَى يَدَيْهِ فَتَوَضَّأَ فَقُلْتُ يَا أَمِيرَ الْمُؤْمِنِينَ مَنِ الْمَرْأَتَانِ مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم اللَّتَانِ قَالَ اللَّهُ عَزَّ وَجَلَّ لَهُمَا { إِنْ تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا} قَالَ عُمَرُ وَاعَجَبًا لَكَ يَا ابْنَ عَبَّاسٍ - قَالَ الزُّهْرِيُّ كَرِهَ وَاللَّهِ مَا سَأَلَهُ عَنْهُ وَلَمْ يَكْتُمْهُ - قَالَ هِيَ حَفْصَةُ وَعَائِشَةُ . ثُمَّ أَخَذَ يَسُوقُ الْحَدِيثَ قَالَ كُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ - قَالَ - وَكَانَ مَنْزِلِي فِي بَنِي أُمَيَّةَ بْنِ زَيْدٍ بِالْعَوَالِي فَتَغَضَّبْتُ يَوْمًا عَلَى امْرَأَتِي فَإِذَا هِيَ تُرَاجِعُنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي . فَقَالَتْ مَا تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ . فَانْطَلَقْتُ فَدَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ أَتُرَاجِعِينَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَتْ نَعَمْ . فَقُلْتُ أَتَهْجُرُهُ إِحْدَاكُنَّ الْيَوْمَ إِلَى اللَّيْلِ قَالَتْ نَعَمْ . قُلْتُ قَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْكُنَّ وَخَسِرَ أَفَتَأْمَنُ إِحْدَاكُنَّ أَنْ يَغْضَبَ اللَّهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَإِذَا هِيَ قَدْ هَلَكَتْ لاَ تُرَاجِعِي رَسُولَ اللَّهِ صلى الله عليه وسلم وَلاَ تَسْأَلِيهِ شَيْئًا وَسَلِينِي مَا بَدَا لَكِ وَلاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمَ وَأَحَبَّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْكِ - يُرِيدُ عَائِشَةَ - قَالَ وَكَانَ لِي جَارٌ مِنَ الأَنْصَارِ فَكُنَّا نَتَنَاوَبُ النُّزُولَ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَيَنْزِلُ يَوْمًا وَأَنْزِلُ يَوْمًا فَيَأْتِينِي بِخَبَرِ الْوَحْىِ وَغَيْرِهِ وَآتِيهِ بِمِثْلِ ذَلِكَ وَكُنَّا نَتَحَدَّثُ أَنَّ غَسَّانَ تُنْعِلُ الْخَيْلَ لِتَغْزُوَنَا فَنَزَلَ صَاحِبِي ثُمَّ أَتَانِي عِشَاءً فَضَرَبَ بَابِي ثُمَّ نَادَانِي فَخَرَجْتُ إِلَيْهِ فَقَالَ حَدَثَ أَمْرٌ عَظِيمٌ . قُلْتُ مَاذَا أَجَاءَتْ غَسَّانُ قَالَ لاَ بَلْ أَعْظَمُ مِنْ ذَلِكَ وَأَطْوَلُ طَلَّقَ النَّبِيُّ صلى الله عليه وسلم نِسَاءَهُ . فَقُلْتُ قَدْ خَابَتْ حَفْصَةُ وَخَسِرَتْ قَدْ كُنْتُ أَظُنُّ هَذَا كَائِنًا حَتَّى إِذَا صَلَّيْتُ الصُّبْحَ شَدَدْتُ عَلَىَّ ثِيَابِي ثُمَّ نَزَلْتُ فَدَخَلْتُ عَلَى حَفْصَةَ وَهْىَ تَبْكِي فَقُلْتُ أَطَلَّقَكُنَّ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَتْ لاَ أَدْرِي هَا هُوَ ذَا مُعْتَزِلٌ فِي هَذِهِ الْمَشْرُبَةِ . فَأَتَيْتُ غُلاَمًا لَهُ أَسْوَدَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ . فَدَخَلَ ثُمَّ خَرَجَ إِلَىَّ فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ فَانْطَلَقْتُ حَتَّى انْتَهَيْتُ إِلَى الْمِنْبَرِ فَجَلَسْتُ فَإِذَا عِنْدَهُ رَهْطٌ جُلُوسٌ يَبْكِي بَعْضُهُمْ فَجَلَسْتُ قَلِيلاً ثُمَّ غَلَبَنِي مَا أَجِدُ ثُمَّ أَتَيْتُ الْغُلاَمَ فَقُلْتُ اسْتَأْذِنْ لِعُمَرَ . فَدَخَلَ ثُمَّ خَرَجَ إِلَىَّ . فَقَالَ قَدْ ذَكَرْتُكَ لَهُ فَصَمَتَ . فَوَلَّيْتُ مُدْبِرًا فَإِذَا الْغُلاَمُ يَدْعُونِي فَقَالَ ادْخُلْ فَقَدْ أَذِنَ لَكَ فَدَخَلْتُ فَسَلَّمْتُ عَلَى رَسُولِ اللَّهِ صلى الله عليه وسلم فَإِذَا هُوَ مُتَّكِئٌ عَلَى رَمْلِ حَصِيرٍ قَدْ أَثَّرَ فِي جَنْبِهِ فَقُلْتُ أَطَلَّقْتَ يَا رَسُولَ اللَّهِ نِسَاءَكَ فَرَفَعَ رَأْسَهُ إِلَىَّ وَقَالَ \" لاَ \" . فَقُلْتُ اللَّهُ أَكْبَرُ لَوْ رَأَيْتَنَا يَا رَسُولَ اللَّهِ وَكُنَّا مَعْشَرَ قُرَيْشٍ قَوْمًا نَغْلِبُ النِّسَاءَ فَلَمَّا قَدِمْنَا الْمَدِينَةَ وَجَدْنَا قَوْمًا تَغْلِبُهُمْ نِسَاؤُهُمْ فَطَفِقَ نِسَاؤُنَا يَتَعَلَّمْنَ مِنْ نِسَائِهِمْ فَتَغَضَّبْتُ عَلَى امْرَأَتِي يَوْمًا فَإِذَا هِيَ تُرَاجِعُنِي فَأَنْكَرْتُ أَنْ تُرَاجِعَنِي . فَقَالَتْ مَا تُنْكِرُ أَنْ أُرَاجِعَكَ فَوَاللَّهِ إِنَّ أَزْوَاجَ النَّبِيِّ صلى الله عليه وسلم لَيُرَاجِعْنَهُ وَتَهْجُرُهُ إِحْدَاهُنَّ الْيَوْمَ إِلَى اللَّيْلِ . فَقُلْتُ قَدْ خَابَ مَنْ فَعَلَ ذَلِكَ مِنْهُنَّ وَخَسِرَ أَفَتَأْمَنُ إِحْدَاهُنَّ أَنْ يَغْضَبَ اللَّهُ عَلَيْهَا لِغَضَبِ رَسُولِهِ صلى الله عليه وسلم فَإِذَا هِيَ قَدْ هَلَكَتْ فَتَبَسَّمَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَقُلْتُ يَا رَسُولَ اللَّهِ قَدْ دَخَلْتُ عَلَى حَفْصَةَ فَقُلْتُ لاَ يَغُرَّنَّكِ أَنْ كَانَتْ جَارَتُكِ هِيَ أَوْسَمُ مِنْكِ وَأَحَبُّ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم مِنْكِ . فَتَبَسَّمَ أُخْرَى فَقُلْتُ أَسْتَأْنِسُ يَا رَسُولَ اللَّهِ . قَالَ \" نَعَمْ \" . فَجَلَسْتُ فَرَفَعْتُ رَأْسِي فِي الْبَيْتِ فَوَاللَّهِ مَا رَأَيْتُ فِيهِ شَيْئًا يَرُدُّ الْبَصَرَ إِلاَّ أُهُبًا ثَلاَثَةً فَقُلْتُ ادْعُ اللَّهَ يَا رَسُولَ اللَّهِ أَنْ يُوَسِّعَ عَلَى أُمَّتِكَ فَقَدْ وَسَّعَ عَلَى فَارِسَ وَالرُّومِ وَهُمْ لاَ يَعْبُدُونَ اللَّهَ فَاسْتَوَى جَالِسًا ثُمَّ قَالَ \" أَفِي شَكٍّ أَنْتَ يَا ابْنَ الْخَطَّابِ أُولَئِكَ قَوْمٌ عُجِّلَتْ لَهُمْ طَيِّبَاتُهُمْ فِي الْحَيَاةِ الدُّنْيَا \" . فَقُلْتُ اسْتَغْفِرْ لِي يَا رَسُولَ اللَّهِ . وَكَانَ أَقْسَمَ أَنْ لاَ يَدْخُلَ عَلَيْهِنَّ شَهْرًا مِنْ شِدَّةِ مَوْجِدَتِهِ عَلَيْهِنَّ . حَتَّى عَاتَبَهُ اللَّهُ عَزَّ وَجَلَّ . قَالَ الزُّهْرِيُّ فَأَخْبَرَنِي عُرْوَةُ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا مَضَى تِسْعٌ وَعِشْرُونَ لَيْلَةً دَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بَدَأَ بِي فَقُلْتُ يَا رَسُولَ اللَّهِ إِنَّكَ أَقْسَمْتَ أَنْ لاَ تَدْخُلَ عَلَيْنَا شَهْرًا وَإِنَّكَ دَخَلْتَ مِنْ تِسْعٍ وَعِشْرِينَ أَعُدُّهُنَّ . فَقَالَ \" إِنَّ الشَّهْرَ تِسْعٌ وَعِشْرُونَ - ثُمَّ قَالَ - يَا عَائِشَةُ إِنِّي ذَاكِرٌ لَكِ أَمْرًا فَلاَ عَلَيْكِ أَنْ لاَ تَعْجَلِي فِيهِ حَتَّى تَسْتَأْمِرِي أَبَوَيْكِ \" . ثُمَّ قَرَأَ عَلَىَّ الآيَةَ { يَا أَيُّهَا النَّبِيُّ قُلْ لأَزْوَاجِكَ} حَتَّى بَلَغَ { أَجْرًا عَظِيمًا} قَالَتْ عَائِشَةُ قَدْ عَلِمَ وَاللَّهِ أَنَّ أَبَوَىَّ لَمْ يَكُونَا لِيَأْمُرَانِي بِفِرَاقِهِ قَالَتْ فَقُلْتُ أَوَفِي هَذَا أَسْتَأْمِرُ أَبَوَىَّ فَإِنِّي أُرِيدُ اللَّهَ وَرَسُولَهُ وَالدَّارَ الآخِرَةَ . قَالَ مَعْمَرٌ فَأَخْبَرَنِي أَيُّوبُ أَنَّ عَائِشَةَ قَالَتْ لاَ تُخْبِرْ نِسَاءَكَ أَنِّي اخْتَرْتُكَ فَقَالَ لَهَا النَّبِيُّ صلى الله عليه وسلم \" إِنَّ اللَّهَ أَرْسَلَنِي مُبَلِّغًا وَلَمْ يُرْسِلْنِي مُتَعَنِّتًا \" . قَالَ قَتَادَةُ صَغَتْ قُلُوبُكُمَا مَالَتْ قُلُوبُكُمَا."
  },
  "1480": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1480t\nIn-book reference  : Book 18, Hadith 64\nUSC-MSA web (English) reference  : Book 9, Hadith 3530\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي حَسَنُ بْنُ عَلِيٍّ الْحُلْوَانِيُّ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا حَسَنُ بْنُ صَالِحٍ، عَنِ السُّدِّيِّ، عَنِ الْبَهِيِّ، عَنْ فَاطِمَةَ بِنْتِ قَيْسٍ، قَالَتْ طَلَّقَنِي زَوْجِي ثَلاَثًا فَلَمْ يَجْعَلْ لِي رَسُولُ اللَّهِ صلى الله عليه وسلم سُكْنَى وَلاَ نَفَقَةً ."
  },
  "1481": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1481c\nIn-book reference  : Book 18, Hadith 68\nUSC-MSA web (English) reference  : Book 9, Hadith 3534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا عَبْدُ الرَّحْمَنِ، عَنْ سُفْيَانَ، عَنْ عَبْدِ الرَّحْمَنِ، بْنِ الْقَاسِمِ عَنْ أَبِيهِ، قَالَ قَالَ عُرْوَةُ بْنُ الزُّبَيْرِ لِعَائِشَةَ أَلَمْ تَرَىْ إِلَى فُلاَنَةَ بِنْتِ الْحَكَمِ طَلَّقَهَا زَوْجُهَا الْبَتَّةَ فَخَرَجَتْ فَقَالَتْ بِئْسَمَا صَنَعَتْ . فَقَالَ أَلَمْ تَسْمَعِي إِلَى قَوْلِ فَاطِمَةَ فَقَالَتْ أَمَا إِنَّهُ لاَ خَيْرَ لَهَا فِي ذِكْرِ ذَلِكَ ."
  },
  "1482": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1482\nIn-book reference  : Book 18, Hadith 66\nUSC-MSA web (English) reference  : Book 9, Hadith 3532\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا حَفْصُ بْنُ غِيَاثٍ، حَدَّثَنَا هِشَامٌ، عَنْ أَبِيهِ، عَنْ فَاطِمَةَ، بِنْتِ قَيْسٍ قَالَتْ قُلْتُ يَا رَسُولَ اللَّهِ زَوْجِي طَلَّقَنِي ثَلاَثًا وَأَخَافُ أَنْ يُقْتَحَمَ عَلَىَّ . قَالَ فَأَمَرَهَا فَتَحَوَّلَتْ ."
  },
  "1483": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1483\nIn-book reference  : Book 18, Hadith 69\nUSC-MSA web (English) reference  : Book 9, Hadith 3535\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمِ بْنِ مَيْمُونٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ ابْنِ جُرَيْجٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ طُلِّقَتْ خَالَتِي فَأَرَادَتْ أَنْ تَجُدَّ نَخْلَهَا فَزَجَرَهَا رَجُلٌ أَنْ تَخْرُجَ فَأَتَتِ النَّبِيَّ صلى الله عليه وسلم فَقَالَ \" بَلَى فَجُدِّي نَخْلَكِ فَإِنَّكِ عَسَى أَنْ تَصَدَّقِي أَوْ تَفْعَلِي مَعْرُوفًا \" ."
  },
  "1484": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1484\nIn-book reference  : Book 18, Hadith 70\nUSC-MSA web (English) reference  : Book 9, Hadith 3536\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَتَقَارَبَا فِي اللَّفْظِ - قَالَ حَرْمَلَةُ حَدَّثَنَا وَقَالَ أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، - حَدَّثَنِي يُونُسُ بْنُ يَزِيدَ، عَنِ ابْنِ شِهَابٍ، حَدَّثَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ بْنِ مَسْعُودٍ، أَنَّ أَبَاهُ، كَتَبَ إِلَى عُمَرَ بْنِ عَبْدِ اللَّهِ بْنِ الأَرْقَمِ الزُّهْرِيِّ يَأْمُرُهُ أَنْ يَدْخُلَ، عَلَى سُبَيْعَةَ بِنْتِ الْحَارِثِ الأَسْلَمِيَّةِ فَيَسْأَلَهَا عَنْ حَدِيثِهَا وَعَمَّا قَالَ لَهَا رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ اسْتَفْتَتْهُ فَكَتَبَ عُمَرُ بْنُ عَبْدِ اللَّهِ إِلَى عَبْدِ اللَّهِ بْنِ عُتْبَةَ يُخْبِرُهُ أَنَّ سُبَيْعَةَ أَخْبَرَتْهُ أَنَّهَا كَانَتْ تَحْتَ سَعْدِ ابْنِ خَوْلَةَ وَهُوَ فِي بَنِي عَامِرِ بْنِ لُؤَىٍّ وَكَانَ مِمَّنْ شَهِدَ بَدْرًا فَتُوُفِّيَ عَنْهَا فِي حَجَّةِ الْوَدَاعِ وَهْىَ حَامِلٌ فَلَمْ تَنْشَبْ أَنْ وَضَعَتْ حَمْلَهَا بَعْدَ وَفَاتِهِ فَلَمَّا تَعَلَّتْ مِنْ نِفَاسِهَا تَجَمَّلَتْ لِلْخُطَّابِ فَدَخَلَ عَلَيْهَا أَبُو السَّنَابِلِ بْنُ بَعْكَكٍ - رَجُلٌ مِنْ بَنِي عَبْدِ الدَّارِ - فَقَالَ لَهَا مَا لِي أَرَاكِ مُتَجَمِّلَةً لَعَلَّكِ تَرْجِينَ النِّكَاحَ إِنَّكِ وَاللَّهِ مَا أَنْتِ بِنَاكِحٍ حَتَّى تَمُرَّ عَلَيْكِ أَرْبَعَةُ أَشْهُرٍ وَعَشْرٌ . قَالَتْ سُبَيْعَةُ فَلَمَّا قَالَ لِي ذَلِكَ جَمَعْتُ عَلَىَّ ثِيَابِي حِينَ أَمْسَيْتُ فَأَتَيْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم فَسَأَلْتُهُ عَنْ ذَلِكَ فَأَفْتَانِي بِأَنِّي قَدْ حَلَلْتُ حِينَ وَضَعْتُ حَمْلِي وَأَمَرَنِي بِالتَّزَوُّجِ إِنْ بَدَا لِي . قَالَ ابْنُ شِهَابٍ فَلاَ أَرَى بَأْسًا أَنْ تَتَزَوَّجَ حِينَ وَضَعَتْ وَإِنْ كَانَتْ فِي دَمِهَا غَيْرَ أَنْ لاَ يَقْرَبُهَا زَوْجُهَا حَتَّى تَطْهُرَ ."
  },
  "1485": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1485b\nIn-book reference  : Book 18, Hadith 72\nUSC-MSA web (English) reference  : Book 9, Hadith 3538\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَاهُ مُحَمَّدُ بْنُ رُمْحٍ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَمْرٌو، النَّاقِدُ قَالاَ حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، كِلاَهُمَا عَنْ يَحْيَى بْنِ سَعِيدٍ، بِهَذَا الإِسْنَادِ . غَيْرَ أَنَّقَالَ فِي حَدِيثِهِ فَأَرْسَلُوا إِلَى أُمِّ سَلَمَةَ وَلَمْ يُسَمِّ كُرَيْبًا ."
  },
  "1486": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1486d\nIn-book reference  : Book 18, Hadith 79\nUSC-MSA web (English) reference  : Book 9, Hadith 3544\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا عَمْرٌو النَّاقِدُ، وَابْنُ أَبِي عُمَرَ، - وَاللَّفْظُ لِعَمْرٍو - حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ بْنِ مُوسَى، عَنْ حُمَيْدِ بْنِ نَافِعٍ، عَنْ زَيْنَبَ بِنْتِ أَبِي سَلَمَةَ، قَالَتْ لَمَّا أَتَى أُمَّ حَبِيبَةَ نَعِيُّ أَبِي سُفْيَانَ دَعَتْ فِي الْيَوْمِ الثَّالِثِ بِصُفْرَةٍ فَمَسَحَتْ بِهِ ذِرَاعَيْهَا وَعَارِضَيْهَا وَقَالَتْ كُنْتُ عَنْ هَذَا غَنِيَّةً سَمِعْتُ النَّبِيَّ صلى الله عليه وسلم يَقُولُ \" لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ فَإِنَّهَا تُحِدُّ عَلَيْهِ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا \"."
  },
  "1487": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1487, 1488b\nIn-book reference  : Book 18, Hadith 75\nUSC-MSA web (English) reference  : Book 9, Hadith 3540\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَتْهُ زَيْنَبُ، عَنْ أُمِّهَا، وَعَنْ زَيْنَبَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَوْ عَنِ امْرَأَةٍ مِنْ بَعْضِ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "1488": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1488d\nIn-book reference  : Book 18, Hadith 77\nUSC-MSA web (English) reference  : Book 9, Hadith 3542\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ حُمَيْدِ بْنِ نَافِعٍ، بِالْحَدِيثَيْنِ جَمِيعًا حَدِيثِ أُمِّ سَلَمَةَ فِي الْكُحْلِ وَحَدِيثِ أُمِّ سَلَمَةَ وَأُخْرَى مِنْ أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم غَيْرَ أَنَّهُ لَمْ تُسَمِّهَا زَيْنَبُ نَحْوَ حَدِيثِ مُحَمَّدِ بْنِ جَعْفَرٍ ."
  },
  "1490": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1490d\nIn-book reference  : Book 18, Hadith 83\nUSC-MSA web (English) reference  : Book 9, Hadith 3548\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا أَبُو الرَّبِيعِ، حَدَّثَنَا حَمَّادٌ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عُبَيْدُ اللَّهِ، جَمِيعًا عَنْ نَافِعٍ، عَنْ صَفِيَّةَ بِنْتِ أَبِي عُبَيْدٍ، عَنْ بَعْضِ، أَزْوَاجِ النَّبِيِّ صلى الله عليه وسلم عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِهِمْ ."
  },
  "1491": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 1491\nIn-book reference  : Book 18, Hadith 84\nUSC-MSA web (English) reference  : Book 9, Hadith 3549\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَعَمْرٌو النَّاقِدُ وَزُهَيْرُ بْنُ حَرْبٍ - وَاللَّفْظُ لِيَحْيَى - قَالَ يَحْيَى أَخْبَرَنَا وَقَالَ الآخَرُونَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" لاَ يَحِلُّ لاِمْرَأَةٍ تُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَنْ تُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجِهَا \" ."
  },
  "938": {
    "collection": "Sahih Muslim",
    "book": "The Book of Divorce",
    "book_num": "18",
    "reference": "Reference  : Sahih Muslim 938e\nIn-book reference  : Book 18, Hadith 87\nUSC-MSA web (English) reference  : Book 9, Hadith 3552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/18",
    "text": "وَحَدَّثَنِي أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا حَمَّادٌ، حَدَّثَنَا أَيُّوبُ، عَنْ حَفْصَةَ، عَنْ أُمِّ عَطِيَّةَ، قَالَتْ كُنَّا نُنْهَى أَنْ نُحِدَّ عَلَى مَيِّتٍ فَوْقَ ثَلاَثٍ إِلاَّ عَلَى زَوْجٍ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا وَلاَ نَكْتَحِلُ وَلاَ نَتَطَيَّبُ وَلاَ نَلْبَسُ ثَوْبًا مَصْبُوغًا وَقَدْ رُخِّصَ لِلْمَرْأَةِ فِي طُهْرِهَا إِذَا اغْتَسَلَتْ إِحْدَانَا مِنْ مَحِيضِهَا فِي نُبْذَةٍ مِنْ قُسْطٍ وَأَظْفَارٍ ."
  }
}