{
  "1818": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1818b\nIn-book reference  : Book 33, Hadith 2\nUSC-MSA web (English) reference  : Book 20, Hadith 4474\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، حَدَّثَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" النَّاسُ تَبَعٌ لِقُرَيْشٍ فِي هَذَا الشَّأْنِ مُسْلِمُهُمْ تَبَعٌ لِمُسْلِمِهِمْ وَكَافِرُهُمْ تَبَعٌ لِكَافِرِهِمْ \" ."
  },
  "1819": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1819\nIn-book reference  : Book 33, Hadith 3\nUSC-MSA web (English) reference  : Book 20, Hadith 4475\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا رَوْحٌ، حَدَّثَنَا ابْنُ جُرَيْجٍ، حَدَّثَنِي أَبُو الزُّبَيْرِ أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ قَالَ النَّبِيُّ صلى الله عليه وسلم \" النَّاسُ تَبَعٌ لِقُرَيْشٍ فِي الْخَيْرِ وَالشَّرِّ \" ."
  },
  "1820": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1820\nIn-book reference  : Book 33, Hadith 4\nUSC-MSA web (English) reference  : Book 20, Hadith 4476\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ اللَّهِ بْنِ يُونُسَ، حَدَّثَنَا عَاصِمُ بْنُ مُحَمَّدِ بْنِ زَيْدٍ، عَنْ أَبِيهِ، قَالَ قَالَ عَبْدُ اللَّهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَزَالُ هَذَا الأَمْرُ فِي قُرَيْشٍ مَا بَقِيَ مِنَ النَّاسِ اثْنَانِ \" ."
  },
  "1821": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1821f\nIn-book reference  : Book 33, Hadith 10\nUSC-MSA web (English) reference  : Book 20, Hadith 4482\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ الْجَهْضَمِيُّ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا ابْنُ عَوْنٍ، ح وَحَدَّثَنَا أَحْمَدُ بْنُ عُثْمَانَ النَّوْفَلِيُّ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَزْهَرُ، حَدَّثَنَا ابْنُ عَوْنٍ، عَنِ الشَّعْبِيِّ، عَنْ جَابِرِ بْنِ سَمُرَةَ، قَالَ انْطَلَقْتُ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم وَمَعِي أَبِي فَسَمِعْتُهُ يَقُولُ \" لاَ يَزَالُ هَذَا الدِّينُ عَزِيزًا مَنِيعًا إِلَى اثْنَىْ عَشَرَ خَلِيفَةً \" . فَقَالَ كَلِمَةً صَمَّنِيهَا النَّاسُ فَقُلْتُ لأَبِي مَا قَالَ قَالَ \" كُلُّهُمْ مِنْ قُرَيْشٍ \" ."
  },
  "1822": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1822b\nIn-book reference  : Book 33, Hadith 12\nUSC-MSA web (English) reference  : Book 20, Hadith 4484\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، حَدَّثَنَا ابْنُ أَبِي ذِئْبٍ، عَنْ مُهَاجِرِ، بْنِ مِسْمَارٍ عَنْ عَامِرِ بْنِ سَعْدٍ، أَنَّهُ أَرْسَلَ إِلَى ابْنِ سَمُرَةَ الْعَدَوِيِّ حَدِّثْنَا مَا، سَمِعْتَ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ . فَذَكَرَ نَحْوَ حَدِيثِ حَاتِمٍ ."
  },
  "1823": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1823b\nIn-book reference  : Book 33, Hadith 14\nUSC-MSA web (English) reference  : Book 20, Hadith 4486\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَابْنُ أَبِي عُمَرَ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ، وَأَلْفَاظُهُمْ، مُتَقَارِبَةٌ قَالَ إِسْحَاقُ وَعَبْدٌ أَخْبَرَنَا وَقَالَ الآخَرَانِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، - أَخْبَرَنَا مَعْمَرٌ، عَنِ الزُّهْرِيِّ، أَخْبَرَنِي سَالِمٌ، عَنِ ابْنِ عُمَرَ، قَالَ دَخَلْتُ عَلَى حَفْصَةَ فَقَالَتْ أَعَلِمْتَ أَنَّ أَبَاكَ غَيْرُ مُسْتَخْلِفٍ قَالَ قُلْتُ مَا كَانَ لِيَفْعَلَ . قَالَتْ إِنَّهُ فَاعِلٌ . قَالَ فَحَلَفْتُ أَنِّي أُكَلِّمُهُ فِي ذَلِكَ فَسَكَتُّ حَتَّى غَدَوْتُ وَلَمْ أُكَلِّمْهُ - قَالَ - فَكُنْتُ كَأَنَّمَا أَحْمِلُ بِيَمِينِي جَبَلاً حَتَّى رَجَعْتُ فَدَخَلْتُ عَلَيْهِ فَسَأَلَنِي عَنْ حَالِ النَّاسِ وَأَنَا أُخْبِرُهُ - قَالَ - ثُمَّ قُلْتُ لَهُ إِنِّي سَمِعْتُ النَّاسَ يَقُولُونَ مَقَالَةً فَآلَيْتُ أَنْ أَقُولَهَا لَكَ زَعَمُوا أَنَّكَ غَيْرُ مُسْتَخْلِفٍ وَإِنَّهُ لَوْ كَانَ لَكَ رَاعِي إِبِلٍ أَوْ رَاعِي غَنَمٍ ثُمَّ جَاءَكَ وَتَرَكَهَا رَأَيْتَ أَنْ قَدْ ضَيَّعَ فَرِعَايَةُ النَّاسِ أَشَدُّ قَالَ فَوَافَقَهُ قَوْلِي فَوَضَعَ رَأْسَهُ سَاعَةً ثُمَّ رَفَعَهُ إِلَىَّ فَقَالَ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَحْفَظُ دِينَهُ وَإِنِّي لَئِنْ لاَ أَسْتَخْلِفْ فَإِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم لَمْ يَسْتَخْلِفْ وَإِنْ أَسْتَخْلِفْ فَإِنَّ أَبَا بَكْرٍ قَدِ اسْتَخْلَفَ . قَالَ فَوَاللَّهِ مَا هُوَ إِلاَّ أَنْ ذَكَرَ رَسُولَ اللَّهِ صلى الله عليه وسلم وَأَبَا بَكْرٍ فَعَلِمْتُ أَنَّهُ لَمْ يَكُنْ لِيَعْدِلَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم أَحَدًا وَأَنَّهُ غَيْرُ مُسْتَخْلِفٍ ."
  },
  "1652": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1652d\nIn-book reference  : Book 33, Hadith 16\nUSC-MSA web (English) reference  : Book 20, Hadith 4488\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، ح وَحَدَّثَنِي عَلِيُّ، بْنُ حُجْرٍ السَّعْدِيُّ حَدَّثَنَا هُشَيْمٌ، عَنْ يُونُسَ، وَمَنْصُورٍ، وَحُمَيْدٍ، ح وَحَدَّثَنَا أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ سِمَاكِ بْنِ عَطِيَّةَ، وَيُونُسَ بْنِ عُبَيْدٍ، وَهِشَامِ بْنِ حَسَّانَ، كُلُّهُمْ عَنِ الْحَسَنِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِ حَدِيثِ جَرِيرٍ ."
  },
  "1733": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1733d\nIn-book reference  : Book 33, Hadith 18\nUSC-MSA web (English) reference  : Book 20, Hadith 4490\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ حَاتِمٍ، - وَاللَّفْظُ لاِبْنِ حَاتِمٍ - قَالاَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، حَدَّثَنَا قُرَّةُ بْنُ خَالِدٍ، حَدَّثَنَا حُمَيْدُ بْنُ هِلاَلٍ، حَدَّثَنِي أَبُو بُرْدَةَ، قَالَ قَالَ أَبُو مُوسَى أَقْبَلْتُ إِلَى النَّبِيِّ صلى الله عليه وسلم وَمَعِي رَجُلاَنِ مِنَ الأَشْعَرِيِّينَ أَحَدُهُمَا عَنْ يَمِينِي وَالآخَرُ عَنْ يَسَارِي فَكِلاَهُمَا سَأَلَ الْعَمَلَ وَالنَّبِيُّ صلى الله عليه وسلم يَسْتَاكُ فَقَالَ \" مَا تَقُولُ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ \" . قَالَ فَقُلْتُ وَالَّذِي بَعَثَكَ بِالْحَقِّ مَا أَطْلَعَانِي عَلَى مَا فِي أَنْفُسِهِمَا وَمَا شَعَرْتُ أَنَّهُمَا يَطْلُبَانِ الْعَمَلَ . قَالَ وَكَأَنِّي أَنْظُرُ إِلَى سِوَاكِهِ تَحْتَ شَفَتِهِ وَقَدْ قَلَصَتْ فَقَالَ \" لَنْ أَوْ لاَ نَسْتَعْمِلُ عَلَى عَمَلِنَا مَنْ أَرَادَهُ وَلَكِنِ اذْهَبْ أَنْتَ يَا أَبَا مُوسَى أَوْ يَا عَبْدَ اللَّهِ بْنَ قَيْسِ \" . فَبَعَثَهُ عَلَى الْيَمَنِ ثُمَّ أَتْبَعَهُ مُعَاذَ بْنَ جَبَلٍ فَلَمَّا قَدِمَ عَلَيْهِ قَالَ انْزِلْ وَأَلْقَى لَهُ وِسَادَةً وَإِذَا رَجُلٌ عِنْدَهُ مُوثَقٌ قَالَ مَا هَذَا قَالَ هَذَا كَانَ يَهُودِيًّا فَأَسْلَمَ ثُمَّ رَاجَعَ دِينَهُ دِينَ السَّوْءِ فَتَهَوَّدَ قَالَ لاَ أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ فَقَالَ اجْلِسْ نَعَمْ . قَالَ لاَ أَجْلِسُ حَتَّى يُقْتَلَ قَضَاءُ اللَّهِ وَرَسُولِهِ ثَلاَثَ مَرَّاتٍ . فَأَمَرَ بِهِ فَقُتِلَ ثُمَّ تَذَاكَرَا الْقِيَامَ مِنَ اللَّيْلِ فَقَالَ أَحَدُهُمَا مُعَاذٌ أَمَّا أَنَا فَأَنَامُ وَأَقُومُ وَأَرْجُو فِي نَوْمَتِي مَا أَرْجُو فِي قَوْمَتِي ."
  },
  "1825": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1825\nIn-book reference  : Book 33, Hadith 19\nUSC-MSA web (English) reference  : Book 20, Hadith 4491\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عَبْدُ الْمَلِكِ بْنُ شُعَيْبِ بْنِ اللَّيْثِ، حَدَّثَنِي أَبِي شُعَيْبُ بْنُ اللَّيْثِ، حَدَّثَنِي اللَّيْثُ، بْنُ سَعْدٍ حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، عَنْ بَكْرِ بْنِ عَمْرٍو، عَنِ الْحَارِثِ بْنِ يَزِيدَ الْحَضْرَمِيِّ، عَنِ ابْنِ حُجَيْرَةَ الأَكْبَرِ، عَنْ أَبِي ذَرٍّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَلاَ تَسْتَعْمِلُنِي قَالَ فَضَرَبَ بِيَدِهِ عَلَى مَنْكِبِي ثُمَّ قَالَ \" يَا أَبَا ذَرٍّ إِنَّكَ ضَعِيفٌ وَإِنَّهَا أَمَانَةٌ وَإِنَّهَا يَوْمَ الْقِيَامَةِ خِزْىٌ وَنَدَامَةٌ إِلاَّ مَنْ أَخَذَهَا بِحَقِّهَا وَأَدَّى الَّذِي عَلَيْهِ فِيهَا \" ."
  },
  "1826": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1826\nIn-book reference  : Book 33, Hadith 20\nUSC-MSA web (English) reference  : Book 20, Hadith 4492\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، كِلاَهُمَا عَنِ الْمُقْرِئِ، قَالَ زُهَيْرٌ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، عَنْ عُبَيْدِ اللَّهِ بْنِ أَبِي جَعْفَرٍ الْقُرَشِيِّ، عَنْ سَالِمِ، بْنِ أَبِي سَالِمٍ الْجَيْشَانِيِّ عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" يَا أَبَا ذَرٍّ إِنِّي أَرَاكَ ضَعِيفًا وَإِنِّي أُحِبُّ لَكَ مَا أُحِبُّ لِنَفْسِي لاَ تَأَمَّرَنَّ عَلَى اثْنَيْنِ وَلاَ تَوَلَّيَنَّ مَالَ يَتِيمٍ \" ."
  },
  "1827": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1827\nIn-book reference  : Book 33, Hadith 21\nUSC-MSA web (English) reference  : Book 20, Hadith 4493\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَابْنُ، نُمَيْرٍ قَالُوا حَدَّثَنَا سُفْيَانُ، بْنُ عُيَيْنَةَ عَنْ عَمْرٍو، - يَعْنِي ابْنَ دِينَارٍ - عَنْ عَمْرِو بْنِ أَوْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ ابْنُ نُمَيْرٍ وَأَبُو بَكْرٍ يَبْلُغُ بِهِ النَّبِيَّ صلى الله عليه وسلم وَفِي حَدِيثِ زُهَيْرٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ الْمُقْسِطِينَ عِنْدَ اللَّهِ عَلَى مَنَابِرَ مِنْ نُورٍ عَنْ يَمِينِ الرَّحْمَنِ عَزَّ وَجَلَّ وَكِلْتَا يَدَيْهِ يَمِينٌ الَّذِينَ يَعْدِلُونَ فِي حُكْمِهِمْ وَأَهْلِيهِمْ وَمَا وَلُوا \" ."
  },
  "1828": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1828b\nIn-book reference  : Book 33, Hadith 23\nUSC-MSA web (English) reference  : Book 20, Hadith 4495\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، عَنْ حَرْمَلَةَ، الْمِصْرِيِّ عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُمَاسَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ"
  },
  "1829": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1829e\nIn-book reference  : Book 33, Hadith 27\nUSC-MSA web (English) reference  : Book 20, Hadith 4499\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، أَخْبَرَنِي عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي رَجُلٌ، سَمَّاهُ وَعَمْرُو بْنُ الْحَارِثِ عَنْ بُكَيْرٍ، عَنْ بُسْرِ بْنِ سَعِيدٍ، حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا الْمَعْنَى ."
  },
  "142": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 142h\nIn-book reference  : Book 33, Hadith 31\nUSC-MSA web (English) reference  : Book 20, Hadith 4503\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا عُقْبَةُ بْنُ مُكْرَمٍ الْعَمِّيُّ، حَدَّثَنَا يَعْقُوبُ بْنُ إِسْحَاقَ، أَخْبَرَنِي سَوَادَةُ بْنُ أَبِي، الأَسْوَدِ حَدَّثَنِي أَبِي أَنَّ مَعْقِلَ بْنَ يَسَارٍ، مَرِضَ فَأَتَاهُ عُبَيْدُ اللَّهِ بْنُ زِيَادٍ يَعُودُهُ . نَحْوَ حَدِيثِ الْحَسَنِ عَنْ مَعْقِلٍ، ."
  },
  "1830": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1830\nIn-book reference  : Book 33, Hadith 32\nUSC-MSA web (English) reference  : Book 20, Hadith 4504\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا جَرِيرُ بْنُ حَازِمٍ، حَدَّثَنَا الْحَسَنُ، أَنَّ عَائِذَ بْنَ عَمْرٍو، - وَكَانَ مِنْ أَصْحَابِ رَسُولِ اللَّهِ صلى الله عليه وسلم - دَخَلَ عَلَى عُبَيْدِ اللَّهِ بْنِ زِيَادٍ فَقَالَ أَىْ بُنَىَّ إِنِّي سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّ شَرَّ الرِّعَاءِ الْحُطَمَةُ فَإِيَّاكَ أَنْ تَكُونَ مِنْهُمْ \" . فَقَالَ لَهُ اجْلِسْ فَإِنَّمَا أَنْتَ مِنْ نُخَالَةِ أَصْحَابِ مُحَمَّدٍ صلى الله عليه وسلم . فَقَالَ وَهَلْ كَانَتْ لَهُمْ نُخَالَةٌ إِنَّمَا كَانَتِ النُّخَالَةُ بَعْدَهُمْ وَفِي غَيْرِهِمْ ."
  },
  "1831": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1831d\nIn-book reference  : Book 33, Hadith 36\nUSC-MSA web (English) reference  : Book 20, Hadith 4508\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي أَحْمَدُ بْنُ الْحَسَنِ بْنِ خِرَاشٍ، حَدَّثَنَا أَبُو مَعْمَرٍ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا أَيُّوبُ، عَنْ يَحْيَى بْنِ سَعِيدِ بْنِ حَيَّانَ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِنَحْوِ حَدِيثِهِمْ ."
  },
  "1832": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1832e\nIn-book reference  : Book 33, Hadith 41\nUSC-MSA web (English) reference  : Book 20, Hadith 4513\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنِ الشَّيْبَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ ذَكْوَانَ، - وَهُوَ أَبُو الزِّنَادِ - عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم اسْتَعْمَلَ رَجُلاً عَلَى الصَّدَقَةِ فَجَاءَ بِسَوَادٍ كَثِيرٍ فَجَعَلَ يَقُولُ هَذَا لَكُمْ وَهَذَا أُهْدِيَ إِلَىَّ . فَذَكَرَ نَحْوَهُ قَالَ عُرْوَةُ فَقُلْتُ لأَبِي حُمَيْدٍ السَّاعِدِيِّ أَسَمِعْتَهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَقَالَ مِنْ فِيهِ إِلَى أُذُنِي ."
  },
  "1833": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1833c\nIn-book reference  : Book 33, Hadith 44\nUSC-MSA web (English) reference  : Book 20, Hadith 4516\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، أَخْبَرَنَا الْفَضْلُ بْنُ مُوسَى، حَدَّثَنَا إِسْمَاعِيلُ، بْنُ أَبِي خَالِدٍ أَخْبَرَنَا قَيْسُ بْنُ أَبِي حَازِمٍ، قَالَ سَمِعْتُ عَدِيَّ بْنَ عَمِيرَةَ الْكِنْدِيَّ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِ حَدِيثِهِمْ ."
  },
  "1834": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1834\nIn-book reference  : Book 33, Hadith 45\nUSC-MSA web (English) reference  : Book 20, Hadith 4517\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ نَزَلَ { يَا أَيُّهَا الَّذِينَ آمَنُوا أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ وَأُولِي الأَمْرِ مِنْكُمْ} فِي عَبْدِ اللَّهِ بْنِ حُذَافَةَ بْنِ قَيْسِ بْنِ عَدِيٍّ السَّهْمِيِّ بَعَثَهُ النَّبِيُّ صلى الله عليه وسلم فِي سَرِيَّةٍ . أَخْبَرَنِيهِ يَعْلَى بْنُ مُسْلِمٍ عَنْ سَعِيدِ بْنِ جُبَيْرٍ عَنِ ابْنِ عَبَّاسٍ ."
  },
  "1835": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1835g\nIn-book reference  : Book 33, Hadith 51\nUSC-MSA web (English) reference  : Book 20, Hadith 4523\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ حَيْوَةَ، أَنَّ أَبَا يُونُسَ، مَوْلَى أَبِي هُرَيْرَةَ حَدَّثَهُ قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِذَلِكَ وَقَالَ \" مَنْ أَطَاعَ الأَمِيرَ \" . وَلَمْ يَقُلْ أَمِيرِي وَكَذَلِكَ فِي حَدِيثِ هَمَّامٍ عَنْ أَبِي هُرَيْرَةَ ."
  },
  "1836": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1836\nIn-book reference  : Book 33, Hadith 52\nUSC-MSA web (English) reference  : Book 20, Hadith 4524\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، كِلاَهُمَا عَنْ يَعْقُوبَ، قَالَ سَعِيدٌ حَدَّثَنَا يَعْقُوبُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي حَازِمٍ، عَنْ أَبِي صَالِحٍ السَّمَّانِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" عَلَيْكَ السَّمْعَ وَالطَّاعَةَ فِي عُسْرِكَ وَيُسْرِكَ وَمَنْشَطِكَ وَمَكْرَهِكَ وَأَثَرَةٍ عَلَيْكَ \" ."
  },
  "1837": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1837c\nIn-book reference  : Book 33, Hadith 55\nUSC-MSA web (English) reference  : Book 20, Hadith 4527\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي عِمْرَانَ، بِهَذَا الإِسْنَادِ كَمَا قَالَ ابْنُ إِدْرِيسَ عَبْدًا مُجَدَّعَ الأَطْرَافِ ."
  },
  "1838": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1838e\nIn-book reference  : Book 33, Hadith 60\nUSC-MSA web (English) reference  : Book 20, Hadith 4532\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي سَلَمَةُ بْنُ شَبِيبٍ، حَدَّثَنَا الْحَسَنُ بْنُ أَعْيَنَ، حَدَّثَنَا مَعْقِلٌ، عَنْ زَيْدِ بْنِ أَبِي، أُنَيْسَةَ عَنْ يَحْيَى بْنِ حُصَيْنٍ، عَنْ جَدَّتِهِ أُمِّ الْحُصَيْنِ، قَالَ سَمِعْتُهَا تَقُولُ، حَجَجْتُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم حَجَّةَ الْوَدَاعِ - قَالَتْ - فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم قَوْلاً كَثِيرًا ثُمَّ سَمِعْتُهُ يَقُولُ \" إِنْ أُمِّرَ عَلَيْكُمْ عَبْدٌ مُجَدَّعٌ - حَسِبْتُهَا قَالَتْ - أَسْوَدُ يَقُودُكُمْ بِكِتَابِ اللَّهِ فَاسْمَعُوا لَهُ وَأَطِيعُوا \" ."
  },
  "1839": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1839b\nIn-book reference  : Book 33, Hadith 62\nUSC-MSA web (English) reference  : Book 20, Hadith 4534\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ زُهَيْرُ بْنُ حَرْبٍ، وَمُحَمَّدُ بْنُ الْمُثَنَّى، قَالاَ حَدَّثَنَا يَحْيَى، وَهُوَ الْقَطَّانُ ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي كِلاَهُمَا، عَنْ عُبَيْدِ اللَّهِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1840": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1840c\nIn-book reference  : Book 33, Hadith 65\nUSC-MSA web (English) reference  : Book 20, Hadith 4537\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، وَأَبُو مُعَاوِيَةَ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "1709": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1709h\nIn-book reference  : Book 33, Hadith 69\nUSC-MSA web (English) reference  : Book 20, Hadith 4541\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبِ بْنِ مُسْلِمٍ، حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، حَدَّثَنِي بُكَيْرٌ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ جُنَادَةَ بْنِ أَبِي أُمَيَّةَ، قَالَ دَخَلْنَا عَلَى عُبَادَةَ بْنِ الصَّامِتِ وَهُوَ مَرِيضٌ فَقُلْنَا حَدِّثْنَا أَصْلَحَكَ اللَّهُ، بِحَدِيثٍ يَنْفَعُ اللَّهُ بِهِ سَمِعْتَهُ مِنْ، رَسُولِ اللَّهِ صلى الله عليه وسلم . فَقَالَ دَعَانَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَبَايَعْنَاهُ فَكَانَ فِيمَا أَخَذَ عَلَيْنَا أَنْ بَايَعَنَا عَلَى السَّمْعِ وَالطَّاعَةِ فِي مَنْشَطِنَا وَمَكْرَهِنَا وَعُسْرِنَا وَيُسْرِنَا وَأَثَرَةٍ عَلَيْنَا وَأَنْ لاَ نُنَازِعَ الأَمْرَ أَهْلَهُ قَالَ \" إِلاَّ أَنْ تَرَوْا كُفْرًا بَوَاحًا عِنْدَكُمْ مِنَ اللَّهِ فِيهِ بُرْهَانٌ \" ."
  },
  "1841": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1841\nIn-book reference  : Book 33, Hadith 70\nUSC-MSA web (English) reference  : Book 20, Hadith 4542\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا إِبْرَاهِيمُ، عَنْ مُسْلِمٍ، حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنِي وَرْقَاءُ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" إِنَّمَا الإِمَامُ جُنَّةٌ يُقَاتَلُ مِنْ وَرَائِهِ وَيُتَّقَى بِهِ فَإِنْ أَمَرَ بِتَقْوَى اللَّهِ عَزَّ وَجَلَّ وَعَدَلَ كَانَ لَهُ بِذَلِكَ أَجْرٌ وَإِنْ يَأْمُرْ بِغَيْرِهِ كَانَ عَلَيْهِ مِنْهُ \" ."
  },
  "1842": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1842b\nIn-book reference  : Book 33, Hadith 72\nUSC-MSA web (English) reference  : Book 20, Hadith 4544\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَبْدُ اللَّهِ بْنُ بَرَّادٍ الأَشْعَرِيُّ، قَالاَ حَدَّثَنَا عَبْدُ اللَّهِ، بْنُ إِدْرِيسَ عَنِ الْحَسَنِ بْنِ فُرَاتٍ، عَنْ أَبِيهِ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1843": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1843\nIn-book reference  : Book 33, Hadith 73\nUSC-MSA web (English) reference  : Book 20, Hadith 4545\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو الأَحْوَصِ، وَوَكِيعٌ، ح وَحَدَّثَنِي أَبُو سَعِيدٍ، الأَشَجُّ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو كُرَيْبٍ، وَابْنُ، نُمَيْرٍ قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، وَعَلِيُّ بْنُ خَشْرَمٍ، قَالاَ أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، كُلُّهُمْ عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، عَنْ زَيْدِ بْنِ، وَهْبٍ عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّهَا سَتَكُونُ بَعْدِي أَثَرَةٌ وَأُمُورٌ تُنْكِرُونَهَا \" . قَالُوا يَا رَسُولَ اللَّهِ كَيْفَ تَأْمُرُ مَنْ أَدْرَكَ مِنَّا ذَلِكَ قَالَ \" تُؤَدُّونَ الْحَقَّ الَّذِي عَلَيْكُمْ وَتَسْأَلُونَ اللَّهَ الَّذِي لَكُمْ \" ."
  },
  "1844": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1844c\nIn-book reference  : Book 33, Hadith 76\nUSC-MSA web (English) reference  : Book 20, Hadith 4548\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو الْمُنْذِرِ، إِسْمَاعِيلُ بْنُ عُمَرَ حَدَّثَنَا يُونُسُ بْنُ، أَبِي إِسْحَاقَ الْهَمْدَانِيُّ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ أَبِي السَّفَرِ، عَنْ عَامِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ، رَبِّ الْكَعْبَةِ الصَّائِدِيِّ قَالَ رَأَيْتُ جَمَاعَةً عِنْدَ الْكَعْبَةِ . فَذَكَرَ نَحْوَ حَدِيثِ الأَعْمَشِ ."
  },
  "1845": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1845b, c\nIn-book reference  : Book 33, Hadith 78\nUSC-MSA web (English) reference  : Book 20, Hadith 4550\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ حَبِيبٍ الْحَارِثِيُّ، حَدَّثَنَا خَالِدٌ، - يَعْنِي ابْنَ الْحَارِثِ - حَدَّثَنَا شُعْبَةُ بْنُ الْحَجَّاجِ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسًا، يُحَدِّثُ عَنْ أُسَيْدِ بْنِ حُضَيْرٍ، أَنَّ رَجُلاً، مِنَ الأَنْصَارِ خَلاَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ . وَحَدَّثَنِيهِ عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا شُعْبَةُ، بِهَذَا الإِسْنَادِ وَلَمْ يَقُلْ خَلاَ بِرَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1846": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1846b\nIn-book reference  : Book 33, Hadith 80\nUSC-MSA web (English) reference  : Book 20, Hadith 4552\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكٍ، بِهَذَا الإِسْنَادِ مِثْلَهُ وَقَالَ فَجَذَبَهُ الأَشْعَثُ بْنُ قَيْسٍ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" اسْمَعُوا وَأَطِيعُوا فَإِنَّمَا عَلَيْهِمْ مَا حُمِّلُوا وَعَلَيْكُمْ مَا حُمِّلْتُمْ \" ."
  },
  "1847": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1847b\nIn-book reference  : Book 33, Hadith 82\nUSC-MSA web (English) reference  : Book 20, Hadith 4554\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ سَهْلِ بْنِ عَسْكَرٍ التَّمِيمِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، ح وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا يَحْيَى، - وَهُوَ ابْنُ حَسَّانَ - حَدَّثَنَا مُعَاوِيَةُ، - يَعْنِي ابْنَ سَلاَّمٍ - حَدَّثَنَا زَيْدُ بْنُ سَلاَّمٍ، عَنْ أَبِي سَلاَّمٍ، قَالَ قَالَ حُذَيْفَةُ بْنُ الْيَمَانِ قُلْتُ يَا رَسُولَ اللَّهِ إِنَّا كُنَّا بِشَرٍّ فَجَاءَ اللَّهُ بِخَيْرٍ فَنَحْنُ فِيهِ فَهَلْ مِنْ وَرَاءِ هَذَا الْخَيْرِ شَرٌّ قَالَ نَعَمْ . قُلْتُ هَلْ وَرَاءَ ذَلِكَ الشَّرِّ خَيْرٌ قَالَ \" نَعَمْ \" . قُلْتُ فَهَلْ وَرَاءَ ذَلِكَ الْخَيْرِ شَرٌّ قَالَ \" نَعَمْ \" . قُلْتُ كَيْفَ قَالَ \" يَكُونُ بَعْدِي أَئِمَّةٌ لاَ يَهْتَدُونَ بِهُدَاىَ وَلاَ يَسْتَنُّونَ بِسُنَّتِي وَسَيَقُومُ فِيهِمْ رِجَالٌ قُلُوبُهُمْ قُلُوبُ الشَّيَاطِينِ فِي جُثْمَانِ إِنْسٍ \" . قَالَ قُلْتُ كَيْفَ أَصْنَعُ يَا رَسُولَ اللَّهِ إِنْ أَدْرَكْتُ ذَلِكَ قَالَ \" تَسْمَعُ وَتُطِيعُ لِلأَمِيرِ وَإِنْ ضُرِبَ ظَهْرُكَ وَأُخِذَ مَالُكَ فَاسْمَعْ وَأَطِعْ \" ."
  },
  "1848": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1848d\nIn-book reference  : Book 33, Hadith 86\nUSC-MSA web (English) reference  : Book 20, Hadith 4558\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ غَيْلاَنَ بْنِ جَرِيرٍ، بِهَذَا الإِسْنَادِ . أَمَّا ابْنُ الْمُثَنَّى فَلَمْ يَذْكُرِ النَّبِيَّ صلى الله عليه وسلم فِي الْحَدِيثِ وَأَمَّا ابْنُ بَشَّارٍ فَقَالَ فِي رِوَايَتِهِ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِنَحْوِ حَدِيثِهِمْ ."
  },
  "1849": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1849b\nIn-book reference  : Book 33, Hadith 88\nUSC-MSA web (English) reference  : Book 20, Hadith 4560\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا الْجَعْدُ، حَدَّثَنَا أَبُو رَجَاءٍ، الْعُطَارِدِيُّ عَنِ ابْنِ عَبَّاسٍ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ \" مَنْ كَرِهَ مِنْ أَمِيرِهِ شَيْئًا فَلْيَصْبِرْ عَلَيْهِ فَإِنَّهُ لَيْسَ أَحَدٌ مِنَ النَّاسِ خَرَجَ مِنَ السُّلْطَانِ شِبْرًا فَمَاتَ عَلَيْهِ إِلاَّ مَاتَ مِيتَةً جَاهِلِيَّةً \" ."
  },
  "1850": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1850\nIn-book reference  : Book 33, Hadith 89\nUSC-MSA web (English) reference  : Book 20, Hadith 4561\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا هُرَيْمُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا الْمُعْتَمِرُ، قَالَ سَمِعْتُ أَبِي يُحَدِّثُ، عَنْ أَبِي، مِجْلَزٍ عَنْ جُنْدَبِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ قُتِلَ تَحْتَ رَايَةٍ عُمِّيَّةٍ يَدْعُو عَصَبِيَّةً أَوْ يَنْصُرُ عَصَبِيَّةً فَقِتْلَةٌ جَاهِلِيَّةٌ \" ."
  },
  "1851": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1851c\nIn-book reference  : Book 33, Hadith 92\nUSC-MSA web (English) reference  : Book 20, Hadith 4564\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عَمْرُو بْنُ عَلِيٍّ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ جَبَلَةَ، حَدَّثَنَا بِشْرُ بْنُ عُمَرَ، قَالاَ جَمِيعًا حَدَّثَنَا هِشَامُ بْنُ سَعْدٍ، عَنْ زَيْدِ بْنِ أَسْلَمَ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ نَافِعٍ عَنِ ابْنِ عُمَرَ ."
  },
  "1852": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1852c\nIn-book reference  : Book 33, Hadith 95\nUSC-MSA web (English) reference  : Book 20, Hadith 4567\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي عُثْمَانُ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يُونُسُ بْنُ أَبِي يَعْفُورٍ، عَنْ أَبِيهِ، عَنْ عَرْفَجَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" مَنْ أَتَاكُمْ وَأَمْرُكُمْ جَمِيعٌ عَلَى رَجُلٍ وَاحِدٍ يُرِيدُ أَنْ يَشُقَّ عَصَاكُمْ أَوْ يُفَرِّقَ جَمَاعَتَكُمْ فَاقْتُلُوهُ \" ."
  },
  "1853": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1853\nIn-book reference  : Book 33, Hadith 96\nUSC-MSA web (English) reference  : Book 20, Hadith 4568\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي وَهْبُ بْنُ بَقِيَّةَ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنِ الْجُرَيْرِيِّ، عَنْ أَبِي، نَضْرَةَ عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِذَا بُويِعَ لِخَلِيفَتَيْنِ فَاقْتُلُوا الآخَرَ مِنْهُمَا \" ."
  },
  "1854": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1854d\nIn-book reference  : Book 33, Hadith 100\nUSC-MSA web (English) reference  : Book 20, Hadith 4572\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ حَسَنُ بْنُ الرَّبِيعِ الْبَجَلِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ هِشَامٍ، عَنِ الْحَسَنِ، عَنْ ضَبَّةَ بْنِ مِحْصَنٍ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم . فَذَكَرَ مِثْلَهُ إِلاَّ قَوْلَهُ \" وَلَكِنْ مَنْ رَضِيَ وَتَابَعَ \" . لَمْ يَذْكُرْهُ ."
  },
  "1855": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1855c\nIn-book reference  : Book 33, Hadith 103\nUSC-MSA web (English) reference  : Book 20, Hadith 4575\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الأَنْصَارِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا ابْنُ جَابِرٍ، بِهَذَا الإِسْنَادِ وَقَالَ رُزَيْقٌ مَوْلَى بَنِي فَزَارَةَ . قَالَ مُسْلِمٌ وَرَوَاهُ مُعَاوِيَةُ بْنُ صَالِحٍ عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنْ مُسْلِمِ بْنِ قَرَظَةَ، عَنْ عَوْفِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1856": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1856h\nIn-book reference  : Book 33, Hadith 111\nUSC-MSA web (English) reference  : Book 20, Hadith 4583\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا عُثْمَانُ بْنُ أَبِي شَيْبَةَ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، قَالَ إِسْحَاقُ أَخْبَرَنَا وَقَالَ، عُثْمَانُ حَدَّثَنَا جَرِيرٌ، عَنِ الأَعْمَشِ، حَدَّثَنِي سَالِمُ بْنُ أَبِي الْجَعْدِ، قَالَ قُلْتُ لِجَابِرٍ كَمْ كُنْتُمْ يَوْمَئِذٍ قَالَ أَلْفًا وَأَرْبَعَمِائَةٍ ."
  },
  "1857": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1857b\nIn-book reference  : Book 33, Hadith 113\nUSC-MSA web (English) reference  : Book 20, Hadith 4585\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا ابْنُ الْمُثَنَّى، حَدَّثَنَا أَبُو دَاوُدَ، ح وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا النَّضْرُ بْنُ شُمَيْلٍ، جَمِيعًا عَنْ شُعْبَةَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1858": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1858b\nIn-book reference  : Book 33, Hadith 115\nUSC-MSA web (English) reference  : Book 20, Hadith 4587\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، بِهَذَا الإِسْنَادِ."
  },
  "1859": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1859c\nIn-book reference  : Book 33, Hadith 117\nUSC-MSA web (English) reference  : Book 20, Hadith 4589\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي حَجَّاجُ بْنُ الشَّاعِرِ، وَمُحَمَّدُ بْنُ رَافِعٍ، قَالاَ حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ أَبِيهِ، قَالَ لَقَدْ رَأَيْتُ الشَّجَرَةَ ثُمَّ أَتَيْتُهَا بَعْدُ فَلَمْ أَعْرِفْهَا."
  },
  "1860": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1860b\nIn-book reference  : Book 33, Hadith 119\nUSC-MSA web (English) reference  : Book 20, Hadith 4591\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ إِسْحَاقُ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا حَمَّادُ بْنُ مَسْعَدَةَ، حَدَّثَنَا يَزِيدُ، عَنْ سَلَمَةَ، بِمِثْلِهِ ."
  },
  "1861": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1861\nIn-book reference  : Book 33, Hadith 120\nUSC-MSA web (English) reference  : Book 20, Hadith 4592\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا الْمَخْزُومِيُّ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَمْرُو بْنُ، يَحْيَى عَنْ عَبَّادِ بْنِ تَمِيمٍ، عَنْ عَبْدِ اللَّهِ بْنِ زَيْدٍ، قَالَ أَتَاهُ آتٍ فَقَالَ هَذَاكَ ابْنُ حَنْظَلَةَ يُبَايِعُ النَّاسَ فَقَالَ عَلَى مَاذَا قَالَ عَلَى الْمَوْتِ قَالَ لاَ أُبَايِعُ عَلَى هَذَا أَحَدًا بَعْدَ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1862": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1862\nIn-book reference  : Book 33, Hadith 121\nUSC-MSA web (English) reference  : Book 20, Hadith 4593\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا حَاتِمٌ، - يَعْنِي ابْنَ إِسْمَاعِيلَ - عَنْ يَزِيدَ بْنِ أَبِي، عُبَيْدٍ عَنْ سَلَمَةَ بْنِ الأَكْوَعِ، أَنَّهُ دَخَلَ عَلَى الْحَجَّاجِ فَقَالَ يَا ابْنَ الأَكْوَعِ ارْتَدَدْتَ عَلَى عَقِبَيْكَ تَعَرَّبْتَ قَالَ لاَ وَلَكِنْ رَسُولُ اللَّهِ صلى الله عليه وسلم أَذِنَ لِي فِي الْبَدْوِ ."
  },
  "1863": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1863c\nIn-book reference  : Book 33, Hadith 124\nUSC-MSA web (English) reference  : Book 20, Hadith 4596\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عَاصِمٍ، بِهَذَا الإِسْنَادِ قَالَ فَلَقِيتُ أَخَاهُ فَقَالَ صَدَقَ مُجَاشِعٌ . وَلَمْ يَذْكُرْ أَبَا مَعْبَدٍ ."
  },
  "1353": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1353d\nIn-book reference  : Book 33, Hadith 126\nUSC-MSA web (English) reference  : Book 20, Hadith 4598\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، وَابْنُ، رَافِعٍ عَنْ يَحْيَى بْنِ آدَمَ، حَدَّثَنَا مُفَضَّلٌ، - يَعْنِي ابْنَ مُهَلْهِلٍ - ح وَحَدَّثَنَا عَبْدُ بْنُ حُمَيْدٍ، أَخْبَرَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، عَنْ إِسْرَائِيلَ، كُلُّهُمْ عَنْ مَنْصُورٍ، بِهَذَا الإِسْنَادِ . مِثْلَهُ ."
  },
  "1864": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1864\nIn-book reference  : Book 33, Hadith 127\nUSC-MSA web (English) reference  : Book 20, Hadith 4599\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبِي، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ حَبِيبِ بْنِ أَبِي، ثَابِتٍ عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي حُسَيْنٍ، عَنْ عَطَاءٍ، عَنْ عَائِشَةَ، قَالَتْ سُئِلَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَنِ الْهِجْرَةِ فَقَالَ \" لاَ هِجْرَةَ بَعْدَ الْفَتْحِ وَلَكِنْ جِهَادٌ وَنِيَّةٌ وَإِذَا اسْتُنْفِرْتُمْ فَانْفِرُوا \" ."
  },
  "1865": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1865b\nIn-book reference  : Book 33, Hadith 129\nUSC-MSA web (English) reference  : Book 20, Hadith 4601\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنِ الأَوْزَاعِيِّ، بِهَذَا الإِسْنَادِ . مِثْلَهُ غَيْرَ أَنَّهُ قَالَ \" إِنَّ اللَّهَ لَنْ يَتِرَكَ مِنْ عَمَلِكَ شَيْئًا \" . وَزَادَ فِي الْحَدِيثِ قَالَ \" فَهَلْ تَحْلُبُهَا يَوْمَ وِرْدِهَا \" . قَالَ نَعَمْ ."
  },
  "1866": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1866b\nIn-book reference  : Book 33, Hadith 131\nUSC-MSA web (English) reference  : Book 20, Hadith 4603\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، وَأَبُو الطَّاهِرِ، قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا وَقَالَ، هَارُونُ حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي مَالِكٌ، عَنِ ابْنِ شِهَابٍ، عَنْ عُرْوَةَ، أَنَّ عَائِشَةَ، أَخْبَرَتْهُ عَنْ بَيْعَةِ النِّسَاءِ، قَالَتْ مَا مَسَّ رَسُولُ اللَّهِ صلى الله عليه وسلم بِيَدِهِ امْرَأَةً قَطُّ إِلاَّ أَنْ يَأْخُذَ عَلَيْهَا فَإِذَا أَخَذَ عَلَيْهَا فَأَعْطَتْهُ قَالَ \" اذْهَبِي فَقَدْ بَايَعْتُكِ \" ."
  },
  "1867": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1867\nIn-book reference  : Book 33, Hadith 132\nUSC-MSA web (English) reference  : Book 20, Hadith 4604\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ - وَاللَّفْظُ لاِبْنِ أَيُّوبَ - قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - أَخْبَرَنِي عَبْدُ اللَّهِ بْنُ دِينَارٍ، أَنَّهُ سَمِعَ عَبْدَ اللَّهِ بْنَ عُمَرَ، يَقُولُ كُنَّا نُبَايِعُ رَسُولَ اللَّهِ صلى الله عليه وسلم عَلَى السَّمْعِ وَالطَّاعَةِ يَقُولُ لَنَا \" فِيمَا اسْتَطَعْتَ \" ."
  },
  "1868": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1868b\nIn-book reference  : Book 33, Hadith 134\nUSC-MSA web (English) reference  : Book 20, Hadith 4606\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، وَعَبْدُ الرَّحِيمِ بْنُ، سُلَيْمَانَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ، - يَعْنِي الثَّقَفِيَّ - جَمِيعًا عَنْ عُبَيْدِ، اللَّهِ بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي حَدِيثِهِمْ وَأَنَا ابْنُ أَرْبَعَ عَشْرَةَ سَنَةً فَاسْتَصْغَرَنِي ."
  },
  "1869": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1869d\nIn-book reference  : Book 33, Hadith 138\nUSC-MSA web (English) reference  : Book 20, Hadith 4609\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ يَعْنِي ابْنَ عُلَيَّةَ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، وَالثَّقَفِيُّ، كُلُّهُمْ عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ رَافِعٍ، حَدَّثَنَا ابْنُ أَبِي فُدَيْكٍ، أَخْبَرَنَا الضَّحَّاكُ، - يَعْنِي ابْنَ عُثْمَانَ - جَمِيعًا عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . فِي حَدِيثِ ابْنِ عُلَيَّةَ وَالثَّقَفِيِّ \" فَإِنِّي أَخَافُ \" . وَفِي حَدِيثِ سُفْيَانَ وَحَدِيثِ الضَّحَّاكِ بْنِ عُثْمَانَ \" مَخَافَةَ أَنْ يَنَالَهُ الْعَدُوُّ \" ."
  },
  "1870": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1870b\nIn-book reference  : Book 33, Hadith 140\nUSC-MSA web (English) reference  : Book 20, Hadith 4611\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَمُحَمَّدُ بْنُ رُمْحٍ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا خَلَفُ بْنُ هِشَامٍ، وَأَبُو الرَّبِيعِ، وَأَبُو كَامِلٍ قَالُوا حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - عَنْ أَيُّوبَ، ح وَحَدَّثَنَا زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ، عَنْ أَيُّوبَ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، ح\nوَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَعُبَيْدُ اللَّهِ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا يَحْيَى، - وَهُوَ الْقَطَّانُ - جَمِيعًا عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنِي عَلِيُّ بْنُ حُجْرٍ، وَأَحْمَدُ بْنُ عَبْدَةَ، وَابْنُ أَبِي عُمَرَ، قَالُوا حَدَّثَنَا سُفْيَانُ، عَنْ إِسْمَاعِيلَ بْنِ أُمَيَّةَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، أَخْبَرَنِي مُوسَى بْنُ عُقْبَةَ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي أُسَامَةُ، - يَعْنِي ابْنَ زَيْدٍ - كُلُّ هَؤُلاَءِ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، بِمَعْنَى حَدِيثِ مَالِكٍ عَنْ نَافِعٍ، . وَزَادَ فِي حَدِيثِ أَيُّوبَ مِنْ رِوَايَةِ حَمَّادٍ وَابْنِ عُلَيَّةَ قَالَ عَبْدُ اللَّهِ فَجِئْتُ سَابِقًا فَطَفَّفَ بِي الْفَرَسُ الْمَسْجِدَ ."
  },
  "1871": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1871b\nIn-book reference  : Book 33, Hadith 142\nUSC-MSA web (English) reference  : Book 20, Hadith 4613\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا قُتَيْبَةُ، وَابْنُ، رُمْحٍ عَنِ اللَّيْثِ بْنِ سَعْدٍ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، ح وَحَدَّثَنَا ابْنُ نُمَيْرٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا عُبَيْدُ، اللَّهِ بْنُ سَعِيدٍ حَدَّثَنَا يَحْيَى، كُلُّهُمْ عَنْ عُبَيْدِ اللَّهِ، ح وَحَدَّثَنَا هَارُونُ بْنُ سَعِيدٍ الأَيْلِيُّ، حَدَّثَنَا ابْنُ وَهْبٍ، حَدَّثَنِي أُسَامَةُ، كُلُّهُمْ عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ مَالِكٍ عَنْ نَافِعٍ ."
  },
  "1872": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1872b\nIn-book reference  : Book 33, Hadith 144\nUSC-MSA web (English) reference  : Book 20, Hadith 4615\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ، أَبِي شَيْبَةَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، كِلاَهُمَا عَنْ يُونُسَ، بِهَذَا الإِسْنَادِ مِثْلَهُ ."
  },
  "1873": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1873e\nIn-book reference  : Book 33, Hadith 149\nUSC-MSA web (English) reference  : Book 20, Hadith 4620\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي ح، وَحَدَّثَنَا ابْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، كِلاَهُمَا عَنْ شُعْبَةَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْعَيْزَارِ بْنِ حُرَيْثٍ، عَنْ عُرْوَةَ، بْنِ الْجَعْدِ عَنِ النَّبِيِّ صلى الله عليه وسلم بِهَذَا . وَلَمْ يَذْكُرِ \" الأَجْرَ وَالْمَغْنَمَ \" ."
  },
  "1874": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1874b\nIn-book reference  : Book 33, Hadith 151\nUSC-MSA web (English) reference  : Book 20, Hadith 4622\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ حَبِيبٍ، حَدَّثَنَا خَالِدٌ يَعْنِي ابْنَ الْحَارِثِ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ، الْوَلِيدِ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، عَنْ أَبِي التَّيَّاحِ، سَمِعَ أَنَسًا، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1875": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1875c\nIn-book reference  : Book 33, Hadith 154\nUSC-MSA web (English) reference  : Book 20, Hadith 4625\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا مُحَمَّدٌ يَعْنِي ابْنَ جَعْفَرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنِي وَهْبُ بْنُ جَرِيرٍ، جَمِيعًا عَنْ شُعْبَةَ، عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ النَّخَعِيِّ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ وَكِيعٍ . وَفِي رِوَايَةِ وَهْبٍ عَنْ عَبْدِ اللَّهِ بْنِ يَزِيدَ . وَلَمْ يَذْكُرِ النَّخَعِيَّ ."
  },
  "1876": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1876h\nIn-book reference  : Book 33, Hadith 162\nUSC-MSA web (English) reference  : Book 20, Hadith 4633\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" تَضَمَّنَ اللَّهُ لِمَنْ خَرَجَ فِي سَبِيلِهِ - إِلَى قَوْلِهِ - مَا تَخَلَّفْتُ خِلاَفَ سَرِيَّةٍ تَغْزُو فِي سَبِيلِ اللَّهِ تَعَالَى \" ."
  },
  "1877": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1877b\nIn-book reference  : Book 33, Hadith 164\nUSC-MSA web (English) reference  : Book 20, Hadith 4635\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَابْنُ، بَشَّارٍ قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ قَتَادَةَ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" مَا مِنْ أَحَدٍ يَدْخُلُ الْجَنَّةَ يُحِبُّ أَنْ يَرْجِعَ إِلَى الدُّنْيَا وَأَنَّ لَهُ مَا عَلَى الأَرْضِ مِنْ شَىْءٍ غَيْرُ الشَّهِيدِ فَإِنَّهُ يَتَمَنَّى أَنْ يَرْجِعَ فَيُقْتَلَ عَشْرَ مَرَّاتٍ لِمَا يَرَى مِنَ الْكَرَامَةِ \" ."
  },
  "1878": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1878b\nIn-book reference  : Book 33, Hadith 166\nUSC-MSA web (English) reference  : Book 20, Hadith 4637\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، ح وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا جَرِيرٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، كُلُّهُمْ عَنْ سُهَيْلٍ، بِهَذَا الإِسْنَادِ نَحْوَهُ ."
  },
  "1879": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1879b\nIn-book reference  : Book 33, Hadith 168\nUSC-MSA web (English) reference  : Book 20, Hadith 4638\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِيهِ عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، حَدَّثَنَا يَحْيَى بْنُ حَسَّانَ، حَدَّثَنَا مُعَاوِيَةُ، أَخْبَرَنِي زَيْدٌ، أَنَّهُ سَمِعَ أَبَا سَلاَّمٍ، قَالَ حَدَّثَنِي النُّعْمَانُ بْنُ بَشِيرٍ، قَالَ كُنْتُ عِنْدَ مِنْبَرِ رَسُولِ اللَّهِ صلى الله عليه وسلم . بِمِثْلِ حَدِيثِ أَبِي تَوْبَةَ ."
  },
  "1880": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1880\nIn-book reference  : Book 33, Hadith 169\nUSC-MSA web (English) reference  : Book 20, Hadith 4639\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ ثَابِتٍ، عَنْ أَنَسِ، بْنِ مَالِكٍ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَغَدْوَةٌ فِي سَبِيلِ اللَّهِ أَوْ رَوْحَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \" ."
  },
  "1881": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1881b\nIn-book reference  : Book 33, Hadith 171\nUSC-MSA web (English) reference  : Book 20, Hadith 4641\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي حَازِمٍ، عَنْ سَهْلِ بْنِ سَعْدٍ السَّاعِدِيِّ، عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ \" غَدْوَةٌ أَوْ رَوْحَةٌ فِي سَبِيلِ اللَّهِ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \" ."
  },
  "1882": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1882\nIn-book reference  : Book 33, Hadith 172\nUSC-MSA web (English) reference  : Book 20, Hadith 4642\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ ذَكْوَانَ، بْنِ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لَوْلاَ أَنَّ رِجَالاً مِنْ أُمَّتِي \" . وَسَاقَ الْحَدِيثَ وَقَالَ فِيهِ \" وَلَرَوْحَةٌ فِي سَبِيلِ اللَّهِ أَوْ غَدْوَةٌ خَيْرٌ مِنَ الدُّنْيَا وَمَا فِيهَا \" ."
  },
  "1883": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1883b\nIn-book reference  : Book 33, Hadith 174\nUSC-MSA web (English) reference  : Book 20, Hadith 4644\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ قُهْزَاذَ، حَدَّثَنَا عَلِيُّ بْنُ الْحَسَنِ، عَنْ عَبْدِ اللَّهِ بْنِ الْمُبَارَكِ، أَخْبَرَنَا سَعِيدُ بْنُ أَبِي أَيُّوبَ، وَحَيْوَةُ بْنُ شُرَيْحٍ، قَالَ كُلُّ وَاحِدٍ مِنْهُمَا حَدَّثَنِي شُرَحْبِيلُ بْنُ، شَرِيكٍ عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، أَنَّهُ سَمِعَ أَبَا أَيُّوبَ الأَنْصَارِيَّ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم بِمِثْلِهِ سَوَاءً ."
  },
  "1884": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1884\nIn-book reference  : Book 33, Hadith 175\nUSC-MSA web (English) reference  : Book 20, Hadith 4645\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي أَبُو هَانِئٍ الْخَوْلاَنِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" يَا أَبَا سَعِيدٍ مَنْ رَضِيَ بِاللَّهِ رَبًّا وَبِالإِسْلاَمِ دِينًا وَبِمُحَمَّدٍ نَبِيًّا وَجَبَتْ لَهُ الْجَنَّةُ \" . فَعَجِبَ لَهَا أَبُو سَعِيدٍ فَقَالَ أَعِدْهَا عَلَىَّ يَا رَسُولَ اللَّهِ فَفَعَلَ ثُمَّ قَالَ \" وَأُخْرَى يُرْفَعُ بِهَا الْعَبْدُ مِائَةَ دَرَجَةٍ فِي الْجَنَّةِ مَا بَيْنَ كُلِّ دَرَجَتَيْنِ كَمَا بَيْنَ السَّمَاءِ وَالأَرْضِ \" . قَالَ وَمَا هِيَ يَا رَسُولَ اللَّهِ قَالَ \" الْجِهَادُ فِي سَبِيلِ اللَّهِ الْجِهَادُ فِي سَبِيلِ اللَّهِ \" ."
  },
  "1885": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1885c\nIn-book reference  : Book 33, Hadith 178\nUSC-MSA web (English) reference  : Book 20, Hadith 4648\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، ح قَالَ وَحَدَّثَنَا مُحَمَّدُ بْنُ عَجْلاَنَ، عَنْ مُحَمَّدِ بْنِ قَيْسٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ صلى الله عليه وسلم يَزِيدُ أَحَدُهُمَا عَلَى صَاحِبِهِ أَنَّ رَجُلاً أَتَى النَّبِيَّ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ فَقَالَ أَرَأَيْتَ إِنْ ضَرَبْتُ بِسَيْفِي . بِمَعْنَى حَدِيثِ الْمَقْبُرِيِّ ."
  },
  "1886": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1886b\nIn-book reference  : Book 33, Hadith 180\nUSC-MSA web (English) reference  : Book 20, Hadith 4650\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يَزِيدَ الْمُقْرِئُ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي، أَيُّوبَ حَدَّثَنِي عَيَّاشُ بْنُ عَبَّاسٍ الْقِتْبَانِيُّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْحُبُلِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ، عَمْرِو بْنِ الْعَاصِ أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" الْقَتْلُ فِي سَبِيلِ اللَّهِ يُكَفِّرُ كُلَّ شَىْءٍ إِلاَّ الدَّيْنَ \" ."
  },
  "1887": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1887\nIn-book reference  : Book 33, Hadith 181\nUSC-MSA web (English) reference  : Book 20, Hadith 4651\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، وَأَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ كِلاَهُمَا عَنْ أَبِي مُعَاوِيَةَ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، وَعِيسَى بْنُ يُونُسَ، جَمِيعًا عَنِ الأَعْمَشِ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا أَسْبَاطٌ، وَأَبُو مُعَاوِيَةَ قَالاَ حَدَّثَنَا الأَعْمَشُ، عَنْ عَبْدِ اللَّهِ بْنِ مُرَّةَ، عَنْ مَسْرُوقٍ، قَالَ سَأَلْنَا عَبْدَ اللَّهِ عَنْ هَذِهِ الآيَةِ، { وَلاَ تَحْسَبَنَّ الَّذِينَ قُتِلُوا فِي سَبِيلِ اللَّهِ أَمْوَاتًا بَلْ أَحْيَاءٌ عِنْدَ رَبِّهِمْ يُرْزَقُونَ} قَالَ أَمَا إِنَّا قَدْ سَأَلْنَا عَنْ ذَلِكَ فَقَالَ \" أَرْوَاحُهُمْ فِي جَوْفِ طَيْرٍ خُضْرٍ لَهَا قَنَادِيلُ مُعَلَّقَةٌ بِالْعَرْشِ تَسْرَحُ مِنَ الْجَنَّةِ حَيْثُ شَاءَتْ ثُمَّ تَأْوِي إِلَى تِلْكَ الْقَنَادِيلِ فَاطَّلَعَ إِلَيْهِمْ رَبُّهُمُ اطِّلاَعَةً فَقَالَ هَلْ تَشْتَهُونَ شَيْئًا قَالُوا أَىَّ شَىْءٍ نَشْتَهِي وَنَحْنُ نَسْرَحُ مِنَ الْجَنَّةِ حَيْثُ شِئْنَا فَفَعَلَ ذَلِكَ بِهِمْ ثَلاَثَ مَرَّاتٍ فَلَمَّا رَأَوْا أَنَّهُمْ لَنْ يُتْرَكُوا مِنْ أَنْ يُسْأَلُوا قَالُوا يَا رَبِّ نُرِيدُ أَنْ تَرُدَّ أَرْوَاحَنَا فِي أَجْسَادِنَا حَتَّى نُقْتَلَ فِي سَبِيلِكَ مَرَّةً أُخْرَى . فَلَمَّا رَأَى أَنْ لَيْسَ لَهُمْ حَاجَةٌ تُرِكُوا \" ."
  },
  "1888": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1888c\nIn-book reference  : Book 33, Hadith 184\nUSC-MSA web (English) reference  : Book 20, Hadith 4654\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَبْدِ الرَّحْمَنِ الدَّارِمِيُّ، أَخْبَرَنَا مُحَمَّدُ بْنُ يُوسُفَ، عَنِ الأَوْزَاعِيِّ، عَنِ ابْنِ شِهَابٍ، بِهَذَا الإِسْنَادِ فَقَالَ \" وَرَجُلٌ فِي شِعْبٍ \" . وَلَمْ يَقُلْ \" ثُمَّ رَجُلٌ \" ."
  },
  "1889": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1889c\nIn-book reference  : Book 33, Hadith 187\nUSC-MSA web (English) reference  : Book 20, Hadith 4657\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَ أَبُو كُرَيْبٍ قَالُوا حَدَّثَنَا وَكِيعٌ، عَنْ أُسَامَةَ بْنِ زَيْدٍ، عَنْ بَعْجَةَ بْنِ عَبْدِ اللَّهِ الْجُهَنِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ أَبِي حَازِمٍ عَنْ بَعْجَةَ وَقَالَ \" فِي شِعْبٍ مِنَ الشِّعَابِ \" ."
  },
  "1890": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1890c\nIn-book reference  : Book 33, Hadith 190\nUSC-MSA web (English) reference  : Book 20, Hadith 4660\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، قَالَ هَذَا مَا حَدَّثَنَا أَبُو هُرَيْرَةَ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم فَذَكَرَ أَحَادِيثَ مِنْهَا وَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" يَضْحَكُ اللَّهُ لِرَجُلَيْنِ يَقْتُلُ أَحَدُهُمَا الآخَرَ كِلاَهُمَا يَدْخُلُ الْجَنَّةَ \" قَالُوا كَيْفَ يَا رَسُولَ اللَّهِ قَالَ \" يُقْتَلُ هَذَا فَيَلِجُ الْجَنَّةَ ثُمَّ يَتُوبُ اللَّهُ عَلَى الآخَرِ فَيَهْدِيهِ إِلَى الإِسْلاَمِ ثُمَّ يُجَاهِدُ فِي سَبِيلِ اللَّهِ فَيُسْتَشْهَدُ \" ."
  },
  "1891": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1891b\nIn-book reference  : Book 33, Hadith 192\nUSC-MSA web (English) reference  : Book 20, Hadith 4662\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَوْنٍ الْهِلاَلِيُّ، حَدَّثَنَا أَبُو إِسْحَاقَ الْفَزَارِيُّ، إِبْرَاهِيمُ بْنُ مُحَمَّدٍ عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَجْتَمِعَانِ فِي النَّارِ اجْتِمَاعًا يَضُرُّ أَحَدُهُمَا الآخَرَ \" . قِيلَ مَنْ هُمْ يَا رَسُولَ اللَّهِ قَالَ \" مُؤْمِنٌ قَتَلَ كَافِرًا ثُمَّ سَدَّدَ \" ."
  },
  "1892": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1892b\nIn-book reference  : Book 33, Hadith 194\nUSC-MSA web (English) reference  : Book 20, Hadith 4664\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَائِدَةَ، ح وَحَدَّثَنِي بِشْرُ بْنُ، خَالِدٍ حَدَّثَنَا مُحَمَّدٌ، - يَعْنِي ابْنَ جَعْفَرٍ - حَدَّثَنَا شُعْبَةُ، كِلاَهُمَا عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ."
  },
  "1893": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1893b\nIn-book reference  : Book 33, Hadith 196\nUSC-MSA web (English) reference  : Book 20, Hadith 4666\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ يُونُسَ، ح وَحَدَّثَنِي بِشْرُ بْنُ خَالِدٍ، أَخْبَرَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، عَنْ شُعْبَةَ، ح وَحَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَخْبَرَنَا سُفْيَانُ، كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ ."
  },
  "1894": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1894\nIn-book reference  : Book 33, Hadith 197\nUSC-MSA web (English) reference  : Book 20, Hadith 4667\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، ح\nوَحَدَّثَنِي أَبُو بَكْرِ بْنُ نَافِعٍ، - وَاللَّفْظُ لَهُ - حَدَّثَنَا بَهْزٌ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ فَتًى، مِنْ أَسْلَمَ قَالَ يَا رَسُولَ اللَّهِ إِنِّي أُرِيدُ الْغَزْوَ وَلَيْسَ مَعِي مَا أَتَجَهَّزُ قَالَ \" ائْتِ فُلاَنًا فَإِنَّهُ قَدْ كَانَ تَجَهَّزَ فَمَرِضَ \" . فَأَتَاهُ فَقَالَ إِنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم يُقْرِئُكَ السَّلاَمَ وَيَقُولُ أَعْطِنِي الَّذِي تَجَهَّزْتَ بِهِ قَالَ يَا فُلاَنَةُ أَعْطِيهِ الَّذِي تَجَهَّزْتُ بِهِ وَلاَ تَحْبِسِي عَنْهُ شَيْئًا فَوَاللَّهِ لاَ تَحْبِسِي مِنْهُ شَيْئًا فَيُبَارَكَ لَكِ فِيهِ ."
  },
  "1895": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1895b\nIn-book reference  : Book 33, Hadith 199\nUSC-MSA web (English) reference  : Book 20, Hadith 4669\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو الرَّبِيعِ الزَّهْرَانِيُّ، حَدَّثَنَا يَزِيدُ، - يَعْنِي ابْنَ زُرَيْعٍ - حَدَّثَنَا حُسَيْنٌ، الْمُعَلِّمُ حَدَّثَنَا يَحْيَى بْنُ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ بُسْرِ بْنِ سَعِيدٍ، عَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ، قَالَ قَالَ نَبِيُّ اللَّهِ صلى الله عليه وسلم \" مَنَ جَهَّزَ غَازِيًا فَقَدْ غَزَا وَمَنْ خَلَفَ غَازِيًا فِي أَهْلِهِ فَقَدْ غَزَا \" ."
  },
  "1896": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1896d\nIn-book reference  : Book 33, Hadith 202\nUSC-MSA web (English) reference  : Book 20, Hadith 4672\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ يَزِيدَ بْنِ أَبِي سَعِيدٍ، مَوْلَى الْمَهْرِيِّ عَنْ أَبِيهِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم بَعَثَ إِلَى بَنِي لَحْيَانَ \" لِيَخْرُجْ مِنْ كُلِّ رَجُلَيْنِ رَجُلٌ \" . ثُمَّ قَالَ لِلْقَاعِدِ \" أَيُّكُمْ خَلَفَ الْخَارِجَ فِي أَهْلِهِ وَمَالِهِ بِخَيْرٍ كَانَ لَهُ مِثْلُ نِصْفِ أَجْرِ الْخَارِجِ \" ."
  },
  "1897": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1897c\nIn-book reference  : Book 33, Hadith 205\nUSC-MSA web (English) reference  : Book 20, Hadith 4675\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ سَعِيدُ بْنُ مَنْصُورٍ، حَدَّثَنَا سُفْيَانُ، عَنْ قَعْنَبٍ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، بِهَذَا الإِسْنَادِ \" فَقَالَ فَخُذْ مِنْ حَسَنَاتِهِ مَا شِئْتَ \" . فَالْتَفَتَ إِلَيْنَا رَسُولُ اللَّهِ صلى الله عليه وسلم فَقَالَ \" فَمَا ظَنُّكُمْ \" ."
  },
  "1898": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1898b\nIn-book reference  : Book 33, Hadith 207\nUSC-MSA web (English) reference  : Book 20, Hadith 4677\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا ابْنُ بِشْرٍ، عَنْ مِسْعَرٍ، حَدَّثَنِي أَبُو إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ لَمَّا نَزَلَتْ { لاَ يَسْتَوِي الْقَاعِدُونَ مِنَ الْمُؤْمِنِينَ} كَلَّمَهُ ابْنُ أُمِّ مَكْتُومٍ فَنَزَلَتْ { غَيْرُ أُولِي الضَّرَرِ}"
  },
  "1899": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1899\nIn-book reference  : Book 33, Hadith 208\nUSC-MSA web (English) reference  : Book 20, Hadith 4678\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ عَمْرٍو الأَشْعَثِيُّ، وَسُوَيْدُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لِسَعِيدٍ - أَخْبَرَنَا سُفْيَانُ، عَنْ عَمْرٍو، سَمِعَ جَابِرًا، يَقُولُ قَالَ رَجُلٌ أَيْنَ أَنَا يَا، رَسُولَ اللَّهِ إِنْ قُتِلْتُ قَالَ \" فِي الْجَنَّةِ \" . فَأَلْقَى تَمَرَاتٍ كُنَّ فِي يَدِهِ ثُمَّ قَاتَلَ حَتَّى قُتِلَ . وَفِي حَدِيثِ سُوَيْدٍ قَالَ رَجُلٌ لِلنَّبِيِّ صلى الله عليه وسلم يَوْمَ أُحُدٍ ."
  },
  "1900": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1900\nIn-book reference  : Book 33, Hadith 209\nUSC-MSA web (English) reference  : Book 20, Hadith 4679\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَكَرِيَّاءَ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ، قَالَ جَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ إِلَى النَّبِيِّ صلى الله عليه وسلم ح وَحَدَّثَنَا أَحْمَدُ بْنُ جَنَابٍ الْمِصِّيصِيُّ حَدَّثَنَا عِيسَى - يَعْنِي ابْنَ يُونُسَ - عَنْ زَكَرِيَّاءَ عَنْ أَبِي إِسْحَاقَ عَنِ الْبَرَاءِ قَالَ جَاءَ رَجُلٌ مِنْ بَنِي النَّبِيتِ - قَبِيلٍ مِنَ الأَنْصَارِ - فَقَالَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّكَ عَبْدُهُ وَرَسُولُهُ . ثُمَّ تَقَدَّمَ فَقَاتَلَ حَتَّى قُتِلَ فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" عَمِلَ هَذَا يَسِيرًا وَأُجِرَ كَثِيرًا \" ."
  },
  "1901": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1901\nIn-book reference  : Book 33, Hadith 210\nUSC-MSA web (English) reference  : Book 20, Hadith 4680\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا أَبُو بَكْرِ بْنُ النَّضْرِ بْنِ أَبِي النَّضْرِ، وَهَارُونُ بْنُ عَبْدِ اللَّهِ، وَمُحَمَّدُ بْنُ رَافِعٍ، وَعَبْدُ بْنُ حُمَيْدٍ - وَأَلْفَاظُهُمْ مُتَقَارِبَةٌ - قَالُوا حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا سُلَيْمَانُ، - وَهُوَ ابْنُ الْمُغِيرَةِ - عَنْ ثَابِتٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ بَعَثَ رَسُولُ اللَّهِ صلى الله عليه وسلم بُسَيْسَةَ عَيْنًا يَنْظُرُ مَا صَنَعَتْ عِيرُ أَبِي سُفْيَانَ فَجَاءَ وَمَا فِي الْبَيْتِ أَحَدٌ غَيْرِي وَغَيْرُ رَسُولِ اللَّهِ صلى الله عليه وسلم قَالَ لاَ أَدْرِي مَا اسْتَثْنَى بَعْضَ نِسَائِهِ قَالَ فَحَدَّثَهُ الْحَدِيثَ قَالَ فَخَرَجَ رَسُولُ اللَّهِ صلى الله عليه وسلم فَتَكَلَّمَ فَقَالَ \" إِنَّ لَنَا طَلِبَةً فَمَنْ كَانَ ظَهْرُهُ حَاضِرًا فَلْيَرْكَبْ مَعَنَا \" . فَجَعَلَ رِجَالٌ يَسْتَأْذِنُونَهُ فِي ظُهْرَانِهِمْ فِي عُلْوِ الْمَدِينَةِ فَقَالَ \" لاَ إِلاَّ مَنْ كَانَ ظَهْرُهُ حَاضِرًا \" . فَانْطَلَقَ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَصْحَابُهُ حَتَّى سَبَقُوا الْمُشْرِكِينَ إِلَى بَدْرٍ وَجَاءَ الْمُشْرِكُونَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يُقَدِّمَنَّ أَحَدٌ مِنْكُمْ إِلَى شَىْءٍ حَتَّى أَكُونَ أَنَا دُونَهُ \" . فَدَنَا الْمُشْرِكُونَ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" قُومُوا إِلَى جَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالأَرْضُ \" . قَالَ يَقُولُ عُمَيْرُ بْنُ الْحُمَامِ الأَنْصَارِيُّ يَا رَسُولَ اللَّهِ جَنَّةٌ عَرْضُهَا السَّمَوَاتُ وَالأَرْضُ قَالَ \" نَعَمْ \" . قَالَ بَخٍ بَخٍ . فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا يَحْمِلُكَ عَلَى قَوْلِكَ بَخٍ بَخٍ \" . قَالَ لاَ وَاللَّهِ يَا رَسُولَ اللَّهِ إِلاَّ رَجَاءَةَ أَنْ أَكُونَ مِنْ أَهْلِهَا . قَالَ \" فَإِنَّكَ مِنْ أَهْلِهَا \" . فَأَخْرَجَ تَمَرَاتٍ مِنْ قَرْنِهِ فَجَعَلَ يَأْكُلُ مِنْهُنَّ ثُمَّ قَالَ لَئِنْ أَنَا حَيِيتُ حَتَّى آكُلَ تَمَرَاتِي هَذِهِ إِنَّهَا لَحَيَاةٌ طَوِيلَةٌ - قَالَ - فَرَمَى بِمَا كَانَ مَعَهُ مِنَ التَّمْرِ . ثُمَّ قَاتَلَهُمْ حَتَّى قُتِلَ ."
  },
  "1902": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1902\nIn-book reference  : Book 33, Hadith 211\nUSC-MSA web (English) reference  : Book 20, Hadith 4681\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، - وَاللَّفْظُ لِيَحْيَى - قَالَ قُتَيْبَةُ حَدَّثَنَا وَقَالَ، يَحْيَى أَخْبَرَنَا جَعْفَرُ بْنُ سُلَيْمَانَ، عَنْ أَبِي عِمْرَانَ الْجَوْنِيِّ، عَنْ أَبِي بَكْرِ بْنِ، عَبْدِ اللَّهِ بْنِ قَيْسٍ عَنْ أَبِيهِ، قَالَ سَمِعْتُ أَبِي وَهُوَ، بِحَضْرَةِ الْعَدُوِّ يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" إِنَّ أَبْوَابَ الْجَنَّةِ تَحْتَ ظِلاَلِ السُّيُوفِ \" . فَقَامَ رَجُلٌ رَثُّ الْهَيْئَةِ فَقَالَ يَا أَبَا مُوسَى آنْتَ سَمِعْتَ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ هَذَا قَالَ نَعَمْ . قَالَ فَرَجَعَ إِلَى أَصْحَابِهِ فَقَالَ أَقْرَأُ عَلَيْكُمُ السَّلاَمَ . ثُمَّ كَسَرَ جَفْنَ سَيْفِهِ فَأَلْقَاهُ ثُمَّ مَشَى بِسَيْفِهِ إِلَى الْعَدُوِّ فَضَرَبَ بِهِ حَتَّى قُتِلَ ."
  },
  "677": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 677k\nIn-book reference  : Book 33, Hadith 212\nUSC-MSA web (English) reference  : Book 20, Hadith 4682\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادٌ، أَخْبَرَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ جَاءَ نَاسٌ إِلَى النَّبِيِّ صلى الله عليه وسلم فَقَالُوا أَنِ ابْعَثْ مَعَنَا رِجَالاً يُعَلِّمُونَا الْقُرْآنَ وَالسُّنَّةَ . فَبَعَثَ إِلَيْهِمْ سَبْعِينَ رَجُلاً مِنَ الأَنْصَارِ يُقَالُ لَهُمُ الْقُرَّاءُ فِيهِمْ خَالِي حَرَامٌ يَقْرَءُونَ الْقُرْآنَ وَيَتَدَارَسُونَ بِاللَّيْلِ يَتَعَلَّمُونَ وَكَانُوا بِالنَّهَارِ يَجِيئُونَ بِالْمَاءِ فَيَضَعُونَهُ فِي الْمَسْجِدِ وَيَحْتَطِبُونَ فَيَبِيعُونَهُ وَيَشْتَرُونَ بِهِ الطَّعَامَ لأَهْلِ الصُّفَّةِ وَلِلْفُقَرَاءِ فَبَعَثَهُمُ النَّبِيُّ صلى الله عليه وسلم إِلَيْهِمْ فَعَرَضُوا لَهُمْ فَقَتَلُوهُمْ قَبْلَ أَنْ يَبْلُغُوا الْمَكَانَ . فَقَالُوا اللَّهُمَّ بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ وَرَضِيتَ عَنَّا - قَالَ - وَأَتَى رَجُلٌ حَرَامًا خَالَ أَنَسٍ مِنْ خَلْفِهِ فَطَعَنَهُ بِرُمْحٍ حَتَّى أَنْفَذَهُ . فَقَالَ حَرَامٌ فُزْتُ وَرَبِّ الْكَعْبَةِ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم لأَصْحَابِهِ \" إِنَّ إِخْوَانَكُمْ قَدْ قُتِلُوا وَإِنَّهُمْ قَالُوا اللَّهُمَّ بَلِّغْ عَنَّا نَبِيَّنَا أَنَّا قَدْ لَقِينَاكَ فَرَضِينَا عَنْكَ وَرَضِيتَ عَنَّا \" ."
  },
  "1903": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1903\nIn-book reference  : Book 33, Hadith 213\nUSC-MSA web (English) reference  : Book 20, Hadith 4683\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا سُلَيْمَانُ بْنُ الْمُغِيرَةِ، عَنْ ثَابِتٍ، قَالَ قَالَ أَنَسٌ عَمِّيَ الَّذِي سُمِّيتُ بِهِ لَمْ يَشْهَدْ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم بَدْرًا - قَالَ - فَشَقَّ عَلَيْهِ قَالَ أَوَّلُ مَشْهَدٍ شَهِدَهُ رَسُولُ اللَّهِ صلى الله عليه وسلم غُيِّبْتُ عَنْهُ وَإِنْ أَرَانِيَ اللَّهُ مَشْهَدًا فِيمَا بَعْدُ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم لَيَرَانِيَ اللَّهُ مَا أَصْنَعُ - قَالَ - فَهَابَ أَنْ يَقُولَ غَيْرَهَا - قَالَ - فَشَهِدَ مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم يَوْمَ أُحُدٍ - قَالَ - فَاسْتَقْبَلَ سَعْدُ بْنُ مُعَاذٍ فَقَالَ لَهُ أَنَسٌ يَا أَبَا عَمْرٍو أَيْنَ فَقَالَ وَاهًا لِرِيحِ الْجَنَّةِ أَجِدُهُ دُونَ أُحُدٍ - قَالَ - فَقَاتَلَهُمْ حَتَّى قُتِلَ - قَالَ - فَوُجِدَ فِي جَسَدِهِ بِضْعٌ وَثَمَانُونَ مِنْ بَيْنِ ضَرْبَةٍ وَطَعْنَةٍ وَرَمْيَةٍ - قَالَ - فَقَالَتْ أُخْتُهُ عَمَّتِيَ الرُّبَيِّعُ بِنْتُ النَّضْرِ فَمَا عَرَفْتُ أَخِي إِلاَّ بِبَنَانِهِ . وَنَزَلَتْ هَذِهِ الآيَةُ { رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ فَمِنْهُمْ مَنْ قَضَى نَحْبَهُ وَمِنْهُمْ مَنْ يَنْتَظِرُ وَمَا بَدَّلُوا تَبْدِيلاً} قَالَ فَكَانُوا يُرَوْنَ أَنَّهَا نَزَلَتْ فِيهِ وَفِي أَصْحَابِهِ ."
  },
  "1904": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1904d\nIn-book reference  : Book 33, Hadith 217\nUSC-MSA web (English) reference  : Book 20, Hadith 4687\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ أَبِي وَائِلٍ، عَنْ أَبِي، مُوسَى الأَشْعَرِيِّ أَنَّ رَجُلاً، سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم عَنِ الْقِتَالِ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ فَقَالَ الرَّجُلُ يُقَاتِلُ غَضَبًا وَيُقَاتِلُ حَمِيَّةً قَالَ فَرَفَعَ رَأْسَهُ إِلَيْهِ - وَمَا رَفَعَ رَأْسَهُ إِلَيْهِ إِلاَّ أَنَّهُ كَانَ قَائِمًا - فَقَالَ \" مَنْ قَاتَلَ لِتَكُونَ كَلِمَةُ اللَّهِ هِيَ الْعُلْيَا فَهُوَ فِي سَبِيلِ اللَّهِ \" ."
  },
  "1905": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1905b\nIn-book reference  : Book 33, Hadith 219\nUSC-MSA web (English) reference  : Book 20, Hadith 4689\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ عَلِيُّ بْنُ خَشْرَمٍ، أَخْبَرَنَا الْحَجَّاجُ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنِ ابْنِ جُرَيْجٍ، حَدَّثَنِي يُونُسُ بْنُ يُوسُفَ، عَنْ سُلَيْمَانَ بْنِ يَسَارٍ، قَالَ تَفَرَّجَ النَّاسُ عَنْ أَبِي هُرَيْرَةَ، فَقَالَ لَهُ نَاتِلُ الشَّامِ وَاقْتَصَّ الْحَدِيثَ بِمِثْلِ حَدِيثِ خَالِدِ بْنِ الْحَارِثِ ."
  },
  "1906": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1906b\nIn-book reference  : Book 33, Hadith 221\nUSC-MSA web (English) reference  : Book 20, Hadith 4691\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي مُحَمَّدُ بْنُ سَهْلٍ التَّمِيمِيُّ، حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ، حَدَّثَنِي أَبُو هَانِئٍ، حَدَّثَنِي أَبُو عَبْدِ الرَّحْمَنِ الْحُبُلِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَا مِنْ غَازِيَةٍ أَوْ سَرِيَّةٍ تَغْزُو فَتَغْنَمُ وَتَسْلَمُ إِلاَّ كَانُوا قَدْ تَعَجَّلُوا ثُلُثَىْ أُجُورِهِمْ وَمَا مِنْ غَازِيَةٍ أَوْ سَرِيَّةٍ تُخْفِقُ وَتُصَابُ إِلاَّ تَمَّ أُجُورُهُمْ \" ."
  },
  "1907": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1907b\nIn-book reference  : Book 33, Hadith 223\nUSC-MSA web (English) reference  : Book 20, Hadith 4693\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، ح وَحَدَّثَنَا أَبُو الرَّبِيعِ الْعَتَكِيُّ، حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا عَبْدُ الْوَهَّابِ يَعْنِي الثَّقَفِيَّ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا أَبُو خَالِدٍ الأَحْمَرُ، سُلَيْمَانُ بْنُ حَيَّانَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ، اللَّهِ بْنِ نُمَيْرٍ حَدَّثَنَا حَفْصٌ، - يَعْنِي ابْنَ غِيَاثٍ - وَيَزِيدُ بْنُ هَارُونَ ح وَحَدَّثَنَا مُحَمَّدُ بْنُ، الْعَلاَءِ الْهَمْدَانِيُّ حَدَّثَنَا ابْنُ الْمُبَارَكِ، ح وَحَدَّثَنَا ابْنُ أَبِي عُمَرَ، حَدَّثَنَا سُفْيَانُ، كُلُّهُمْ عَنْ يَحْيَى، بْنِ سَعِيدٍ بِإِسْنَادِ مَالِكٍ وَمَعْنَى حَدِيثِهِ وَفِي حَدِيثِ سُفْيَانَ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ عَلَى الْمِنْبَرِ يُخْبِرُ عَنِ النَّبِيِّ صلى الله عليه وسلم ."
  },
  "1908": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1908\nIn-book reference  : Book 33, Hadith 224\nUSC-MSA web (English) reference  : Book 20, Hadith 4694\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا شَيْبَانُ بْنُ فَرُّوخَ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، حَدَّثَنَا ثَابِتٌ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ طَلَبَ الشَّهَادَةَ صَادِقًا أُعْطِيَهَا وَلَوْ لَمْ تُصِبْهُ \" ."
  },
  "1909": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1909\nIn-book reference  : Book 33, Hadith 225\nUSC-MSA web (English) reference  : Book 20, Hadith 4695\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، وَحَرْمَلَةُ بْنُ يَحْيَى، - وَاللَّفْظُ لِحَرْمَلَةَ - قَالَ أَبُو الطَّاهِرِ أَخْبَرَنَا وَقَالَ، حَرْمَلَةُ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنِي أَبُو شُرَيْحٍ، أَنَّ سَهْلَ بْنَ أَبِي أُمَامَةَ بْنِ سَهْلِ، بْنِ حُنَيْفٍ حَدَّثَهُ عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ النَّبِيَّ صلى الله عليه وسلم قَالَ \" مَنْ سَأَلَ اللَّهَ الشَّهَادَةَ بِصِدْقٍ بَلَّغَهُ اللَّهُ مَنَازِلَ الشُّهَدَاءِ وَإِنْ مَاتَ عَلَى فِرَاشِهِ \" . وَلَمْ يَذْكُرْ أَبُو الطَّاهِرِ فِي حَدِيثِهِ \" بِصِدْقٍ \" ."
  },
  "1910": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1910\nIn-book reference  : Book 33, Hadith 226\nUSC-MSA web (English) reference  : Book 20, Hadith 4696\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ سَهْمٍ الأَنْطَاكِيُّ، أَخْبَرَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ وُهَيْبٍ الْمَكِّيِّ، عَنْ عُمَرَ بْنِ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ مَاتَ وَلَمْ يَغْزُ وَلَمْ يُحَدِّثْ بِهِ نَفْسَهُ مَاتَ عَلَى شُعْبَةٍ مِنْ نِفَاقٍ \" . قَالَ ابْنُ سَهْمٍ قَالَ عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ فَنُرَى أَنَّ ذَلِكَ كَانَ عَلَى عَهْدِ رَسُولِ اللَّهِ صلى الله عليه وسلم ."
  },
  "1911": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1911b\nIn-book reference  : Book 33, Hadith 228\nUSC-MSA web (English) reference  : Book 20, Hadith 4698\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو سَعِيدٍ الأَشَجُّ قَالاَ حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، أَخْبَرَنَا عِيسَى بْنُ، يُونُسَ كُلُّهُمْ عَنِ الأَعْمَشِ، بِهَذَا الإِسْنَادِ غَيْرَ أَنَّ فِي، حَدِيثِ وَكِيعٍ \" إِلاَّ شَرِكُوكُمْ فِي الأَجْرِ \" ."
  },
  "1912": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1912d\nIn-book reference  : Book 33, Hadith 232\nUSC-MSA web (English) reference  : Book 20, Hadith 4702\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي يَحْيَى بْنُ أَيُّوبَ، وَقُتَيْبَةُ، وَابْنُ، حُجْرٍ قَالُوا حَدَّثَنَا إِسْمَاعِيلُ، - وَهُوَ ابْنُ جَعْفَرٍ - عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ، أَنَّهُ سَمِعَ أَنَسَ بْنَ مَالِكٍ، يَقُولُ أَتَى رَسُولُ اللَّهِ صلى الله عليه وسلم ابْنَةَ مِلْحَانَ خَالَةَ أَنَسٍ فَوَضَعَ رَأْسَهُ عِنْدَهَا . وَسَاقَ الْحَدِيثَ بِمَعْنَى حَدِيثِ إِسْحَاقَ بْنِ أَبِي طَلْحَةَ وَمُحَمَّدِ بْنِ يَحْيَى بْنِ حَبَّانَ ."
  },
  "1913": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1913b\nIn-book reference  : Book 33, Hadith 234\nUSC-MSA web (English) reference  : Book 20, Hadith 4704\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي أَبُو الطَّاهِرِ، أَخْبَرَنَا ابْنُ وَهْبٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شُرَيْحٍ، عَنْ عَبْدِ الْكَرِيمِ، بْنِ الْحَارِثِ عَنْ أَبِي عُبَيْدَةَ بْنِ عُقْبَةَ، عَنْ شُرَحْبِيلَ بْنِ السَّمِطِ، عَنْ سَلْمَانَ الْخَيْرِ، عَنْ رَسُولِ اللَّهِ صلى الله عليه وسلم بِمَعْنَى حَدِيثِ اللَّيْثِ عَنْ أَيُّوبَ بْنِ مُوسَى ."
  },
  "1914": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1914\nIn-book reference  : Book 33, Hadith 235\nUSC-MSA web (English) reference  : Book 20, Hadith 4705\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" بَيْنَمَا رَجُلٌ يَمْشِي بِطَرِيقٍ وَجَدَ غُصْنَ شَوْكٍ عَلَى الطَّرِيقِ فَأَخَّرَهُ فَشَكَرَ اللَّهُ لَهُ فَغَفَرَ لَهُ \" . وَقَالَ \" الشُّهَدَاءُ خَمْسَةٌ الْمَطْعُونُ وَالْمَبْطُونُ وَالْغَرِقُ وَصَاحِبُ الْهَدْمِ وَالشَّهِيدُ فِي سَبِيلِ اللَّهِ عَزَّ وَجَلَّ \" ."
  },
  "1915": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1915c\nIn-book reference  : Book 33, Hadith 238\nUSC-MSA web (English) reference  : Book 20, Hadith 4708\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي مُحَمَّدُ بْنُ حَاتِمٍ، حَدَّثَنَا بَهْزٌ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا سُهَيْلٌ، بِهَذَا الإِسْنَادِ وَفِي حَدِيثِهِ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ مِقْسَمٍ، عَنْ أَبِي صَالِحٍ، وَزَادَ، فِيهِ \" وَالْغَرِقُ شَهِيدٌ \" ."
  },
  "1916": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1916b\nIn-book reference  : Book 33, Hadith 240\nUSC-MSA web (English) reference  : Book 20, Hadith 4710\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ الْوَلِيدُ بْنُ شُجَاعٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، فِي هَذَا الإِسْنَادِ بِمِثْلِهِ ."
  },
  "1917": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1917\nIn-book reference  : Book 33, Hadith 241\nUSC-MSA web (English) reference  : Book 20, Hadith 4711\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا هَارُونُ بْنُ مَعْرُوفٍ، أَخْبَرَنَا ابْنُ وَهْبٍ، أَخْبَرَنِي عَمْرُو بْنُ الْحَارِثِ، عَنْ أَبِي عَلِيٍّ، ثُمَامَةَ بْنِ شُفَىٍّ أَنَّهُ سَمِعَ عُقْبَةَ بْنَ عَامِرٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم وَهُوَ عَلَى الْمِنْبَرِ يَقُولُ \" وَأَعِدُّوا لَهُمْ مَا اسْتَطَعْتُمْ مِنْ قُوَّةٍ أَلاَ إِنَّ الْقُوَّةَ الرَّمْىُ أَلاَ إِنَّ الْقُوَّةَ الرَّمْىُ أَلاَ إِنَّ الْقُوَّةَ الرَّمْىُ \""
  },
  "1918": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1918b\nIn-book reference  : Book 33, Hadith 243\nUSC-MSA web (English) reference  : Book 20, Hadith 4713\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَاهُ دَاوُدُ بْنُ رُشَيْدٍ، حَدَّثَنَا الْوَلِيدُ، عَنْ بَكْرِ بْنِ مُضَرَ، عَنْ عَمْرِو بْنِ الْحَارِثِ، عَنْ أَبِي عَلِيٍّ الْهَمْدَانِيِّ، قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ ."
  },
  "1919": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1919\nIn-book reference  : Book 33, Hadith 244\nUSC-MSA web (English) reference  : Book 20, Hadith 4714\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ، أَخْبَرَنَا اللَّيْثُ، عَنِ الْحَارِثِ بْنِ يَعْقُوبَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ شَمَاسَةَ، أَنَّ فُقَيْمًا اللَّخْمِيَّ، قَالَ لِعُقْبَةَ بْنِ عَامِرٍ تَخْتَلِفُ بَيْنَ هَذَيْنِ الْغَرَضَيْنِ وَأَنْتَ كَبِيرٌ يَشُقُّ عَلَيْكَ . قَالَ عُقْبَةُ لَوْلاَ كَلاَمٌ سَمِعْتُهُ مِنْ رَسُولِ اللَّهِ صلى الله عليه وسلم لَمْ أُعَانِهِ . قَالَ الْحَارِثُ فَقُلْتُ لاِبْنِ شُمَاسَةَ وَمَا ذَاكَ قَالَ إِنَّهُ قَالَ \" مَنْ عَلِمَ الرَّمْىَ ثُمَّ تَرَكَهُ فَلَيْسَ مِنَّا أَوْ قَدْ عَصَى \" ."
  },
  "1920": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1920\nIn-book reference  : Book 33, Hadith 245\nUSC-MSA web (English) reference  : Book 20, Hadith 4715\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا سَعِيدُ بْنُ مَنْصُورٍ، وَأَبُو الرَّبِيعِ الْعَتَكِيُّ، وَقُتَيْبَةُ بْنُ سَعِيدٍ، قَالُوا حَدَّثَنَا حَمَّادٌ، - وَهُوَ ابْنُ زَيْدٍ - عَنْ أَيُّوبَ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَبِي أَسْمَاءَ، عَنْ ثَوْبَانَ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي ظَاهِرِينَ عَلَى الْحَقِّ لاَ يَضُرُّهُمْ مَنْ خَذَلَهُمْ حَتَّى يَأْتِيَ أَمْرُ اللَّهِ وَهُمْ كَذَلِكَ \" . وَلَيْسَ فِي حَدِيثِ قُتَيْبَةَ \" وَهُمْ كَذَلِكَ \" ."
  },
  "1921": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1921b\nIn-book reference  : Book 33, Hadith 247\nUSC-MSA web (English) reference  : Book 20, Hadith 4716\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِيهِ مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا أَبُو أُسَامَةَ، حَدَّثَنِي إِسْمَاعِيلُ، عَنْ قَيْسٍ، قَالَ سَمِعْتُ الْمُغِيرَةَ بْنَ شُعْبَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ بِمِثْلِ حَدِيثِ مَرْوَانَ سَوَاءً ."
  },
  "1922": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1922\nIn-book reference  : Book 33, Hadith 248\nUSC-MSA web (English) reference  : Book 20, Hadith 4717\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، وَمُحَمَّدُ بْنُ بَشَّارٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، حَدَّثَنَا شُعْبَةُ، عَنْ سِمَاكِ بْنِ حَرْبٍ، عَنْ جَابِرِ بْنِ سَمُرَةَ، عَنِ النَّبِيِّ صلى الله عليه وسلم أَنَّهُ قَالَ \" لَنْ يَبْرَحَ هَذَا الدِّينُ قَائِمًا يُقَاتِلُ عَلَيْهِ عِصَابَةٌ مِنَ الْمُسْلِمِينَ حَتَّى تَقُومَ السَّاعَةُ \" ."
  },
  "1923": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1923\nIn-book reference  : Book 33, Hadith 249\nUSC-MSA web (English) reference  : Book 20, Hadith 4718\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللَّهِ، وَحَجَّاجُ بْنُ الشَّاعِرِ، قَالاَ حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ قَالَ ابْنُ جُرَيْجٍ أَخْبَرَنِي أَبُو الزُّبَيْرِ، أَنَّهُ سَمِعَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لاَ تَزَالُ طَائِفَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ إِلَى يَوْمِ الْقِيَامَةِ \" ."
  },
  "1037": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1037d\nIn-book reference  : Book 33, Hadith 251\nUSC-MSA web (English) reference  : Book 20, Hadith 4720\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، أَخْبَرَنَا كَثِيرُ بْنُ هِشَامٍ، حَدَّثَنَا جَعْفَرٌ، - وَهُوَ ابْنُ بُرْقَانَ - حَدَّثَنَا يَزِيدُ بْنُ الأَصَمِّ، قَالَ سَمِعْتُ مُعَاوِيَةَ بْنَ أَبِي سُفْيَانَ، ذَكَرَ حَدِيثًا رَوَاهُ عَنِ النَّبِيِّ صلى الله عليه وسلم لَمْ أَسْمَعْهُ رَوَى عَنِ النَّبِيِّ صلى الله عليه وسلم عَلَى مِنْبَرِهِ حَدِيثًا غَيْرَهُ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" مَنْ يُرِدِ اللَّهُ بِهِ خَيْرًا يُفَقِّهْهُ فِي الدِّينِ وَلاَ تَزَالُ عِصَابَةٌ مِنَ الْمُسْلِمِينَ يُقَاتِلُونَ عَلَى الْحَقِّ ظَاهِرِينَ عَلَى مَنْ نَاوَأَهُمْ إِلَى يَوْمِ الْقِيَامَةِ \" ."
  },
  "1924": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1924\nIn-book reference  : Book 33, Hadith 252\nUSC-MSA web (English) reference  : Book 20, Hadith 4721\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنِي أَحْمَدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ وَهْبٍ، حَدَّثَنَا عَمِّي عَبْدُ اللَّهِ بْنُ وَهْبٍ، حَدَّثَنَا عَمْرُو بْنُ الْحَارِثِ، حَدَّثَنِي يَزِيدُ بْنُ أَبِي حَبِيبٍ، حَدَّثَنِي عَبْدُ الرَّحْمَنِ بْنُ شُمَاسَةَ الْمَهْرِيُّ، قَالَ كُنْتُ عِنْدَ مَسْلَمَةَ بْنِ مُخَلَّدٍ وَعِنْدَهُ عَبْدُ اللَّهِ بْنُ عَمْرِو بْنِ الْعَاصِ فَقَالَ عَبْدُ اللَّهِ لاَ تَقُومُ السَّاعَةُ إِلاَّ عَلَى شِرَارِ الْخَلْقِ هُمْ شَرٌّ مِنْ أَهْلِ الْجَاهِلِيَّةِ لاَ يَدْعُونَ اللَّهَ بِشَىْءٍ إِلاَّ رَدَّهُ عَلَيْهِمْ . فَبَيْنَمَا هُمْ عَلَى ذَلِكَ أَقْبَلَ عُقْبَةُ بْنُ عَامِرٍ فَقَالَ لَهُ مَسْلَمَةُ يَا عُقْبَةُ اسْمَعْ مَا يَقُولُ عَبْدُ اللَّهِ . فَقَالَ عُقْبَةُ هُوَ أَعْلَمُ وَأَمَّا أَنَا فَسَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" لاَ تَزَالُ عِصَابَةٌ مِنْ أُمَّتِي يُقَاتِلُونَ عَلَى أَمْرِ اللَّهِ قَاهِرِينَ لِعَدُوِّهِمْ لاَ يَضُرُّهُمْ مَنْ خَالَفَهُمْ حَتَّى تَأْتِيَهُمُ السَّاعَةُ وَهُمْ عَلَى ذَلِكَ \" . فَقَالَ عَبْدُ اللَّهِ أَجَلْ . ثُمَّ يَبْعَثُ اللَّهُ رِيحًا كَرِيحِ الْمِسْكِ مَسُّهَا مَسُّ الْحَرِيرِ فَلاَ تَتْرُكُ نَفْسًا فِي قَلْبِهِ مِثْقَالُ حَبَّةٍ مِنَ الإِيمَانِ إِلاَّ قَبَضَتْهُ ثُمَّ يَبْقَى شِرَارُ النَّاسِ عَلَيْهِمْ تَقُومُ السَّاعَةُ ."
  },
  "1925": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1925\nIn-book reference  : Book 33, Hadith 253\nUSC-MSA web (English) reference  : Book 20, Hadith 4722\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى، أَخْبَرَنَا هُشَيْمٌ، عَنْ دَاوُدَ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي عُثْمَانَ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" لاَ يَزَالُ أَهْلُ الْغَرْبِ ظَاهِرِينَ عَلَى الْحَقِّ حَتَّى تَقُومَ السَّاعَةُ \" ."
  },
  "1926": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1926b\nIn-book reference  : Book 33, Hadith 255\nUSC-MSA web (English) reference  : Book 20, Hadith 4724\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا عَبْدُ الْعَزِيزِ، - يَعْنِي ابْنَ مُحَمَّدٍ - عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِذَا سَافَرْتُمْ فِي الْخِصْبِ فَأَعْطُوا الإِبِلَ حَظَّهَا مِنَ الأَرْضِ وَإِذَا سَافَرْتُمْ فِي السَّنَةِ فَبَادِرُوا بِهَا نِقَيَهَا وَإِذَا عَرَّسْتُمْ فَاجْتَنِبُوا الطَّرِيقَ فَإِنَّهَا طُرُقُ الدَّوَابِّ وَمَأْوَى الْهَوَامِّ بِاللَّيْلِ \" ."
  },
  "1927": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1927\nIn-book reference  : Book 33, Hadith 256\nUSC-MSA web (English) reference  : Book 20, Hadith 4725\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ، وَإِسْمَاعِيلُ بْنُ أَبِي أُوَيْسٍ، وَأَبُو مُصْعَبٍ الزُّهْرِيُّ وَمَنْصُورُ بْنُ أَبِي مُزَاحِمٍ وَقُتَيْبَةُ بْنُ سَعِيدٍ قَالُوا حَدَّثَنَا مَالِكٌ، ح وَحَدَّثَنَا يَحْيَى، بْنُ يَحْيَى التَّمِيمِيُّ - وَاللَّفْظُ لَهُ - قَالَ قُلْتُ لِمَالِكٍ حَدَّثَكَ سُمَىٌّ عَنْ أَبِي صَالِحٍ عَنْ أَبِي هُرَيْرَةَ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" السَّفَرُ قِطْعَةٌ مِنَ الْعَذَابِ يَمْنَعُ أَحَدَكُمْ نَوْمَهُ وَطَعَامَهُ وَشَرَابَهُ فَإِذَا قَضَى أَحَدُكُمْ نَهْمَتَهُ مِنْ وَجْهِهِ فَلْيُعَجِّلْ إِلَى أَهْلِهِ \" . قَالَ نَعَمْ ."
  },
  "1928": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 1928b\nIn-book reference  : Book 33, Hadith 258\nUSC-MSA web (English) reference  : Book 20, Hadith 4726\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنِيهِ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، حَدَّثَنَا هَمَّامٌ، حَدَّثَنَا إِسْحَاقُ بْنُ عَبْدِ اللَّهِ بْنِ أَبِي طَلْحَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِمِثْلِهِ غَيْرَ أَنَّهُ قَالَ كَانَ لاَ يَدْخُلُ ."
  },
  "715": {
    "collection": "Sahih Muslim",
    "book": "The Book on Government",
    "book_num": "33",
    "reference": "Reference  : Sahih Muslim 715ad\nIn-book reference  : Book 33, Hadith 266\nUSC-MSA web (English) reference  : Book 20, Hadith 4731\n  (deprecated numbering scheme)",
    "url": "https://sunnah.com/muslim/33",
    "text": "وَحَدَّثَنَا مُحَمَّدُ بْنُ الْمُثَنَّى، حَدَّثَنَا مُحَمَّدُ بْنُ جَعْفَرٍ، ح وَحَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُعَاذٍ، حَدَّثَنَا أَبِي قَالاَ، جَمِيعًا حَدَّثَنَا شُعْبَةُ، عَنْ مُحَارِبٍ، عَنْ جَابِرٍ، عَنِ النَّبِيِّ صلى الله عليه وسلم بِكَرَاهَةِ الطُّرُوقِ وَلَمْ يَذْكُرْ يَتَخَوَّنُهُمْ أَوْ يَلْتَمِسُ عَثَرَاتِهِمْ ."
  }
}